[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2012-02-21 09:17:49","objective":"本課程著重於商業溝通及實務的應用。每個實例討論均能幫助學生了解英文商務應用，並且提供學生去研習，分析並將個人論點英文表達。課程的重點有二：加強學生理解英文在商業領域的重要性，增強學生在商業案件中的綜合分析的表達能力。此外，由實際的商業實務中反應出各種未來可能出現的不同挑戰，讓學生有機會學習應對。根據課程規定，學生須具備高級英文的能力跟基本的商業知識。\nDepartment of English, National Taipei University of Technology\nCourse Syllabus\nCourse Title:　　　　Business Case Studies in English\nCredit Hours:　　　　3\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nTerm Offered:　　　　Spring, 2012\nOffice Hours:      By appointment\nRequired Texts:  Harvard Business School Cases\nCourse Description: This course will look at a broad array of issues and cases of business in practices. All cases discusses in class present real-business environment and situations in which corporations and business professionals have made business operations more sophisticated and yet prosperous. Through the learning of real business cases, many of them well-known corporations and brand names, this current course centers its emphasis on scaffolding knowledge and experiences governing certain business disciplines in which students are most likely to pursue a successful career. In addition, students will be required to meet with and learn from invited project advisors, who are currently middle to senior managers in renowned companies in Taiwan.\nCourse Objectives:  At the successful conclusion of this course, students shall be able to\n(1) develop thorough understanding of several prestigious corporations and brand names\n(2) acquire the essential business concepts by studying key terminology\n(3) establish critical and analytical ability to integrate all necessary information for problem solution\n(4) understand the opportunities and benefits presented through the cases and further construct a strong sense of career development to navigate future career pursuit\nCourse Requirements:\n(1)　　Students are required to read the case materials thoroughly, whether in responsible for session presentation. The purpose of this course, and the study of cases, is established on abundant discussions and by the exchange of ideas and thoughts.\n(2)　　Students are responsible for presenting at least one to two cases.\n(3)　　Students are scheduled to meet with the course instructor to ascertain that the case has been fully studied for its presentation.\n(4)　　An elaborated outline is required along with the presentation. Based on the case, five essay questions are to be designed and write a full-length essay to each question. The questions will also be used for student essays.\n(5)　　Three in-service professionals are invited to class to share with students their professional expertise in a variety of business operations. Reflection papers regarding the respective speeches are required.\n(6)　　Attendance: Students are required to attend the class as scheduled.\ni.　　Each unexcused absence will result in 10% semester grade deduction.\nii.　　At the sole discretion of the instructor, some absence penalties may be waived with valid proof and just cause. No Penalty waiver request will only be accepted in two weeks of the date of absence. Students forfeit the right of contention after that. It is important to know that only ONE- time penalty waiver will be granted to any student.\niii.　　Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Two times of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.","schedule":"Cases to Study (Tentative)\n1)　　P&amp;G Japan: The SKII Globalization Project (Week 3-4)\n2)　　Zara: Managing Stores for Fast Fashion (Week 5-6)\n3)　　Growing Big While Staying Small: Starbucks Harvests International Growth (Kellogg School of Management) (Week 7-8)\n4)　　The Ritz-Carlton Hotel Company (Week 10-11)\n5)　　Singapore Inc. (Week 12-13)\n6)　　Starbucks: Delivering Customer Service (Week 14-15)\n* Speaker Sessions (Week 16-17): Advertising / Telecom Marketing (IT) / HR / QC &amp; RM (Date TBD)","scorePolicy":"Evaluation Procedures &amp; Grading System:\nFinal grades will be determined by a point system (X out of 100 total points). Students will be evaluated by the following components.\n(1)　　Case Presentation 30%\n(2)　　Case Essay 30% (10% for each)\n(3)　　Reflections of Invited Speeches 10% (if applicable)\n(4)　　Attendance 30%\n** Keep the syllabus for future reference.**","materials":"Harvard Business Case Study for Undergraduates (Authorized copy with permission to duplicate and use in classroom)","foreignLanguageTextbooks":false}]
