[{"name":"莊清松","email":"chuang.cs@msa.hinet.net","latestUpdate":"2012-02-21 21:15:58","objective":"—To introduce the fundamental architectures, characteristics and applications of modern wireless radio frequency and microwave systems from a system approach point of view.\n\n—To introduce the fundamental characteristics of radio wave radiation and propagation.\n\n—To introduce the analysis of mobile microwave wireless system performance based on system architecture, modulation techniques and radio propagation effect.\n\n—To introduce the analysis and design of critical components at the radio-frequency front-end stage of wireless communication systems.","schedule":"Week 1: Introduction to Modern Microwave Wireless Systems \nWeek 2: Introduction of Conventional Analog Modulation in Modern\n        Wireless Radio Link Systems-\nWeek 3: Introduction of Modern Digital Modulation in Modern Wireless\n         Radio Link Systems-\nWeek 4: Radio Frequency Linkage in Physical Effects \nWeek 5: Radio Frequency Linkage with Multipath Effects\nWeek 6: Modern Receiver Architectures in Wireless Radio Link Systems\nWeek 7: Noise and Multipath Effect in Wireless Radio Receiver\nWeek 8: Distortion in Wireless Radio Receiver\nWeek 9: Middle Term Course Review Examination\nWeek 10: Introduction of Electromagnetic Wave Radiation for Wireless\n         Communications \nWeek 11: Electrical Current Excited Small Antenna Design for \n         Wireless Radio Link Systems\nWeek 12: Electrical Current Excited Resonate Antennas for Wireless\n         Radio Link Systems\nWeek 13: Impedance Broadband Wire Antennas for Wireless Radio Link \n         Systems\nWeek 14: Magnetic Current Excited Resonate Patch Antennas for \n         Wireless Radio Link Systems\nWeek 15: Introduction to Matching Techniques for Wireless Radio Link \n         Systems\nWeek 16: Radio Frequency Coupler and Power Divider for Wireless\n         Radio Link Systems\nWeek 17: Radio Frequency Filter Synthesis for Wireless Radio Link \n         Systems\nWeek 18: Issues on Updated Techniques for Next Generation Wireless\n         Radio Link Systems","scorePolicy":"-Lecture on Class\n-Power Point Aids Presentation\n-Interactive Discussion\n-Evaluation and measurement\nHomework Assignment                   30%\nMid-Term Paper Exam                   30%\nProject Presentation or Paper Exam.   40%","materials":"—MICROWAVE AND RF DESIGN; A System Approach,  Michael; Steer, Scitech Publishing, INC, 2010.\n\n—RF Microelectronics, BEHZAD RAZAVi, Prentice Hall PTR,1998\n\n—Papers on public Journals","foreignLanguageTextbooks":false}]
