[{"name":"邱志洲","email":"chih3c@ntut.edu.tw","latestUpdate":"2011-12-30 14:25:40","objective":"OBJECTIVES:\nThis course provides an understanding of the business value of customer relationship management and how data mining technology can be used to improve organizational interaction with customers. Building a business around the customer relationship is the aspiration of many modern organizations. Customer relationship management and data mining has been combined together to provide the required concepts, techniques, technology and tools to achieve this goal. The unit discuss how IT and IT based techniques can be used for customer segmentation, clustering and classification, market basket analysis and association rule mining in addition to traditional CRM.\n\nPREREQUISITE:\nData Mining and Business Intelligence","schedule":"1　　Feb. 20　　Introduction\n2　　Feb. 27　　Understanding CRM Tools and Software\n3　　March 5　　Software 1: SPSS Clementine\n4　　March 12　　Software 1: SPSS Clementine\n5　　March 19　　Software 1: SPSS Clementine\n6　　March 26　　Software 1: SPSS Clementine\n7　　April 2　　Exam 1\n8　　April 9　　Software 2: IBM Intelligent Minere\n9　　April 16　　Software 2: IBM Intelligent Minere\n10　　April 23　　Software 2: IBM Intelligent Minere\n11　　April 30　　Software 2: IBM Intelligent Minere\n12　　May 7　　Exam 2\n13　　May 14　　Software 3: MicroSoft SQL\n14　　May 21　　Software 3: MicroSoft SQL\n15　　May 28　　Software 3: MicroSoft SQL\n16　　June 4　　Exam 3\n17　　June 11　　Group Project &amp; Presentation\n18　　June 18　　Group Project &amp; Presentation","scorePolicy":"COURSE REQUIREMENTS &amp; GRADING\n\nClass Policies:\nAssignments are due on the date specified. Assignments that are submitted after the end of the class period on the designated due date are considered late. Any assignments that are submitted late will not be accepted unless authorization is received from the instructor by the time the assignment is due. This authorization should accompany the late work when it is submitted. Assignments that are submitted late with authorization will be assessed a penalty. Grading on assignments will be based on neatness and completeness of work as assigned. \n\nFinal Grades:\nFinal grades will be awarded on a point basis as follows:\nGroup Project &amp; Presentation: 　　40%\nExams: 　　　　　　　　　　45%\nClass Participation:　　　　　　15%\n_________________________________________________\nTotal:　　　　　　　　　　100%\n\nGroup Project &amp; Presentation: \nStudents will complete a group project. Project results will be presented to other members of the class. The \"deliverable\" to the instructor is the PowerPoint presentation of the project with references. Class members will also evaluate the presentations as well. The instructor will use class evaluations as one of the measures of performance prior to assigning a final project grade. Presentations should be approximately 60 minutes in duration.\n\nClass Participation: \nAttendance is required for the benefit of your learning and as a courtesy to your classmates. It is essential that each student become actively involved in the class. Your contributions are essential. As a member of this class, you have the responsibility to your fellow students to be here, be prepared, and participate. It is also expected that you make it to class on time. Failure to attend class or participate actively may impact your final grade in the course. Student participation in class discussions is an essential part of this course. The in-class activities will provide ample opportunity for students to share their ideas, thoughts, and experiences with the rest of the class.","materials":"TEXTBOOK:\nDyche, Jill  (2002)  The CRM Handbook  A Business Guide to Customer Relationship Management  Addison Wesley Information Technology Series: Boston\n\nREFERENCES\nNentl, Nancy J. and Craig Miller (2004) SimCRM Playbook for students McGraw Hill Irwin:  Boston","foreignLanguageTextbooks":false}]
