[{"name":"蔡榮發","email":"jftsai@ntut.edu.tw","latestUpdate":"2012-02-23 11:27:14","objective":"本課程主要運用數量方法解析管理與決策問題，所談到的方法包括資料包絡分析法、分析層級程序法、分析網路程序法與各種最佳化方法。應用問題包括：原物料切割問題、船席規畫問題、投資組合問題、管理績效評估、多磁碟系統配置、能力集合分析與供應鏈管理問題等。此外，相關之文獻及各種應用將深入討論。","schedule":"W1 Introduction to quantitative management and decision making\nW2 DEA \u000b\nW3 AHP (assign term paper topic)\nW4 presentation (DEA book Ch1-4)\nW5 presentation (DEA book Ch5-8)\nW6 Attend conference (Prepare term paper)\nW7 No class (Prepare term paper)\nW8 presentation (DEA book Ch9+1 paper)\nW9 presentation (AHP+1 paper) \u000b\nW10 Zero sum Game\nW11 Nonzero sum Game \u000b\nW12 Habitual Domain (submit term paper)\u000b\nW13 Term paper discussion\u000b\nW14 Optimization methods and applications (submit revised term paper) W15 Term paper presentation \u000b\nW16 Term paper presentation \u000b\nW17 Term paper presentation \u000b\nW18 Final discussion","scorePolicy":"Presentation: 50% (25% for each)\nPaper: 30%\n上課討論與出席情況: 20%","materials":"References:\n1.Deterministic global optimization: theory, algorithms and applications (Christodoulos A. Floudas, Kluwer Academic Publishers, 2000).\n2.Introduction to global optimization (Horst R., Pardalos P.M. and Thoai N.V., Kluwer Academic Publishers, 2000).\n3、管理績效評估：資料包絡分析法，高強，黃旭男，Toshiyuki Sueyoshi，華泰文化公司，民國92年。\n4、 HD:習慣領域，IQ和EQ沒談的人性軟體，游伯龍，時報出版。\n5.Handbook of test problems in local and global optimization (Christodoulos A. Floudas et al., Kluwer Academic Publishers, 1999).\n6.Selected papers from Journal of Global Optimization, European Journal of Operational Research, Engineering Optimization, and Journal of the Operational Research Society.\n7.Optimization Modeling with Lingo, 2001, LINDO System INC.\nSelected papers:\n1.D. Rotem, G. A. Schloss, A. Segev, Data allocation for Multidisk Database, IEEE Transactions on Knowledge and Data Engineering, 5 (5) (1993) 882-887.\n2.C. T. Chang, Optimization approach for data allocation in multidisk database, European Journal of Operational Research, 143 (2002) 210-217.\n3.Jung-Fa Tsai, Han-Lin Li, On optimization approach for multidisk vertical allocation problems, 165, 835-842, 2005.\n4.Han-Lin Li, and Ching-Ter Chang, “An Approximate Approach of Global Optimization for Polynomial Programming Problems”, European Journal of Operational Research, 107(3), 625-632, 1998.\n5.Han-Lin Li, and Ching-Ter Chang, “An Approximately Global Optimization Method for Assortment Problems”, European Journal of Operational Research, 105, 604-612, 1998.\n6.Han-Lin Li, “Solve Least Absolute Value Regression Problem using Modified Goal Programming Techniques”, Computers and Operations Research, 25(12), 1137-1143, 1998.\n7.Han-Lin Li, and Chian-Son Yu, “A Global Optimization Method for Nonconvex Separable Programming Problems”, European Journal of Operational Research, 117, 275-292, 1999.\n8.Han-Lin Li, A global approach for general 0-1 fractional programming, European Journal of Operational Research, 73, 590-596, 1994.\n9.Ching-Ter Chang, On the posynomial fractional programming problems, European Journal of Operational Research, 143, 42-52, 2002.\n10.Jung-Fa Tsai, Global optimization of nonlinear fractional programming problems in engineering design, Engineering Optimization, 2005, 1-11.\n11.Jung-Fa Tsai, Han-Lin Li, and Nian-Ze Hu, “Global Optimization for Signomial Discrete Programming Problems in Engineering Design”, Engineering Optimization, 34, 613-622, 2002.\n12.Han-Lin Li, and Jung-Fa Tsai, “A Fast Algorithm for Assortment Optimization Problems”, Computer and Operation Research, 28, 1245-1252, 2001.\n13.Han-Lin Li, Ching-Ter Chang, and Jung-Fa Tsai, “Approximately Global Optimization for Assortment Problems using Piecewise Linearization Techniques”, European Journal of Operational Research, 140, 584-589, 2002.\n14.C. S. Chen, S. M. Lee, Q. S. Shen, An analytical model for the container loading problem, European Journal of Operational Research, 80, 68-76, 1995.\n15.Han-Lin Li, Jung-Fa Tsai, Nain-Ze Hu, A distributed global optimization method for packing problems, Journal of the Operational Research Society, 54, 419-425, 2003.\n16.T. Obata and H. Ishii, A method for discriminating efficient candidates with ranked voting data, European Journal of Operational Research 151, 233-237, 2003.\n17.Han-Lin Li, and Jung-Fa Tsai, “Treating Non-Positive Variables in Generalized Geometric Global Optimization Programs”, Journal of Global Optimization, Accepted, 2005.\n18.Michael Doumpos, Constantin Zopounidis, A multicriteria classification approach based on pairwise comparisons, 158, 378-389, 2004.\n19.Jung-Fa Tsai, 2009, Treating free variables in generalized geometric programming problems, Computers and Chemical Engineering, 33(1), 239-243.\n20.Han-Lin Li, Jung-Fa Tsai and C. A. Floudas, June 2008, Convex Underestimation for Posynomial Functions of Positive Variables, Optimization Letters, 2 (3), 333-340.\n21.Jung-Fa Tsai, Ming-Hua Lin and Yi-Chung Hu, January 2008,","foreignLanguageTextbooks":false}]
