[{"name":"蕭玄逸沂","email":"siyihau@ms4.hinet.net","latestUpdate":"2012-02-22 22:55:59","objective":"1.對未來有志從事財務金融相關行業者，提供如何分析、解讀並利用財務報表所提供之資訊。\n2.對非以財務金融業為職業，然對個人投資理財有興趣者，提供基礎之財務報表相關知識，俾做投資之參考。\n3.做為進一步研讀高階財務金融課程之入門課程。","schedule":"1. 第一週：財務報表分析的概論（Ch.1）\n2. 第二週：資產負債表（Ch.2）\n3. 第三週：損益表、現金流量表及財務報表其他重要資訊（Ch.3）\n4. 第四週：財務報表分析工具（Ch.4）\n5. 第五週：基本分析－短期償債能力分析（Ch.5）\n6. 第六週：現金流量分析與現金管理（Ch.6）\n7. 第七週：基本分析－長期償債能力分析（Ch.7）\n8. 第八週：獲利能力與經營能力分析（Ch.8）\n9. 第九週：經營成果分析（Ch.9）\n10. 第十週：風險分析與股票的評價（Ch.10） \n11. 第十一週：投資股票應具備的財務分析（Ch.11）\n12. 第十二週：現金流量表（Ch.12）\n13. 第十三週：期末報告\n14. 第十四週：期末報告\n15. 第十五週：期末報告\n16. 第十六週：期末報告\n17. 第十七週：期末報告\n18. 第十八週：期末考試","scorePolicy":"1.期末報告：30%。\n2.期末考：40%。\n3.平時成績：30%。（出缺席紀錄）","materials":"1. 財務報表分析－實務的運用，修訂版，薛兆亨著，雙葉書廊，民國101年。（課本）\n2. 財務報表分析，三版，萬哲鈺、高崇瑋著，華泰文化，民國96年。\n3. 財務管理－新觀念與本土化，謝劍平著，四版，智勝文化，民國96年。\n4. 現代投資學－分析與管理，五版，謝劍平著，智勝文化，民國100年。\n5. 期貨與選擇權—策略型交易與套利實務，三版修訂，廖四郎、王昭文著，新陸書局，民國99年。\n6. 期貨與選擇權—衍生性金融商品入門經典，三版，黃昱程著，華泰文化，民國101年。\n7. 期貨與選擇權－財務工程的入門捷徑，四版，謝劍平著，智勝文化，民國99年。\n8. 投資學—理論與實務，七版，徐俊明著，新陸書局，民國100年。\n9. 風險管理新標竿－風險值理論與應用，周大慶、沈大白等合著，智勝文化，民國91年。\n10. Bodie, Z., Kane, A., and Marcus, A. J., Investments, McGraw-Hill Com., 7th ed., 2008。\n11. Brealey, R. A., Myers, S. C., and Allen F., 2008, Principles of Corporate Finance. 9th.ed. McGraw-Hill Companies. \n12. Damodaran, A., Investment Valuation, John Wiley &amp; Sons Inc., 2nd ed., 2002。\n13. Elton, E. J., Gruber, M. J., Brown, S. J., and Goetzmann, W. N., Modern Portfolio Theory and Investment Analysis, John Wiley &amp; Sons Inc., 6th ed., 2003。\n14. Fabozzi, F. J., Bond Markets, Analysis and Strategies, Prentice-Hall International, 5th ed., 2003。\n15. Galitz, L. C., Financial Engineering, Pitman Publishing, 1995。\n16. Hull, J. C., Options, Futures and Other Derivatives, Prentice-Hall International, 7th ed., 2008。\n17. Kolb R. W., and Overdahl J. A., Futures, Options and Swaps, Blackwell Publishers, 5th ed., 2007。\n18. Murphy, J. J., Technical Analysis of the Futures Markets, Prentice-Hall Inc., 1986。\n19. Reilly, F. K., and Brown, K. C., Investment Analysis and Portfolio Management, Thomson, 9th ed., 2009。\n20. Smithson, C. W., Managing Financial Risk: A Guide to Derivative Products, Financial Engineering, and Value Maximization, McGraw-Hill Com., 3rd ed., 1998。","foreignLanguageTextbooks":false}]
