[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2012-02-05 22:37:46","objective":"本課程旨在探討英語與漢語在結構與功能上的主要異同，涵蓋語意、語音、音韻、詞法、句法、語用與社會文化等特徵，同時類比與對比這兩個語言使用何種語言策略達到溝通的目的。本課程之本質在訓練學生往後如何解決語言對比分析的問題，在學期結束時，學生需要針對英語與漢語某一特定語言現象獨立完成對比分析。","schedule":"February 20 Class Orientation\nFebruary 27 no classes\nMarch 5 A Historical Background of contrastive research\nReading: Chen, Fred Jyun-gwang. 2006. Contrastive research and crosslinguistic influence: Some implications for teaching Chinese and English as a second language. Taipei: Crane.\nDiscuss Topic for Final Paper\nMarch 12 Reference and Noun Phrases; Discuss Literature for Final Paper\nMarch 19 Clause Types and Word Order; Discuss Literature for Final Paper\nMarch 26 Modification and Relativization (A)\nApril 2 Time/Tense and Temporal Expression (B)\nApril 9 Aspect (C)\nApril 16 Information Structure and Passive Voice (A); Discuss Methodology\nApril 23 Negation (B); Discuss Methodology\nApril 30 Interrogatives (C); Discuss Problems\nMay 7 no classes\nMay 14 Clause Constructions with Indirect Objects (A); Discuss Results\nMay 21 Transitivity (B), Emotion Expressions (C); Discuss Results\nMay 28 Pragmatics and Pragmatic Markers (A), Speech Acts and Communicative Strategies (B)\nJune 4 Cohesion and Coherence (C)\nJune 11 Final Presentations\nJune 18 Final Paper Due","scorePolicy":"Homework, Exercises, and Attendance: 20%\nClass Presentations and Participation: 40%\nFinal Presentation: 20%\nTerm Paper: 20%","materials":"Biber, Douglas et al. 2000. Longman grammar of spoken and written English. London: Longman.\nLi, Charles N. and Sandra A. Thompson. 1971. Mandarin Chinese: A functional reference grammar. Taipei: Crane.\nLi, Y. C. et al. 1989. Mandarin Chinese: A practical reference grammar for students and teachers. 2 volumes. Taipei: Crane.\nList of Readings\nReference (Nouns, Pronouns, Articles)\nClause Types and Word Order\nBiber et al. 2000. Chapter 3.5 (Major clause patterns), Chapter 11.1 (Word Order)\nLi and Thompson. 1971. Chapter 2.4\n曹逢甫。1993。中英文的句子—某些基本語法差異的探討。應用語言學的探討，82-107。\n曹逢甫。1993。從主題-評論的觀點談中文的句型。應用語言學的探討，201-233。\n曹逢甫。1993。過去兩百年漢語詞法與句法的英化。應用語言學的探討，285-300。\nTang-Ting-chi. 1982. Existential sentences, Pseudo-Cleft sentences, and Relative clauses: A contrastive analysis between English, Chinese, and Japanese. Studies in English Literature and Linguistics April 1982: 98-116.\nTsao, Feng-fu. 1979. Sentences in Chinese and English. Studies in English Literature and Linguistics April 1979: 53-68.\nModification and Relativization\nBiber et al. (2000) Chapter 7.1, Chapter 8.7 (Postmodification)\nLi et al. Ch 2.1.1 and Ch 3.2.2 (Non-Action Verbs)\nComrie, Bernard. 2008. Prenominal relative clauses in Verb-Object languages. Language and Linguistics 9.4: 723-733.\nFeist, Jim. 2009. Premodifier order in English nominal phrases: A semantic account. Cognitive Linguistics 20.2: 301-340.\nFox, Barbara A. and Sandra A. Thompson. 1990. A discourse explanation of the grammar of relative clauses in English conversation. Language 66.2: 297-316.\nFox, Barbara A. and Sandra A. Thompson. 2007. Relative clauses in English conversation. Studies in Language 31.2: 293-326.\nGibson, Edward et al. 2005. Reading relative clauses in English. Cognitive Linguistics 16.2: 313-353.\nLi, Audrey Yen-hui. 2001. Universal constructions? Relativization in English and Chinese. Concentric: Studies in English Literature and Linguistics 27.2: 81-102.\nLin, Charles Chien-Jer. 2008. The processing foundation of head-final relative clauses. Language and Linguistics 9.4: 813-838.\nLin, Charles Chien-Jer and Thomas G. Bever. 2006. Subject preference in the processing of relative clauses in Chinese. Proceedings of the 25th West Coast Conference on Formal Linguistics, ed. By Donald Baumer, David Montero, and Michael Scanlon, 254-260. Somerville, MA: Cascadilla Proceedings Project.\nLoock, Rudy. 2007. Appositive relative clauses and their functions in discourse. Journal of Pragmatics 39: 336-362.\nPaul, Waltraud. 2005. Adjectival modification in Mandarin Chinese and related issues. Linguistics 43.4: 757-793.\nRijkhoff, Jan. 2008. Descriptive and discourse-referential modifiers in a layered model of the noun phrases. Linguistics 46.4: 789-829.\nTao, Hongyin and Michael J. MacCarthy. 2001. Understanding non-restrictive which-clauses in spoken English, which is not an easy thing. Language Sciences 23: 651-677.\nTao, Ming and Liang Chen. 2010. A discourse-pragmatic study of the word order variation in Chinese relative clauses. Journal of Pragmatics 42: 168-189.\n曹逢甫。1993。漢語及英語的關係子句：形式及功用的對比研究。應用語言學的探討，108-131。\nTime/Tense and Temporal Expression\nBiber et al. 2000. Chapter 6.2\nLi et al. 1971. Ch 3.5.2 (Types of time relation)\nTime adverbials in Chinese and English. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 14-30.\nThe unmarked or the simple present. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 31-95.\nThe expression of past time. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 96-146.\nBrisard, Frank. 1997. The English tense system as an epistemic category: The case of futurity. In Lexical and syntactical constructions and the construction of meaning, Eds by Marjolijn Verspoor, Kee Dong Lee, and Eve Sweetser, 271-285. Amsterdam: John Benjamins.\nLin, Jo-wang. 2000. On the tem","foreignLanguageTextbooks":false}]
