[{"name":"方浩偲","email":"maxcormor@yahoo.es","latestUpdate":"2011-12-13 16:39:59","objective":"本課程使學生具有基礎西班牙語能力，並加強會話及閱讀能力訓練。培養學生簡易西文的溝通能力，提供學生西文的基礎知識(包括字母、讀音、語法等)，並增進學生對西班牙文化的認識與興趣。本課程分為(一)和(二)兩部分進行(各三學分)。\n\nOBJECTIVES \n\nThe general goal of this course is to prepare students for communication in Spanish on A1 level (CEFR). All basic language skills will be dealt with in the semester. Thus, students will be instructed to:\n1.- hold everyday conversations, \n2.- read short texts, and\n3.- write simple sentences.\n\nBesides developing their basic language skills, students will gain knowledge of various aspects of culture, including popular traditions, music, art, etc., in Spanish speaking countries.","schedule":"WEEKLY CONTENTS \n\n1.- The importance of the Spanish language in the world; the weather; pronunciation of combined words; use of comma, full stop, colon, and dots; about Rafa Nadal.\n\n2.- Habitual actions; likes and dislikes; emphatic intonation; letter &lt; h &gt;; writing informal letters (I); about Mexico and Paulina Rubio.\n\n3.- Expressing opinions and beliefs; hobbies; non verbal communication; talking about present actions; letters &lt; l &gt;, &lt; ll &gt; &amp; &lt; y &gt;; about Honduras, Guatemala and Enrique Iglesias.\n\n4.- Expressing agreement and disagreement; expressing satisfaction, dissatisfaction and indifference; expressing cause and consequence; talking about housework; expressing doubt; letters &lt; g &gt; &amp; &lt; j &gt;; phonemes /x/, /g/ &amp; /k/; about Pedro Duque, El Salvador and Nicaragua.\n\n5.- Talking about leisure; talking on the phone; letters &lt;l&gt;, &lt;r&gt; &amp; &lt;rr&gt; (I); suspended intonation; about Costa Rica and Penelope Cruz.\n\n6.- Proposing and replying to a proposal; taking a short trip; consonant groups; capital letters; about Santiago Calatrava, Cuba and Panama.\n\n7.- Visiting friends; strategies to understand new words; business hours; buying clothes; letters &lt; c &gt;, &lt; z &gt;, &lt; s &gt; &amp; &lt; x &gt;; about Pau Gasol and the Dominican Republic.\n\n8.- Names of food; names of shops (I); going to a  bar or to a restaurant; pronunciation of vowels; about Colombia and Shakira.\n\n9.- Midterm exam\n\n10.- Names of shops (II); names of products; talking about food and cooking; talking about one’s health; letters &lt; m &gt; ,  &lt;n &gt; &amp; &lt; l &gt;; about Puerto Rico, Venezuela and Salvador Dali.\n\n11.- Describing and comparing towns; writing informal letters (II); letters &lt;b&gt;, &lt;v&gt; &amp; &lt;p&gt;; about Ecuador, Peru and Antoni Gaudi.\n\n12.- Talking about plans for the future; making a hotel reservation; planning a flight; conversations in a bank; letters &lt;d&gt; &amp; &lt;t&gt;; about Bolivia, Paraguay and Montserrat Caballe.\n\n13.- Writing a letter applying for a job; writing one’s resume; expressing feelings; a job interview; letters &lt; c &gt;, &lt; q &gt;, &lt; k &gt; &amp; &lt; g &gt;; about Pablo Picasso, Uruguay and Chile.\n\n14.- Identifying someone; talking about the past (I); letters &lt;l&gt;, &lt;r&gt; y &lt;rr&gt; (II); revision of intonation; about Cervantes and Argentina.\n\n15.- About “preterito indefinido” tense (I); talking about the past (II); writing an e-mail; stress; about Equatorial Guinea and Ramon y Cajal.\n\n16.- About “preterito indefinido” tense (II); about “preterito perfecto” tense; about Spain.\n\n17.- General revision of the whole semester: linguistic and cultural issues.\n\n18.- Final exam","scorePolicy":"EVALUATION\n\nContinuous assessment. Weekly attendance, punctuality, attitude, participation and effort in class, as well as homework will be highly valued. Students will have five short tests along the semester. The final grade of the semester will be calculated as follows:\n \nPunctuality        　　　　　　(1% every day)                 17%\nHomework         　　　　　　(1% every day)                 17%\nAttitude and participation  　　(1% every day)        　　 17% \nFive tests 　　　　　　　　(5 x 7%)　　　　　　 35%\nMidterm exam + Final exam　　(7% + 7%)　　　　　　 14%","materials":"METHODOLOGY \n\nFrom the first day, students will be actively involved in their own learning and will create their own dialogues in Spanish, thus using the language for real communication with their classmates and the teacher.\n\n\nTASKS\n\nThe tasks carried out in the classroom will involve mostly oral skills: listening, speaking and interacting. Students will also be assigned some reading and writing tasks mainly for homework as a revision or as a preparation for the following class.\n\n\nTEXTBOOK\n\nM. Cortes (2011): Espanol: segundo paso最新西班牙語教程（中級）+ audio CD. Taipei: Massbook (萬人出版社), ISBN 978-957-461-245-1.","foreignLanguageTextbooks":false}]
