[{"name":"黃子坤","email":"phwang@ntut.edu.tw","latestUpdate":"2012-02-22 13:46:00","objective":"本課程旨在探討服務設計的屬性與特質，應用既存的設計工具與方法，發展適用於服務領域的設計架構．講述各項應用於設計發想與分析的工具，包括：touch points analysis，scenario planning，storyboards，Service Quality 等．\nEconomic conditions have changed from a manufacturing society to an information- and service-based economy. Within Service Design, Service Interfaces are designed for intangible products that are, from the customer's point of view, useful, profitable and desirable. This course explores the process and framework of service design. The process of service design applies explorative, generative, and evaluative design approaches. Designers observe and interpret requirements and behavioral patterns and then visualize, formulate, and choreograph solutions to problems. Tools that help to accomplish a successful service design are introduced. The analysis of existing services examines whether touch points are correctly positioned. Scenario Planning starts with the development of the client journey as a schema by which service design can capture and illustrate the complete process of a service with its emotional, material and procedural components from a client's perspective. Storyboards illustrate the newly created service process from the perspective of the clients and help to visualize the full observation of scripts, roles, scenery.","schedule":"Service\nService Quality\nService design framework\nCustom Experience Map\nDesigning Service\nProduct Service System\nCharacteristics of Research\nStrategies for Research\nScientific Methods\nOrganize a Research Proposal","scorePolicy":"專題報告及測驗：40%\n發表及參與討論：40%\n出勤及服務：    20%","materials":"Roozenburg, NFM; Eekels, J (1995) Product Design: Fundamentals and Methods. John Wiley &amp; Sons, West Sussex, England.\n\nPolaine, Andy; Lavrans Løvlie; Ben Reason (2012). Service Design - Designing useful, usable and desirable services. Rosenfeld Media.\n\nSchneider, Jakob; Marc Stickdorn (23 authors) (2011) THIS IS SERVICE DESIGN THINKING.","foreignLanguageTextbooks":false}]
