[{"name":"張子立","email":"tzeliph@gmail.com","latestUpdate":"2012-02-09 18:06:56","objective":"倫理學在一般意義下亦可稱為道德哲學，乃研究道德價值與倫理規範之本質的學問。其主要內涵可分為以下三項：\n1.研究對錯、善惡等道德判斷之根據或原理。此為規範倫理學（normative ethics）之主要內容。\n2.研究道德命題之意義或邏輯根據。亦即對道德語句或命題的後設研究。此為後設倫理學（meta-ethics）之主要內容。\n3.道德人格或美德之定義與培養問題。此為德性倫理學（virtue ethics）所著重的部分。\n\n基於此認識，本課程之設計希望達到以下兩目標：\n\n1.使上課學生對各種重要道德理論有基本而無誤之理解。課程架構以英美倫理學為主軸，並兼及儒家倫理學、歐陸倫理學之介紹。英美倫理學涵蓋義務論、目的論等兩大規範倫理學理論與道德的相對主義，以及德性倫理學、後設倫理學。儒家倫理學則介紹孔子、孟子、荀子的思想，歐陸倫理學主要涉及康德與謝勒的倫理學。\n2.能力必須在練習中養成，所以本課程另一重點就是：在學生具備重要倫理學理論之基本了解後，訓練其應用這些理論在日常生活中所遭遇的問題上。因此在第二學期將介紹應用倫理學基本理論及其對一些重大道德爭議諸如死刑、安樂死、同性戀之處理。最後採取辯論會的方式，讓學生在累積學習後能主動應用及表達本身意見。期望經過這些演練後，使學生在吸收理論之餘，也能把所得知識靈活運用在日常生活各種議題或爭論中。","schedule":"本課程以十八週為計算基準\n1.課程說明及思想背景介紹：第一週\n2.哲學思考與倫理學：第二週\n3.規範倫理學：第三至四週\na.義務論b.目的論\n4.德性倫理學：第五週\n5.後設倫理學：第六週\n6.儒家倫理學概說：第七至八週\n7.歐陸倫理學概說：第九週\n8.應用倫理學概說：第十週\n9.墮胎問題探討：第十一週\n10.安樂死問題探討：第十二週\n11.同性戀問題探討：第十三週\n12.複製人問題探討：第十四週\n13.動物權問題探討：第十五週\n14.學生研討或辯論會（一）－同居是否可行？：第十六週\n15.學生研討或辯論會（二）－開放性產業是否恰當？：第十七週\n16.期末考：第十八週","scorePolicy":"成績評量方式：\n1.上課表現與出席率：30%\n2.期中報告：35%（題目須經教師指定）\n3.期末筆試：35%","materials":"上課方式：\n本課程之上課方式主要分為四部分\n1.重點講解：學生必須在上課前預習書本指定範圍，再由本人針對書中內容作重點講解。\n2.提問與解答：在課程進行前、後或之中，特別歡迎學生積極發問。蓋哲學思考與理論正是由諸多問題意識所激發，既可增加學生興趣與專注力，也可幫助教師本身檢視其專業知識、授課方式與效果、乃至有何盲點。若有學生指出教師錯誤所在，學期成績加分。\n3.課前重點回顧：經過一週時間，學生多少會對上一週教學內容有所生疏，五至十分鐘的重點回顧既可喚起記憶，亦可下接本週上課內容。\n4.理論應用－－日常生活反省與時事評論：哲學理論不應脫離現實，對於探討道德事務的倫理學更是如此。在每週課堂結束前留二十至三十分鐘，由個人或學生提出今日上課內容與日常生活或時事相關者作討論，訓練學生應用哲學理論於現實生活中，才能真正內化於其思想中。\n指定教科書及參考資料：\n1.指定教科書：自編講義：《倫理學概論講義》\n2.參考資料：\nA.中文著作\n李瑞全：《儒家生命倫理學》。臺北：鵝湖出版社，1999年。\n彼徹姆(Tom L.Beauchamp)著，雷克勤等譯：《哲學的倫理學─道德哲學引論》。北京：中國社科出版社，1999年\n格沃斯(Alan Gewirth)等著，戴楊毅等譯：《倫理學要義》。北京：中國社科出版社，1991年。\nB.英文著作\nBarcalow, Emmett: Moral Philosophy: Theory and Issues. Belmont , Calif.: Wadsworth,1994.\nFeldman, Fred: Introductory Ethics. Englewood Cliffs, N. J.: Prentice Hall, 1987.\nFrankena, William: Ethics. Englewood Cliffs, N. J.: Prentice Hall, 1973.\nHarman, Gilbert: The Nature of Morality: An Introduction to Ethics. New York: Oxford University Press, 1977.\nHudson, W. D.: Modern moral Philosophy. New York: Macmillan ,1983.   Pojman, Louis P.: Ethics: Discovering Right and Wrong. Belmont, Calif.: Wadsworth, 1995.\nThiroux, Jacques P.: Ethics: Theory and Practice. Englewood Cliffs, N. J.: Prentice Hall, 1995.","foreignLanguageTextbooks":false}]
