[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2012-03-06 14:15:15","objective":"From the dawn of the 20th century until approximately the time of WWII, a new perspective arose in Western literature and culture.  The modernist aesthetic called for new ways of seeing, reading and conceiving the world.  Text and visual art changed, both formally and thematically, and a new and enduring art form—cinema—came into being.  We will be reading poetry, prose texts and dramatic works by key Modernist figures, viewing paintings and films representative of the era, and listening to a new kind of American classical music—jazz—shape itself from its blues roots.  Through exposure to Modernist literature, visual art, music and film, students will be able to acquire a more sophisticated, nuanced view of modernity in its aesthetic expression, and a greater appreciation for the manner in which art and culture continually shape and reshape one another.","schedule":"COURSE SCHEDULE\n\nFebruary 21　　INTIMATIONS OF MODERNITY I.  READ: Poe’s “The Case of M. Valdemar,” “The Purloined Letter,” “Maelzel’s Chess-Player” and “The Man of the Crowd,” Apollinaire’s “Zone” and Loy selections from The Last Lunar Baedeker.\n\nMarch 7　　THE EUROPEAN AVANT GARDE I.  Discuss reading.  View short film by Georges Melies and visual art by Kandinsky.  ASSIGNMENT:  Poetry by Stein, Niedecker and critical works Mina Loy’s Futurism/Feminism; Tristan Tzara’s Mr. Antipyrine’s and Dada Manifesto 1918 and Andre Breton’s Surrealist Manifesto.\n\nMarch 14　　THE EUROPEAN AVANT GARDE II.  Discuss reading.  View short film by Bunuel and visual art by DuChamp.  ASSIGNMENT:  Read poems by Breton, Vallejo, Lorca and Carrington short-stories “The Debutante,” “A Man in Love,” and “The Neutral Man.”  \n\nMarch 21  　　THE MODERNIST PROJECT: “NEWS THAT STAYS NEWS.” View short film by Charlie Chaplin.  ASSIGNMENT:  Read poetry by Pound, Eliot and Stevens and Fitzgerald’s The Great Gatsby, pp. 1-52.\n\nMarch 28   　　AMERICAN MODERNISM: “NO IDEAS BUT IN THINGS.”  View avant-garde film.  Discuss reading.  ASSIGNMENT:  Read Williams, Crane, Oppen and Gatsby 52-115.\n\nApril 11　　BRITISH/IRISH MODERNISM:  ‘THE CENTER CANNOT HOLD.”.  Discuss reading.  ASSIGNMENT:  Read poetry by Yeats, Auden, Carrington’s Down Below and short-story ”The Dead” by James Joyce\n\nApril 18　　MODERNISM ON THE MOVE: “ASSIGNMENT:  Read Hemingway’s The Sun Also Rises, pp. 1-116 and Ouspensky chapter from In Search of the Miraculous.\n\nApril 25  　　Discuss reading.  ASSIGNMENT:  Read Hemingway 116-251, Futurist theatrical works and Jean Cocteau’s “The Wedding on the Eiffel Tower.”\n\nMay 2   　　MODERNIST PROSE I:  Discuss reading. ASSIGNMENT:  Faulker’s The Sound and the Fury pp. 1-113 and essay “The Stream of Thought” by William James.\n\nMay 9  　　MODERNIST PROSE II:  Discuss reading.  ASSIGNMENT:  Read Faulkner to end and Beckett short plays.\n\nMay  16 　　MODERNIST PROSE III:  Discuss reading. ASSIGNMENT:  Read poems by Hughes and Brooks and Hurston’s Their Eyes Were Watching God, pp. 1-117.\n\nMay 23　　MODERNIST PROSE IV.  Discuss reading.  ASSIGNMENT:  Read Hurston to end and essay “On Colonialism” by Aime Cesaire.\n\nMay 30  　　LATER MODERNISM:  “BY THESE I WOULD NOT CARE TO DIE.”  ASSIGNMENT:  Read, Woolf’s The Waves, 1-137 and Merleau-Ponty’s preface to Merleau-Ponty’s preface to Phenomenology of Perception..\n\nJune 13  　　BRITISH MODERNISM:  “By These I Would Not Care to Die.”  MODERNIST THEATRE II.  Discuss reading.  ASSIGNMENT:  Read Woolf to end and poems by Thomas and Plath.\n\nJune 20　　CONCLUSION\n\nFINAL PAPER DUE NOON JUNE 27","scorePolicy":"GRADING\n\n25%　　Participation in class\n25% 　　Presentations\n25% Mid-term paper (or equivalent)\n25% 　　Final paper","materials":"TEXTS\n\nCourse Reader:  Poems, short plays and prose texts from European avant-garde Generation of 98, Futurists, Dadaists and Surrealists and British and American Modernists T.S. Eliot, Ezra Pound, Gertrude Stein, James Joyce, Mina Loy, W. H. Auden, William Carlos Williams, Wallace Stevens, George Oppen, Lorine Niedecker, Langston Hughes, Gwendolyn Brooks, Dylan Thomas and Sylvia Plath.\n\nThe Great Gatsby by F. Scott Fitzgerald\n\nThe Sound and the Fury by William Faulkner\n\nTheir Eyes Watching God by Zora Neale Hurston\n\nThe Sun Also Rises by Ernest Hemingway\n\nThe Waves by Virginia Woolf","foreignLanguageTextbooks":false}]
