[{"name":"林文印","email":"wylin@ntut.edu.tw","latestUpdate":"2012-02-19 16:56:14","objective":"An introduction to the theory relative technology for particulate matters is firstly presented in the graduated course. Then, it will focus on the following contents to provide students a comprehensive and professional knowledge: 1. Characteristics sources with particle size distribution. 2. Transport phenomena in air environment. 3. Analysis of transport phenomena for fugitive dust. 4. Theory on particle entrainment or suspension. 5. Principle of control technologies. 6. Sampling and analysis for fugitive dust.","schedule":"Week　　Topics\n1　　Introduction\n2　　No class\n3　　Programming I\n4　　Programming II\n5　　Control Equipments\n6　　Basic properties and measuring methods of nanoparticles\n7　　Structural control of nanoparticles\n8　　Characteristics and behavior of nanoparticles and its dispersion systems\n9　　Control of nanostructure of materials\n10　　Characterization methods for nanostructure of materials\n11　　Evaluation methods for properties of nanostructured body\n12　　Environmental and safety issues with nanoparticles\n13　　Application 1-4\n14　　Application 5-8\n15　　Application 9-12\n16　　Application 13-16\n17　　Application 17-20\n18　　Presentation","scorePolicy":"1.　　Class Participation + Reading Presentations　　50%\n2.　　Term Project (Using Available Instruments)　　50%","materials":"1. Nanoparticle Particle Technology, edited by M. Hosokawa, K. Nogi, M. Naito, and T. Yokoyama, Elsevier, 2007\n2. Air Quality Criteria for Particulate Matter, USEAP, 2004\n3. Fundamentals of Air Pollution Engineering, Richard C. Flagan and John H. Seinfeld, Prentice-Hall, 1988\n4.  Air Pollution Engineering Manual, Edited by Anthony J. Buonicore and Wayne T. Davis, Air &amp; Waste Management Association, 2000\n5.  Air Pollution Control Theory, Martin Crawford, McGraw-Hill, 1976\n6.  Air Pollution Control Engineering, William Licht, Marcel Dekker, 1980\n7. 奇妙的塵埃，漢娜?霍姆茲 (陳芝儀譯)，先覺出版，2007","foreignLanguageTextbooks":false}]
