[{"name":"陳亮嘉","email":"lcchen@ntut.edu.tw","latestUpdate":"2012-02-16 19:54:38","objective":"Objectives: This subject is arranged to introduce the theory and techniques required in Automatic Optical Inspection (AOI) as well as its applications in various industries. The subject mainly includes the following subtopics: introduction to precision metrology and machine vision, the measurement &amp; detection principles and methods used in the 2D AOI, the detection &amp; measurement principles and techniques used in the 3D AOI, image processing and algorithm methods used in automatic inspection, special topic from experts from industries, system instrumentation, factory visit, and lab practice work.\n\nCourse Objectives:\n1.　　To familiarize with fundamentals, theories and techniques required in AOI technology. \n2.　　To understand key issues in system design and operations in AOI.\n3.　　To establish the fundamentals of instrumentation needed in AOI.\n4.　　To establish hands-on skills of AOI\n\n本課程主要介紹自動化光學精密檢測相關技術，內容包括如下：前言，精密量測概論，機器視覺原理，二維光學檢測技術及實習，三維光學檢測技術及實習，影像處理與人工智慧技術運用，智慧型量測系統及應用，系統整合之相關技術，產業相關技術應用，及結論。","schedule":"Week　　Topics\n1　　課程介紹:上課內容及自動化光學檢測產業之發展趨勢\n2　　休假\n3　　 基本光學原理\n4　　 光學影像基礎\n5　　 數位影像處理技術\n6　　 OPENCV數位影像處理函式庫之整合與應用\n7　　 溫書假\n8　　自動瑕疵偵測之演算法則(一): 影像比對\n9　　業界教師(一): 3D Machine Vision &amp; technologies (東元電機王博士)\n10　　自動瑕疵偵測之演算法則(二): 表面瑕疵偵測\n11　　 AOI在PCB與LCD產業之應用\n12　　 AOI在IC產業之應用\n13　　實驗一：自動對焦量測、自動影像比對、CCD校正: 第一組同學;  自動影像瑕疵偵測、  三維量測實習、OPENCV 實習: 第二組同學.\n14　　實驗二： 自動對焦量測、自動影像比對、CCD校正: 第二組同學;  自動影像瑕疵偵測、  三維量測實習、OPENCV 實習: 第一組同學.\n15　　白光干涉三維量測原理與檢測應用\n16　　業界教師(二): 自動尺寸 瑕疵之檢測技術與實例 (工研院量測中心)\n17　　參觀德律公司\n18　　Final exam (close book test)","scorePolicy":"成績評量方式：\n1.　　期末考 (50%);  \n2.　　作業(25%);  \n3.　　實驗報告 (25% );   \n4.　　出席成績 (0~-10%)","materials":"講義:  陳亮嘉 (置於實驗室網站供學生自行下載)\n參考書： (1) Optical metrology:  K. J. Gasvik, ISBN: 0-470-84300-4, Wiley, 3rd Edition; (2) Digital Image Processing: R. C. Gonzalez and R. E. Woods, third edition, 978-986-154-762-6;  (5) 圖書館藏相關期刊文章。","foreignLanguageTextbooks":false}]
