[{"name":"周素鳳","email":"sfchou@ntut.edu.tw","latestUpdate":"2011-03-01 12:51:20","objective":"This is an integrated course specifically designed to advance students’ proficiency and communicative competence in English.  In this semester, in addition to the six articles in MegaGaol, selected reading texts drawn from newspapers and online news websites will be included.  Students will not only cultivate reading competence and enrich vocabulary knowledge through exposure to the language of the news media but also get in touch with the latest news and viewpoints on global affairs. The class format will combine lecture, small-group discussion, in-class practices and individual oral tests.","schedule":"2/24　　New York Times: Posting Your Promises to Elevate the Stakes\n3/3　　TED: The 3 A's of awesome　　\n3/10　　TED: The 3 A's of awesome　　\n3/17　　Unit 7: You’ve Got Mail　　\n3/24　　Unit 8: Wishful Thinking　　\n3/31　　Unit 9: Complaints, Complaints\n4/7　　Holiday\n4/14　　Midterm Exam\n4/19　　Proficiency Test\n4/28　　TED\n5/5　　TED　　\n5/12　　New York Times: Getting Ready for a Grayer World　　\n5/19　　Unit10: I Wonder What Happened     　　\n5/26　　Unit 11:If It Hadn’t Happened　　\n6/2　　Unit 12: What They Said　　\n6/9　　Review\n6/16　　Final Exam\n6/21　　Proficiency Test","scorePolicy":"Grading Scale: \n1. Weekly quizzes and practices: 40%\n2.Midterm Exam &amp; Final Exam: 50%\n3.Oral Tests: 10%","materials":"Requirement: \n1. Your regular attendance is required to pass this course.  3 unexcused absences from class will result in failing this course.  Excused absences require that I be notified on or before class date, or with official documentation shortly after the absence.  One unexcused absence will result in an automatic final score reduction of 2 points.  If you are more than 15 minutes late to the class, it will be counted as an absence.  One late attendance means a 1 point reduction from your final score. \n2. Every student will be arranged to take 2 individual oral tests in this semester. You will be asked to answer questions related to the texts covered in class.  Every week, 4-5 students will be assigned to take the oral test, while all the other students will be given group activities, in-class practices in writing or translation work.\n3. Throughout the semester, there will be numerous, announced or unannounced, quizzes, in-class activities, in-class writings, take-home exercises.  If you miss any of the tests or fail to submit the exercise by the deadline, there is no way to make it up (no exceptions).  However, your two lowest scores will be dropped—so, save these for those unexpected occasions when you might be sick or miss class for other reason.","foreignLanguageTextbooks":false}]
