[{"name":"饒餘杏","email":"Yvonnejao1@gmail.com","latestUpdate":"2011-02-21 17:00:50","objective":"本課程以輔助建築設計操作中的環境分析方法與實務練習為目的，培養學生具備具體的分析工具、方法、程序洞察力。課程將以實際操作為主，透過田野調查實務的練習強化學生的環境知識與體驗能力。\n〔一〕目標：\n提供學生有關生態(永續)土地發展、建築、景觀環境調查、收集、分析之基本理論、規劃設計方法及實務經驗，使學生在執行土地發展、建築規劃、設計過程時具有分析、整合、應用基地環境條件，規劃設計能融合環境之永續土地發展、建築體及改善周邊環境景觀之規劃設計能力，以完成具有創意及生態基礎之永續土地發展、建築、景觀規劃、設計實務能力。\n〔二〕方法：\n本課程一學期時間分為兩個部分，其一為生態環境調查、收集、分\n析、應用方法與永續土地發展、建築、景觀原理及規劃設計方法論、工作流程及實務操作規劃、設計案例介紹。\n另部分為環境調查、收集、分析應用於實務永續土地發展、建築及景觀規劃設計，使學生畢業後對生態(永續)土地發展、建築、景觀領域之理論及實務方面，皆有所了解，以因應時代發展。\n〔三〕 教授重點內容：\n一 ．生態(永續)土地發展、建築、景觀環境調查、收集、分析應用範圍\n二 ．生態(永續)土地發展、建築、景觀原理及規劃設計方法論\n三 ．生態(永續)土地發展、建築、景觀規劃、設計 工作流程\n四 ．生態(永續土地發展、)建築、景觀資料蒐集、調查及分析\n1.自然環境因子\n2.實質環境因子\n3.社會環境因子\n4.歷史文化因子\n五 ．環境資源在生態(永續)規劃設計中的功能\n六 ．環境調查、收集、分析應用於生態(永續)土地發展、建築、景觀規劃設計實務操作案例\n1. 生態(永續)土地發展、建築、景觀規劃實務操作案例\n2. 生態(永續)建築、景觀設計實務操作案例\n七 ．以一實際建築基地要求學生練習作基地生態環境資料收集、分\n析及永續土地發展、建築、景觀規劃、設計\n( I ) Objectives :\nTo provide architectural students with the basic knowledge and\npractical experience of Date collection, site survey and analysis ,\nrelated with Sustainable Land Development, Architecture and Landscapen Planning &amp; Design .\nTo train the student with the abilities to integrate the environmental\ndata &amp; analysis in Eco (sustainable) Land Development, Architecture and Landscape Planning &amp; Design.\n( II ) Method :\nThis course contains two parts in one semester,. Part one will be the\nntroduction of the Eco (sustainable) Land Development, Architecture and Landscape Planning &amp; Design Methodology, Working Procedure, Data Collection, Site survey and Analysis, Functionally uses of Natural resources,on sustainable planning &amp; design . Another part Will be the Land Development, Architecture and landscape planning and design practice cases study.\n( III ) This course wil1 focus on the major Topics :\n1 . The Work Scope of Eco (sustainable) Land Development, Architecture and Landscape Planning and Design\n2 . Eco(sustainable) Architecture and LandscapeTheory and Planning\n&amp; Design Methodology\n3 . The Working Procedure of sustainable Architecture and\nLandscape Planning and Design\n4 . Data Collection, Site survey and Analyisis of Eco (sustainable)\nLand Development, Architecture and Landscape Planning and Design\n(1) .Natural factors\n(2) .Physical factors\n(3) .Social factors\n(4) .Historic &amp; Cultural factors\n5 . Functional uses of natural resources in sustainable projects\n6 . Environmental Date collection, site survey and analysis , used on\nEco (sustainable) Land Development, Architecture and landscape planning and design practice cases study\n(1).Eco (sustainable)  Land Development, Architecture and landscape planning practice cases study\n(2).Eco (sustainable) Architecture and landscape design practice cases study\n7. Choosiung an architectural site let students to practice the\nEco (sustainable) Land Development, Architecture and landscape Data Collection,Site Analysis, planning and Design","schedule":"2/24第一週\n一 ．生態(永續)土地發展、建築、景觀規劃設計應用範圍\n3/3~3/17第二~四週\n二 ．生態(永續)土地發展、建築、景觀原理及規劃設計方法論\n3/24第五週\n三 ．生態(永續)土地發展、建築、景觀規劃、設計 工作流程\n3/31~5/5第六~十一週\n四 ．生態(永續)土地發展、建築、景觀資料蒐集、調查及分析\n1.自然環境因子\n2.實質環境因子\n3.社會環境因子\n4.歷史文化因子\n5/12第十二週\n五 ．環境資源在生態(永續)環境中的功能\n5/19~6/16第十三~十七週(第十三週繳期中環境調查、收集、分析報告)\n六 ．生態(永續)土地發展、建築、景觀規劃設計實務操作案例\n1. 生態(永續)土地發展、建築、景觀規劃實務操作案例\n2. 生態(永續)建築、景觀設計實務操作案例\n6/23第十八週繳期末土地發展、永續建築、景觀規劃設計報告)","scorePolicy":"1.上課點名 佔40%\n2.期中基地環境調查、收集、分析報告 佔30%\n3.期末永續建築及景觀規畫、設計報告  佔30%","materials":"1.生態土地使用規劃/2000年1月/黃書禮著/詹氏書局\n2.築綠/2010年12月/陳宗鵠著/詹氏書局\n3.Design with Nature//1992年/Ian L. McHarg /John Wiley &amp; Sons, Inc.\n道法自然/2002年3月/郭瓊瑩、饒餘杏等15人譯/田園城市文化事業有限\n公司\n4.Plants/people/and environmental quality/1972年/Gary O.Robinette/\nU.S.Department of the Interior, National Park Service, Washington,\nD.C.\n5.Landscape Planning for Energy Conservation /1977/Charles McClenon,\nGary O.Robinette/Environmental Design Press","foreignLanguageTextbooks":false}]
