[{"name":"霍弘毅","email":"twall@ntut.edu.tw","latestUpdate":"2011-03-01 08:02:28","objective":"In this class we will read and discuss the French novel The Princess of Cl?ves [La princess de Cl?ves] which was published anonymously in 1678 and which we now know was written by Madame de Lafayette.  The novel is significant because, first, it was written by a woman at a time when women seldom published, second because it is considered to be the first psychological novel, third, it helped establish a pattern for all fiction of its kind to follow, and fourth because when it was published it created a scandal and became the most talked about and most written about novel of its time.  \nSet during the reign of Henry II of France (1519-1559) (whose reign coincided with the ascendancy of Elizabeth I to the throne of England) it is the complex, compelling, and remarkably modern story of a woman, her mother, her marriage, and her trials of the heart.  The novel remains one of the most widely read works in the world today (three different English language editions exist at Amazon.com).  In France it is required reading in High School.  French President Nicolas Sarkozy declared publicly that he loathed reading the novel.  In response a new edition of the novel was issued and sold out almost at once. Thousands of people in France wore a button saying: Je lit La princess de Cl?ves to protest Sarkozy’s remark.","schedule":"Wk 1: Introduction to the Course\n\nWk 2: Film: Elizabeth (1998, dir. Shekhar Kapur, starring Cate Blanchett)\n\nWk 3: Lecture: Historical backgrounds to The Princess of Cl?ves\n\nWk 4: Introduction to Literary Terms and Literary Backgrounds.  Begin the novel.\n\nWks 5 – 12: Close reading of the novel\n\n(Wk 9 or 10: MID TERM EXAM: 30%)\n\nWks 13 – 17:  Reading and discussion of secondary sources (essays and reviews, etc.).  Lessons in how to read and write about literature.  \n\nGroup work to develop character or plot analysis: 20%\n\nFinal Exam: 50%","scorePolicy":"Mid Term Exam 30%\nGroup Presentation 20%\nFinal Exam 50%","materials":"The Princess de Cl?ves","foreignLanguageTextbooks":false}]
