[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2011-03-02 09:55:04","objective":"In this course we will continue to develop skills and techniques necessary for the preparation of a full-length research paper.  You will select a research topic and compose two short (2-5 page) papers and one full length (8-10 page) research essay based on both primary and secondary sources and containing a clear distinction between th two.  You will begin your research, in all likelihood, by looking at secondary sources; by the middle of the semester, however, you must have located—and physically shown to me—at least two primary textual sources.  Today, the first day of class, you will select a general topic for further research.\n\nGive some care to selecting a workable topic.  It will work best if you have a genuine desire to learn more about your chosen area.  It is necessary for this class that your research idea lend itself to form of theoretical speculation.  That is to say the best topics will be open-ended, allowing for something more than just a general recitation of facts.  To find a topic that will work for you, begin by selecting a broad area of interest.  Some general areas that I would recommend for your consideration include literature, art, film, philosophy, psychology, music and cultural studies.  But you may select any broad area that you are willing to devote your scholarly efforts to over the next four months.  During that time, you will progressively narrow your more overarching topic down so that finally you will be focusing on specific key works (that is, primary sources) to develop an original, complex thesis idea that sheds new light on your topic and the scholarship available upon it.  All of the shorter papers and informal journal writing assignments should be looked at as possible versions of portions of your final paper; and indeed your final paper may, if you so desire, be looked at as a possible version of a portion of your senior project.","schedule":"All assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nFebruary 23 Introduction/ ASSIGNMENT ( Journal Entry #1): Selecting an Area of Interest\nMarch 2 MLA Format/ JE#1 Due/ ASSIGNMENT: Compose WA#1: Research Proposal\nMarch 9 DRAFT WA#1 DUE (with three extra copies)\nMarch 23 FINAL DRAFT WA#1 DUE/ ASSIGNMENT (JE#2): Research Question and Statement of Methodology\nMarch 30 JE#2 Due/ ASSIGNMENT: Compose WA#2:  Review of the Secondary Literature\nApril 13 Draft WA#2 (with three extra copies) Due\nApril 20 FINAL DRAFT WA#2 DUE/ASSIGNMENT (JE#3): Locating a Primary Source\nApril 27 JE#3 Due/ ASSIGNMENT: Compose WA#3: Comparing Two Sources\nMay 4 Discussion/ Individual Conferences\nMay 11 DRAFT WA#3 (with three extra copies) DUE/Peer Evaluation\nMay 18 FINAL DRAFT WA#3 DUE/ ASSIGNMENT (JE#4):What Have You Learned So Far?\nMay 25 JE#4 Due/ ASSIGNMENT: Prepare for Group Presentations\nJune 1 Group Presentations\nJune 8 Group Presentations  ASSIGNMENT:  Compose WA#4: Research Report\nJune 15 DRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\nFINAL PAPER DUE NOON JUNE 23","scorePolicy":"25%　　Papers 1-3\n25%　　Quizzes and Journals \n25%　　Final Paper\n25%　　Participation and Presentation","materials":"　","foreignLanguageTextbooks":false}]
