[{"name":"凌凱","email":"Karsten.boethling@gmx.de","latestUpdate":"2011-03-11 08:10:00","objective":"This class is aimed at giving the students a basic understanding of the German language. They will not only learn the most important vocabulary and grammar but also have plenty opportunity to make use of it. As a result, they hopefully will be able to master simple everyday situations in Germany, Austria and the German-speaking part of Switzerland.","schedule":"February 25: Activities to get to know each other: partner interview, introducing him or her to the teacher, asking the teacher questions\nMarch 4: Reviewing what the students have learned last semester, especially lesson 7 in the textbook\nMarch 11: Lesson 7-3: A working day / Mrs Winter has to go to hospital (grammar: § 11, 16a, 38, 46)\nMarch 18: Lesson 7-4: A boy got lost at the autobahn service area! (dealing with the story from different perspectives)\nMarch 25: Lesson 7-5: Marianne on a business trip to Vienna (reading a letter, telling a story by means of pictures, listening to the real story)\nApril 1: Lesson 8-1: In the city / Different institutions, where do people go when they need something... (grammar: § 16a)\nApril 8: Lesson 8-1: Mr Kern has to clear some things up / How do I get to the main station? (grammar: § 17)\nApril 15: Lesson 8-2: A city tour in Berlin (grammar: § 15, 16b, 44)\nApril 22: Midterm exam week\nApril 29: Lesson 8-2/3: How to get to Berlin? / Berlin - 30 years later (reading a newspaper article)\nMay 6: Lesson 9-1: Presents / What would you like to have? (grammar: § 3, 11, 38, 42, 43)\nMay 13: Lesson 9-1: What presents can you give to these people? (listening to dialogues, reading and writing a letter; grammar: § 11)\nMay 20: Lesson 9-2: The customer is king (comparing things, grammar: § 12, 21)\nMay 27: Lesson 9-3: The brand new Video Phone! (reading and dealing with advertisements)\nJune 3: Lesson 9-4: Now I am much happier! (analyzing an interview) / What's important in life? (grammar: § 21)\nJune 10: Lesson 10-1: German language and culture (What do you know about Germany, Austria and Switzerland? Quiz: famous people)\nJune 17: Lesson 10-2: The German speaking countries / Reading a map (grammar: § 4, 7, 10) / Reviewing\nJune 24: Final exam week","scorePolicy":"Class participation: 10%\nAssignments: 20%\nQuizzes: 10%\nMidterm exam: 30%\nFinal exam: 30%","materials":"As a textbook we use \"Themen aktuell 1\". It is a classic title for teaching German because of its systematic training of the four different skills: reading, listening, speaking, and writing. Along with the textbook comes a workbook (used for doing exercises at home) and three audio CDs.","foreignLanguageTextbooks":false}]
