[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2019-12-17 16:25:20","objective":"本課程針對幼稚園與國小學童的英語師資而設計，考量本階段兒童身心發展的程度，在教材與教法的搭配上提供學理的引介與實務上的訓練。","schedule":"I. Required Text:\nTeaching Children English. by David Vale and Anne Feunteun. Cambridge:  Cambridge UP, 2003.\nII. Important Texts:\n1. Culture in Second Language Teaching and Learning. Ed. by Eli Hinkel. Cambridge:  Cambridge UP, 1999.\n2. Pictures for Language Learning, by Andrew Wright. Cambridge:  Cambridge UP,2003.\nIII.Teaching materials for practicum:\n1. Content Area Reading (Levels A-F), by Teacher Created Materials, Inc. Taipei:  Norton and Bookman, 2004.\n2. Engligh 300 for Children, by Edwin T. Cornelius, Jr. Taipei: Studio Classroom, 2005.\nIV. Syllabus:\nUnit One: Approaches in Teaching Children English\nWeek 1 Introduction\nWeek 2 Attitudes and approaches\nWeek 3 An overview of thress teaching approaches\nWeek 4 Building up a teaching sequence\nUnit Two:Activities in Teaching Children English\nWeek 5 An overview of teaching techniques; teaching practice\nWeek 6 A focus on balancing various activities; teaching practice\nWeek 7 Storytelling, comprehension, errors, and correction; teaching practice\nWeek 8 Classroom management and organization; teaching practice\nUnit Three:Key study areas in Teaching Children English\nWeek 9 Visual, musical, and other teaching aid; teaching practice\nWeek 10 Content and curriculum design; teaching practice\nWeek 11 Observation, assessment and records; teaching practice\nWeek 12 Communication with students, parents, and supervisors; teaching practice\nUnit Four: Culture in Second Language Teaching and Learning\nWeek 13 Culture, context, and writing; teaching practice\nWeek 14 Developing skills in listening and interpreting culturalimplication in conversation; teaching practice\nUnit Five:  Pictures for Language Learning\nWeek 15 Pictures for speaking and writing; teaching practice\nWeek 16 Pictures for listening and reading; teaching practice\nUnit Six: Wrapping up\nWeek 17 Final (written) exam on the knowledge of teaching approaches\nWeek 18 Teaching practicum (final exam)","scorePolicy":"I. In class participation,discussions and teaching practice: 30%\nII.Exam on teaching principles, theory, and approaches: 30%\nIII. Teaching practicum: total 40%\n1. creation and preparation of teaching materials: 20%\n2. teaching approaches and classroom management: 20%","materials":"1.Teaching Children English. by David Vale and Anne Feunteun. Cambridge:  Cambridge UP, 2003.\n2.Culture in Second Language Teaching and Learning. Ed. by Eli Hinkel. Cambridge:  Cambridge UP, 1999.\n3.Pictures for Language Learning, by Andrew Wright. Cambridge:  Cambridge UP,2003.\n4.Content Area Reading (Levels A-F), by Teacher Created Materials, Inc. Taipei:  Norton and Bookman, 2004.\n5.Engligh 300 for Children, by Edwin T. Cornelius, Jr. Taipei: Studio Classroom, 2005.","foreignLanguageTextbooks":true}]
