[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2011-03-02 09:59:11","objective":"We will be reading four novels in this semester’s course—or potentially five, depending on if you count Lewis Carroll’s Alice’s Adventures in Wonderland and Through the Looking Glass as two novels or one.  Anyway all the novels are British (some decidedly so) and all involve marvelous journeys through space and time.  They range in nature from the (inspiredly) silly (Alice’s aforementioned adventures) to the satirical (Jonathan Swift’s Gulliver’s Travels), from the poignant horror of the Romantic grotesque (Mary Shelley’s Frankenstein) to a Modernist mindscape weaving inner and outer of life and time (Virginia Woolf’s The Waves).  Emphasis will be laid upon going beyond the (often delightful) details of plot to appreciate the nuance woven into the language used by each of these four classic authors.  We will also examine other related (very short) works of literature that shed light upon the principle texts.  It is my hope that we will learn to appreciate the spiritual, aesthetic, political and philosophical usages, demands and delights of literature in general and the novel in particular.","schedule":"All assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nFebruary 24 Introduction:  Nonsense and Logic:  Edward Lear and Lewis Carroll\nMarch  3 Alice, pp. 1-32\nMarch 10 Alice, pp. 33-104\nMarch 24 Looking Glass, pp. 105-161\nMarch 31 Looking Glass, pp. 161-231\nApril 7 Gulliver, Part One\nApril 14 Gulliver, Part Two\nApril 21 Gulliver, Part Three   (hand out midterm due during class April 16)\nApril 28 Gulliver, Part Four.\nMay 5 Frankenstein, pp.\nMay 12 Frankenstein, pp.\nMay 19 Frankenstein, pp.\nMay 26 Frankenstein, pp.\nJune 2 The Waves, pp.\nJune 9 The Waves, pp. (handout final exam due noon, June 27)\nJune 16 The Waves, pp.  \nJune 23 The Waves, pp. (final exam due noon, June 27)","scorePolicy":"25%　　Midterm Exam\n25%　　Participation\n25%　　Homework Assignments\n25%　　Final Exam","materials":"Alice, Looking Glass, Gulliver, Frankenstein, The Waves","foreignLanguageTextbooks":false}]
