[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2011-03-02 10:00:12","objective":"English Romantic poet Percy Bysse Shelley once famously observed that “Poets are the unacknowledged legislators of mankind.”  Unacknowledged they may well be.  But poetry remains unique among the linguistic arts as the one which most fully synthesizes orality with the written text, the intellectual rigor of philosophy with the immediacy of direct perception, and the world of he individual imagination (such as witnessed in drems) with the mythologies, folk rituals and held as the common cultural heritage by entire groups of people.  In this class we will try to bring the written word off the page and into new life through discussion, performance, and the use of supplementary materials such as music, film and visual arts.  In order to understand how literature interacts with the performatory, healing and divinatory arts from which it may well stem, we will look at literature through the lens first suggested by anthropologist Victor Turner who used the notion of liminality to describe the function of ritual in a tribal context. Liminal space can be thought of as a doorway or threshold through which the shaman-artist passes, or upon which he balances.  Turner, whose fieldwork was based on the Ndembu of Zaire, posits ritual as not only recreating but indeed creating the categories by which humans perceive reality.  Ritual and art create a liminal space in which man-made divisions dissolve before the deeper intuition of unity in all things.  To such ends, the liminal makes use of, among other devices, nonsense, monstrous images, sacred symbols, clowns, masks and gender reversal.  The ritual, thus viewed, becomes, rather than a reaffirmation of morays, customs and pre-defined rules, a realm of pure possibility, essentially ambiguous, unsettled, unsettling.  In this course we will study how Turner’s notion of liminal (or liminoid) space can be applied in a variety of contexts, beginning with the orally transmitted ancient (or contemporary tribal) shaman’s song and moving toward inscribed symbolic or written language in the form of epical literature and systematized forms of divination.\n\nThis course will provide an examination of poetry in relationship to musics of the world, particularly rural blues, ancient Scottish ballads, British and American folk-rock, reggae, jazz and hip-hop.  Anticipated films include:  Percy Henzell’s The Harder They Come, Marcel Camus’ Black Orpheus and The Cry of Jazz which features early performances by the Sun Ra Archestra.  Through exposure to poetry, art, song, film, history, mythology, literary theory and consciousness studies, students will be able to acquire a more sophisticated, nuanced view of culture in its aesthetic expression, and a greater appreciation for the manner in which art and culture continually shape and reshape one another.","schedule":"February 21　　INTRODUCTION:  Music “Mr. Tambourine Man,” by Bob Dylan;  :Hoochie-Coochie Man” by Willie Dixon.  ASSIGNMENT:  Robert Duncan “Toward the Shaman.”\n\nMarch 7　　THE SHAMAN’S AMBIT.  .  ASSIGNMENT:  Sappho Poems and “The Descent of Inanna.”\nTHE UNDYINGNESS OF LOVE.  .  ASSIGNMENT:  Taliesin’s Riddle; shape-shifting shaman’s songs from the northern Eurasian tradition.\n\nMarch 21  NATIVE AMERICAN SPIRITUALITY.   ASSIGNMENT:  “The Great Vision of Black Elk,” Pt. One.\n\nMarch 28  NATIVE AMERICAN SPIRITUALITY AND THE TRICKSTER CYCLE.  ASSIGNMENT:  “The Great Vision of Black Elk,” Pt. 2 + selected Winnebego tales.\n\nApril 11　　BALLAD FORMS AND FOLK SONGS, pt. 1:  Archival footage of Woody Guthrie, Leadbelly.  ASSIGNMENT:  Read selected Ballad and Blue’s lyrics  (“Frankie and Johnnie,” “Stagolee,” etc.)\n\nApril 18　　BALLAD FORMS AND FOLK SONGS, pt.2.  Bob Dylan and the folk-rock revolution (back to the beginning again)\n\nApril 25  Hoodoo (Delta Blues):  Robert Johnson, Son House, Sleepy John Estes, Charlie Patton, Blind Willie McTell  ASSIGNMENT:  Read selections from The Blues Line and explicate and reflect on any one of the blues songs whose words you understand.\n\nMay 2   CHICAGO BLUES:  Rare studio recording of Mississippi Muddy Waters, Otis Spann, Willie Dixon and others.  Reading: Selections from Paul Garon\n\nMay 9  Midterm Exam\n\nMay  16 JAZZ, PART 1.  Film footage of Louis Armstrong, Besse Smith, Billie Holliday, Art Blakey.  Poems by Langston Hughes, Gwendolyn Brooks.\n\nMay 23　　JAZZ, PART 2  Charlie Parker and the Be-Bop Sound.  Poems by Bob Kaufman, Ted Joans, Amiri Baraka\n\nMay 30  FILM:  “The Cry of Jazz,” a rare jazz documentary featuring the Sun Ra Archestra.  Poems by Sun Ra and Nathaniel Mackey.\n\nJune 13  The Harder They Come, Starring Jimmy Cliff. pt 1.Poems by Kamau Braithwaite.\n\nFINAL PAPER DUE NOON JUNE 23","scorePolicy":"25%　　Midterm Exam\n25%　　Participation\n25%　　Journal Assignments\n25%　　Final Exam","materials":"　","foreignLanguageTextbooks":false}]
