[{"name":"蔡榮發","email":"jftsai@ntut.edu.tw","latestUpdate":"2011-01-14 15:50:29","objective":"本課程主要運用最佳化方法解析動態成長、風險檢測、供應鏈調控等管理與決策問題，探討的主題包括：環球供應鏈問題、投資組合問題、生產規劃、配送規劃、排程規劃、原物料切割問題、投資組合問題、管理績效評估、多磁碟系統配置、能力集合分析等。此外，也會討論如何運用各種最佳化技術以最有效率方式求得全域最佳解，並彙整比較相關文獻之方法及各種應用。","schedule":"W1 Introduction to quantitative management and decision making\nW2 Applications \nW3, W4: Multidisk vertical allocation (Data knowledge and engineering, 1993, Chang, 2002, Tsai, 2005, New method) (testing problems and present report on 4/8)\nW5, W6: Nonlinear programming problems (Approximate polynomial, Li and Chang, 1998; piecewise linearization, Li and Chang, 1998; Fast Assortment, Li and Tsai, 2001; improved goal programming(Li, 1996); piecewise linearization assortment problem, Li, Chang and Tsai, 2002.\nW7, W8: local optima for MINLP, Li,1992; 0-1 fractional, Li, 1994; 0-1 fractional, Chang, 2001; nonconvex separable, Li and Yu, 1999.\nW9 paper presentation\nW10 paper presentation\nW11 paper presentation\nW12, W13: Signomial discrete problems (Tsai, 2002); Fractional programming (Tsai, 2005);SDP with Free variable, Tsai and Lin, 2006.\nW14 Container loading problems (Chen, 1995); Distributed packing, Li, Tsai and Hu, 2003.\nW15 Multiple solutions, Tsai, Lin and Hu, 2008; multiple solutions of nonlinear equation, Tsai and Lin, 2007.\nW16 paper presentation +Game Theory (I)\nW17 paper presentation +Game Theory(II)\nW18 paper presentation +Spectrum Management\n","scorePolicy":"Presentation: 50% (25% for each)\n上課討論與出席情況: 30%\nHomework: 20%","materials":"References:\n1.Deterministic global optimization: theory, algorithms and applications (Christodoulos A. Floudas, Kluwer Academic Publishers, 2000).\n2.Introduction to global optimization (Horst R., Pardalos P.M. and Thoai N.V., Kluwer Academic Publishers, 2000).\n3.Handbook of test problems in local and global optimization (Christodoulos A. Floudas et al., Kluwer Academic Publishers, 1999).\n4.Selected papers from Journal of Global Optimization, European Journal of Operational Research, Engineering Optimization, and Journal of the Operational Research Society.\n5.Optimization Modeling with Lingo, 2001, LINDO System INC.\nSelected papers:\n1.D. Rotem, G. A. Schloss, A. Segev, Data allocation for Multidisk Database, IEEE Transactions on Knowledge and Data Engineering, 5 (5) (1993) 882-887.\n2.C. T. Chang, Optimization approach for data allocation in multidisk database, European Journal of Operational Research, 143 (2002) 210-217.\n3.Jung-Fa Tsai, Han-Lin Li, On optimization approach for multidisk vertical allocation problems, 165, 835-842, 2005.\n4.Han-Lin Li, and Ching-Ter Chang, “An Approximate Approach of Global Optimization for Polynomial Programming Problems”, European Journal of Operational Research, 107(3), 625-632, 1998.\n5.Han-Lin Li, and Ching-Ter Chang, “An Approximately Global Optimization Method for Assortment Problems”, European Journal of Operational Research, 105, 604-612, 1998.\n6.Han-Lin Li, “Solve Least Absolute Value Regression Problem using Modified Goal Programming Techniques”, Computers and Operations Research, 25(12), 1137-1143, 1998.\n7.Han-Lin Li, and Chian-Son Yu, “A Global Optimization Method for Nonconvex Separable Programming Problems”, European Journal of Operational Research, 117, 275-292, 1999.\n8.Han-Lin Li, A global approach for general 0-1 fractional programming, European Journal of Operational Research, 73, 590-596, 1994.\n9.Ching-Ter Chang, On the posynomial fractional programming problems, European Journal of Operational Research, 143, 42-52, 2002.\n10.Jung-Fa Tsai, Global optimization of nonlinear fractional programming problems in engineering design, Engineering Optimization, 2005, 1-11.\n11.Jung-Fa Tsai, Han-Lin Li, and Nian-Ze Hu, “Global Optimization for Signomial Discrete Programming Problems in Engineering Design”, Engineering Optimization, 34, 613-622, 2002.\n12.Han-Lin Li, and Jung-Fa Tsai, “A Fast Algorithm for Assortment Optimization Problems”, Computer and Operation Research, 28, 1245-1252, 2001.\n13.Han-Lin Li, Ching-Ter Chang, and Jung-Fa Tsai, “Approximately Global Optimization for Assortment Problems using Piecewise Linearization Techniques”, European Journal of Operational Research, 140, 584-589, 2002.\n14.C. S. Chen, S. M. Lee, Q. S. Shen, An analytical model for the container loading problem, European Journal of Operational Research, 80, 68-76, 1995.\n15.Han-Lin Li, Jung-Fa Tsai, Nain-Ze Hu, A distributed global optimization method for packing problems, Journal of the Operational Research Society, 54, 419-425, 2003.\n16.T. Obata and H. Ishii, A method for discriminating efficient candidates with ranked voting data, European Journal of Operational Research 151, 233-237, 2003.\n17.Han-Lin Li, and Jung-Fa Tsai, “Treating Non-Positive Variables in Generalized Geometric Global Optimization Programs”, Journal of Global Optimization, Accepted, 2005.\n18.Michael Doumpos, Constantin Zopounidis, A multicriteria classification approach based on pairwise comparisons, 158, 378-389, 2004.\n19.Jung-Fa Tsai, 2009, Treating free variables in generalized geometric programming problems, Computers and Chemical Engineering, 33(1), 239-243.\n20.Han-Lin Li, Jung-Fa Tsai and C. A. Floudas, June 2008, Convex Underestimation for Posynomial Functions of Positive Variables, Optimization Letters, 2 (3), 333-340.\n21.Jung-Fa Tsai, Ming-Hua Lin and Yi-Chung Hu, January 2008, Finding Multiple Solutions to General Integer Linear Programs, European Journal of Operational Research, 184 (2), 802-809.\n22.Jung-Fa Tsai* and Mi","foreignLanguageTextbooks":false}]
