[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2011-01-06 21:32:26","objective":"Course Objective\nTo provide a comprehensive introduction to the principles and applications of interactive technologies and information systems and to proposed applications for future cutting edge interactive applications. Activity focuses on the descriptions, contents, principles and applications of the changes to the interactive technology and its future trends. The course covers the discussion on four main topics and their application case studies: traditional interactive technology, multi-touch interactive technology, gesture interactive technology and internet interactive technology.\nProcedures and Class Sessions\nClasses will consist of lectures, moderated round-table discussions, the writing presentation of a research paper and a final exam. Classes will meet in classroom 六教B on Monday afternoon from 13:20 to 16:00 PM. Studying groups will be established, each consisting of 2-3 members. Each group is asked to build-up and maintains its own studying blog. This course offered out-of-class communications that consist mainly of e-mail communication, and responding to documents posted on the class discussion board as follows:\n(https://facebook.com/imi.ntut)\nGroup Research Paper\nThe Research Paper Presentations are considered formal presentations, and as such the dress and deportment of the speaker should be professional in all respects. The class will play the role of a decision making body such as participants in an interactive technology development conference. The paper itself must also be of a professional quality such that it may stand on its own, not requiring a formal presentation.  All paper should follow the submission guideline of an international conference. The research paper is structured approximately in the follow sections as listed below:\nAbstract\nIntroduction\nLiterature Review\nMethodology and Design\nCase Studies and Discussion\nConclusions\n","schedule":"Teaching Plan\nWeek 1　　Course Introduction\n\nWeek 2　　The Learning from Shanghai EXPO 2010\n\nWeek 3　　Interactive Session: Self Introduction (II), The Gesture Interactive Interface: Xbox Natal, Round Table Meeting Topic I: The future interactive technology and applications (I)\n\nWeek 4　　Interactive Session: Self Introduction (III), The Gesture Interactive Interface: Zcam, Round Table Meeting Topic I: The future interactive technology and applications (II)\n\nWeek 5　　Group Presentation of  Round Table Meeting Topic I: The future\ninteractive technology and applications\n\nWeek 6　　The Interactive Technology and Education, Round Table Meeting Topic II: The interactive technology for education and commercial applications (I)\n\nWeek 7　　The Interactive Technology and Media Design, Round Table Meeting Topic II: The interactive technology foreducation and commercial applications (II)\n\nWeek 8　　Activity (I) Visit Interactive Technology Industries and\nNational Lab\n\nWeek 9　　Group Presentation of  Round Table Meeting Topic II: The\ninteractive technology for education and commercial applications, Discussions and Comments on reading assignment I and II\n\nWeek 10　　The Multi-touch Interactive Technology: Android System, \nRound Table Meeting Topic III: The Multi-touch applications\ndevelopment in Commercial Environment\n\nWeek 11　　The Multi-touch Interactive Technology: iPhone and iPad (iOS)\nSystem, Round Table Meeting Topic III: The Multi-touch applications\ndevelopment in Game (AppStore Mechanism)\n\nWeek 12　　Group Presentation of  Round Table Meeting Topic III: The\nmulti-touch interactive technology for commercial applications\nand game Discussions and Comments on report of the visit to the\nInteractive Technology Industries and National Lab O.\n\nWeek 13　　Activity (II) Speech: under arrangement\n\nWeek 14　　The Internet interactive applications development and internet\nmarketing\n\nWeek 15　　Research paper presentation and Discussion\n\nWeek 16　　Research paper presentation and Discussion\n\nWeek 17　　Demonstration: results of multi-touch practice, Review and Remark\n\nWeek 18　　Final Exam\n","scorePolicy":"Participation in round-table discussions &amp; attendance - 20%\nMedia and Presentation – 20%\nResearch Paper – 30%\nFinal Examination – 30%\n","materials":"to be arranged","foreignLanguageTextbooks":false}]
