[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2011-02-21 11:48:07","objective":"Why Shakespeare? Catherine Belsey answers that it is because of his singularity. As she observes, “Shakespeare is part and parcel of English-speaking culture, and not only high culture.” For “phrases from the plays are still current, woven into the fabric of everyday life” in Britain now and have, in fact, been circulated in the world since the early modern era. Besides, Shakespeare has been cherished for his powerful poetry and stagecraft, his nonpareil grasp of human nature, and his remarkable philosophical insights into life. For these reasons, among others, this course aims to guide students to appreciate Shakespeare. It will examine two of Shakespeare’s tragedies Hamlet and King Lear in particular and explore the generic elements of Shakespearean tragedies as well. As a dramatic mode, tragedy is a particular way of presenting a particular kind of story. We will discuss the characters inhabiting the two plays, the significant issues in them, and the idea of tragedy exemplified by them. From bloodthirsty revenge, to family struggles, madness, and jealousy, this course provides an opportunity for students to study two of Shakespeare’s most important tragedies in depth.","schedule":"Syllabus\n02/21  General Introduction \n\n02/28  Holiday\n\n03/07  King Lear \n\n03/14  King Lear\n\n03/21  King Lear\n\n03/28  King Lear\n\n04/04  Holiday\n\n04/11  King Lear\nOral Presentation on King Lear\nStudent 1:   　　　　　　Student 2:       　　　　Student 3:   \nStudent 4:   　　　　　　Student 5:        　　Student 6:\n\n04/18  King Lear\nOral Presentation on King Lear\nStudent 7:   　　　　　　Student 8:       　　　　Student 9:   \nStudent 10:   　　　　　　Student 11:        　　Student 12: \n\n04/25  Hamlet\n\n05/02  Hamlet\n\n05/09  Hamlet\n\n05/16  Hamlet\n\n05/23  Hamlet\n\n05/30  Hamlet\nOral Presentation on Hamlet\nStudent 1:   　　　　　　Student 2:       　　　　Student 3:   \nStudent 4:   　　　　　　Student 5:        　　Student 6:\n\n06/06  Holiday\n\n06/13  Hamlet\nOral Presentation on King Lear\nStudent 7:   　　　　　　Student 8:       　　　　Student 9:   \nStudent 10:   　　　　　　Student 11:        　　Student 12:\n\n06/20  Review","scorePolicy":"Grading policy:\nAttendance and class performance: 30%, oral presentation: 30%, position paper: 40%","materials":"Bibliography\nShakespeare, William. Hamlet. 3rd ed. Ed. Neil Taylor and Ann Thompson. London: Thomas Learning, 2006.\n___. King Lear. Ed. R.A. Foakes. London: Thomas Learning, 1997.","foreignLanguageTextbooks":false}]
