[{"name":"楊景德","email":"jyang@ntut.edu.tw","latestUpdate":"2011-02-16 17:19:54","objective":"Basing on human intellect or human reason, philosophical psychology is an intellectual endeavor that investigates some of the important aspect of human beings. Hence, the subject is also called philosophy of man or philosophical anthropology. This course will be divided into two stages as it proceeds. First, we shall review the insights provided by a famous British philosopher Julian Baggini.  To meet this goal, we shall read his popular book: \"What's It All About? Philosophy and The Meaning of Life.\" We thus are able to understand this subject on a solid footing. Then, by monitoring the major findings in some subjects such as neuroscience, psychology, neurobiology, and physiology, we thus enhance our understanding toward some key issues concerning human beings. These issues include at least: mind, emotions, creativity, body, and faces, and so on. To serve this purpose, we will watch some related scientific films produced by BBC, Discovery, NHK, and the like,to enrich our understanding toward we human beings.","schedule":"Weeks    Contents of instruction            Text chapter\n1.       Course introduction I\n2.       Course introduction II\n3.       Looking for the blueprint           Ch. One\n4.       Living life forwards                Ch. Two\n5.       More things in heaven and earth     Ch. Three\n6.       Here to help                        Ch. Four\n7.       The greater good                    Ch. Five\n8.       As long as you're happy             Ch. Six\n9.       Midterm\n10.      Becoming a contender                Ch. Seven\n11.      Carpe dicm                          Ch. Eight\n12.      Lose yourself                       Ch. Nine\n13.      The threat of meaninglessness       Ch. Ten\n14.      Of which reason knows nothing       Ch. Eleven\n15.      Conclusion\n16.      Taking the stock","scorePolicy":"Final exam：70%\nGeneral performance(based on attendance rates and performance at the class)：30%","materials":"1. Julian Baggini, What's It All About? Philosophy and The Meaning of Life.\n2. Complimentary work: BBC：Some related scientific films produced by BBC, Discovery, NHK, and so on.","foreignLanguageTextbooks":false}]
