[{"name":"周至如","email":"cjchou@ntut.edu.tw","latestUpdate":"2011-01-04 14:00:31","objective":"This course include to erect the power quality fundamental theory, causes and classification, indices definitions, analysis and simulation method, problem affections assessments, practical case studies and improved strategies and measures for the following importment issues of the power system quality:\n(1) power outage issue,\n(2) voltage variations issues,\n(3) phase unbalancesissues,\n(4) waveform distortions issues,\n(5) frequency variations issues.\nfor these issues, the causes to produce bad power quality will be surveyed and the affection factors will be found. The indices for specifying various power quality issues are defined . The methodology to analyzing and simulating the power system with respect to power quality problems are studied, from which the power quality indices will be calculated and their critical parameters will be found. In addition, the power quality level based on local and international standards and analysis results are assessed. Finally, the practical cases of power quality problems will be presented. Futhermore, the strategies for improving power quality of a power system are discussed, in which the design methods for the practical improved measures will be studied.","schedule":"第1週:introduction, objects, important issues of power system\nquality.\n第2週:overview of existent power system crital power quality\nproblems and affections. 　\n第3週:power outage problem survey , related indices evalutations\nand affection factors and import parameters determinations.\n第4週:causes and classification of power outage, improved\nstrategies and practical feasible measures for reducing power\noutage.\n第5週:fundamental theory of voltage variations on power system, root\ncauses to produce voltage variations, classification of\nvoltage variations.　\n第6週:definitions for various indices of voltage variations and\ntheir calculation.\n第7週:analysis and simulation method for voltage variation with\nrespect to various types of voltage variations. affections\nevaluations. 　\n第8週:study of phase unbalance problems (fundamental theory, causes\nand classification).\n第9週:Review and midterm examination and report (期中考試)　\n第10週:study of phase unbalance problems (analysis and simulation\nmethods, and indices definitions).\n第11週:study of phase unbalance problems (affections assessment and\nimproved strategies).　\n第12週:survey on waveform distortion problems: fundamental theory,\nindices definitions, causes and analysis methods.\n第13週:affections of power harmonics, transient and other type of\ndistortions of voltage and current waveforms.\n第14週:local and international standard of power harmonics,\nimproved strategies and practical case studies.\n第15週:planning and design of harmonic filters of practical\nproblems.\n第16週:frequency variation issue on power system: causes study and\naffections assessments. 　\n第17週:the frequency control methods in utility and customer and\ntheir availbility and investment evaluations.\n第18週:Final examination and report (期末考)\n","scorePolicy":"期中考:30%  期末考:30%  平常成績:40%\n註:平常成績包括:出席率,作業(報告)及課堂表現等.\n","materials":"The object of this course is to discipline the students of graduated level to erect their fundamental on the power system quality which includes to understand the important issues of power quality and their indices. The causes to produce bad power quality will be surveyed and the affection factors will be found. The methodology to analyzing the power system with respect to power quality problems are learned, from which the power quality indices will be calculated and their critical parameters will be found. In addition, the students must to learn to assess the power quality level based on local and international standards , and to find the strategies for improving power quality of a power system. in which the design methods for the practical improved measures will be learned.\n主要教材:\n1.(1)教科書名 Electric Power Quality\n作者 G. Heydt\n出版書局 Star in a circle Publications\n出版日期 西元1995年\n(2)教科書名 Electrical Power System Quality\n作者 R. C. Dugan, M. F. McGranaghan, S. Santoso,and H. W. Beaty\n出版書局 McGraw-Hill Companies, Inc.\n出版日期 西元2003年 International Editions\n2. 教師周至如自編講義\n","foreignLanguageTextbooks":false}]
