[{"name":"楊安石","email":"asyang@ntut.edu.tw","latestUpdate":"2010-12-15 10:54:31","objective":"高等流體力學主要為探討流體動力學，將講授流場有限控制體積與微分分析、不可壓縮與可壓縮黏滯流動量方程式推導原理，並且能利用Navier- Stoke方程式解牛頓黏滯流問題，進而訓練學生具備數學建模分析流體系統之能力。使學生成為具有較深入流體力學能力及能運用力學解決工程問題的機械工程專業人才，並具體:\n1 了解流體運動學/動力學、流場有限控制體積與微分分析。\n2 具備以解析方法解常見內、外層流流場之能力，及流體系統之模型建構能力。3 了解不可壓縮與可壓縮黏滯流動量方程式推導原理，並且能利用Navier- Stoke方程式解牛頓黏滯流問題。\n4 了解層流邊界層之特性，及具備層流穩定度觀念。課程大綱包括:\n第一章  Preliminary Concepts\n第二章  Fundamental Equations of Compressible Viscous Flow\n第三章  Solutions of Newtonian Viscous-Flow equations\n第四章  Laminar Boundary layers\n第五章  Stability of Laminar flows\n","schedule":"1  Preliminary Concepts\n2  Elementary Fluid Dynamics－Bernoulli Eq.\n3  Fluid Kinematics; Reynolds transport theorem\n4  Finite Control Volume Analysis: continuity equation\n5  The Newton’s second law－the momentum equation\n6  The first law of thermodynamics－the energy equation(derivation    and applications)\n7  Viscous Flow in Pipes: laminar flows\n8  Viscous Flow in Pipes: turbulent flows\n9  期中考\n10 Description of Fluid Flows; Types of Fluid Motion; Classification of Fundamental equations; Conservation of Mass: The Equation of Continuity\n11 Conservation of Momentum: The Navier-Stokes Equations; The Energy Equation (the First Law of thermodynamics); Boundary Conditions for Viscous Heat-Conducting Flow\n12 Mathematical Character of The Basic Equations; Vorticity Considerations in Incompressible Viscous Flow; Two-Dimensional Considerations: The Stream Function\n13 Couette Flows Due to Moving Surfaces; Poiseuille Flow through Ducts\n14 Unsteady Duct Flows; Unsteady Flows with Moving Boundaries; Asymptotic Suction Flows\n15 Wind-Driven Flows; Similarity Solutions; Integral (Control Volume approach) and Differential Approach  \n16 Similarity Solutions for Boundary-Layer Equations \n17 The Concept of Small-Disturbance Stability; Linearized Stability of Parallel Viscous Flows\n18 期末考\n","scorePolicy":"1 平時成績：10%（平時出缺席考核與課堂行為觀察）\n2 期中考：40%\n3 期末流體力學相關專題研究報告：50% \n","materials":"A Brief Introduction to Fluid Mechanics (4th Edition, John Wiley &amp; Sons),  Authors: D. F. Young, B. R. Munson, and T. H. Okiishi, W. W. Huebsch;  \nViscous Fluid Flow (3rd Edition, McGraw-Hill), by Frank M. White \n","foreignLanguageTextbooks":false}]
