[{"name":"李文興","email":"f10539@ntut.edu.tw","latestUpdate":"2011-01-17 05:48:02","objective":"本課程主要的內容包括有；生物醫用材料的發展概況及趨勢；生物醫用材料的生物相容性及生物學評價；可降解與吸收材料之機制及調控；組織工程材料與人工器官--軟組織修復與重建；硬組織修復與骨組織工程材料，也就是生物活性陶瓷、金屬植入材料之表面生物活化功能和塗層；口腔材料；控制釋放材料；仿生智能材料；生物醫用材料表面改質等。","schedule":"第一週:introduction, week 2:the structure of solids, week 3:characterization of materials-I, mechanical properties, termal properties, phase diagram, week 4:characterization-II, electrical, optical, X-ray absorption, acoustic, ultrasonic, ets. week 5:metallic implant materials, week 6:ceramic implant materials, week 7:polymeric implant materials,term paper report-I. week 8:composites as biomaterials, term paper report-II,week 9:mid-term test, week 10:structure-property relationships of biological materials, week 11:tissue response to implants, week 12:soft tissue replacement --1 sutures skin, and maxillofacial implants, week 13: soft tissue replacement --II, blood interfacing, implants, week 14, hard tissue replacement -I long bone reapir, week 15: hard tissue replacement -II joints and teeth, week 16:transplants,term paper report-III week 17:tissue engineering materials and regeneration. term paper report-IV, week 18 final examination and report.","scorePolicy":"1.home work:20%\n2.mid-term test:25%\n3.final examination:30%\n4.presence:5%\n5.term paper reports:10%, the title of the paper studying report should be decided in the first 3 weeks.\n6.others performance:10%","materials":"Text Book:\nbiomaterials, An introduction, third edition, Joon Park and R.S. Lakes. Springer.\nReference Books:\n1.Biomaterials, sujata V. Bhat, alpha science international Ltd.\n2.Biomaterials Science, An introduction to materials in mdicine, Buddy Ratner, Allan, Hoffman, Frederick Schoen, Jack Lemons.\n3.生物醫用材料，俞耀庭主編，天津大學出版社。\n4.The science and engineering materials, fourth edition. D.R.askerland and P.P. phule\n5.Inquiry into life, 10 ed.Sylvia S. Mader.\n6.Principle and applications of biomedical enginering, 正中書局\n","foreignLanguageTextbooks":false}]
