[{"name":"葛瑞斐","email":"griffith@ntut.edu.tw","latestUpdate":"2011-02-28 23:30:48","objective":"馬克吐溫筆下，十九世紀的美國佬造訪了亞瑟王的宮廷；一百年後，差不多就是美國總統甘迺迪將白宮稱為「卡美樂」(亞瑟王的皇城)的同時，倫敦和紐約的地鐵車站的塗鴉寫著:「佛羅多萬歲」。時至今日，業界為了增加生產力，選擇在具有中古風味的地方舉辦員工休閒活動兼凝聚向心力，有的派遣員工參加討論如何在職場發揚騎士精神的研討會。為什麼? 就廣義的定義來看，中古世紀就是羅馬帝國衰亡後到十五世紀義大利文藝復興這段時期。我們依據文藝復興時期的觀點，認為那是一段未經啟蒙，缺乏知識，尚未現代化的時期，將它稱為「黑暗時代」。但是，有關這段黑暗時期的故事-亞瑟王和圓桌武士、聖杯、巨龍和公主等-卻一直流傳下來，歷久不衰，經過文藝復興時期，傳到啟蒙時代，甚至一直流傳到後現代主義的今天。透過主流(如好萊塢熱門影片中有關亞瑟王、貝奧武夫、以及托爾金另類中古世界的英雄)和非主流(如報章雜誌出現「聖杯」一詞的頻率和各種引伸用法)的管道，中古世界的意象不斷出現在西方的產品和論述中。本課程將檢視「現代中古」這一個弔詭的現象，探討現代西方如何借用、尊崇、重寫古老的中古世界，讓它在小說、電影、以及線上遊戲的虛擬空間中復活，形成了一種奇特而蓬勃的文\nModern Medievalism [M.A.]\nDr. Griffith\nMark Twain’s nineteenth-century Yankee visited King Arthur’s Court.  About a hundred years later, around the same time the American president was said to be living in Camelot, “Frodo Lives” was being scrawled on subway walls.  To increase productivity, businesses today send employees on medieval retreats and to seminars on chivalry.  Why?  The Middle Ages can be defined broadly as that period from the fall of the Roman Empire to the 15th century Italian Renaissance – a dark time, if one is to believe the men of the Renaissance, in need of light, knowledge, modernization.  Yet the stories of these dark ages – of Arthur and his knights, the Holy Grail, dragons and princesses – have endured beyond the Renaissance and the Enlightenment and even survived Post-Modernism.  In ways major (Hollywood blockbusters devoted to King Arthur, Beowulf, and the heroes of Tolkien’s alternate medieval world) and minor (the frequent and creative use of the phrase “holy grail” in newspapers and popular magazines), images of the medieval world continue to surface in the products and the discourses of Western culture.    This course will examine the paradoxical phenomenon of modern medievalism, looking at the varied ways the modern West has borrowed, revered, and rewritten its medieval past, a culture strangely as vibrant now -- reborn in novels, films, and the game spaces of the internet -- as it was a millennium ago.","schedule":"Week 1:  　　　　Intro\nWeeks 2-6  　　　　Tennyson and the Pre-Raphaelites: 19th century Medievalism\nWeeks 7-11  　　　　Tolkien, Lewis, White:  early 20th century medievalism\nWeeks 12-17　　　　Medievalism in the 21st century","scorePolicy":"Grades\nMidterm　　33.3%\nFinal 33.3%\nClass Work/Weekly Participation 33.3%\nAttendance:   a combination of 4 absences or late days  =  -10 points from course grade","materials":"　","foreignLanguageTextbooks":false}]
