[{"name":"王聰榮","email":"tjwang@ntut.edu.tw","latestUpdate":"2011-01-30 22:23:08","objective":"本課程主要進行「永續建築環境」之相關研究議題探討與分析。於瞬息萬變之環境與極富思維空間之建築研究中並不能全然按理論或法則定律判斷，亦須依實務經驗輔以基礎理論架構予以綜合評估與分析評估。探討之內容包括但不限下面之主題：『永續建築環境規劃設計』、『永續建築環境教育』和『永續能源環境規劃設計』等相關議題間之相互依存性或相關性，藉由國內外之相關案例進行深入探討與分析，期待建立個人對現今永續建築環境之瞭解與認識。The theme of the course is ”Sustainable Architecture”. It aims to provide a forum to examine and discuss solution-oriented methods for implementing sustainable development, and to stimulate more ideas and useful insights regarding architecture development within the context of sustainability. In an effort to explore and map the challenges and opportunities of sustainable development, this course aims to address the various aspects of architecture &amp; urban development in accordance with the principles of sustainability. These themes will address issues but not limit to, architectural design, ecological and social sustainability, economic and environmental sustainability, environmentalism.","schedule":"Week 1: 2010/02/23\n1. 建築是結合藝術與技術的專業, 如何以正確(有效)方法解決建築與環境問題;\n2. 實務建築師或建築研究者要有其論述，論述與理論不同;\n3. 建築師是深綠或淺綠都已被環境倫理所接收;\n4. 課程內容與目標。\nWeek 2: 2010/03/02\n1. 永續發展建構的永續環境永續社會和永續經濟;\n2. 建築的內涵是時間、文化、和社會現象之精神的反思;\n3. 面對永續建築的態度。\nWeek 3: 2010/03/9\n1. 修課同學繳交並報告個人研究興趣的方向或主題(一頁);\n2. 開放討論;\n3. 評論與建議。\nWeek 4: 2010/03/16\n1. 靜態建築和動態的空間與環境, 如何以正確方法解決建築與環境問題;\n2. 台灣建築發展對環境的影響。\nWeek 5: 2010/03/23\n1. 前衛主義是個幌子, 如何落實現代與後現代主義的建築教育;\n2. 永續建築設計教育的後設分析對台灣建築教育影響與啟示;\n3. 客觀和主觀對建築教育和課程的解讀並非完全互斥。\nWeek6: 2010/03/30\n1. 如何利用內心(解構主義)感受空間特質的存在與使用;\n2. 台灣閒置空間或建物再利用對文化與場所精神的衝擊與評估。\nWeek7: 2010/04/06\n專題演講\nWeek 8:2010/04/13\n1. 不願面對的真相思考生態文化的永續建築環境;\n2. 城市永續經營所須具備的環境素養、認知、情意、技能和環境行為\nWeek 9: 2010/04/20\n期中考周\nWeek 10: 2010/04/27\n1. 建築研究法的重要性\n2. 無干擾研究法與層級分析法(AHP)在永續建築研究議題上的使用與案例介紹\nWeek 11: 2010/05/4\n1. 層級分析法(AHP)與模糊層級分析法(FAHP)之應用與比較\n2. AHP與FAHP應用在永續建築與環境研究議題上的操作與案例介紹\nWeek 12: 2010/05/11\n1. 修課同學繳交並報告研究計畫書\n2. 開放討論\n3. 評論與建議\nWeek 13: 2010/05/18\n1. 修課同學繳交並報告研究計畫書\n2. 開放討論\n3. 評論與建議\nWeek 14: 2010/05/25\n1. 修課同學繳交並報告研究計畫書\n2. 開放討論\n3. 評論與建議\nWeek 15: 2010/06/1\n1. 修課同學繳交並報告研究計畫書\n2. 開放討論\n3. 評論與建議\nWeek 16: 2010/06/8\n1. 修課同學繳交並報告研究計畫書\n2. 開放討論\n3. 評論與建議\nWeek 17: 2010/06/15\n專題演講\nWeek 18: 2010/06/22\n期末考周","scorePolicy":"1.各項報告同學互評占50%；老師評分占50%\n2.同學互評與老師評量加總後轉化為平均85分，標準差3分的直線T分數(四捨五入)。\n3.缺席一次扣總分2分，請假或遲到扣1分。所扣分數做為上課參與度高同學之加分","materials":"以上課程大綱暫訂，上課時可以經由討論再加以修改。","foreignLanguageTextbooks":false}]
