[{"name":"鄭瑞清","email":"juiching@ntut.edu.tw","latestUpdate":"2017-09-04 14:26:41","objective":"Engineering problems always involve complicated mathematics. Traditionally, solving mathematical equations requires elaborating process of derivation and induction of formula which require students to spend a long time to learn and master the skills and still not every student can achieve the level of expertise to solve these complicated equations. Moreover, many of these equations are not able to solve analytically. With the advance of computing technologies, an ordinary student, when helped by suitable software, can solve those equations which only gifted students could solve before. Not only that, those equations not solvable analytically can be solved today numerically. The purpose of this course is to train undergraduate students to solve engineering problems by using computers. Students will learn not only the theoretical background of numerical methods but also the popular engineering software MATLAB in this class. The choice of MATLAB instead of programming language like FORTRAN, C, or C++ is because MATLAB not only provides an abundant repertoire of programs for solving all kinds of engineering problems but also is a programming language that students use to create his own programs. This will equip students with a powerful tool no matter for higher study or an engineering career in the future. The contents include the following topics.\n1.　　Introduction to numerical method and MATLAB: give introductory examples, useful background material, identification of some basic issues and an introduction of computation and programming with MATLAB.\n2.　　Roots of Equations: deals with finding the zeros of a nonlinear function of one variable, as well as methods for minimization of such a function.\n3.　　Linear Algebra and Matrices: treat topics from numerical linear algebra. Include solving systems of linear equations, factorization of matrices and matrix inversion.\n4.　　Curve Fitting: deals with finding an equation that fits a set of points by linear least-square and nonlinear regression. Include polynomial regression, multiple linear regression, general linear least-square regression, QR factorization and the backslash operator, and nonlinear regression.\n5.　　Interpolation: include Newton interpolation, Lagrange interpolation and splines.\n6.　　Numerical Integration: give the formula for integrating a function that can not be analytically integrated. Include Newton-Cotes formula, the trapezoidal rule, Simpson’s rule, Romberg integration and Gauss quadrature.\n7.　　Ordinary Differential Equations: many engineering problems are solved in ODE form. This is always the most difficult parts of numerical methods. This chapter gives the technique for solving ODE. Include Euler’s method, Runge-Kutta method, multi-step method. \n8.　　Eigenvalues: gives the technique for finding eigenvalues. Include polynomial method and power method.","schedule":"1.　　Introduction to numerical methods and MATLAB \n2.　　Roots of equations\n3.　　Gauss elimination\n4.　　LU decomposition\n5.　　Matrix inversion and condition\n6.　　Iterative methods for systems of equations\n7.　　Curve fitting of a straight line\n8.　　General linear least-square regression and\n9.　　Nonlinear regression\n10.　　Polynomial interpolation and splines\n11.　　Numerical integration fomulas\n12.　　Numerical integration of functions\n13.　　ODE: Euler's method\n14.　　ODE: Runge-Kutta method\n15.　　ODE: Multi-step methods\n16.　　ODE: adaptive methods\n17.　　Eigenvalues: polynomial method\n18.　　Eigenvalues: power method","scorePolicy":"16 Weekly programming home work: 80%.\nProgramming capability evaluation: 20%.","materials":"Textbook: Chapra, “Applied Numerical Methods with MATLAB for Engineers and Scientists, 3nd Edition.”, McGraw-Hill.","foreignLanguageTextbooks":true}]
