[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2017-05-23 14:48:06","objective":"「研究成果具有足以影響意見和行動的力量，因此有責任感的作者會以謹慎細心的態度撰寫之」。(MLA Handbook for the Writers of Research Papers, xiv).\n本課程以人文學科領域通用的MLA系統為基礎，加強學生對論文撰寫規範的認識，並經由研究過程的實踐和論文的撰寫體認學術研究的目的及價值。課程開始時學生須選擇一較為廣泛的主題，學習如何抽絲剝繭，找出核心的問題，進一步釐清研究的重點所在，然後經過仔細研究搜尋，最後以論文報告呈現成果。透過此一過程，學生將體認到學術研究有嚴謹明確的規範，需經過一步一步的印證，方能寫出合乎專業水準的研究論文或報告。","schedule":"COURSE SCHEDULE\n\n September 17　　Introduction  ASSIGNMENT:  LOCATE AT LEAST ONE SOURCE (EITHER A BOOK, A COMPLETE PDF FILE FROM COMPUTER. OR A JOURNAL ARTICLE.  Make sure you include all the information you will need to make a standard MLA reference.  Visit library.  Locate and begin to read source(s); in journal detail your efforts.)\n\nSeptember 24　　QUOTATION, SUMMARY AND PARAPHRASE.  In Journal write a sketch of your proposed project.  Prepare brief summary of source + bibliography\n\nOctober 1　　 ANALYSIS.  Bring to class a bibliography of possible primary and secondary sources.  In Journal weigh possible critical approaches \n\nOctober 8 　　 CLOSE READING  Bring 1-2 pages of text for us to consider in class.  In Journal try to image at least three critical approaches in relationship to your primary source text.\n\nOctober 15　　REFLECTION In journal write reflection.\n\nOctober 22　　RESPONSE  In journal write response.  In Journal meditate on differences between critical and/or writerly (or praxis-oriented) approaches\n\nOctober 29　　PRESENTATIONS\n\nNovember 5　　PRESENTATIONS.   MIDTERM ASSIGNMENT (three-five pages containing examples of quotation, paraphrase and summary employing standard MLA format) \n\nNovember 21　　  EXAMPLE PROJECT:  Read Ballard’s  The Atrocity Exhibition.  In Journal write response\n\nNovember 28　　Ballard and Media.  Read Cline essay and summarize/analyze in journal.\n \nDecember 5　　FILM:  The Atrocity Exhibition  Prepare short critical paper.\n　　　　\nDecember 12 Science, Media and Technology.  Preparation for group presentations and final project.  In Journal consider possible parallels between our example project and your own semester project.\n\nDecember 19　　Workshop\n\nDecember 26　　Workshop + prepare for presentation\n\nJanuary 2　　Workshop + prepare for presentation\n\nJanuary 9　　Presentations.  DRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE","scorePolicy":"Grading:\n¼ Class Participation\n¼ Homework\n¼ Shorter Papers\n¼ Final Paper","materials":"Texts:\n\nMLA Handbook\nPrimary/Secondary Source Materials of Your Own Choosing\nClass Handout","foreignLanguageTextbooks":true}]
