[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2017-05-23 14:50:14","objective":"本課程旨在提昇學生撰寫結構完整段落和短文之能力, 並著重如何重寫、摘要、 轉述、 陳述、筆記、編排、起草、修改等相關技巧。","schedule":"COURSE SCHEDULE\n\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nSeptember 13　　Introduction  ASSIGNMENT:  Journal Entry (JE) #1\n\nSeptember 20　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #2\n\nSeptember 27　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #3\n\nOctober 4　　 　　Workshop Discussion.  ASSIGNMENT:  Journal Entry/Revision (JE) #4\n\nOctober 11　　Live Reading/Critique.   ASSIGNMENT:  Journal Entry (JE) #5\n\nOctober 18　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #6\n\nOctober 25　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #7\n\nNovember 1　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #8/Plan for Final\n\nNovember 8　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #9\n\nNovember 15　　Individual Conferenes  \n\nNovember 22　　Individual Confrences\n \nNovember 29　　Individual Conferences  ASSIGNMENT:  Journal Entry (JE) #10\n　　　　\nDecember 6　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #11\n\nDecember 13　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #12\n\nDecember 20　　Individual/Collaborative Live Readings\n\nDecember 27　　Individual/Collaborative Live Readings\n\nJanuary 3　　　　Individual/Collaborative Live Readings\n\nJanuary 10　　　　BOOK PARTY + OPEN READING","scorePolicy":"GRADING\n\n25%　　Journal Entries　　　　　　25%　　Open Mic and In-Class Readings\n25%　　Final Work　　　　　　　　25%　　Participation in Class Discussions","materials":"This is a chance to explore and think about writing qua writing.  The purpose to write something suggested by the source texts, which can be responded to on a formal or thematic or associative level.  Of course anything quoted from a source text must be placed in quotation marks, and anything inspired by another work  should show obeisance to that original source, .  In some way, the opriginal source must be honored.  In the case of a formal college-level essay this will involve application of the MLA system.  With a creative work maybe it would be more appropriate to mention the source text by name on in another way to acknowledge its authorship.   It is my hope that this class might erase, however temporarily, writing as a set of unquestioning and unquestionable rules.  There are conventions of course, of grammar, syntax and clarity, although these vary slightly from genre to genre.  It is also possible that “mistakes” may be our friends as we witness the meaning of writing forming itself before our very eyes.  Our mode should be one of inquiry, not imputation, and this inquiry should carry as well back into their writing process.  Rather than directly analyzing primary, original source texts we will use them as jumping off points for further writing.  Students are then encouraged to enter into dialogue with the great writers and thinkers of all time, not as master to pupil, but as writer to writer, human being to human being.","foreignLanguageTextbooks":true}]
