[{"name":"林彥良","email":"ericlin@ntut.edu.tw","latestUpdate":"2017-05-28 00:23:38","objective":"This course offers an introduction to corpus linguistics, including the corpus analytical tools, techniques, corpus design and construction, and methodologies for doing corpus-based studies. We will also discuss its applications in English language teaching and learning. Major topics include vocabulary teaching and learning, analysis of chunks, teaching materials analysis, interlanguage analysis, discourse analysis, and computer-assisted language learning. Students are expected to learn to collect corpora data, create a small corpus, run and analyze corpora data according to different research topics.","schedule":"A detailed syllabus will be distributed on the first day of class.\nW1. Course orientation; Introduction to corpus linguistics\nW2. Applications of corpora in language learning &amp; research\nW3. Building a corpus: What are the key considerations? \nW4. Corpus analytical tools: Wordsmith, AntConc, Wmatrix\nW5. Holiday\nW6. Corpora and vocabulary: the analysis of chunks \nW7. Corpora and grammar: lexis and patterns; Spoken grammar\nW8. Listenership and response; Relational language\nW9. Academic and business corpora\nW10. Exploring teacher corpora; What can a corpus tell us about language teaching\nW11. Multi-modal corpora: Language and gestures \nW12. Corpora and discourse analysis \nW13. Mini-conference: Project Proposal Presentation\nW14. Learner corpus research\nW15. Corpora and ESP – with guest speakers\nW16. Holiday\nW17. Computer assisted language learning \nW18. Final presentation","scorePolicy":"Participation &amp; Selected Paper Discussion: 30%\nResearch Presentation: 30%\nFinal paper (project): 40%","materials":"1. Okeeffe, A., McCarthy, M. &amp; Carter, R. (2007). From Corpus to Classroom. Cambridge, Cambridge University Press.\n2. Handouts and journal articles (SSCI): Applied Linguistics, International Journal of Corpus Linguistics, TESOL Quarterly, System, ReCALL, etc.","foreignLanguageTextbooks":true}]
