[{"name":"吳可久","email":"kochiuwu@ntut.edu.tw","latestUpdate":"2017-06-01 13:28:44","objective":"課程包含三大領域之說明：「智慧化概念」以設計智慧化環境為始，探討感知及未來性空間設計之互動關係為基礎；「智慧材料與技術」說明空間與技術模組之衍伸歷程，從智慧牆之功能性探討到三維技術性在建築應用之各類挑戰成果；「智慧設計與應用」探討誘導式住宅之介面與自然學習的智慧演化關係，配合案例介紹探討未來性之空間設計應用。","schedule":"1.　　簡介\n2.　　科技發展與哲學\n3.　　智慧空間研究方法\n4.　　台灣智慧空間產業發展與政策\n5.　　智慧空間與互動技術之需求\n6.　　適用於空間之互動感知技術\n7.　　虛擬與實境\n8.　　智慧介面\n9.　　期中\n10.　　資訊控制與介面\n11.　　資訊流與資訊尋求\n12.　　應用方向-物業管理\n13.　　應用方向-3D實境\n14.　　應用方向-節能 \n15.　　應用方向-自動化\n16.　　應用方向-通用設計\n17.　　應用方向-數位學習 \n18.　　期末","scorePolicy":"期中 期末報告\n課堂資料閱讀","materials":"1.　　簡介\n\nLearning in an Ambient Intelligent World: Enabling Technologies and Practices \nXiang Li; Ling Feng; Lizhu Zhou; Yuanchun Shi; \nKnowledge and Data Engineering, IEEE Transactions on \nVolume: 21 , Issue: 6 \nDigital Object Identifier: 10.1109/TKDE.2008.143 \nPublication Year: 2009 , Page(s): 910 - 924 \n\n\n2.　　科技發展與哲學\n\nThe Information Society and Its Philosophy: Introduction to the Special Issue on “The Philosophy of Information, Its Nature, and Future Developments”  \nAuthor: Luciano Floridi \nThe Information Society, Volume 25, Issue 3 May 2009 , pages 153 - 158\n\nThe philosophy of information as an underlying and unifying theory of information science\nTomic, T.  \nUppsala University, Department of ALM, Box 625, 751 26 Uppsala, Sweden\nInformation Research \nVolume 15, Issue 4, December 2010\n\nThe Rationale for a Teaching Innovation About the Interrelationship Between Science and Technology\nR. Hadjilouca ? C. P. Constantinou ? N. Papadouris\nSpringer Science+Business Media B.V. 2011\n\nThe interaction effect of strategic orientations on new product performance in the high-tech industry: A nonlinear model \nChou, C., Yang, K.-P.  2011 Technological Forecasting and Social Change 78 (1), pp. 63-74   \n\nPlaying life and living play: How hybrid reality games reframe space, play, and the ordinary\nDe Souza E Silva, A.a b , Sutko, D.M.a  \na  North Carolina State University\nb  North Carolina State University, 201 Winston Hall, CB 8104, Raleigh, NC 27695-8104, United States\nCritical Studies in Media Communication \nVolume 25, Issue 5, December 2008, Pages 447-465   \n\n3.　　智慧空間研究方法\nHuman-centered computing: Defining a research agenda\nSears, A.a c , Lazar, J.b , Ozok, A.a , Meiselwitz, G.b  \na  Information Systems Department, UMBC\nb  Department of Computer and Information Sciences, Towson University\nc  Information Systems Department, UMBC, 1000 Hilltop Circle, Baltimore, MD 21250\nInternational Journal of Human-Computer Interaction \nVolume 24, Issue 1, January 2008, Pages 2-16\nThe role of technology in intelligence practice: Linking the developer and the user perspectives \n\nHide abstract  Resnyansky, L.  2010 Prometheus 28 (4), pp. 361-374  0  \n\nAction Research as a Proactive Research Method for Construction Engineering and Management\nJ. Constr. Engrg. and Mgmt. Volume 136, Issue 1, pp. 87-98 (January 2010)\n\nComparing picture and video prompting in autonomous indoor wayfinding for individuals with cognitive impairments\nChang, Y.-J., Wang, T.-Y.  \nInstitute of Health and Welfare Policy, National Yang Ming University, Taipei 112, Taiwan\nPersonal and Ubiquitous Computing \nVolume 14, Issue 8, December 2010, Pages 737-747\n\nIntegrating Statistics and Visualization for Exploratory Power: From Long-Term Case Studies to Design Guidelines \nPerer, A.; Shneiderman, B.; \nComputer Graphics and Applications, IEEE \nVolume: 29 , Issue: 3 \nDigital Object Identifier: 10.1109/MCG.2009.44 \nPublication Year: 2009 , Page(s): 39 - 51 \n\n\nA Visual Analytics Approach to Understanding Spatiotemporal Hotspots \nMaciejewski, R.; Rudolph, S.; Hafen, R.; Abusalah, A.; Yakout, M.; Ouzzani, M.; Cleveland, W.S.; Grannis, S.J.; Ebert, D.S.; \nVisualization and Computer Graphics, IEEE Transactions on \nVolume: 16 , Issue: 2 \nDigital Object Identifier: 10.1109/TVCG.2009.100 \nPublication Year: 2010 , Page(s): 205 - 220 \n\n\n4.　　台灣智慧空間產業發展與政策\n\n\n5.　　智慧空間與互動技術之需求\nThe changing face of human-computer interaction in the age of ubiquitous computing\nRogers, Y.  \nPervasive Interaction Lab., Open University, Milton Keynes, MK7 6AA, United Kingdom\nLecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) \nVolume 5889 LNCS, 2009, Pages 1-19\n\nIdentity, profiling algorithms and a world of ambient intelligence\nde Vries, K.  \nCenter for Law,","foreignLanguageTextbooks":false},{"name":"黃志弘","email":"huangch@ntut.edu.tw","latestUpdate":"2017-06-13 20:16:16","objective":"1.授課大綱： \n智慧化空間設計與產品設計除產品方案之創意議題外，影響產品價值最鉅者莫過於專利權之保護。本課程之目的即在於動手實作開發智慧化居住產品，探討其智慧居住產品思考開發程序內容，以培養學生專利產品開發設計能力。\n2. 授課內容： \n由基本問題診斷中，分析各項產品議題、技術原理及其創意重點，先前技術分析；進而指導實證操作、技術實驗、及效能驗證，並撰寫專利申請書。\n3. 作業練習： \n本學期藉由檢測與實驗操作、改善方案設計、報告撰寫 present、專利產品開發，特別著重研討式論辯，訓練學術思辯及技術應用能力，以利學生認識健康指標及產品設計應用之整體關聯性，進而建立其專利產品設計能力。\n期末之前學生必須進行2次專題簡報；或提送2件以上專利作品申請。","schedule":"　","scorePolicy":"進行2次專題簡報；\n或提送2件以上專利作品申請。","materials":"Advanced Technology for Smart Buildings, by James Sinopoli;\nSmart Buildings Systems for Architects, Owners and Builders, by James M Sinopoli;\n「物聯網發展趨勢展示內容」研究報告, 研究單位：國立臺灣科技大學, 周碩彥教授","foreignLanguageTextbooks":true}]
