[{"name":"楊欣哲","email":"sjyang@csim.scu.edu.tw","latestUpdate":"2017-10-07 09:23:00","objective":"雲端運算(Cloud Computing)是指透過網際網路進行擴充、消費或提供IT服務，因而顧客可隨時取用Web化的網路資源、軟體或資料之新模式，它是新一代的網際網路服務以及新一代的資料中心。總之，雲端運算不是一項全新技術，而是一項應用與服務創新的概念，「簡單的說，就是把所有的軟體或資料全部丟到網際網路上處理(Service on the Internet)」本課程的主要內容包含網路與TCP/IP基礎、雲端運算基本概念、雲端運算的核心技術、雲端運算的服務與管理策略、雲端化移轉之方法與策略、雲端化系統之設計、雲端多租戶控制之IAM設計、雲端運算的安全/私密/信任管理議題、巨量資料分析與應用。此外，本課程亦選擇一些有關雲端運算的期刊論文指定予同學研讀並於課堂上簡報和討論之。\n\nCloud Computing is a new model for enabling convenient, on-demand network access to a shared pool of configurable computing resources that can be rapidly provisioned and released with minimal management effort or service provider interaction on Internet. Practically, Cloud Computing is new frontier of Internet Computing and next generation Data Centers. Also, there are three main service models: IaaS, PaaS and SaaS, and two new and key applications: IoT and Big data in Cloud Computing. This course covers Networking and TCP/IP Basics; Cloud Computing: An Overview; Core Technologies of Cloud Computing; Service and Management Strategies in Cloud Computing; Methodologies and Strategies for Cloud Migration; Designing Cloud-based System Solutions; IAM (Identity and Access Management) Designs for Cloud Multi-tenancy; Security Issues and Risk Management in Cloud Computing;  Big Data Analytics and Applications. In addition, the class will select and assign some Journal papers in related Cloud Computing and its application topics for on-class presentation and discussion.","schedule":"1. Networking and TCP/IP Basics 　　　　　　　　 (2 Weeks)\n2. Cloud Computing: An Overview　　　　　　　　 (1 Week)\n3. Core Technologies in Cloud Computing　　　　　　 (2 Weeks)\n4. Service and Management Strategies in Cloud Computing　　 　　 (2 Weeks) \n5. Methodologies and Strategies for Cloud Migration　　　　 (1 Week)\n6. Designing Cloud-based System Solutions　　　　　　 (1 Week)\n7. IAM Designs for Cloud Multi-tenancy　　　　　　 (1 Week)\n8. Security Issues and Risk Management in Cloud Computing 　　                    (2 Weeks)\n9. Big Data Analytics and Applications　　　　　　 (1 Week)\n10. Panel Seminars for Related Cloud Computing Journal Papers　　 (3 Weeks)","scorePolicy":"- Mid-term Exam. : 　　30%　　　　　　\n- Presentation &amp; Report:　　40% (Including class performance).\n- Final Exam. : 30%","materials":"- 自編上課講義- 2017版 (\"Applications and Services of Cloud Computing\" PP Slide -2017)\n-References:\n(1) Amir Gandomi and Murtaza Haider, “Beyond the Hype: Big Data Concepts, Methods, and Analytics”, International Journal of Information Management, Vol. 35, January 2015, pp. 137-144. \n(2) Dan Griffin and Tom Jones, “Designing a Cloud-Based Mobile Application for Compliance”, Microsoft MVP, October 31, 2013.\n(3) Rashmi, Shabana Mehfuz and G. Sahoo, “A Five-Phased Approach for the Cloud Migration”, International Journal of Emerging Technology and Advanced Engineering, Vol. 2, No. 4, pp. 286-291, April 2012.\n(4) Shin-Jer Yang, \"Using SLA Strategy to Design an SOC Platform in Data Center on the Cloud Computing\", Journal of Internet Technology, Taipei, Vol. 14, No. 5, pp. 751-758, September 2013.  【SCI】\n(5) IBM Company, “Path to Designing a Cloud-based, Always-on system: An Architecture for the Cloud Enabled Data Center”, 2014.\n(6) Flavio Frattini, Kishor S. Trivedi, Francesco Longo, Stefano Russo and Rahul Ghosh, \"Scalable Analytics for IaaS Cloud Availability,\" IEEE Transactions on Cloud Computing, Vol. 2, No. 1, pp. 57-70, March 2014. 【SCI】\n(7) M. Rak, A. Cuomo, Umberto Villano, and G. Aversano, “Prediction of Cost and Performance of Cloud Applications”, International Journal of Cloud Computing, InderScience Publishers, Vol. 3, No. 4, August 2014.\n(8) McKinsey &amp; Company, “Big Data: The Next Frontier for Innovation, Competition, and Productivity”, June 2015. \n(9) Syed A. Ahson and Mohammad ILyas (2015), “Cloud Computing and Software Services”, CRC Press, U. S. A.\n(10) Kris Jamsa (2013), “Cloud Computing”, Jones &amp; Bartlett Learning Inc., U. S. A.\n(11) W. Stallings and T. Case (7th Ed., 2013), \"Business Data Communications\", Pearson Prentice Hall Inc., U.S.A.\n(12) K. C. Laudon and J. P. Laudon (11th Ed., 2015),”Essentials of Management Information Systems,” Pearson Prentice-Hall Inc., NJ U.S.A.\n(13) IEEE Transactions on Cloud Computing, IEEE Computer Society\n(14) IEEE Internet Computing, IEEE Computer Society","foreignLanguageTextbooks":true}]
