[{"name":"呂怜樺","email":"lhlu@ntut.edu.tw","latestUpdate":"2017-06-08 10:47:14","objective":"The goal of this course is to survey the major theoretical perspectives in organizational theory (OT). More specifically, we introduce the foundation questions of the strategy filed and focus on the strategy ‘content” research in this class. The major purpose of this class is to expose students to samples of the contemporary strategy content research and to point out some access points to the broader universe of thought on each topics. In other words, we will start from the fundamentals in order to have a solid understanding of the theoretical approach. This elaboration will be followed by more in-depth exploration of the empirical articles assigned for each week, and how this contribute to organization theory. Finally, we will move on to assessment and critique of theoretical view. One or two students will be assigned to lead each week’s discussion.","schedule":"COURSE SCHEDULE AND READINGS\nPapers can be downloaded from the E-library on EBSCOhost database. Read and well-prepare for No.1 article in each session is necessary before our class. Moreover, all the students have to read the assigned article and one or two students will lead us to review the paper and I will assign one or two students to share with his/her personal opinions in our class at the end of our terms. \n\nWeek 1 : Introduction the perspective of Organization Theory\n\nWeek 2 Session 1: Introduction: Research Design and Approaches of Strategic management\n1.　　Nag, R. Hambrick, D. Chen, M.J. 2007. What is strategic management, really? Inductive\nderivation of a consensus definition of the field. Strategic Management Journal. 28(9):935-955.\n2.　　Sutton, R. I. and B. M. Staw. 1995. What theory is not? Administrative Science Quarterly 40(3): 371-384.\n3.　　Weick, K. E. 1995. What theory is not, theorizing is. Administrative Science Quarterly 40(3): 385-390.\n4.　　DiMaggio, P. J. 1995. Comments on ‘What theory is not’. Administrative Science Quarterly 40(3): 391-397.\n5.　　Suddaby, Roy. 2006. From the editors: What grounded theory is not. Academy of Management Journal 49(4): 633-642.\n6.　　Shah, Sonali K. and Corley, Kevin G. 2006. Building better theory by bridging the quantitative-qualitative divide. Journal of Management Studies 43(8): 1821-1835.\n\nWeek 3 Session 2 : Industry and competitive strategy \n1.　　Rumelt, R., Schendel, D. and Teece, D. 1991, “Strategic Management and Economics,\" Strategic Management Journal, Winter Special Issue: Fundamental Issues in Strategy.\n2.　　Porter, M., 1981, \"The Contributions of Industrial Organization to Strategic \n3.　　Management”. Academy of Management Review, 6(4): 609-620. \n4.　　Rumelt, D. 1991, “How Much Does Industry Matter?” Strategic Management Journal, 12: 167-185.\n5.　　Ruefli, T., Wiggins, R. 2003, \"Industry, Corporate, and Segment effects and Business Performance: A non-parametric approach. Strategic Management Journal. 24(9): p. 861.\n\nWeek 4 Session 3: The Internalization Theory and the Scope of the Firm\n*Transaction Cost Economics\n1.　　Coase, R. 1937, “The Nature of the Firm,” Economica.”\n2.　　Williamson, O. 1991. “Comparative Economic Organization: The Analysis of Discrete\nStructural Analysis”, Administrative Science Quarterly, pp. 269-291\n3.　　Williamson, O. 1975, Markets and Hierarchy, Free Press.\n4.　　D’Aveni, R. and Ravenscraft, D. 1994, “Economies of Integration versus Bureaucratic Costs: Does Vertical Integration Improve Performance,” Academy of Management Journal, 1167-1206.\n5.　　Williamson, O. 1979. “Transaction-Cost Economics: The Governance of Contractual Relations”, Journal of Law and Economics, 22, pp. 233-261.\nWeek 5 Session 4: Firm as a System of Incentives\n*Agency Theory\n1.　　Jensen, M. and Meckling, W. 1976. Theory of the Firm: Managerial Behavior, Agency Cost, and Ownership Structure, Journal of Financial Economics, 3: 305-360.\n2.　　Eisenhardt, K. M. 1989. Agency Theory: An Assessment and Review. Academy of\nManagement Review, 14(1): 57-74.\n3.　　Jacobides, M.G. &amp; Croson, D. C. 2001. Information policy: shaping the value of agency relationships. Academy of Management Review, 26(2): 202-223.\n4.　　Grossman, S., and Hart, O. 1986, The Costs and Benefits of Ownership: A Theory of Vertical and Lateral Integration, Journal of Political Economy, 94(4): 691.\nWeek 6 Session 5: Strategic Assets and Resources within a firm\n*Resource-Based View (RBV)\n1.　　Barney, J. 1991. Firm Resources and Sustained Competitive Advantage. Journal of\nManagement, 17: 99-120.\n2.　　Ethiraj, S. Kale, P., Krishnan, M., Singh J., 2005. \"Where Do Capabilities Come From and How Do They Matter? A Study in the Software Services Industry”, Strategic Management Journal. \n3.　　C.K. Prahalad and Gary Hamel, 1990, “The Core Competence of the Corporation,” Harvard Business Review, 79-91.\n4.　　Lado, Augustine A., Boyd, Nancy G., Wright, Peter, and Kroll, Mark. 2006. Paradox and\ntheorizing within the resou","scorePolicy":"Leading Discussion (30% of grade)-- While I will provide some guidance, clarification, and summary, much of the course involves engaging in discussions about session topics. Each participant will be asked to lead discussion once or twice throughout the class, depending upon the number of participants. Your presentation of the materials and facilitation of class discussion should be in a PowerPoint file and it constitutes 20% of your final grade. After your presentation, please upload your PowerPoint file to the course TA, and this material will be shared to the students in our class. \n\nLeading a week’s discussion entails providing the class with a short overview (30-40 minutes) of the main theoretical ideas (constructs, concepts, mechanisms) as well as issues (strengths, weaknesses, and controversies) and leading a discussion of the readings based upon your own agenda. We will then have a general discussion based on questions posed by the participants. The students leading the discussion should familiarize themselves with the required readings for that week. Your job is to come to class prepared to answer: What are the central research questions raised by the authors? What core concepts, evidence, and research methods are utilized? As you do the readings and prepare for the presentation, think about what the author did properly as well as improperly. What are the interesting ideas in the paper? If you disagree with an argument, what would it require to persuade you? Can these differences be adjudicated through further empirical study? A good discussion should have active dialog and debate. If someone proposes an idea that is contrary to your view and explanation, think about constructive ways to reconcile the differences. Your task is to engage one another in an assessment and deep understanding of the readings. You are also welcomed to consult me to develop the presentations and questions that will guide and structure each week's class. I will also (sometimes) be intentionally provocative to facilitate ideas and conversation. Before the end of each session, I will use around 20-25 minutes to sum up the main points of the week’s topic and bring out the issues that are overlooked. \n\nClass Preparation and Participation (30% of grade)-- All participants should arrive at class with questions, topics, and issues to be vetted and debated. Class participation involves your active, thoughtful participation throughout the term. Preparation will involve reading all the weekly assignments. In addition, participants will prepare a short memo (preferably one to two pages) relating to the weekly required readings. Formats may vary but it is useful to include:\n\n1) Ideas, concepts, arguments that you find stimulating, worth remembering and building on.\n2) Connections, linkages, contradictions between one idea or approach and another.\n3) Questions, concerns, disagreements with ideas encountered.\n\nMemos are to be created in MS Word and are due by 12 noon one day before class (12 noon, Tuesday). Send the whole memo to me and the questions (item 3) to the students who are in charge of leading the discussion via email. 30% of the course grade is based on class preparation and participation.\n\nWhen you are the leader(s), please compile the questions and post them (in one Word document) to the TA or me before class, so that all of us and think about the questions in advance. If it is your term to lead the discussion, there is no need to submit the memo.\n\nFinal Presentation (40% of grade)","materials":"參考書籍: 組織理論與管理, 溫金豐著","foreignLanguageTextbooks":true}]
