[{"name":"張素薰","email":"shchang@ntut.edu.tw","latestUpdate":"2017-08-31 19:01:46","objective":"本課程利用新聞教材加強英語字彙能力及聽力技巧, 　　內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時, 學生亦可獲得各種有用的聽力技巧以加強英語聽力。","schedule":"Journalistic English &amp; Listening Training\nIntroduction:\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \nBasic Doctrines:\n1.　　Expose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\n2.　　The films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\n3.　　Language capability and performance are equally stressed and developed.\n4.　　Students’ active participation is essentially required.\n5.　　Individual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\n\n\n\nAssessment:\n1.　　Weekly tests and Attendance (20 points maximum deduction). 80%\n2.　　Oral reports and presentations. 20%\n3.　　Teacher’s website: http://www.cc.ntut.edu.tw/~shchang/2017/\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSyllabus for 4E1 Multimedia English Listening and Speaking, \n2017(1)一零六學年度第一學期\nWeek　　Classification 　　English News　　Friends (S1)\n1　　Introduction\n2　　Health　　1.　　Taipei health inspectors find \npreservatives in jellies sold in popular summer drinks (2017/06/12)　　1\n3　　　　2. Taiwan set to lose WHA observer status for first time since 2009 with invitation yet to arrive (2017/05/09)　　2\n4　　Technology　　3. Worldwide Fidget Spinner Craze Reaches Taiwan (2017/05/04)　　3\n5　　　　4. President Tsai visits Tainan reservoir to promote infrastructure project (2017/06/09)　　Stage Play\n6　　Business　　5. Chinese women flock to Taiwan to have their eggs frozen (2017/06/05)　　4\n7　　　　6. Competitive online gaming, robotics and VR take center stage at this year’s Computex Taipei (2017/05/30)　　5\n8　　Life　　7. Antisocial parking of oBikes treated differently in New Taipei and Taipei City (2017/07/10)　　6\n9　　　　Mid-term\n10　　　　8. American genetically modified potatoes are said to produce lesser amounts of carcinogens (2017/06/19)　　7\n11　　Society　　9. Legal changes aim to curb Chinese real estate speculation (2017/07/10)　　8\n12　　　　10. Universiade torch given to Taipei representatives Ko Wen-je and Chu Mu-yen (2017/06/21)　　9\n13　　Environment　　11. Asia Cement under growing pressure over expanded open pit mines in Taroko (2017/06/12) 　　Demonstration\n14　　　　12. NTU study suggests cancer-causing pollutants from Sixth Naphtha Cracker spreading to Changhua (2017/04/27)　　10\n15　　Traffic　　13. Taoyuan Mayor claims Airport MRT will break even in two years (2017/06/06)　　11\n16　　　　14. Suhua highway resumes intermittent one-lane traffic, with interval service starting June (2017/05/31)　　12\n17　　　　Powerpoint Presentation\n18　　Final Report\nEvaluation:\n1.　　Weekly Tests and appearance, one absence being reduced two points. 80%\n2.　　Presentations and Reports. 20%\n\nThe way to get into contact with the teacher:\n1.　　Teacher’s website: http://www.cc.ntut.edu.tw/~shchang/2017/\n2.　　Teacher’s e-mail: shchang@ntut.edu.tw","scorePolicy":"Evaluation:\n1.　　Weekly Tests and appearance, one absence being reduced two points. 80%\n2.　　Presentations and Reports. 20%","materials":"　","foreignLanguageTextbooks":false}]
