[{"name":"徐燕興","email":"HSU.YENHSING@GMAIL.COM","latestUpdate":"2017-09-11 15:35:40","objective":"本課程要從西方都市設計理論談起，到台灣本地實踐。希望拉出都市設計如何想像和實踐，及其歐美與亞洲不同的都市設計內涵。並更進一步討論在後全球化、後工業化與市民社會下，21世紀都市設計新嘗試與可能性。","schedule":"(試修課背景調整)","scorePolicy":"上課參與20%\n案例作業:50%\n心得報告:30%","materials":"美國脈絡下的都市設計觀:\n1.　　Barnett, J.（1974）Urban design as public policies: practical methods for improving cities. New York: Architectural Record Books (必讀)(有中譯本)(ch1,ch2)\n2.　　Jacobs, J.（1961）The life and death of great American cities. Random House (必讀)(有中譯本)(ch1,ch2,ch3)(進階版可以再看Zukin, Sharon(2012)Naked city: the death and life of authentic urban places(有中譯本))\n3.　　謝慶達譯，1987/11，都市設計概論， An Introduction to Urban Design，喬納森‧巴奈特，創興出版社。\n4.　　Christopher Alexander (1987), 黃瑞茂譯, 新的都市設計理論,六合出版社，NY: Oxford University Press\n5.　　Lynch, Kevin. (1986)，《都市意像》（The Image of the City）（宋伯欽譯），台北：台隆書店。（原書出版於1960年）\n6.　　Trancik, Roger. (1989). 《找尋失落的空間︰都市設計理論》（Finding Lost Space: Theories of Urban Design）（謝慶達譯），台北︰創興\n7.　　Lozano, Eduardo E. 1990. Community Design and the Culture of Cities, Cambridge: Cambridge University Press. [Chapter 2: Tradition in Community Design(社區設計與文化治理)\n8.　　Lang, Jon. 1994, Urban Design: The American Experience, N.Y.: Van Nostrand Reinhold Company. [Introduction] (都市設計)\n9.　　Alexander, Christopher, and Artemis Anninou, Hansjoachim Neis. 1987. A New Theory of Urban Design. New York: Oxford University Press. (人文主義回應美國都市設計經驗)\n10.　　Fitch, James Marston. 1998. Historical Preservation –Curatorial Management of the Built World, Charlottesville and London: University Press of Virginia. (歷史保存)\n\n歐陸脈絡下都市設計觀:\n1.　　Peter Hall，2009〈明日之城: 一部關於20世紀城市規劃與設計的思想史〉，童明譯，同濟大學出版社(ch1;ch6;ch7)(必讀)\n2.　　Francois Chaslin (2001), 林宜宣譯, 庫哈斯談庫哈斯: 兩場對話及其他, 田園出版社(ch1)(必讀)\n3.　　Morris, A.E.J.(1994)History of Urban Form: Before the Industrial Revolution. New York: Longman Scientific &amp; Technical.(都市形式與工業化前的歐陸都市設計)\n4.　　Kostof, Spiro. 1991. The City Shaped: Urban Patterns and Meanings Through History. Boston, Toronto, London: A Bulfinch Press Book. [Introduction] (看城市的比較)\n5.　　劉易士‧孟福，1994，＜歷史中的城市－起源、演變與展望＞，宋竣嶺、倪文彥譯，建築與文化出版社(人文主義者的都市與區域主義)\n6.　　大衛•哈維（David Harvey），2007，＜巴黎，現代性之都＞，黃煜文譯，群學出版有限公司(現代性與歐洲都市設計)\n\n\n後現代、都市主義與都市設計:\n1.　　Heynen,Hilde(1999) Architecture and Modernity. A Critique: MIT Press，高政軒翻譯建築與現代性》，台灣現代建築學會與國立臺灣博物館出版，2013(ch4)(必讀)\n2.　　Calvino, Italo. (1993)，《看不見的城市》（Invisible Cities）（王志弘譯），台北：時報。（原書出版於1972年）\n3.　　朱天心，（1997），〈古都〉，收於《古都》（頁151-233），台北：麥田。\n4.　　Ellin, Nan（1996）Postmodern Urbanism. Oxford and Cambridge: Blackwell\n5.　　Broadbent, Geoffrey,( 1990)”Chapter 8: Neo-Rationalists,’ from Emerging Concepts in Urban Space Design, New York: Van Nostrand Reinhold.\n\n\n新都市主義之後(後人文主義)都市主義與替代性都市設計與都市更新浮現\n1.　　Glaeser, Edward.(2011)Triumph of the City: How our Greatest Invention Makes Us Richer, Smarter, Greener, Healthier, and Happier. Penguie Group: USA (Ch1;Ch7;Conclusion)\n2.　　Montgomery, Charles. (2013) Happt City: Transforming our Lives tgrough Urban Design. Farrar, Straus and Giroux.:US\n3.　　Beatley, Timothy.(2014) Blue Urbanism: Exploring Connections between Cities and Oceans, Island Press: Washington DC\n4.　　台北市都市更新處，2013，《都市再生的20個故事》，主編:林盛豐，臺北市都市更新處\n\n消失的知識對於21世紀都市設計與都市更新知識的補遺\n1.　　Pocock, J. G. A. (1985) Virtue, Commerce, and History: Essays on Political Thought and History; Chiefly in the Eighteenth Century. Cambridge University Press.(有中文版)\n2.　　伍頓．戴維 編（Wooden, David)，2014，《共和主義、自由與商業社會：1649-1776》，台北：盛文沁，左敏譯：人民出版社。\n3.　　Lemke, Thomas. 2011. Foucault, Governmentality, and Critique. Paradigm:\n\n東亞現代性移植下的都市設計\n1.　　蘇碩斌（2005）〈看不見與看得見的台北〉：左岸文化事業有限公司社(ch2)(必讀)\n2.　　公視 / 城市遠見系列 \n3.　　王惠君譯 (西村幸夫原著) (1997)，故","foreignLanguageTextbooks":true}]
