[{"name":"陳建文","email":"a868@ntut.edu.tw","latestUpdate":"2017-06-04 23:18:47","objective":"透過一系列的資料採集、參考與互動，包含經驗分享、影片欣賞等，帶領修課同學探索創新（Innovation）、創業（Startup）以及最重要的 – 創業家創新精神（Entrepreneur Innovative Thinking）之本質。無論是工作上的創造，學習上的創造，或者是(創)事業上的創造，都必然需要一定程度的創新，才能在全球化競爭以及指數型科技（Exponential Technology）發展的趨勢下存活，最終獲得勝利、創造價值。","schedule":"這是門開給喜歡創新思考的人的課\n創新思考的能力來自於主動嘗試，需要不斷地傷腦筋，所以沒辦法只靠被動聽講就奏效創新思考的心態習慣與技巧運用的養成，需靠大量練習來累積想要成為一個能夠創新思考的人，除了練習還是練習，時時刻刻､隨時隨地､隨遇而安､隨心所欲､隨緣成長的主動積極不斷嘗試\n    不同於一般專業知識課程重在傳輸知識內容的INPUT記憶學習，創新思考課程反過來要求學生不斷進行OUTPUT的創意練習，並強調在OUTPUT中要有專屬於你自己的創意產出(YOURPUT)，整個課程就像COMPUTER(電腦)，所有參與練習者如同一台台處理器，各自產出OUTPUT，供其他練習者INPUT，再放入自己的PUT形成新的OUTPUT...藉此磨練自我大腦CPU的靈活運作，減輕以龐大記憶體來學習記憶知識的負擔\n所以，修習這門課會有大量的練習作業，會被不斷要求創意塗鴉､表達對話，老師的任務則像是教練，在上課的過程中陪伴大家練習､體會，然後對話､思考､修正､調整，不斷想方設法來進化升級自我的創意思維能力\n由於創意､創新強調與眾不同的個別化､獨特性的心智成果呈現創意､創新能力的學習培養過程自然也需要個別化､獨特性的心智運作訓練，所以理想的修習人數規模不宜過大，才能有充分的時間摸索實作技巧，進行個別指導啟發\n我自九十七學年度起從事全校性必選修之智慧財產權法課程教學工作近十年，整體課程一向就以創新思考為教學核心詳言之，智慧財產權法課程除了解說具體法律制度規定內容之外，還必須兼顧智慧學創意；財產學生意；權法學爭議這三方面的學習重點，來引導學習者進行創意思考如以智慧創意角度來化約掌握，智慧財產權法課程的教學重點應置重在培養學習者兩種智慧創意，即財產生意的創意智慧以及權法爭議的智慧創意，來因應未來進入實務界後的創新思考挑戰\n學校有鑑於外界對於創業創新的教學需求日益殷切，於104學年在通識教育課程增列創新創業向度選修課程故配合學校校學政策調整，將智慧財產權法課程教學經驗整理運用至創新思考課程進行創新教學，希望能協助有心的學生培養創新思考的心態､習慣與靈活應變能力\n曾有同學將我的智慧財產權法課程的授課特色筆記整理(如下圖)，我將會再創新思考課程繼續延續這樣的風格特色，來協助同學鍛鍊1.邏輯思辨2.溝通表達3.問題解決4.創新思維\n\n\n一般創新思考課程為設計學院所重視，教學模式主要透過一系列的資料採集､參考與互動，包括經驗分享､影片欣賞等，帶領受教者探索如何進行創新思考本校除設計學院學生外，以理工科學生居多，學生教學回饋意見屢屢反應，工科學生長於機械結構操作事物，相對拙於天馬行空的靈活思考，對於傾聽他人意見､表達自己想法，亦少有練習機會故本課程設計理念針對前述受教者特質背景，結合翻轉教學的練習實作，來讓學生體驗創新思考講求結果､結局不一樣的精神\n\n    基於此等背景因素考量，本計畫之課程設計理念主要有以下幾項:\n\n1.重視創意思考練習實作，對話練習重於聽講記憶\n創意或創新思考一般有幾種教法可供參考，一是多方觀摩以求了解他人創意技巧，二是整理教授可供參考之創意方法，但不論採何種方法最終都得仰賴學習者自身不斷的大量練習不斷練習､累積深化，是培養提升自身創意思考能力的重要功夫，所以本課程的教學方式對話練習重於聽講記憶，運用各種素材與機會引導受教者主動積極的練習創新思考與發表想法\n    本課程將在課堂上不斷利用機會鼓勵學生靈活結合記憶與創意兩端來學習知識，以記憶端的溫故，檢索､分析既有知識，用創意端的知新，形成未知的構想布局，兩者結合來作不一樣的創新思考表達讓學生認知到，用記憶讀書，ㄧ切都不容易用創意讀書，到處都找新意凡事，都是變易、簡易、不易試著回憶、追憶(記憶的作用與目的)，翻譯其間所涉的利益以及意義，研議、提議、建議、倡議，會議、商議、協議的集思廣益，思索如何容易、變異的更加優異，就是創新思考的學習真意！\n \n2.手腦併用的創造､表達､溝通\n手腦併用有助於刺激創意手腦並用的意見塗鴉，讓思考的嚴肅感轉化成問題的遊戲感，有利於營造創新思考的氛圍故本課程在課堂上的小組練習作業採分組集體討論，先由各組在A3大小的紙張上形成意見塗鴉，再由各組於課堂板書塗鴉，視覺化的呈現思路，再由老師引導各組及全班同學進行對話思考，結合創造､表達､溝通三者所具有之功能關聯，手腦併用的創造､表達､溝通，來練習創新思考\n  \n3.寓教於樂､翻轉教學，讓受教者能放､晃､FUN的練習創新思考\n課堂上適時結合同學臉書上的動態消息､youtube上的流行歌曲等周遭素材，進行創新思考的練習與示範解說，樂中有教､教中有樂的發揮寓教於樂學習效應此外，採取翻轉學來讓受教者放､晃､FUN，不受拘束的去探索、發問。\n創新思考必須採取與專業知識不同的思考視野來教學白日依山盡 黃河入?","scorePolicy":"課堂討論表現  50%\n小組作業25%\n個人作業25%","materials":"參考書籍\n\n邱麗娟/譯，井上彥達，創新的第一課: 模仿，2013 年7月1版1刷\n林麗冠/譯，大衛.莫瑞/譯，借用創意，你最快出人頭地，大雁(香港)出版基地. 里人文化，2010年8月3日初版1刷\n張舜芬.錢佳緯/譯，點子都是偷來的:10個沒人告訴過你的創意撇步，遠流出版，2013年10月2版5刷。\n沈殿忠等編著，談創造說機遇—科學方法論談，復漢出版社有限公司，1996年6月初版張大凱，電的旅程–探索人類駕馭電子的過程，天下文化出版\n王蘊潔/譯，山田大隆/著，從故事看科學，世潮出版有限公司，2006\n年3月初版\n劉藍玉/譯，安娜‧克雷邦/著，我愛讀發明的故\n事，小天下出版社，2010年3月5日初版\n劉復苓/譯，邁可．J．蓋爾伯，莎拉．米勒．卡蒂/著，快樂腦：學習愛迪生的五種創新思考法(Innovation Like \nEdison：The ive-Step System for Breakthrough Business Success)，馬可孛羅出\n版社。\n劉蘊芳/譯，麥可‧葛柏 /著，7 Brains－怎樣擁有達文西的七種天才(How to Think Live Leonardo da Vinci)，大塊文化。\n趙晉枚等合著，智慧財產權入門，元照出版社，2014年9月10版1刷李光熹/編譯，愛迪生到iPOD: 保護你的創意並從而致富，三民書局靠智慧變富有的秘密，三民書局\n蕭雲菁/譯，大發明調查團/編著，日本創意大發明，台灣東販股份有限公司，2011年6月24日初版林宜瑄/譯，追蹤發明的思路，臉譜出版，2006年3月\n楊雨樵/譯，佐藤健太郎/著，改變歷史的元素之王碳，臉譜出版，2015年2月15日陳朝華，商標法實例解析，元照出版，2013年7月初版\n鄭煥生/譯，誰把橡皮擦戴在鉛筆的頭上: 文具們的百年演進史，時報出版，2015年9月25日","foreignLanguageTextbooks":false}]
