[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2017-09-14 12:13:44","objective":"This course introduces you to a set of theories and tools to help you be a more thoughtful, ethical, and effective planner. These theories and tools are ideas about focusing on the process of planning, how to plan, what to plan, and the contents of plans. We will be looking at different ideas about how planners should approach their work. In the course of learning about these different ideas about what and how to do planning, you will also be practicing some specific ideas and skills that you will use throughout your career: designing planning processes, assessing the quality of planning processes, and writing up planning documents in ways that make them easy to read and understandable to the public.","schedule":"9/14: Introduction to the Theory and Practice of Urban Planning\n9/21: Architecture and Planning\n9/28: Culture and Planning\n10/5: Sociology and Planning\n10/10: Holiday of National Day of ROC (Taiwan)\n10/12: Demography and Planning\n10/19: Economics and Planning\n10/26: Politics and Planning\n11/2: Law and Planning\n11/9: Mid-term Examinations\n11/16: Management and Planning\n11/23: Health and Planning\n11/30: Environmental Studies and Planning\n12/7: Geography and planning\n12/14: Specific Topic Discussion- Sustainable City\n12/21: Specific Topic Discussion- Creative City\n12/28: Specific Topic Discussion- Compact City\n1/4: Specific Topic Discussion- Livable City\n1/11: Final Examinations","scorePolicy":"1. Class interactions (30%): reading the main references, school attendance, participation in class discussions and expert discussion.\n2. Course work and seminar preparation (30%): reading literature or case studies on each one of the selected themes and make a class presentation.\n3. Term paper (40%): semester final paper.","materials":"1.Ravetz, J. City-Region 2020: Integrated Planning for a Sustainable Environment, Earthscan.\n2.Bruton, M. &amp; Nicholson, D., Local Planning In Practice, Stanley Thornes.\n3.Hancock, J. Urban Development and Planning, Basil Blackwell.\n4.Some more materials available from websites.","foreignLanguageTextbooks":true}]
