[
  {
    "name": "陳儀",
    "email": "chenyi@ntut.edu.tw",
    "latestUpdate": "2023-12-19 10:19:07",
    "objective": "中文課程共分四年三階段授課。\n第一年以華語教學為主，授課重點為：（一）華語基本句型句法；（二）華語基本會話；（三）生活語言；（四）標音系統。\n第二、第三年，除延續第一年華語授課重點外，以段落朗讀和基本認字為主要訓練，並給與中國文字書寫訓練。\n第四年，加強會話能力，認字與閱讀能力，並傳授中國文化。\nThe course of Chinese is categorized as three individual stages for four years. \nIn the first year, the course focuses on : (a) Basic Sentence Patterns, (b) Basic Conversation, (c) Languages in the Real Life and (d) the phonetic system for the Chinese language.\nIn the second and the third year, the training focuses on paragraph reading and term/character recognition-in addition to the teaching themes set in the first year. Writing courses are also added during this stage. \nIn the fourth year, we add more emphasis on the conversational ability, term/character recognition and reading ability. More culture-related information will be included.",
    "schedule": "第 1 週  課程介紹\n第 2 週  生活情趣\n第 3 週  生活情趣\n第 4 週  好習慣壞習慣\n第 5 週  好習慣壞習慣\n第 6 週  感情問題\n第 7 週  感情問題\n第 8 週  影片欣賞\n第 9 週  自主學習\n第 10 週  街頭訪問\n第 11 週  街頭訪問\n第 12 週  文化特色\n第 13 週  文化特色\n第 14 週  環境保護\n第 15 週  環境保護\n第 16 週  說故事\n第 17 週  說故事\n第 18 週  期末考\n\n\nWeek 1  Course introduction\nWeek 2  Lifestyle interests\nWeek 3  Lifestyle interests\nWeek 4  Good habits, bad habits\nWeek 5  Good habits, bad habits\nWeek 6  Relationship issues\nWeek 7  Relationship issues\nWeek 8  Movie discussion\nWeek 9  Self-learning\nWeek 10  Street interviews\nWeek 11  Street interviews\nWeek 12  Cultural characteristics\nWeek 13  Cultural characteristics\nWeek 14  Environmental protection\nWeek 15  Environmental protection\nWeek 16  Storytelling\nWeek 17  Storytelling\nWeek 18  Final Exam",
    "scorePolicy": "課堂參與 40%\n課堂報告 40%\n期末考 20%\n\nClass Participation 40%\nPersonal Presentation 40%\nFinal Exam 20%",
    "materials": "Practical Audio-Visual Chinese 3rd edition vol.4",
    "consultation": "chenyi@mail.ntut.edu.tw",
    "remarks": "課程對應指標：4 優質教育指標對應授課內容：第 2-17 週授課主題「臺灣文化與生活」對應指標 4 優質教育中的「文化涵養提升」。* This course corresponds to SDGs goal: 4 Quality Education* The SDGs goal corresponds to the course content: From the second week to the seventeenth week of the semester, the teaching theme includes Taiwan culture and everyday life which corresponds to the target of SDGs goal 4, Improvement of cultural accomplishment.If online teaching is necessary, we will use Google Meet.Details will be announced on NTUT i-school.",
    "foreignLanguageTextbooks": false
  }
]
