[
  {
    "name": "尤信程",
    "email": "scyou@ntut.edu.tw",
    "latestUpdate": "2024-03-11 10:44:46",
    "objective": "This course covers a broad classes of machine learning algorithms. After taking this course, students should be able to conduct research in this field. The emphasis of this course is not in the theoretical development (math), but in the understanding level. Therefore, many examples will be given in the lecture to show how to apply the equations to real problems. The detailed contents are given in the course schedule field.\n\nPrerequisite: Calculus (partial derivatives), undergrad linear algebra (eigenvalues & eigenvectors), undergrad probability (random variable, joint density, Gaussian distribution), and programming skills (Python)",
    "schedule": "Week 1: Class announcement and introduction to machine learning\nWeek 2: introduction to machine learning (cont'd)\nWeek 3: Basics of supervised learning (classification and regression), VC dimension, Bayesian decision theory, and Naive Bayes classifiers \nWeek 4: Dimension reduction techniques: PCA, FA, LDA and ICA, \nWeek 5: Unsupervised learning: Clustering algorithm (k-means)\nWeek 6: Decision trees: ID3, C4.5, and bagging algorithm (random forest)\nWeek 7: Basics of optimization\nWeek 8: Basics of optimization (Cont'd) and gradient search\nWeek 9: MT\nWeek 10: MT sol.  \nWeek 11: Feedforward neural networks with examples: multi-layer perceptrons, Back propagation, and Regularization methods\nWeek 12: Deep learning and convolutional neural networks\nWeek 13, 14: More on deep neural networks: YOLO, Autoencoder, LSTM, and advanced topics, such as Bayesian networks, confidence of classification, and self-supervised learning \nWeek 15: SVM, Adaboost, and Ensemble learning\nWeek 16: Design and analysis of experiments\nWeek 17:  Reinforcement learning\nWeek 18: Final exam",
    "scorePolicy": "MT 30 %\nFinal 40 %\nHW 30 %\nProject 10 % (optional)",
    "materials": "Course PPT files are available for students.",
    "consultation": "Office: Tech building 1533Email: scyou@ntut.edu.tw",
    "remarks": "In case online lecturing is required by CDC, we will use the Microsoft Teams as the lecturing platform. E-mail me if you have any problems: scyou@ntut.edu.tw4/2 & 4/8 class meetings will be held as usual.",
    "foreignLanguageTextbooks": false
  }
]
