[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2023-12-26 23:14:48",
    "objective": "本課程將介紹網站架設與前後端網頁設計，內容包括：網站架設，前端網頁設計 (html,javascript)，後端網頁設計 (php,mySQL 資料庫)，學習目前網頁的主流，進階階網頁設計：響應性網頁 RWD (bootstrap)。以及網站架設實務，包括：申請網站空間，自行架設網站的 2 種方法，申請網域名稱。\n  學習 html 將有助於後續課程的應用，包括：(1). 可以處理商業數據截取，經常必須要爬取網路數據，所以必須懂 html 語法。(2). 網頁 html 的 TDK 有助於搜尋引擎的 SEO 排名，SEO 是搜尋引擎優化的簡寫，是為了讓網站的搜尋排名變好，提升網站的能見度與流量，進而創造轉單與業績。\n  學習 javascript 將有助於後續課程的應用包括：處理第 1 方第 3 方的網站流量分析，這些都必須有能力置入 javascript 代碼，才能追用戶的使用趨勢，以改進網站流量與行銷。另外 Google 流量分析證照 GA，也要在網頁置入 javascript，才能追流量。\n  學習目前商業網站的整體架構，包括：前端網頁的技術 (html＋javascript)，與後端網頁 (資料庫網頁) 技術 (PHP＋mySQL)，最後將有能力製作自訂的 ERP 系統\nThis course will introduce website construction and front-end and back-end web design, including: website construction, front-end web design (html,javascript), back-end web design (php,mySQL database), learning the mainstream of current web pages, advanced web design : Responsive web page RWD (bootstrap). And the practice of setting up a website, including: applying for a website space, two ways to set up a website by yourself, and applying for a domain name (Domain Name).\n  Learning html will help the application of subsequent courses, including: (1). Can handle commercial data interception, often must crawl network data, so you must understand html grammar. (2). The TDK of the web page html is helpful to the SEO ranking of the search engine. SEO is the abbreviation of Search Engine Optimization (Search Engine Optimization), which is to improve the search ranking of the website, improve the visibility and traffic of the website, and create conversions. Orders and performance.\n  The applications that learning javascript will help subsequent courses include: dealing with 1st party and 3rd party website traffic analysis, all of which must be able to insert javascript codes in order to track user usage trends to improve website traffic and marketing. In addition, Google traffic analysis certificate GA, also need to put javascript in the webpage to track the traffic.\n  Learn the overall structure of the current commercial website, including: front-end web technology (html,javascript), and back-end web (database web) technology (PHP,mySQL), and finally have the ability to create a customized ERP system",
    "schedule": "第 1 週：使用已經寫好的 javascript 程式\n第 2 週：初階網頁模版 (html)\n第 3 週：學習 Html 標籤語法，Javascript 網頁程式，CSS 樣式設定\n第 4 週：基本輸出 document.write，Alert (提示) 對話盒，textBox 文字方塊，label 文字標籤，按鈕\n第 5 週：選擇結構，條件敘述：if-else 敘述，Switch 敘述，制圖片屬性\n第 6 週：計時器，倒數，貓走路動畫\n第 7 週：應用函數：日期時間，數學，字串\n第 8 週：申請網頁空間，上傳網站\n第 9 週：期中作業\n第 10 週：架設網站方法 1：IIS\n第 11 週：架設網站方法 2：Apache+php+mySQL\n第 12 週：申請網域名稱 (域名)，DN, Domain Name\n第 13 週：進階階網頁設計 / 目前網頁設計主流：響應性網頁 RWD (bootstrap)\n第 14 週：後端網頁 (資料庫網頁) 的技術：PHP (1)\n第 15 週：後端網頁 (資料庫網頁) 的技術：PHP (2)\n第 16 週：後端網頁 (資料庫網頁) 的技術：PHP+mySQL (1)\n第 17 週：後端網頁 (資料庫網頁) 的技術：PHP+mySQL (2)\n第 18 週：期末作業",
    "scorePolicy": "1. 上課實作範例加分 25%，.6 次作業分數 25%，期中考 25%，期末考 25%\n2. 本學期開始，系上選修課人數上限 40 人，\n3.735 教室不是電腦教室，是一般教室。要自己帶筆電。\n4. 第一周就要帶筆電來上課",
    "materials": "1. 自編教學網站：\nhttps://acupun.site/lecture/cmedia/",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 可以在北科 i 學園 PLUS 平台，觀看上課錄影 3. 老師的 email：ccw@ntut.edu.tw",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱",
    "foreignLanguageTextbooks": false
  }
]
