[
  {
    "name": "黃增隆",
    "email": "blessing@ntut.edu.tw",
    "latestUpdate": "2024-02-16 20:57:30",
    "objective": "The course is designed to:\n1.\tTo help students be familiar with knowledge of service management;\n2.\tTo revisit every theory and concept learned in service management through case studies;\n3.\tStrengthen students' practical insight and make successful service management and marketing.\nThis course will play business case videos for students' discussion and learning. Therefore, the course will require using the Internet and computers to search for information.\n\n本課程主要利用商業影音個案方式學習服務業管理與行銷的概念與實務，因此本課程將會使用電腦影音設備以幫助同學更快速地融入行銷專業英文的學習情境。同學每週將會觀看，撰寫心得並研討一個服務業商業影音個案。藉此強化同學學習效果.",
    "schedule": "Weekly course schedule and teaching methods:\nWeek 1 Course Introduction\nWeek 2 Sensory Marketing in a Servicescape\nVideo case (Lexus), lecture, writing a report, and discussion \nWeek 3 Concrete Affect in a Servicescape\nVideo case (Taco Bell), lecture, writing a report, and discussion \nWeek 4 Experiential Marketing in a Servicescape\nVideo case (Sightseeing bus tour), lecture, writing a report, and discussion \nWeek 5 Persuasive marketing in a servicescape\nVideo case (Mouthwash ads), lecture, writing a report, and discussion\nWeek 6 Customer Orientation\nReading case (WeiChuan High-Quality Milk), lecture, writing a report, and discussion\nWeek 7 The Midterm Review\nWeek 8 Lifestyles Marketing in a Servicescape\nVideo case (Tropiclean), lecture, writing a report, and discussion\nWeek 9 STP in a Servicescape\nVideo case (swimwear design), lecture, writing a report, and discussion \nWeek 10 Service innovation in a servicescape\nVideo case (Diffusion of innovative services), lecture, writing a report, and discussion \nWeek 11 Live streaming Marketing in a servicescape\nVideo case (QVC), lecture, writing a report, and discussion \nWeek 12 Service innovation\nReading the article, lecture, writing a report, and discussion\nWeek 13 The New Science of Customer Emotions\nReading the article, lecture, writing a report, and discussion\nWeek 14 Discuss Final Project Presentation \nWeek 15 Discuss Final Project Presentation\nWeek 16 Discuss Final Project Presentation \nWeek 17 Final Project Presentation\nWeek 18 Final Exam (peer review)",
    "scorePolicy": "1.\tEach case/article reading reports 40%\n2.\tFinal Exam (peer review) 25%\n3.\tFinal Project Presentation 35%",
    "materials": "Harvard Business Review \nVideo case",
    "consultation": "Consultations are available during office hours (reservation in advance).",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
