[
  {
    "name": "王怡惠",
    "email": "yihui@ntut.edu.tw",
    "latestUpdate": "2024-02-29 16:25:35",
    "objective": "「展演藝術與表達」是一門符合現代精神與消費文化的課程，將過去展示消費與文化演出的精神融合成為新的趨勢。隨著時代的變遷，從過去以展示品及表演者為主的角色轉變為與消費者大眾的互動精神為主的概念。表演活動範圍也由純粹的表演活動，擴及商品消費空間及觀眾互動；而展示也由靜態之展覽，擴及表演空間與活動的加入，以有利於開擴展示品之魅力。因此將包含設計與藝術的整合、動態與靜態的表現、環境空間與人類行為的結合、參觀行為與學習行為的互動、消費娛樂與文化教育的交流等，表達多元展演精神與「整體藝術」的跨域表現。\n\"Performance/Display Art and Expression\" is a course in line with the modern spirit and consumer culture, presenting a new trend which improves the past demonstration of consumption and cultural performances. With the changing times, public-oriented concept inviting consumer interaction replaces the past means in showing predominantly the goods and the main performers only. The scope of the performances shifts from sheer performing activities to expanded consumer goods space and audience interaction; the past static display/exhibition now adds performance space and activities so as to better introduce the charm of the goods. The course, therefore, will cover the integration of arts and design, dynamic and static performance/display, the integration of environmental space and human behavior, the interaction between visitor behavior and learner behavior, as well as the exchanges in consumer entertainment and culture education.\n\n課程內容包括：展演藝術的定義、特質、起源與類別範圍等基本原理分析，並企圖在地方與博物館展演中找出與土地相關的案例分析，引導思考如何轉化地方特色為舞台，以文化元素為靈感，透過展演策略推廣使地方文化特色更加豐富，並發展成為國際性的藝術事件，達成展演藝術與表達的課程目標。並結合 USR 計畫內容至鶯歌陶瓷博物館及地方性館舍移地教學，以工藝、藝術、文化展演為題，引導學生思考理論及創意如何落實在實際的展演創生活動中。",
    "schedule": "1\t課程內容講解 -\t\n2\t2/28\t放假 - 和平紀念日\t\n3\t介紹展示意義\t\n4\t展覽行為與展覽機能\t\n5\t展覽策劃的要素\t\n6\t設定展題與與規劃展出內容\t\n7\t地方創生展演案例參觀\t\n8\t文宣設計與針對展題的深入研究\t\n9\t藝術創生展演案例分析 -\n日本越後妻有大地藝術祭\n日本 D&DEPARTMENT PROJECT\n日本瀨戶內國際藝術祭\t小組報告 (3 組)\n地方藝術創生\n比較\n10\t新一代設計展校外參觀\n2024 年 5 月 24 日 (五) 至 5 月 27 日 (一)\n台北南港展覽館 2 館 1 樓、4 樓 (台北市經貿二路 2 號)\t\n11\t展覽設計的空間環境\t\n12\t地方企業特色博物館案例分析 -\n韓國 Leeum Museum of Art (三星美術館)\n韓國 Hyundai Card Storage\n韓國 Amorepacific Museum of Art (愛茉莉太平洋美術館)\t小組報告 (3 組)\n地方企業特色博物館比較\n13\t展覽設計的道具設施與人性因素\t\n14\t展演案例分析\n（V&A 博物館，芝加哥美術館，MONA 新舊藝術博物館）\t小組報告 (3 組)\n主題式博物館\n比較\n15\t展覽活動與地方行銷意涵\t\n16\t地方節慶案例分析\n比利時電子音樂節 (Tomorrowland)\n西班牙番茄節 La Tomatina\n巴黎時裝週（Fashion Week de Paris）\t小組報告 (3 組)\n地方藝術節慶\n比較\n17\t展覽策畫與論述專業養成途徑\t\n18\t期末考試週–發表回饋與檢討",
    "scorePolicy": "□平時成績 General Performance: 30 ％(出缺席及課堂表現)\n□期末作業成績 Homework and/or Assignments: 30 ％   \n□其他 Miscellaneous: ( 小作業及期中口頭報告  )  40％\n\n作業說明:\n期中作業以展演參觀普查為主，並針對展演進行內容，策略，空間，行銷等進行比較分析報告.\n期末作業以個人論述一策展報告",
    "materials": "1. 非去不可的全球百大展覽 The Travel of Global Exhibitions\n作者：La Vie 編輯部 出版社：麥浩斯 出版日期：2009\n2. 展覽行銷與管理實務  \n作者：姚晤毅 出版社：鼎茂  出版日期：2011 年 05 月 17 日\n3. 展覽複合體－博物館展覽的理論與實務 Museum Exhibition Theory and Practice \n作者： David Dean 譯者：蕭翔鴻 出版社：藝術家 出版日期：2006 年",
    "consultation": "請 mail 聯繫課程教師 yihui@ntut.edu.tw",
    "remarks": "如遇三級警戒，改以課程班級 teams 線上進行，如有疑問，請 mail 聯繫課程教師 yihui@ntut.edu.tw",
    "foreignLanguageTextbooks": false
  }
]
