[
  {
    "name": "陳冠薇",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-18 20:00:18",
    "objective": "一、本課程凡十六學分，供學生前四年修習之用。\n二、本課程教學目標旨在透過適當選文，增進學生閱讀、鑑賞與寫作能力，誘使學生對我國重要典籍及傳統文化有一粗淺認識，並從而培植其人文素養，啟發其愛國、愛家、愛人之情操。\n三、本課程所選範文，類別遍於經史子集，時代該及古今。編者於每篇選文，除有生字、難詞、典故之註釋，提意、出處、著作背景之說明，而作者生平、作品、風格及其地位、事功，亦有簡要之評述。\n四、本課程亦講授公文及書信。公文之內容包括函、簽、公告、報告等各類常用公文的作法與寫作要領，並兼及處理公文之注意事項。書信之內容包括傳統及現代書信的寫法與寫作要領，並兼及便條與做為便條使用之名片的寫法。\na) The course is designed for the students to study in the first four years, with a sum total of 16 credit hours. \nb) Course Objective: Through proper readings, the students will increase their ability to read, write and even appreciate literary works, and better understand significant books of ancient times and of traditional culture. With better development of humanity, they are likely to have more sense of loving the country, family and people. \nc) The Readings are adopted from a diversity of sources, including Classics, History Books, individual writings and literary anthology-ancient or modern. In addition to the explanation and discussion of vocabulary items, difficult words, classic allusions, main ideas, origin and the time background of the articles, a brief comment is also made on the authors' life, their works, literary styles/status. \nd) The course is to teach students how to write and handle official correspondences and social letters.",
    "schedule": "1. 穿梭於課文間的時空旅行：課程介紹\n2. 本次停靠站點：篇目導讀\n3. 如何進入 9 又 3/4 月台？—— 問題與方法 ；圖書館資料與文獻\n4. 第一域：【清末】知識份子的使命感 —— 連橫〈臺灣通史序〉\n5. 第二域：【西漢】司馬遷的撰史動機 ——《史記．太史公自序》 \n6. 第三域：【魏晉】死生亦大矣 —— 王羲之〈蘭亭集序〉\n7. 清明節連假\n8. 第四域：【宋】超越有限性的生命思考 —— 蘇軾〈赤壁賦〉\n9. 期中考週          * 上傳期末主題報告構想\n10. 第五域：【明】最懂玩的 KOL—— 袁弘道〈晚遊六橋待月記〉\n11. 第六域：【先秦】一切景語皆情語 ——《詩經．蒹葭》\n12. 圖書館資料與文獻\n13. 實作與討論    \n14. 時代與文化之旅：主題成果發表    * 上傳期末成果簡報\n15. 時代與文化之旅：主題成果發表   \n16. 時代與文化之旅：主題成果發表 \n17. 書面報告撰寫與修改     * 上傳期末書面報告  \n18. 期末考週",
    "scorePolicy": "1. 平時成績 30%（包含出缺席 10%、課堂練習與參與討論情況 20%）\n2. 小組活動 20%\n3. 主題報告 50%（期中構想說明書 10%、期末書面報告 20%、成果簡報與口頭報告 20%）",
    "materials": "東大版 舊版國文第四冊  (教師會再提供課文電子檔於 i 學園)",
    "consultation": "教師聯絡方式：kuanwei31433@mail.ntut.edu.tw",
    "remarks": "1. 若因疫情無法實體授課，會再行公告遠距教學方式於「北科 i 學園」，請再隨時留意。2. 教師聯絡方式：kuanwei31433@mail.ntut.edu.tw",
    "foreignLanguageTextbooks": false
  }
]
