[
  {
    "name": "陳起鳳",
    "email": "cfchen@ntut.edu.tw",
    "latestUpdate": "2023-12-11 12:10:54",
    "objective": "This class is assigned as one of the EMI classes. \nEnglish is the only language used in this class, including all the materials and my speech. \nYou need to read, write, and speak with English. \nDon't worry about it, just try it. More try more gain. \n  \nEnvironmental Science is an interdisciplinary learning, including the knowledge about the biological and non-biological science on the earth and the interactions between human beings and the environment. Human live in the earth environment and use all the natural resources to meet their living needs. Therefore, the basic knowledge about the earth and the resources on it are necessary. With the correct knowledge, the interactions between human and the environment are able to sustain peacefully. This course is a beginning and is aimed to learn the all components about the earth. Moreover, to precious and to conserve the nature is the most important message in this course. The contents of this course include ecosystem, earth science, water resources, energy, food resources, environmental ethics, and environmental justices.",
    "schedule": "Lecture 1：Environmental problems, their causes, and sustainability\nLecture 2：Biodiversity, species interactions, and population control\nLecture 3：The human population and urbanization\nLecture 4：Sustaining biodiversity: the species approach\nLecture 5：Sustaining biodiversity: the ecosystem approach\nmidterm exam\nLecture 6：Food, soil, and pest management\nLecture 7：Water resources and water pollution\nLecture 8：Energy\nLecture 9：Environmental economics, politics, and worldviews\nfinal exam",
    "scorePolicy": "attendance and performance in class 15%\nquiz (in class) 30%\nmidterm exam 25%\nfinal exam 30%",
    "materials": "Miller, G.T., and Spoolman, S.E. 2015. Environmental Science.15th edition.  BROOKS/COLE CENGAGE Learning.",
    "consultation": "If you need any consulting about this class, you can email me: cfchen@ntut.edu.tw.Or you can find me in my office hours. My office is 301 in the building of civil engineering.",
    "remarks": "In case that it needs remote teaching, I will use the TEAMS platform.Please login with your teams account, which was assigned by the school. Again, if you have any questions, the email is the best way to contact me.My email address: cfchen@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
