[
  {
    "name": "王李吉",
    "email": "richwang@ntut.edu.tw",
    "latestUpdate": "2023-12-17 20:05:07",
    "objective": "課程中將教導學生如何透過以程式 (Python) 的方式，來自動建置必要的檔案環境，用來儲存及引用這些擷取來的巨量資訊或大數據 (Big Data)，以利後續的搜尋與增刪，使能更符合教育現場對此數據的應用。對於眾多的 Python 資料處理與網頁擷取模組，課程中嘗試以分門別類的方式，來示範如何從網路及雲端擷取各種類型與項目的資料，並提供練習與提問，讓學生熟練這些模組及其使用的方法，進而可以將這些內容應用在未來面對的教育大數據項目中，甚或能開發出更貼合教育情境的模組，還能分享以供大眾使用。\nIn this course we will teach students how to have the ability for processing big data. It includes how to automatically create the necessary file environment for storing and referencing the huge amount of information or big data, which accessed through a programmatic approach (by Python) to facilitate subsequent search, addition, and deletion to better fit the application of such data in the educational scenarios and their own fields. Furthermore, there are many Python data processing and web scraping modules developed for public use. Thus, we try to demonstrate how to use these modules to retrieve various types of data from the Internet and the cloud in a separate way. To help students understand the usages of the common used modules, this course will provide related exercises and questions for students to familiarize themselves with these modules. Hopefully, the students can learn, and then apply these contents to their own fields and future educational big data projects.",
    "schedule": "第 1 週\tPythont 語法的回顧與應用\n第 2 週\tPython 常用模組的引用介紹\n第 3 週\tPython 檔案與目錄的管理\t\n第 4 週\t資料的清理與分析介紹\n第 5 週\t資料的清理與分析應用\n第 6 週\t網頁內容的爬取介紹\n第 7 週\t網頁內容的爬取應用\n第 8 週\t共授專家演講\n第 9 週\t期中考試\n第 10 週\t雲端資料的存取介紹\n第 11 週\t雲端資料的存取應用\t\n第 12 週\t開放資料平台介紹\n第 13 週\t開放資料平台應用\n第 14 週\t資料的視覺化 1\n第 15 週\t資料的視覺化 2\n第 16 週\t資料庫的存取介紹與應用\n第 17 週\t整合專題實作\n第 18 週\t期末專案與報告",
    "scorePolicy": "(*) 因為本課程同時也是 \"教育大數據微學程\" 中的基礎課程，主要利用 Python 來進行數據資料的處理與應用，因此建議具備 Python 基礎的同學再來選修。\n作業 (20%)\n小考 (20%)\n課程參與 (10%)\n期中考試 (25%)\n期末考試或展示 (25%)",
    "materials": "稍後公告。",
    "consultation": "請於課堂上發問，或於輔導時間來討論。",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 1. 同學如有加退選簽核或課程問題，請寫信至 richwang@ntut.edu.tw，信件標題 [課程名稱]_班級 (或隨班附讀)_名字。2. 本課程其他資料，將透過北科 i 學園 plus 公布。3. 本課程採實體授課方式，但為因應疫情或其它狀況，可能會調整授課內容、授課方式、評分項目與配分比例。如果無法實體上課，預定使用 Teams 於原定上課時段進行遠距上課，相關細節將再另行公告。相關防疫或課程上課形式公告，請參考學校網頁: https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw",
    "foreignLanguageTextbooks": false
  }
]
