[
  {
    "name": "吳冠毅",
    "email": "kywu@ntut.edu.tw",
    "latestUpdate": "2023-12-12 22:23:23",
    "objective": "This course is an introductory course designed to provide undergraduate students with a foundation in the fundamental principles of chemistry. This course covers atomic and molecular structure, chemical reactions, stoichiometry, thermochemistry, the physical state of matter, thermodynamics, and kinetics. In the course, students will explore the properties of matter, the behavior of elements and compounds, and the laws governing chemical reactions. They will also develop an understanding of the scientific method and the role of experimentation in the study of chemistry. By the end of the course, students should have a solid understanding of the principles and concepts of chemistry since General Chemistry is a prerequisite for many higher-level courses in chemistry.",
    "schedule": "First week: Thermochemistry: Energy in Chemical Reactions\nSecond week: Thermochemistry: Energy in Chemical Reactions\nThird week: Entropy, Free Energy, and the Second Law of Thermodynamics\nForth week: Entropy, Free Energy, and the Second Law of Thermodynamics\nFifth week: Entropy, Free Energy, and the Second Law of Thermodynamics\nSixth week: Physical Equilibrium \nSeventh week: Physical Equilibrium\nEighth week: Chemical Equilibrium\nNinth week: Mid-term exam\nTenth week: Chemical Equilibrium\nEleventh week: Acids and Bases\nTwelfth week: Acids and Bases\nThirteenth week: Acid-Base Equilibria and Solubility\nFourteenth week: Acid-Base Equilibria and Solubility\nFifteenth week: Electrochemistry\nSixteenth week: Electrochemistry\nSeventeenth week: Chemical Kinetics\nEighteenth week: Final exam\n\nThe schedule is dependent on the actual progress of the lesson.",
    "scorePolicy": "Quiz & Homework: 15% \nAttendance: 20 %\nMid-term exam: 30 %\nFinal exam: 35 %",
    "materials": "Textbook: University Chemistry, International  Edition, Brian Laird., McGraw-Hill (東華書局)\n\nReference book: Chemistry 11th Edition, Steven S. Zumdahl, Susan A. Zumdahl, and Donald J. DeCoste (滄海圖書)",
    "consultation": "Office hour",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
