[
  {
    "name": "林侑民",
    "email": "Oaz@ntut.edu.tw",
    "latestUpdate": "2024-01-22 11:44:27",
    "objective": "內容包括第二定律、各種動力循環以及冷凍循環。\nTo provide students with the concepts and abilities of analyzing second law of thermodynamics, power cycles, refrigeration cycles and heat pump cycles.",
    "schedule": "Week 1- The Second law of thermodynamics, The reversible process, The Carnot cycle. \nWeek 2-Entropy, The Second law analysis for a control volume. \nWeek 3- Power cycles, Introduction to power systems, The Rankine cycle.  \nWeek 4-the Regernative cycle, Deviations of actual cycles from ideal cycles.  \nWeek 5-Cogeneration, Air-standard Power cycles, The Brayton cycle.  \nWeek 6-The simple gas-turbine cycle with a regenerator, Gas-turbine power cycle configurations. \nWeek 7- The air-standard cycle for a jet propulsion, The Otto cycle. \nWeek 8- The Diesel cycle, The Stirling cycle.  \nWeek 9- refrigeration cycles, Introduction to refrigeration systems, The vapor-compression refrigeration cycle. \nWeek 10- Working fluids for vapor-compression refrigeration systems, Deviations of the actual vapor-compression refrigeration cycle from the ideal cycle.  \n\nWeek 11-The Ammonia absorption refrigeration cycle, The air- standard refrigeration cycle. \nWeek 12- Combined-cycle power and refrigeration systems. \nWeek 13- Heat pump cycles, Vapor-compression refrigeration and heat pump theory.\nWeek 14- Air-source heat-pump systems, Water-source heat-pump systems, Geothermal heat-pump systems.  \nWeek 15- Applications and types of heat pumps, Thermodynamic principles, Heat sources. \nWeek 16- Basic considerations for calculating the operating costs and the economics.\nWeek 17-The heat pump and the energy industry, Heat pump designs-heat pump systems.\nWeek 18-Heat pump components, Heat pump controls, Air-to-liquid type systems, Liquid-to-liquid type systems.",
    "scorePolicy": "Homework 30%\nClass participation 10%\nPresentation 10%\nMidterm exam 20%\nFinal exam 30%\n\nNOTE：Exams can open textbooks",
    "materials": "- Fundamentals of Thermodynamics, Sonntag, Borgnakke, Van Wylen, Fifth edition, JOHN WILEY & SONS. INC. \n- Thermodynamics Concepts and Applications, Stephen R. Turns, Laura L. Pauley, Second edition, CAMBRIDGE UNIVERSITY PRESS. \n- Heat pumps, Eugene Silberstein, second edition, CENGAGE Learning, 2015, USA. \n-Heat Pump Technology, H. Ludwig von Cube and F. Steimle, Butterworth & Co (publisher) Ltd, 1981, England.",
    "consultation": "Oaz@ntut.edu.twOmid.alizargar@gmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
