[
  {
    "name": "黃青萍",
    "email": "chanmaster6@gmail.com",
    "latestUpdate": "2023-12-18 10:47:26",
    "objective": "本課程「國語文實務應用」，專為本校科技大學的同學而設計，以未來於職場（生存）與人生（生活、生命）之實務應用為教學標的。 \n    奠基於大學之前 12 年的國語文能力上，課程設計朝向多元實務應用的方向，以建構學生多元溝通表達之職場需求力為要，包括資訊蒐集力、資訊應用力、簡報製作力、文案企劃力、自我宣傳力、口語溝通力、採訪寫作力、理念論述力、創新思維力等諸多領域的能力，並重視啟發學生培養生活品味力，深化學生對於生命關懷力的體認，以契合本校重視實務應用的優良傳統，以及學生未來畢業後的實務需求。\nThis course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "教學內容\n1.「五分鐘短講：自我介紹 - 求職、升學」\n2.「中國哲學經典選讀」\n\n課程進度：\n中國哲學名篇選讀與口語表達能力訓練\n1. 課程介紹 (Introduce the curriculum content, grade point standard)\n2. 短講作業說明－形式與內容（知己知彼）(How to Give a Presentation)\n3. 短講作業說明－「求職類」自我介紹的重點 (How to Give a Presentation)\n4. 短講作業說明－「升學類」自我介紹的重點 (How to Give a Presentation\n5. 短講作業補充教學－自傳寫作\n6.《孫子兵法》選讀 The Chinese Classic: The Art of War\n7.《孫子兵法》選讀 The Chinese Classic: The Art of War\n8.《孫子兵法》選讀 The Chinese Classic: The Art of War\n9.《孫子兵法》選讀 The Chinese Classic: The Art of War\n10. 個人三分鐘短講 3 minutes presentation\n11. 個人三分鐘短講 3 minutes presentation\n12. 個人三分鐘短講 3 minutes presentation\n13. 個人三分鐘短講 3 minutes presentation\n14.《論語》選讀 The Chinese Classic: Ｔhe Analects\n15.《論語》選讀 The Chinese Classic: Ｔhe Analects\n16.《道德經》選讀 The Chinese Classic: Tao Te Ching\n17.《道德經》選讀 The Chinese Classic: Tao Te Ching\n18. 期末考 Final Exam",
    "scorePolicy": "會考 10% \n出席 Class Attendance30%\n個人短講 Presentation30%(ppt 短講)\n期末考 Final Exam30%",
    "materials": "謝冰瑩等編譯《新譯四書讀本》三民書局\n余培林注譯《新譯老子讀本》三民書局\n吳仁傑注《新譯孫子兵法》三民書局",
    "consultation": "1. 加退選以網路簽核為主，不超過教室座位量為限。2. 如有問題，請使用 chanmaster6@gmail.com 信箱聯絡老師。3. 如有緊急情況，使用 teams 進行同步線上教學。",
    "remarks": "課程對應指標：4 教育品質指標對應授課內容：本課程所設計的教材中，於「中國哲學名篇選讀」部分，以《孫子兵法》、《論語》、《道德經》等中國經典為主。其對應了指標 4「教育品質」項目，著重於文化涵養、職場需求、生命關懷、生活品味等能力的提升。課程對應指標：8 就業與經濟成長指標對應授課內容：本課程所設計的教材中，於「口語表達能力訓練」部分，以「五分鐘短講：自我介紹 - 求職、升學」為主。其對應了指標 8「就業與經濟成長」項目，著重於自我宣傳、口語表達、文案企劃、資訊蒐集、簡報製作等能力的訓練。",
    "foreignLanguageTextbooks": false
  }
]
