[
  {
    "name": "楊景德",
    "email": "jyang@ntut.edu.tw",
    "latestUpdate": "2023-12-31 16:24:05",
    "objective": "學習邏輯思考的目的在於幫助我們培養一種邏輯能力，使我們能夠邏輯理性地以語言進行思考。要達成上述目的，我們首先要了解語言做為一種符號的內在邏輯架構。我們要明白什麼是概念、與概念所指涉的對象、與概念具備的意義和觀念；然後，語句的性質，包含其真假值，它們與字詞和概念的關係。之後，如何用語句去建構論證。為了建構論證，我們要學習傳統的歸納法、三段論法、自然演繹法的基本推論規則與自然語言和形式語言之間的翻譯。總之，我們要會在生活中如何理性地思辨問題並有效地與他人溝通。課程講授將配合一些心理測驗、課堂遊戲與電影教學。\nThe purpose of learning “Logical Thinking” is to help us acquiring a kind of ability in virtue of which we will be able to think logically and rationally.  To achieve that goal, we need to know the innate logical structure of our language.  That means, we will need first to grasp the essence of concepts including their reference, meaning, and ideas. Then, we shall study the essence of sentences including their truth-value and the relations with words and concepts.  After that, we shall learn how to establish a sound argument. For that purpose, we plan to study induction, syllogism, basic rules of inference in the method of natural deduction in quantificational logic, and translation between natural and formal language.  In a word, we will be able to speculate problems in our life rationally and communicate with others effectively.   The lecturing of the course will mix with psychological texts, games and practices in the classroom, and scientific films or regular movies.",
    "schedule": "週次\t講授內容概要\t教科書章節\n1\t“人人必須具備邏輯力” 導論\t\n2-3\t第一部份 學習邏輯思考的事前準備\n4-5   第三部分、第四部分第二部分 思考邏輯的基本原理\t  \n8\t第五部分 非邏輯思考的主要形式\t\n9\t期中考週\t停課一次\n10\t“邏輯學入門”、“清醒思考的藝術” 導論\t\n11\t語句邏輯：自然演譯法的十八條推論法則\n12\t再思考第一部：為何要論辯\n13\t再思考第二部：如何論辯\n14\t再思考第三部：如何不去論辯\n15\t邏輯寫作 I \n16\t邏輯寫作 II\n17    邏輯寫作 III\n18\t期末考",
    "scorePolicy": "以學期中數次課堂上或回家學習回饋之平均計算成績：100% *\n\n\n\n\n*No work done by ChatGPT is allowed.\n\n* 教師有權根據學期實際情況調整評量標準。",
    "materials": "教課書: \n1.  麥肯納利 (D. Q. Mclnerny) 的著作《人人必須具備邏輯力：邏輯思考的入門書》(Being Logical : A Guide to Good Thinking) , 包丹丰 / 譯，久石文化出版 2009.\n2. 林照田、蔡承志 著《邏輯學入門》辰皓國際出版 2004.\n3. 朴注勇 著《首爾大學一開課就秒殺的邏輯寫作課：提筆就寫出獨到觀點、清楚表達意見， 又能強烈說服他人的技巧大公開》樂金文化  2021.\n4. 華特．西諾–阿姆斯壯 Walter Sinnott-Armstrong 著《再思考》(Think Again) 吳妍儀 / 譯，麥田出版 2019.\n5. Michael Krogerus and Roman Tschappeler《The decision Book Fifty Models For Strategic Thinking》Profile Books 出版 2017.",
    "consultation": "Students are free to talk to the instructor any time anywhere.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
