[
  {
    "name": "徐昕煒",
    "email": "hwhsu@ntut.edu.tw",
    "latestUpdate": "2023-12-11 15:55:03",
    "objective": "決策行為是人們每天在做的活動。然而，除非至少有兩個準則存在，否則不需要做決策，也因此這類問題被稱為多準則決策問題（MCDP）。當替代方案已知時，最終的決定就會被做出，這種類型的問題被稱為多屬性決策問題（MADP）。當替代方案未知，我們必須在某些外部條件下找到它們時，問題被稱為多目標決策問題（MODP）。多準則決策分析（MCDA）是一個通用術語，包括兩類問題的技術，即多屬性決策分析（MADA）和多目標決策分析（MODA），其中目標規劃是它的特殊情況。在這門課程中，我們將介紹這些 MCDA 方法，從確定性到不確定性。\nMaking decisions is a daily activity for all of us. However, no decision making occurs unless at least TWO criteria are present, thus this type of problems is called Multi-Criteria Decision Problems (MCDP). When the alternatives are known, the final decision is made and such type of problems is called Multi-Attribute Decision Problems (MADP). When the alternatives are unknown and we have to find them under some external conditions, and the problems are called Multi-Objective Decision Problems (MODP). Multi-Criteria Decision Analysis (MCDA) is a general term that consists of techniques for two types of problems with Multi-Attribute Decision Analysis (MADA) and Multi-Objective Decision Analysis (MODA) in which Goal Programming is its special case. In this course, we will introduce these MCDA methods from certain to uncertainty.",
    "schedule": "1st week/ Introduction to Multi-criteria Decision Making\n2nd week/ Types of Decision Problems and traps\n3rd week/ Preference Structure and Decision Support\n4th weel/ Architecture Issues and Systematic Decision-making Processes, Decision Goals and Attributes\n5th week/ Decision-making Creativity, Brief Introduction to Python code\n6th week/ Foundation of Multi-attribute Decision Analysis, Outcome Measurement and Tradeoff\n7th week/ Simple Multi-attribute Ranking Technique (SMART), Model of Displaced Ideal\n8th week/ Methods of Outcome Evaluation, Analysis Hierarchy Process (AHP)\n9th week/ (期中考試週) Paper reading and presentation\n10th week/ Analysis Hierarchy Process (AHP), Exercise: Python code for AHP\n11th week/ Data Envelopment Analysis (DEA), Project Assignment Proposal\n12th week/ Data Envelopment Analysis (DEA), Fuzzy Evaluation\n13th week/ Foundation of Multi-Objective Decision Making\n14th week/ Multi-Objective Linear Programming\n15th week/ Goal Programming\n16th week/ Interactive Programming, Fuzzy Planning\n17th week/ Decision tree Bayesian Decision Analysis and the Value of Information\n18th week/ (學期考試週) Project Assignment Presentation",
    "scorePolicy": "Practice of python code and exercises 20% \nAssignments 15% \nPaper reading 15%\nProject proposal 15%\nFinal project 30%\nattend 5%",
    "materials": "Multiple Criteria Decision Analysis for Industrial Engineering: Methodology and Applications, Gerald William Evans, 2017, CRC Press, ISBN 9781498739\n825\nMultiple Criteria Decision Analysis: An Integrated Approach, Valerie Belton, Theodor J. Stewart, 2001. Springer, ISBN 079237505X\nMulticriteria Decision Analysis: From Certainty to Uncertainty, Hsiao-Fan Wang, 2004. Tsang Hai, ISBN 9867777557\nIntroduction to Operations Research, Hiller and Lieberman, 2021. McGraw-Hill",
    "consultation": "Instructor: Hsin-Wei Hsu Office: 1134TEL: +886-2-27712171 ext.2323hwhsu@cycu.edu.twOffice HourTus. 10:00-12:00. Wes. 10:00-13:00Please make an appointment in advanceLab. mail: sustainable4435@gmail.com",
    "remarks": "SDGs 4 Quality Education",
    "foreignLanguageTextbooks": true
  }
]
