[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2023-12-14 10:37:57",
    "objective": "這是一門研究所課程，內容包括多元數據分析和高等回歸應用。本課程的目標是確保工業工程與管理領域的研究生能夠解釋、實現和操作幾種不同類型的基本回歸分析。本課程主要致力於高等回歸分析。重點是發展一個嚴格的微積分計算及矩陣代數為基礎的最小平方法 (OLS)、違反回歸假設、假說檢定及一般線性模型。此外，本課程的重點是協助學生理解分析技術這部分的領域知識，如：統計的基本概念 (描述和推理統計，概率分佈)，簡單線性回歸、多元線性回歸、邏輯回歸及對數線性模型之應用。\nThis course covers multivariate data analysis as well as advanced regression applications. The course is primarily devoted to advanced regression analysis. Th? emphasis is on developing a rigorous calculus and matrix algebra-based understanding of ordinary least squares (OLS), violations of regression assumptions, hypothesis testing, and the general linear model. In addition, the emphasis of this course is on the acquisition and understanding of analytical techniques such as basic concepts of statistics (descriptive and inferential statistics, probability distributions), simple linear regression, multiple linear regression, logistic regression, and log-linear model.",
    "schedule": "Week 1 Introduction to probability distribution, sampling distribution, and estimation\nWeek 2 Decision making for a single sample and two samples: Estimation, hypothesis testing, inference on the mean of a population, goodness of fit test – Part I\nWeek 3 Decision making for a single sample and two samples: Estimation, hypothesis testing, inference on the mean of a population, goodness of fit test – Part II\nWeek 4-6 Simple linear regression – Part I, II, III\nWeek 7-9 Multiple linear regression – Part I, II, III\nWeek 10 Model adequacy checking\nWeek 11 Transformation and weighting to correct model inadequacies\nWeek 12 Diagnostics for Leverage and Influence\nWeek 13 Polynomial regression analysis\nWeek 14 Submission of interim project report and presentation – I\nWeek 15 Logistic regression\nWeek 16 Indicator variables, Generalized linear models\nWeek 17 Submission of final project report and presentation\nWeek 18 Final exam, Submission of final project report",
    "scorePolicy": "1. Final Exam: 40 %\n2. Team or individual project: 50 %\n3. Attendance: 10 %",
    "materials": "Introduction to Linear Regression Analysis, Douglas C. Montgomery, Elizabeth A. Peck, G. Geoffrey Vining (Wiley)",
    "consultation": "Email or i-school system.Office hour: Thursday 11:00 ~ 12:00",
    "remarks": "MS teams",
    "foreignLanguageTextbooks": true
  }
]
