[
  {
    "name": "陳起鳳",
    "email": "cfchen@ntut.edu.tw",
    "latestUpdate": "2023-12-21 09:31:36",
    "objective": "In order to preserve water quantity, to protect water quality, and to conserve soil and water resources, it is necessary to institute appropriate land use regulations in a watershed. In general, it is included water resources utilization, water quality control and management. Therefore the major topics are water resources tendency, water law, water right, point and non-point sources pollution control, ground water management, public participation, ecological working method, etc. With appropriate public participation, the government can work together with people in community development in a manner which will enrich local cultural characteristics, and provide ideas for a sustainable growth, which would lead to a high quality of life and also would protect the watershed's ecology . The ultimate goal of making these efforts is to achieve a \"water-soil-trees-men\", four-win situation.\n為涵養水量、維護水質以及保育水土資源，對於集水區內土地的使用，應有適當的規劃與管理牽涉的問題，一般以水資源利用、水質控制、管理計畫等課題加以涵括。因此本課程包含水資源情勢分析、水利法規、水權管理、點源及非點源污染管理、地下水規劃與管理、民眾參與及生態工法於集水區治理工程之應用等，俾提供適度發展及兼顧自然生態機能的集水區社區總體生活，達成「水、土、林、人」四贏之水資源保育總體目標。",
    "schedule": "The course schedule is listed as follows but it might be adjusted the order during the semester. \n\nWeek 1: Introduction\nWeek 2: The basic principles and elements of watershed management\nWeek 3-4: The basic hydrologic methods (rainfall and runoff model)\nWeek  5-6: The basic water quality mechanism \nWeek 7-8: Soil erosion\nWeek 9: midterm exam\nWeek 10: Water and soil conservation methods\nWeek 11-12: Pollution sources control methods (point sources and nonpoint source pollution)\nWeek 13-14: Practical engineering and measures \nWeek 15: cost and benefit analysis \nWeek 16-18: Final reports",
    "scorePolicy": "In-class performance and attendance: 10%\nMidterm exam: 25%\nShort reports: 15%\nFinal reports: 50%",
    "materials": "I will use my self-made materials, and give some references for you as reading materials.",
    "consultation": "You can reach me by my email: cfchen@ntut.edu.tw.Or you can find me in my office hour.",
    "remarks": "The class is related to SDG 6, 13, and 15.",
    "foreignLanguageTextbooks": true
  }
]
