[
  {
    "name": "吉塔",
    "email": "sangeetha@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-18 11:44:56",
    "objective": "ENERGY ENGINEERING is a branch of Engineering science that deals with production, transformation, transmission, storage and use of energy and is the most recent engineering disciplines to emerge. \nThis course 'ENERGY ENGINEERING’ is a basic course taught entirely in English. \nThe aim of this course is to provide introductory knowledge to students who have not studied Environmental Energy Science as a subject. \nStudents can gain basic knowledge about Energy sources, production of energy, Energy Management, Energy Laws and most importantly about Bioenergy Engineering. \nThis deals with sustainable methods of producing clean energy and thereby preventing hazardous environmental issues through significant energy efficiency improvements and sustainable use of resources.\nThis course also has an important objective of motivating non-native English students to improve their English language skills like conversing, discussing and writing assignments in English.\nThese practices will help them deliver better English presentations and also enhance their thesis and paper writing abilities.\nWeek 1: Energy Engineering - Introduction and Basics\nWeek 2: General Energy sources\nWeek 3: Energy Management Strategies \nWeek 4: Bio Energy Engineering \nWeek 5: Renewable Energy resources\nWeek 6: Hydrogen Energy Engineering\nWeek 7: Energy Farming\nWeek 8: Environmental Energy Laws and Regulations\nWeek 9: Midterm Exam \nWeek 10: Sustainable Development Goals (SDGs)\nWeek 11: Biofuel Engineering\nWeek 12: Fuel cells and their types \nWeek 13: Nuclear Energy\nWeek 14: Energy and Buildings\nWeek 15: Sustainable Conversion Technologies\nWeek 16: Green Architecture\nWeek 17: Energy Tourism\nWeek 18: Final Exam",
    "schedule": "1. The students of this class will be separated into groups for weekly presentation purposes and every week the Teacher will assign a topic for the presentation.\n2. In every class, the Teacher will initially finish the power point presentation\n3. Then one person from every group has to give his/her presentation\n4.The students can use Powerpoint and YouTube videos to make their presentations interesting",
    "scorePolicy": "1.The Teacher will conduct one Midterm exam and one Final exam throughout the semester\n2. The questions for the exams will be from the power-point presentation of the Teacher. \n3. The total score of exam will be for 100 marks, in which the Teacher will consider the assignment marks, class attendance and the weekly presentation of every student.\n4.The final score will be for 100% and it will be a sum of evaluations as 50% (from the final written exam) 25% (from the Midterm exam score) 15% (from the class presentations) 10% (from class attendance and attentiveness).",
    "materials": "1.\tThe Teacher will not use any textbooks/bibliography materials for the class.\n2.\tThe students will have to study the Powerpoint presentations prepared and taught by the Teacher in every class.",
    "consultation": "The Teacher of this course will follow all rules and practices which will make the class interesting to the students.The students will have a new experience in learning and improving English skills",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
