[
  {
    "name": "簡良翰",
    "email": "lhchien@ntut.edu.tw",
    "latestUpdate": "2023-12-21 13:43:35",
    "objective": "本課程之目的為訓練學生計算冷凍空調設備之蒸發器、冷凝器之熱傳與壓損的能力，以提升冷凍空調設備之設計能力。內容包括兩相流之流譜分析與動量方程式、兩相介面之表面張力作用、熱沸騰與冷凝等相變化之基本現象、兩相流之沸騰與冷凝熱傳性能之計算與分析、兩相流之流力現象分析與壓損之計算、蒸發器與冷凝器之熱傳增強技術等。\nThis course offers traning of advanced design techniques of evaporators and condensers in the HVAC & R applications. The subjects in this course are: the two phase flow regime, analysis of momentum and energy equations for two phase flow, method of prediction of pressure drop of two phase flow, fundamental phenomena of condensation and evaporation, calculation of heat transfer coefficient of convective condensation or evaporation, heat transfer enhancement techniques for condensation and evaporation.",
    "schedule": "週次 / Week\t 授課內容 /Topic\n1\t兩相流簡介\tIntroduction of two phase flow and heat transfer\n2\t兩相流之流譜分析 Flow pattern analysis\n3\t沸騰與冷凝之熱傳計算 Calculations of boiling and condensation heat transfer\n4\t表面張力分析、熱管原理與應用 Surface tension and heat pipe\n5\t核沸騰原理與表面張力分析 Fundamentals of nuleate boiling and surface tension analysis\n6\t核沸騰原理與經驗公式、高效率沸騰表面  Boiling theory and emperical correlaitons\n7\tHoliday\n8\t冷凝基本現象與分析、Nusselt 平板及圓管冷凝理論 Fundamentals of condensation, Nusselt condensation theory for plates and circular tubes\n9\t期中考\tMidterm exam\n10\t兩相流之動量方程式與解析模型 Momentum equations and theoretical models of two phase flows\n11  兩相流之壓損計算 Pressure drop calculation of two phase flow\n12\t管內與管集之對流沸騰熱傳分析模型\tHeat transfer model of internal convective boiling flow and tube bundles\n13\t管內對流冷凝之熱傳分析與計算　Heat transfer analysis and calculation of internal convective flow condensation\n14\t噴淋式蒸發器之分析與計算 Analysis and calculation of falling film evaporator\n15\t兩相熱對流之計算模型與經驗公式彙整\tSummary of two phase flow convection model and correlations\n16  熱質傳原理  Principles of heat and mass transfer\n17\t熱質傳之冷凝器應用\tApplication of teat and mass trasnfer oncondensers\n18\t期末考 Final exam",
    "scorePolicy": "Homework: 30%, Midterm: 30%, Final Exam: 25%, Term report:15%.",
    "materials": "1.\tVan P. Carey, 1992, Liquid-vapor Phase Change Phenomena, Hemisphere Publishing Corporation. *\n2.\t王啟川，「熱交換器設計」，五南圖書出版公司，民國九十年。*\n3.\tCollier, John G. and Thome, John R., 1996, Convective Boiling & Condensation.  3rd ed., Oxford University Press, Incorporated. \n4.\tWebb, R.-L. and Kim, N.-H., 2005, Principles of Enhanced Heat Transfer, John Wiley and Sons Inc., New York, 1993.\n5.\tWhalley, P. B., 1996, Two-Phase Flow & Heat Transfer, Oxford University Press, Incorporated.\n6.\t「熱管簡介」，石育政、劉子銘。\n7.\tFaghri, A., 1995, Heat Pipe Science and Technology, Chapter 3, Taylor and Francis.\n8.\t「沸騰相關文獻回顧」，張千喬。\n9.\tThome, J. R., 2004, Engineering Data Book III, Chapter 3, Wolverine Tube Inc.\n10.\tJung, D., An, K., and Park, J., 2004, “Nucleate Boiling Heat Transfer Coefficient of HCFC22, HFC134a, HFC125, HFC32 on Various Enhanced Tubes,” Int. J. of Refrigeration, Vol. 27, pp. 202-206.\n11.\t Webb, R. L., 2004, “Odyssey of the enhanced boiling surface,” J. of Heat Transfer, Vol. 126, no. 6, pp. 1051-1059 . \n12.\t簡良翰、鄭全宏，2005，” 噴淋式蒸發器之熱傳性能預測新模型”，冷凍與空調期刊，33 期，頁：75-84。\n13.\tWebb, R. L., and Gupte, N., 1992, “A Critical Review of Correlations for Convective Vaporization in Tubes and Tube Banks,” Heat Transfer Engineering, Vol. 13, no. 3, pp. 58-81.\n14.\tShah, M. M., 1979, “A General Correlation for Heat Transfer During Film Condensation inside Pipes,” Int. J. Heat Mass Transfer, Vol. 22, pp. 547-556.\n15.\tChun, K. R., and Seban, R. A., 1971, “Heat Transfer to Evaporation Liquid Films,” J. of Heat Transfer, Vol. 93, pp. 391-396.\n16.\tASHRAE Handbook, 2005, Chapter 4: Two Phase Flow, ASHRAE.",
    "consultation": "1. 課程諮詢時間 Office hour: Mon. 3:00~6:00pm, Wed. 1:00~4:00pm2. 開學後組成線上群組 Line group discussion: to be announced.",
    "remarks": "本學期課程因應疫情警戒上課方式，請依照學校網頁所公布之訊息為準：遠距上課授課及評量方式說明如下：1. 上課方式：線上會議室 Microsoft Teams2. 課程資訊 line 群組: to be announced.3. 評量方式：期中考、期末考改採自主測驗 (take home exam) 加線上口試。",
    "foreignLanguageTextbooks": true
  }
]
