[
  {
    "name": "黃秀英",
    "email": "hhwang@ntut.edu.tw",
    "latestUpdate": "2023-12-11 10:56:43",
    "objective": "The course focuses on the fundamental theory and concept of \"Engineering Optimization Methods\", \"Linear Programming\", \"Nonlinear Programming\", \"Multi-objective Function Optimization\", \"Modern Mathematical Planning Methods\", and \"Cross-Attribute System Optimization.\" Hands-on practices using optimization software, and term projects are some key elements. Students will report out their own term project at the end of the semester. \n\nIn this semester, University Social Responsibility (USR) concept is brought into the class. Encourage student to participate the USR project. Guide students to apply the optimization method in the thinking and planning process. Through the study, students can have better understanding about the optimization principle and apply it to the daily activities. It is expected that students can apply what have learned in the classes to their own daily activities, vehicle design, and research applications; and combine USR project into the term projects. (Taught in English)",
    "schedule": "a. Week   b. Topic\n1\tSyllabus and Introduction to Design (Ch1) -- A general overview of the \n        course. The USR program is introduced into the class. Off-campus visits \n        to county-side schools will be arranged. Students are encouraged to\n        participate in the USR project. Guide students to apply optimal methods in\n        the planning and design of the USR program.\n2\tOptimum Design Problem Formulation (Ch2)\n3\tOptimum Design Problem Formulation (Ch2) -- Arrange USR model car \n        for 3D printing utilizing lightweight optimization design approach for the\n        coming Friday USR activities.\n4\tGraphical Optimization (Ch3) -- Introduce the concept and application of\n        lightweight design. With limited materials, using USR project’s target\n        vehicle as an example (for the USR preparation), we optimize/reduce\n        vehicle materials.\n5\tOptimum Design Concepts (Ch4) -- introducing the design concept for\n        electric vehicles. Using the commercial codes for optimization design \n        analysis to improve the strength of the body structure of the USR project’s\n        target vehicle. \n6\tOptimum Design Concepts: Global & Lagrange Multipliers (Ch4)\n7\tOptimum Design Concepts: KKT (Ch5)\n8\tLinear Programming: Initial Basic Feasible Solution (Ch6) -- Lightweight \n        USR vehicle is arranged on the coming Friday activities.\n9\tLinear Programming (Ch6)\n        Midterm Exam.\n        Define project.  Report outline due next week.\n10\tLinear Programming: Duality (Ch7);\n        Numerical Methods for Unconstrained Design (Ch8)\n11\tNumerical Methods for Unconstrained Design (Ch 8&9)\n12\tNumerical Methods for Unconstrained Design (Ch9) -- Arrange field trip to\n        introduce USR program and electric vehicles to promote off-campus \n        teaching\n13\tNumerical Methods for Constrained Design (Ch10) -- Invite industry\n        experts to share, introduce the design of electric vehicles, and how to use\n        the USR vehicle as an example to conduct various optimization design\n        and analyses.\n14\tNumerical Methods for Constrained Design (Ch 10&11)\n15\tNumerical Methods for Constrained Design (Ch11)\n16\tPractical Design Optimization (Others)\n17\tProject Presentation -- Groups participating in the USR project report their\n        optimal design for different systems, and/or sub-systems.\n18\tClass Review & Final Exam --  After the final exam of the semester, 2 field\n        trips for USR program are arranged to promote the application of electric\n        vehicles.",
    "scorePolicy": "1.\tMidterm Exam：20 %\n2.\tFinal Exam: 26%\n3.\tHomework：24 %\n4.\tProject written report (12%),Project oral presentation (12%)\n5.\tIn-class discussion, participation & attendance (6%)\n6.\tHomework is due a week away from the day assigned.\n                   2 points would be subtracted per each single day delay,\n                   Delaying for 2 days or more would get no point.\n7.\tReport is due the day of the oral presentation.\n                   3 points would be subtracted per each single day delay.\n                  Delaying for 4 days or more would get no point.\n8.\tCopy and cheating are not allowed.\n                  If found copy and cheating, 0 point for the events.",
    "materials": "Class Title: \t        Engineering Optimization Methods and Applications\nClass Schedule：\t6:30-9:20 PM, Monday (Please base on the course schedule posed on Academic Affairs Office web.)\nClassroom: \t        610 , Integral Complex Building (Please base on the course schedule posed on Academic Affairs Office web.)\nTextbook：\t        Introduction to Optimum Design by Jasbir S. Arora;\n                                Publisher: Elsevier Academic Press\nReference： \t        Numerical Optimization Techniques for Engineering\n \t         \t        Design by Gary Vanderplassts;\n \t        \t        Publisher: McGraw-Hill\n \t         \t        It’s illegal to make copies of textbook or reference books.\nMethodology & Activities：\n1.\tTextbook lead\n2.\tIn-Class Discussion\n3.\tDemonstration\n4.\tHomework/Project Discussion\n5.\tPractical Examples Discussion\n6.\tComputer Aided Teaching Exercise\nOthers:\nInstructor:\tHsiu-Ying Hwang\nOffice Hour:\t8:00-12:00, 1:00-3:00, Tuesday (reference only). \n\t\t\tPlease e-mail or call to make an appointment prior the meeting.\nEmail: \t\thhwang@mail.ntut.edu.tw\nOffice \t\tRoom 526-12, 5th Floor, Complex Building,\nTEL: \t\t(02) 27712171 ext 3618",
    "consultation": "Office Hours: 09:00-16:00 Tuesday (reference only). Please email me first.Email: hhwang@mail.ntut.edu.twOffice: Room 526-12, 5th Floor, Complex BuildingTEL: (02) 27712171 ext. 3618",
    "remarks": "By default, we will have in-classroom course.The classes will be adjusted according to the COVID19 condition. If needed, the classes will run online remotely.The link for GoogleMeet:https://meet.google.com/hbe-npat-gpuThis course introduces USR program which is linked with SDG 11 and 4. SDGs:11.Make cities and human settlements inclusive, safe, resilient and sustainable；4.Ensure inclusive and equitable quality education and promote lifelong learning opportunities for all.",
    "foreignLanguageTextbooks": true
  }
]
