[
  {
    "name": "蔣欣翰",
    "email": "hsinhan1001@gmail.com",
    "latestUpdate": "2023-12-12 18:26:27",
    "objective": "透過自駕車理論與實務的課程講述，以及搭配業師實作經驗分享，除可以使修課同學對自駕車研究有基本概念之外，也可以藉本堂課引發對新興車輛技術研究領域與其實際應用之興趣。本課程涵蓋內容為自駕車軌跡規劃與控制、先進駕駛輔助控制設計、自駕車感知資料處理及物件偵測演算法、及 AI 技術應用於自駕車相關功能設計。本課程根據授課主題搭配實驗單元與期末專題，配合使用 Matlab/Simulink、CarSim、Python、AI ToolBox 等工具軟體，讓修課同學可應用課堂所學來進行自駕車演算法與技術開發，及透過模擬結果分析與驗證。\nThis course aims to teach the lessons of autonomous vehicle (AV) theory and practical applications. Moreover, with the experience sharing and cooperative lecturing from industrial experts, students can gain more knowledge about the fundamental concepts of AV research. The course introduces major contents including path planning and tracking control design, advanced driver-assistance systems (ADAS), perception data processing and detection algorithms, and AI-based technologies in the applications of AV. The course will arrange some labs and the term project to provide students, through conducted simulation analysis and verification, with an in-depth understanding of the emerging technology of AV.",
    "schedule": "Week 1: 課程簡介與自駕車應用與發展趨勢\nWeek 2: 自駕車系統介紹\nWeek 3: 自駕車關鍵技術與模組\nWeek 4: 自駕車控制設計與模擬 (I)\nWeek 5: 自駕車控制設計與模擬 (II)\nWeek 6: 自駕車開發工具介紹與使用 (I)\nWeek 7: 自駕車開發工具介紹與使用 (II)\nWeek 8: 自駕車模擬技術及延伸應用\nWeek 9: Midterm\nWeek 10: 自駕車感知技術應用設計 (I)\nWeek 11: 自駕車感知技術應用設計 (II)\nWeek 12: 自駕車規劃與決策開發\nWeek 13: 自駕車 AI 應用介紹 (I)\nWeek 14: 自駕車 AI 應用介紹 (II)\nWeek 15: 自駕車強健性與安全\nWeek 16: 自駕車系統設計驗證與探討\nWeek 17: 未來展望 (業界專家分享)\nWeek 18: 期末專題與報告",
    "scorePolicy": "Home Work: 40%\nMidterm Exams: 30%\nTerm Project: 30%",
    "materials": "1. Reference Book: \nHarald Waschl, Ilya Kolmanovsky, Frank Willems, Control Strategies for Advanced Driver Assistance Systems and Autonomous Driving Functions. Springer, 2019, ISBN 978-3-319-91569-2 (eBook). \n\n2. 自編講義，教材內容參考外文原文書及期刊等資料。",
    "consultation": "每周課程結束後，以及助教及教師諮詢時間，同學可前往實驗室或教師辦公室討論授課內容相關問題。",
    "remarks": "本學期原則採實體授課方式；因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準。(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 1. 相關課程公告與相關事項將會發布於 Google classroom (開學後建立)。2. 若因 COVID-19 疫情影響將提供 Google Meet 或 Microsoft teams 線上同步教學。",
    "foreignLanguageTextbooks": true
  }
]
