[
  {
    "name": "吳南葳",
    "email": "nwwu@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-11 20:55:28",
    "objective": "This course mainly discusses the development of modern Taiwanese architecture since the Japanese colonial period. The historical development of Taiwanese architecture could be divided into traditional Han architecture and modern architecture with Japanese and western influences. Based on the timeline, three themes will be introduced: (1) the background of Taiwanese modern architecture, (2) Taiwanese architecture during the colonial period, (3) Taiwanese architecture after the Second World War.",
    "schedule": "1.\tIntroduction to the course, clarification of historiography, periodization and systems of knowledges\n\nTheme 1 background\n2.\t1-1 Pre-historic architecture and indigenous people before the 17th Century\n1-2 Dutch and Spanish occupation and architecture in the 17th Century\n3.\t1-3 Han people’s religious architecture, settlements and grand residences and Western style architecture during the Qing Dynasty\n\nTheme 2 Japanese colonialism\n4.\t2-1 introduction to Japanese modern architecture\n5.\t2-2 Improvement of construction materials and techniques during the Japanese colonial period\n6.\t2-3 Architectural development under vernacular consideration during the Japanese colonial period\n7.\t2-4 Western style architecture in colonial Taiwan\n8.\t2-5 Traditional Japanese architecture in colonial Taiwan\n9.\tMid-term week: students’ discussions of topics and outlines of final reports\n\nTheme 3 Post-war to the Present\n10.\t3-1 Introduction to New modern architecture in the first half of the 20th century in China\n11.\t3-2 Modernism after the Second World War with Japanese influences\n12.\t3-3 Modernism after the Second World War with western influences\n13.\t3-4 New Chinese Classical Style architecture after the Second World War\n14.\t3-5 Regionalism after the Second World War\n15.\t3-6 Diverse development after the Second World War in the 20th century\n16.\t3-7 Diverse development since 1990s to the present\n17.\tFinal week: final report\n18.\tHoliday",
    "scorePolicy": "1. Attendance 20% (students will not get the score of attendance if the number of absence is more than 4.)\n2. Participation 30%\n3. Mid-term Presentation 20%\n4. Research thesis 30%\n\n2.\tDetail of \"Participation\"\nEach participant needs to prepare a brief introduction to the (non-architectural) social background of one cultural period of time. This will be the tuned in of the class of the day for 20 minutes.\n(Week 02) Dutch and Spanish Empires in the 17th Century (relationship with the world)\n(Week 03) 17th. C. to 19th. C. China (relationship with the rest of the world)\n(Week 04) Japan before 1895 (westernization)\n(Week 05) Japanese colonial power in Taiwan and China \n(Week 10) social background in the first half of the 20th-century China\n(Week 11) Japanese architecture after WWII \n(Week 12) global modernist architecture esp. after WWII\n(Week 13) ideology of Chinese origin before and after 1945 (from 1940s to 1960s)\n(Week 14) global trends of architectural regionalism\n(Week 16) from postmodern architecture to Deconstructivism in the world\n\n3.\tDetail of \"\tMid-term presentation\": proposal for the final report 20%\nIn the first half of the courses, students have to outline their interests of Taiwanese architecture in certain approaches. They might be architectural styles (ex. Regionalism, modernism, etc.), structural systems, materials (ex. Brick, RC, etc.), particular types of architecture, one or two individual architects, etc. Students should present their plans of their final reports in the mid-term class about 10 minutes, in order to collect some feedback from colleagues and class instructor for further develop to achieve the final report.\n\n4.\tDetail of \"\tResearch thesis\": 30%\nOne should submit his/her thesis by 6/15 12:00pm to Dr. Wu. The words of the thesis should not be less than 3000 words. It should be in thesis format (word) instead of brief presentation format (power point).\nThe final report should present the development and influences from the past to the present (or particular period).",
    "materials": "Fu, Chao-Ching, 2014. A History of Modern Architecture in Taiwan. Taipei: Architectural Institute of Taiwan\nCaptivating History, 2019. History of Taiwan: A Captivating Guide to Taiwanese History and the Relationship with the People's Republic of China. CH Publications.\nDavison, Gary Marvin, 2003. A Short History of Taiwan: The Case for Independence. Praeger.\nSadler, A. L. 2011. Japanese Architecture: A Short History. Tuttle Classics.",
    "consultation": "please email (nwwu@ntut.edu.tw) to confirm the consultation time",
    "remarks": "If being influenced by covid-19 pandemic, the class will be held virtually via Microsoft Teams with the link provided later here. Any inquiry can be sent directly to the instructor through nwwu@ntut.edu.twSDG 8 Decent Work and Economic GrowthSDG 9 Industry, Innovation and InfrastructureSDG 11 Sustainable Cities and CommunitiesSDG 17 Partnerships for the Goals",
    "foreignLanguageTextbooks": true
  }
]
