[
  {
    "name": "耿慶瑞",
    "email": "cjkeng@ntut.edu.tw",
    "latestUpdate": "2023-12-15 15:39:52",
    "objective": "以消費者為重心已蔚為目前市場行銷的重要潮流。了解消費者決策過程也成為行銷領域研究的主流。一般而言，消費者的購買決策制定過程決定產品與服務的購買結果，主要包括五個階段：(1) 問題察覺、(2) 資訊搜尋、(3) 方案評估、(4) 購買選擇、(5) 購後過程。消費者的購買決策制定過程深受各種不同因素之影響。本課程強調如何藉由理論概念、實例討論與實作方式進一步了解消費者，並將此知識應用於行銷策略上。此外網際網路為一整合媒體，有別於傳統之行銷環境，在網際網路上消費者與媒體可以產生高度的互動，並且也可能產生虛擬經驗。本課程也從消費者行為理論出發，探討在網際網路環境下之消費者行為。課程以哈佛式個案討論為主。",
    "schedule": "次\t主題\t內容與個案\n1.\t\t課程介紹\t分組 網路資源介紹 個案討論方法介紹\n2.\t\t消費行為概論\tCh1-Ch3 與補充資料\n3. \t消費行為概論\tCh1-Ch3 與補充資料\n4. \t購買後行為\tCh3\n哈佛商學院 HBS Case1: IKEA\n1. 請分析採購家俱的消費者行為，通常消費者會有哪些困難？\n2. 家俱業者提供哪些服務來解決困難？\n3. 分析美國的家俱市場\n4.IKEA 提供給消費者什麼價值？商業模式為何？\n5.IKEA 如何在美國拓展市場？\n5. \t消費者動機、涉入與價值觀\n\n數位行銷\tCh4\n哈佛商學院 HBS Case2:  Starbucks China: Managing Growth Through Innovation \n1. 請解釋 Starbucks 在中國成功的因素？他所提供的顧客價值與品牌形象為何？\n2. Starbucks 與競爭對手之差異為何？有何競爭優勢？\n3.StarBucks 應該要提出怎樣的擴張方案？如何展店？\n4.Starbucks 要如何在中國建立數位服務策略？\n\n6.\t參考群體與創新\nAPP 應用\tCh 12\n哈佛商學院 HBS Case3: ASICS\n1. The company is considering changes to the marketing mix of the core ASICS brand. What would you recommend going forward on issues such as:\n i. Product line (e.g., introducing mid-tier ASICS running shoes at a much lower price point) \nii. Channels to market (e.g., increasing company owned retail stores) iii. Communications (e.g., changing the current ad campaign of “Want it More” and discontinuing sponsorship of the NYC marathon)\n2. Was it wise for ASICS to acquire the fitness app RunKeeper? How can the company best leverage this new digital asset? \n3. Do you feel the company is on the right track to achieving its 2020 goals?\n\n7. \t家庭與創新\n\tCh14\n哈佛商學院 HBS: Case4: Swatch\n1. Why was the Swatch so successful? In what ways was the Swatch different than any watch the industry had ever seen?\n2. What elements of the original Swatch marketing plan were most critical to the brand’s success? Do you agree with the original product strategy? the channel strategy? The promotional strategy? What about the pricing strategy? \n3. Prior to the introduction of the Swatch, what kinds of watches were popular among consumers? In what ways was a Rolex different from a Timex, or from a gold-plated Seiko? How did consumers make buying decisions\n8. \t消費者知覺、學習與記憶\t佛商學院 HBS Case5: 2010 Cola Wars Continue: Coke and Pepsi in the Twenty- First Century\n\n1. Why is the soft drink industry so profitable?\nCompare the economics of the concentrate business to the bottle business: why is the profitability so different?\nHow has the competition between Coke and Pepsi affected the industry’s profit?\nCan Coke and Pepsi sustain their profits in the wake of flattening demand and the glowing popularity in non-carbonated drink?\n\n9. \t社群媒體與病毒行銷\t哈佛商學院 HBS:Case 6 Dove\n1. What is a brand? Why does Unilever to want fewer of them? \n2. What was Dove’s market positioning in the 1950s? What is its positioning in 2007? \n3. How did Unilever organize to do product category management and brand management in Unilever before 2000? What was the corresponding structure after 2000? How was brand meaning controlled before 2000 and how is it controlled at the time of the case? \n4. Spend a little time searching blogs, using Google Blog Search, Technorati, BlogRunner, or any other blog search engines, to get a sense of what people are saying about Dove today. What does this discussion contribute to the meaning of the brand?",
    "scorePolicy": "10.\t個案整理\tCase review 1-6\n11\t社群媒體\t Case 7: Tripadvisor\n1. 為何 Tripadvisor 會吸引消費者？為何消費者會願意寫口碑\n2. 飯店對 Tripadvisor 的想法如何？Tripadvisor 如何取得飯店與消費者的平衡\n3.Tripadvisor 如何將口碑轉成利潤？與 Yelp 有何差異？\n4.Tripadvisor 未來成長的建議？\n\n12\t社群媒體與平台\t哈佛商學院 HBS Case8: Uber\n1.\t請分析消費者在搭乘汽車的消費行為，並與 Uber 及其競爭者比較。\n2.\t請評估 Uber 之 APP 有何優缺點\n3.\t你對 Uber 的服務行銷有何建議？台灣與大陸市場有何建議？\n4.\t共享經濟的營運模式成功要素為何？\n13\t互動行銷\n\t補充互動行銷\n哈佛商學院 HBS: Case9: Predict Customer Tastes with Big Data at GAP\n1. Why is Gap doing poorly in 2017? \n2. Was Peck correct in firing his creative directors and replacing them with a big data-driven creative process? Why or why not? \n3. What do you predict will happen to Gap Inc.’s sales going forward as a result of this decision? How will it affect each of its brands’ equity?  \n4. Does the big data approach work for all three of Gap Inc.’s primary brands: Old Navy, Gap, and Banana Republic? Why or why not? Which brands are better/worse served by this strategy? Why？\n14\t消費者態度\n與情緒\tCh7-8\n哈佛商學院 HBS: Case10: Marvel\n1. 請問 Marvel 的 Vice Chairman Peter Cuneo 應該要追求何種的策略方向？\n2. 為何 Marvel 的轉型是成功的？你認為這個成功只是暫時的？還是會持續的？\n3. 請說明 Marvel 漫畫（comic books），玩具 (toys) 與授權 (licensing) 三個事業部的重要性？以及三者有何綜效？\n4. 你是否認為 Marvel 的成功只靠著蜘蛛人一個角色？Marvel 是否該發展一些較不知名的角色？要如何做？\n15\t互動行銷\tCASE11: Shop Kick\n  1. 說明目前 shopkick 的營運模式\n 2. 消費者使用 shopkick 的動機為何？會持續使用嗎？\n 3.shopkick 是否要發展大數據業務？\n\n16\t互動行銷\t哈佛商學院 HBS: Case12: Sony-Eyetoy\n1. Is EyeToy an important product for Sony? What role does EyeToy play within Sony Computer Entertainment Europe’s (SCEE) strategic objectives?\n2. Although sales figures for EyeToy Play have been impressive, those for EyeToy Groove have been disappointing. What are reasons for Play’s phenomenal success -- and Groove’s failure to emulate Play’s performance?\n3. If you were Phil Harrison, would you continue to invest in the development and marketing of EyeToy software? If so, how much? Why?\n4. What EyeToy software should Sony focus on in the coming years? Which of the concepts currently in the pipeline is the most attractive? More generally, what is the ideal EyeToy development pipeline? Why?\n5. What is the appropriate marketing strategy for EyeToy products? Specifically, how should Sony advertise, price, and bundle its new products? Why?\n17.\t\tCase review 6-12\n18 \t期末考\tCase 1-12 take home exam",
    "materials": "消費者行為  Consumer Behavior 洞察生活、掌握行銷  Life and Marketing\n \n作者：曾光華\n出版日期 : 110 年\n書號 : MK302\n規格 : 471 頁 / 16K / 平裝 / 雙色\nISBN : 9789866264924\t\t\n哈佛商學院 HBS Case \n二、評分方式:\n個案討論 (40%)  個案心得報告 (30%) 期末考考個案 (30%)\n個案討論：共 12 個，所有同學需繳交 12 個心得 (哈佛商學院 HBS 個案) 報告，於當天上課時繳交\n本課以個案討論為主，講課或文選討論為輔。上課前必須準備好當天要討論之個案與文選。學生須準備篇個案，須於上課前繳交一頁個案問題與答案之書面資料。\n上課規則如下： 9:10—9:10 相關教材補充說明 10:10—10:40 休息時間與小組討論 (分 5 組，每組上課時抄兩個個案筆記) 10:40—12:00  80 分鐘個案討論 (請準時入座)",
    "consultation": "1. 請與授課老師耿慶瑞聯絡 cjkeng@ntut.edu.tw",
    "remarks": "1. 請與授課老師耿慶瑞聯絡 cjkeng@ntut.edu.tw2. 若因疫情需要遠距上課：遠距網址為:https://moe-tw.webex.com/meet/cjkeng3. 課程 line 群組會公告在本課程之 i 學園。",
    "foreignLanguageTextbooks": false
  }
]
