[
  {
    "name": "李鎮宇",
    "email": "G.C.Li@ntut.edu.tw",
    "latestUpdate": "2024-02-20 20:53:53",
    "objective": "As a master’s level elective, this course covers advertising and media through a solid understanding of culture, communication, society, and consumer behavior, with an emphasis on analysis-based decision-making. \n\nThis class teaches from a high strategic perspective—how C-level marketing directors determine the marketing and branding strategies, which get implemented by junior staff through advertising and media. This course is therefore NOT about learning how a marketing executive in a company uses Facebook, IG, and Google SEO to advertise online or in traditional media.\n\n\nFirstly, this course introduces the fundamental concepts relevant to understanding the development of strategies. Long before the execution of advertising and media campaigns by delegated, regional staff, marketing strategies are developed at a high level—drawing from an understanding of culture, communication, consumer behavior, as well as marketing and branding.\n\nSecondly, this class covers the practical skills necessary for the data analysis, which are used to to develop marketing strategies that underpin advertising and media campaigns. Rather than an abstract approach, this course also emphasizes knowing how to do—drawing from the strategy-setting practices in the top 100 international brands.\n\nTherefore, Students will also follow this process in the course. Students will 1) learn solid conceptual knowledge, 2) apply them to conduct data analysis, 3) determine marketing strategies, from which to 4) develop advertising and media plans that are evidence-based, coherent, and impactful.",
    "schedule": "1 2/22 Introduction\n2 2/29 1.1 Goals of advertisements\n3 3/7 1.2 Advertisement Cases\n4 3/14 Presentations\n5 3/21 2.1 Competitor analysis\n6 3/28 2.2 Customer Funnel, 2.3 Market Sizing\n7 4/4 Children’s Day /Tomb Sweeping Day\n8 4/11 3.1 Customer Segmentation\n9 4/18 Midterm week\n10 4/25 3.2 Customer Targeting\n11 5/2 4.1 Value Proposition\n12 5/9 4.2 Claim Substantiation\n13 5/16 4.3 RTB, 4.4 Media Strategy\n14 5/23 Questionnaire Design\n15 5/30 Data analysis\n16 6/6 Strategy Development\n17 6/13 Presentations\n18 6/20 Exam week",
    "scorePolicy": "Participation, Quizzes: 10%\nAnalysis 1-4: 60%\nFinal project:30%\nTotal: 100%",
    "materials": "Title: “Global Marketing & Advertising：Understanding Cultural Paradoxes”\nAuthor: Marieke de Mooij\nEdition: 5th or 6th\n\nhttps://www.tunghua.com.tw/portal_b10_cnt_page.php?button_num=b10&folder_id=861&cnt_id=8889\n\nhttps://www.books.com.tw/products/F014270653\n\nhttps://uk.sagepub.com/en-gb/eur/global-marketing-and-advertising/book274128",
    "consultation": "LINE or email the instructor",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
