[
  {
    "name": "李東明",
    "email": "tmlee@ntut.edu.tw",
    "latestUpdate": "2023-12-14 14:00:38",
    "objective": "Design is a quite multiplex domain, technical incarnation, esthetics performance and cultural symbol. And it is the union of the social, economics, technology, arts, psychology, and physiology. The course aims to structure students’ knowledge about the principles and theories of design, improve their abilities to appreciate the aesthetic sense and design works, and provide them with professional terminology. This knowledge constitutes the core which helps young practitioners to attain their artistic objectives and perform project work on a high professional level. This course is based on an overview of the modern design industry, expect to establish a panorama perspective on the subject of design thinking.\n設計是一個相當多元的領域，是技術的化身、美學的表現和文化的象徵。它是社會、經濟、技術、藝術、心理學和生理學的結合。本課程旨在構建學生對設計原理和理論的認識，提高學生對美感和設計作品的鑑賞能力，並為他們提供專業術語。這些知識構成了幫助年輕從業者實現其藝術目標並在高專業水平上執行項目工作的核心。本課程基於對現代設計行業的概述，期望建立一個關於設計思維主題的全景視角。",
    "schedule": "1st Week  Introduction of design and its relationship to the world around us\n設計概論及其與我們周圍世界的關係\n\n2ndWeek  In-depth exploration of Design elements\n設計元素的深度探索\n關於空間規劃 Space and Planning\nAs a nation we tend to dwell in small, poorly lit homes - the average lounge is about 15ft square. Llewelyn-Bowen explores how to make tiny rooms seem larger.\n\nBBC 室內設計規則 Design.Rules.\n'Design Rules' - the ultimate back-to-basics design programme explored the perceptions and facts of true design. Demonstrating that there should be no relationship between personal style and basic design rules, the programme explored the living spaces that we have inherited - real homes with all their character and shortcomings. \nhttps://v.youku.com/v_show/id_XMTMzNDI4NDQ4.html?spm=a2hbt.13141534.1_2.d_1_7&f=22812308\nhttps://www.youtube.com/playlist?list=PL1aj6wt3KDH0Asy2iAp2-EEcn3m7ewdEh\n\n\n3rd Week\tIn-depth exploration of Design elements\n設計元素的深度探索\n關於色彩 Colour\nLlewelyn-Bowen scoffs at the varieties of cream used in decorating, and uses a mix of bold colours to bring a Victorian house to life. Meanwhile, colour consultant Annabel Alton proposes that when choosing the shades to paint their houses, the nation's DIYers are reflecting collective moods of hope, sorrow or optimism.\n\n4th Week In-depth exploration of Design elements\n設計元素的深度探索\n關於照明 Light\nWith humans spending more time indoors than ever before, use of light has become a series issue. Laurence shows how to transform a room by maximising its natural light, and what effects can be achieved by atmospheric and moody lighting.\n\n5th Week In-depth exploration of Design elements\n設計元素的深度探索\n關於圖案及材質 Textures and Pattern\nLaurence Llewelyn-Bowen explains how bold motifs and textural interplay are important factors to consider for successful interior design.\n\n6th Week In-depth exploration of Design elements\n設計元素的深度探索\n關於陳設 Balance and Order\nWhat are the principal focal points within a room and how can they be used to best effect? In episode 5, Laurence Llewelyn-Bowen applies ancient rules of design that use focal points as energy lines.\n\n7th Week In-depth exploration of Design elements\n設計元素的深度探索\n關於個性 Personality\nIn the final programme of the series Laurence Llewelyn-Bowen demonstrates how the design rules can be applied to make a room that's completely individual.\n\n8th Week\tDesign Principles Overview – Design Works Off-campus visits\n設計原理實地探訪：優秀作品校外參觀\n9th Week\tDesign Principles Overview – Design Works Off-campus visits\n設計原理實地探訪：優秀作品校外參觀\n\n10th Week\tDesign Thinking: Design process and problem-solving Discussion\n設計思考：過程和問題解決討論（個人心得報告討論一）\n\n11st Week\tDesign Thinking: Design process and problem-solving Discussion\n設計思考：過程和問題解決討論（個人心得報告討論二）\n\n12nd\tWeek  Design Principles Overview – Design Process Group Report\n設計原則總覽：分組報告一\n\n13rd Week  Design Principles Overview – Design Process Group Report\n設計原則總覽：分組報告二\n\n14th Week  Design Principles Overview – Design Process Group Report\n設計原則總覽：分組報告三\n\n15th Week\tDesign Principles Overview – Design Works Off-campus visits\n設計原理實地探訪：新一代設計展校外參觀\n\n16th Week\tDesign Principles Overview – Design Works Off-campus visits\n設計原理實地探訪：新一代設計展校外參觀\n\n17th Week\tFinal Exam Week 期末考核週\n\n18th Week\t補教教學週　Supplementary teaching wee",
    "scorePolicy": "Usual grades: 20%\nReport absences, ask questions in class, and interact with teachers.\n平時成績：20%\n出缺席、上課提問、與老師互動討論。\nMidterm grade: 30%\nRead reports on books related to design principles and share them on stage.\n期中成績：30%\n設計原理相關書籍讀書報告，並上台分享。\nFinal grade: 50%\nAdopt the method of making reports by group. Each group chooses topics related to design principles to share on stage.\n期末成績：50%\n採分組製作報告方式。各組選擇設計原理相關主題上台分享。",
    "materials": "BBC 室內設計規則 Design.Rules.\nhttps://www.youtube.com/playlist?list=PL1aj6wt3KDH0Asy2iAp2-EEcn3m7ewdEh\nWilliam Lidwell、Kritina Holden、Jill Butler, Universal Principles of Design, Revised and Updated Edition, Massachusetts: Rockport Publishers, 2010.\n高橋佑磨、片山，劉小鳳 譯，圖解設計的原理。台北：不求人文化，2017。",
    "consultation": "Contact the teacher directly, or consult with the teacher's research room in 402. 直接與老師聯繫，或 406 教師研究室洽詢。Distance teaching adopts TEAMS software for online teaching, and is assisted by LINE groups. 遠距教學採 TEAMS 軟體線上教學，並以 LINE 群組輔助。",
    "remarks": "SDG11：建構具包容、安全、韌性及永續特質的城市與鄉村「永續城市」目標，在於透過住居、運輸、防災、環保、資訊建設、社會安全、民眾參與、文化傳承等不同面向，建構具包容、安全、韌性及永續特質的城市與鄉村。本課程透過理解設計史上的精彩作品，透過政治、宗教、技術、文化、氣候和地理因素影響下的背景梳理，利用設計思維的文化傳承，進而達到建構具包容、安全、韌性及永續特質的城市與鄉村的目標。",
    "foreignLanguageTextbooks": false
  }
]
