[
  {
    "name": "鍾仁傑",
    "email": "rjchung@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-12 03:46:14",
    "objective": "「仿生工程」是生物學到工程技術的觀念轉移，生物系統在上億年的演化驗證後已經達到高效且永續的精緻成果，本課程將介紹仿生工程之最新發展，師法自然將其應用於工程上將帶來革命性的突破。課程內容包含四大主題: (1) 仿生概述、(2) 生物製造技術、(3) 生物高分子與 (4) 生物材料於仿生技術上的應用。\n“Biomimetic Engineering” is a kind of knowledge transferring from biology to engineering technology. After billions of years of evolution, it has been proven that the biological system is highly efficient and sustainable. In this course, the latest progress in Biomimetic Engineering will be introduced. It will bring us revolutionary breakthroughs if we learn from nature and apply it to technology. The topics covered in this course will include (1) an introduction to bioinspiration, (2) biofabrication, (3) biomacromolecules, and (4) biomaterials and their application in bioinspired engineering.",
    "schedule": "Week1 Introduction to Biological (Natural) Materials\nWeek2 Basic Building Blocks: Amino acid, proteins, polysaccharides, lipids,\nminerals\nWeek3 Cells: structure and functions\nWeek4 Bio-mineralization\nWeek5 Silicate-based Composites: Diatoms, sea sponges\nWeek6 Calcium carbonate-based Composite: Mollusk shells, crustacean\nexoskeletons\nWeek7 Calcium phosphate-based Composite: Bone and teeth\nWeek8 Biological Polymers and Polymer-based Composites\nWeek9 Midterm test/report\nWeek10 Biological Elastomers\nWeek11 Cellular Solids (Foams)\nWeek12 Functional Biological Materials I: Adhesion and attachment\nWeek13 Functional Biological Materials II: Surface properties\nWeek14 Functional Biological Materials III: Optical properties\nWeek15 Bio-inspired and biomimetic materials: engineering approaches\nWeek16 Molecular-based Biomimetic\nWeek17 Final Presentation/Project\nWeek18 Final Exam",
    "scorePolicy": "期中考或期中報告 40%，期中課堂表現 10%。\nMidterm exam or midterm report 40%. Midterm class performance 10%.\n期末考或期末報告 40%，期末課堂表現 10%。\nFinal exam or final report 40%. Final class performance 10%.",
    "materials": "Biological Materials Science: Biological Materials, Bio-inspired Materials and Biomaterials/ M.A. Meyers and P.-Y. Chen. Cambridge University Press. 2014. pp1.630.",
    "consultation": "請課堂討論或 email 給授課老師 Please discuss in class or email to the professor.",
    "remarks": "因應疫情將使用 GOOGLE MEET 進行遠距教學 In response to the epidemic, GOOGLE MEET will be used for distance teaching.",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "魏暘",
    "email": "wei38@ntut.edu.tw",
    "latestUpdate": "2023-12-11 11:20:50",
    "objective": "“Biomimetic Engineering” is a kind of knowledge transferring from biology to\nengineering technology. After billions of years of evolution, it has been proven\nthat the biological system is highly efficient and sustainable. In this course, the\nlatest progress in Biomimetic Engineering will be introduced. It will bring us\nrevolutionary breakthroughs if we learn from nature and apply it to technology.\nThe topics covered in this course will include (1) an introduction to\nbioinspiration, (2) biofabrication, (3) biomacromolecules, and (4) biomaterials\nand their application in bioinspired engineering.",
    "schedule": "Week1 Introduction to Biological (Natural) Materials\nWeek2 Basic Building Blocks: Amino acid, proteins, polysaccharides, lipids,\nminerals\nWeek3 Cells: structure and functions\nWeek4 Bio-mineralization\nWeek5 Silicate-based Composites: Diatoms, sea sponges\nWeek6 Calcium carbonate-based Composite: Mollusk shells, crustacean\nexoskeletons\nWeek7 Calcium phosphate-based Composite: Bone and teeth\nWeek8 Biological Polymers and Polymer-based Composites\nWeek9 midterm report\nWeek10 Cellular Solids (Foams)\nWeek11 Functional Biological Materials I: Adhesion and attachment\nWeek12 Functional Biological Materials II: Surface properties\nWeek13 Functional Biological Materials III: Optical properties\nWeek14 Bio-inspired and biomimetic materials: engineering approaches\nWeek15 Molecular-based Biomimetic\nWeek16-19 Final Presentation/Project",
    "scorePolicy": "1. Class performance/absence 40%\n2. Regular reports 50%\n3. Final reports 10%",
    "materials": "Biological Materials Science: Biological Materials, Bio-inspired Materials and Biomaterials/ M.A. Meyers and P.-Y. Chen. Cambridge University Press. 2014. pp1.630.",
    "consultation": "1. Office hour2.  Line group",
    "remarks": "Due to the epidemic, we might be continuously revising the teaching methods:(1) Google Meet would be used for distance learning.(2) The course URL will be provided in Taipei Tech i-School.(3) Contact the teacher at rjchung@ntut.edu.tw/wei38@ntut.edu.tw.",
    "foreignLanguageTextbooks": false
  }
]
