[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2024-02-20 15:02:29",
    "objective": "The Learning objectives are as follows:\n1.\tTo learn key content/context /concept about Marketing in theory and in real-world application. And understand the change of marketing concepts and definitions to adopt the idea that Marketing is the art and science combination, \n2.\tThis course will also entail the main types of marketers and markets, and how they prospect into the marketplace. While in the marketplace, how the sellers and buyers are connected, and extend in target markets in a holistic approach.\n3.\tWith the corporate core value proposition, students will appropriate the key elements with the course process to design a suggested proper Semester-Long marketing plan project. \n4.\tTopics to pay attention to: the Core Marketing Concepts, Marketing Environment, both inside and outside the organization, TPS, Brands and offerings, Value and Satisfaction, Societal forces, Marketing Channel, Supply Chain, and other competition watch, which may affect the marketing result.",
    "schedule": "Week 01\tCourse Introduction\nChap. 1 -Defining Marketing for the New Realities\nWeek 02\tChap. 2 - Developing Marketing Strategies and Plans\nChap. 3 - Gathering Information and Forecasting Demand\nWeek 03\tPlan for Field Study| Research\nWeek 04\tChap 4 – Conducting Marketing Research\nWeek 05\tChap. 5 - Creating Customer Value, Satisfaction, and Loyalty\nChap. 6 - Analyzing Consumer Markets\nWeek 06\tChap. 7 - Analyzing Business Markets\nChap.8 - Identifying Market Segments and Targets\nWeek 07\tChap. 9 - Creating Brand Equity\nChap. 10 - Crafting the Brand Positioning\nWeek 08\tChap.11 - Competitive Dynamics\nWeek 09\tMid-term Exam by Group presentation\nWeek 10\tChap. 12 - Setting Product Strategy\nChap. 13 - Designing and Managing Services\nWeek 11\tInvite Speaker 講者邀請\nWeek 12\tChap. 14 - Developing Pricing Strategies and Programs\nWeek 13\tChap. 15 - Designing and Managing Marketing Channels and Value Networks\nChap. 16 - Managing Retailing, Wholesaling, and Logistics\nWeek 14\tChap. 17 - Designing and Managing Integrated Marketing Communications \nChap. 18 - Managing Mass Communications: Advertising, Sales Promotions, Events, and Public Relations\nWeek 15\tChap. 19 Managing Digital Communications: Online, Social Media, & Mobile\nWeek 16\tChap. 20 - Managing Personal Communications: Direct Marketing and Personal Selling\nWeek 17\tChap. 21 - Introducing New Market Offerings\nChap. 22 - Tapping into Global Markets\nWeek 18\tFinal-Exam (Final Report) Managing a Holistic Marketing Organization",
    "scorePolicy": "Evaluation/Assessments：\nMid Term    25%\t(Group Presentation-4-5 people in a group)\nFinal Term   25%\t(Paper Exam + Group Presentation)\nParticipation  50%  (30% Attendance on time got 2 points) (20% Class participation, such as asking and answering (questions)\n\tProof of documents required, such as sick leave notice can be provided later.\n\tA wrap-up presentation of the previous class may be required in the next class.",
    "materials": "1. Marketing Management: 7/E, An Asian Perspective, Philip Kotler,   Kevin Lane Kelle\n(Kotler, P., Keller, Kevin Lane, A Framework for Marketing Management: 6/E)\n\n2. Lampel, J., & Germain, O. (2016). Creative industries as hubs of new organizational and business practices. In. UK: Elsevier.\n\n3. Conley, J. G., Bican, P. M., & Ernst, H. Value Articulation: A Framework For The Strategic Management of Intellectual Property. California Management Review, 55(4), 102-120. doi:10.1525/cmr.2013.55.4.102. (2013)",
    "consultation": "Prescheduled is required.",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
