[
  {
    "name": "陳匡正",
    "email": "kchen34@gmail.com",
    "latestUpdate": "2023-12-22 20:57:54",
    "objective": "本課程最主要之目的，乃是讓修課之學生瞭解國際智財權重要的組織與條約文件，藉由課程之教授，使得學生能夠確實掌握這些基本之概念與議題。透過本課程之教授不僅使學生瞭解國際智財法之最新發展趨勢外，更從國際智財法與我國智財法之比較及鑑鏡，來瞭解未來現行法所需修改之方向。其實，本課程之進行，30% 以英文講授、70% 以中文講授，而且課堂教材以中文為主。\nMain proposes of this course are to let enrolled students understand international intellectual property organizations and treaties and make them understand these basic concepts and issues. Students will know new trends of international intellectual property law through teaching of this course and understand amendments of future Taiwan intellectual property legislation compared with international intellectual property laws and Taiwan intellectual property laws. In fact, the class lectures will be in English 30% and in Chinese 70%, and the class materials are in Chinese.",
    "schedule": "Week 1 (2024/2/19~2024/2/24) Introduction: Research Scopes of International Intellectual Property Laws\nWeek 2 (2024/2/26~2024/3/2) International Intellectual Property Law Organizations (I): World Trade Organization and World Intellectual Property Organization\nWeek 3 (2024/3/4~2024/3/9) International Intellectual Property Law Organizations (II): International Union for the Protection of New Varieties of Plants and European Union\nWeek 4 (2024/3/11~2024/3/16) International Intellectual Property Treaties Related to Copyright (I): TRIPS Agreement \nWeek 5 (2024/3/18~2024/3/23) International Intellectual Property Treaties Related to Copyright (II): Berne Convention\nWeek 6 (2024/3/25~2024/3/30) International Intellectual Property Treaties Related to Copyright (III): Rome Convention\nWeek 7 (2024/4/1~2024/4/6) Tomb Sweeping Day \nWeek 8 (2024/4/8~2024/4/13) A Lecture of Practical Teacher\nWeek 9 (2024/4/15~2024/4/20) International Intellectual Property Treaties Related to Patent: TRIPS Agreement, Paris Convention, Patent Cooperative Treaty and Patent Law Treaty\nWeek 10 (2024/4/22~2024/4/27) International Intellectual Property Treaties Related to Trademark (I): TRIPS (Trademark Rights and Geographical Indicators)\nWeek 11 (2024/4/29~2024/5/4) International Intellectual Property Treaties Related to Trademark (II): Paris Convention\nWeek 12 (2024/5/6~2024/5/11) International Intellectual Property Treaties Related to Trademark (III): Trademark Law Treaty, Singapore Treaty on the Law of Trademarks, Madrid Agreement Concerning the International Registration of Marks, Madrid Agreement Concerning the International Registration of Marks, and Lisbon Agreement for the Protection of Appellations of Origin and their International Registration\nWeek 13 (2024/5/13~2024/5/18) International Intellectual Property Treaties Related to Trademark (IV): Nice Agreement Concerning the International Classification of Goods and Services for the Purposes of the Registration of Marks, Vienna Agreement for Establishing an International Classification of the Figurative Elements of Marks; International Intellectual Property Treaties Related to Unfair Competition and Trade Secrets: TRIPS Agreement\nWeek 14 (2024/5/20~2024/5/25) International Intellectual Property Treaties Related to Plant Varieties: UPOV Convention\nWeek 15 (2024/5/27~2024/6/1) Final Week/A Week's Classes Suspension\nWeek 16 (2024/6/3~2024/6/8) Final Project Report (I)\nWeek 17 (2024/6/10~2024/6/15) Final Project Report (II)\nWeek 18 (2024/6/17~2024/6/22) Summer Vacation",
    "scorePolicy": "A.\n1.Final Project Report in English 80%\n(1)Oral Presentation 40%\n(2)Final Written Report 40%\n2.Class Attendance and Participation 20%\n\nB.\n1.Final Project Report in Chinese 65%\n(1)Oral Presentation 40%\n(2)Final Written Report 25%\n2.Class Attendance and Participation 35%",
    "materials": "1.PowerPoint.\n2.Chow, Daniel & Lee, Edward, International Intellectual Property: Problems, Cases, and Materials (Thomson/West, 2006).",
    "consultation": "1.E-mail of the Lecturer: kcschen@mail.ntut.edu.tw.2.Line Group Link:",
    "remarks": "※Level 1 & 2 Epidemic Alert: Classes in Person.※Level 3 or Above Epidemic Alert: Distance Learning.●Teaching Method: Distance Learning through Microsoft Teams.●Grades: Students Can Choose Either OneA.1.Final Project Report in English 80%(1)Oral Presentation 40%(2)Final Written Report 40%2.Class Attendance and Participation 20%B.1.Final Project Report in Chinese 65%(1)Oral Presentation 40%(2)Final Written Report 25%2.Class Attendance and Participation 35%",
    "foreignLanguageTextbooks": false
  }
]
