[
  {
    "name": "陳涵秀",
    "email": "gtaiwan@gmail.com",
    "latestUpdate": "2023-12-20 13:22:14",
    "objective": "This course aims to understand the concept of cultural preservation, and the methods of doing cultural preservation by examining different case studies in the world. Different issues related to cultural preservation are also discussed in this course, include the value and authenticity of cultural heritage, the representation and interpretation of culture, and reuse and management of cultural spaces. A creative practice of cultural preservation will be conducted in this course.",
    "schedule": "1. Ｗhat is culture?\n2. About cultural preservation，conservation, restoration.\n3. The development of cultural preservation policy \n4. The authenticity and value of cultural preservation.\n5. The intangible heritage preservation  \n6. Field trip \n7. The case studies of cultural preservation and creative practice in Taiwan\n8. The international case studies of cultural preservation and creative practice \n9. Mid term: Oral presentation\n10. Film screen  \n11. Personal fieldwork practice \n12. Oral presentation for personal fieldwork\n13. Method of fieldwork I Introduction \n14. Method of fieldwork II Observation \n15. Field trip \n16. Method of fieldwork III Interview \n17. External lecturer’s talk\n18. Oral presentation of cultural preservation and creative practice",
    "scorePolicy": "Course attendance 10%\nReading material oral presentation 20%\nMid term oral presentation 20%\nIndividual fieldwork note 20%\nFinal presentation and assignment 30%",
    "materials": "Ashworth, G., 2000 A Geography of Heritage: Power, Culture and Economy, Arnold\nKapila D. Silva and Neel Kamal Chapagain，2017，Asian Heritage Management: Contexts, Concerns, and Prospects，Routledge\nde Groot, Jerome，2016，Consuming History: Historians and Heritage in Contemporary Popular Culture，Routledge\nFalser, Michael，2015，Cultural Heritage as Civilizing Mission: From Decay to Recovery，Springer \n劉益昌，趙金勇，王嵩山，林會承，林修澈，李台元，2014，文化保存，五南  \n劉俊裕，張宇欣，廖凰，2015 ，臺灣文化權利地圖，巨流圖書公司  \n漢寶德，2014，文化與文創，聯經出版公司  \n李天鐸，2011，文化創意產業讀本：創意管理與文化經濟，遠流 \n文化部文化資產局 ，2013，進化：產業文化資產階段再生，文化部文化資產局",
    "consultation": "請 email 與授課教師預約",
    "remarks": "* 因應疫情防疫規定，依照學校公布調整教學方式，如為遠距教學，使用 Microsoft Teams 教學軟體（學校已開設各課程帳號群組）* 教師諮商時間與聯絡方式：請 mail 至 hhc@mail.ntut.edu.tw 聯繫諮商時間 * 防疫措施下之相關課程資訊，將公告至 i 學園系統。",
    "foreignLanguageTextbooks": true
  }
]
