[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2023-12-17 23:09:45",
    "objective": "This course is ONLY served to INTERNATIONAL students who are at Chinese INTERMEDIATE level. Exchange students are welcome to take it if it has vacancy. Students must be up to  B1 level(HSK4~5) or more than 18 months studying experience (more than 700 studying hours). It would be better that your English ability has been achieved to B1 at least for communicating with your classmates and teacher. You need to cooperate with people who are from multiple culture. \nThe course is based on the business situation, it will be included Chinese culture, thoughts via Chinese language to present how the Chinese think. Frequently Chinese listening and speaking are necessary in this class.  Writing and reading are the skills which be also enhanced in this class. So assignments will be required. This semester we would have a real trip to practice your Chinese ability. Prepare and understand your own culture is important, we would exchange the knowledge with local students.",
    "schedule": "(1)2/19\tPreview  \n(2)2/26\tLesson 6  Business Sheets \n(3)3/4\tPractical:  organize the business Sheets \n(4)3/11\tLesson 7: Take a business trip\n(5)3/18\tPractical activity : make a business trip \n(6)3/25\tLesson 8  attending an exhibition\n(7)4/1\tPractical: join an exhibition \n(8)4/8    Midterm exam Practical: Language exchange 1\n(9)4/15  Midterm exam Practical: Language exchange 2\n(10)4/22\tLesson 9    business banquets\n(11)4/29\tPractical :   make an invitation card \n(12)5/6\tLesson 10   product marketing\n(13)5/13\tPractical :    copy write\n(14)5/20\tLesson 11    customer service\n(15)5/27\tPractical:      customer types\n(16)6/3\tConclusion and Review\n(17)6/10\tDragon boat's festival day\n(18)6/17\tFinal presentation",
    "scorePolicy": "Attendance 20%\nAssignment 20%\nPresentation 20%\nMid-term 20%\nfinal exam 20%\n\n(Attendance is very important in this class because the assignment would be done in class. If you have any reason to get off, you need to provide a prove in 1 week.)You can contact me via :",
    "materials": "<Situated-based Business Chinese>National Tsing Hua University, Wu Nan, 2020/6.",
    "consultation": "You can contact me via : sweetprettylover@gmail.com",
    "remarks": "Course correspond to index 8th: Economic growth should be a positive force for the whole planet.The index correspond to the content : since 3rd week to 15th weekPromote sustained, inclusive and sustainable economic growth, full and productive employment and decent work for all.",
    "foreignLanguageTextbooks": false
  }
]
