[
  {
    "name": "李東明",
    "email": "tmlee@ntut.edu.tw",
    "latestUpdate": "2023-12-14 13:59:38",
    "objective": "本課程之目標在於藉由專業養成，累積實務技能，期能在室內裝修設計及材料技術之各面向，並展現生活環境設計實務操作能力。藉由國內外設計競賽主題與各項產學合作設計案進行實際演練，著重於資料蒐集、需求分析、創新構想與成果表達之進階能力養成，期讓學生在國內外設計競賽舞台上展現光芒。因本所結合設計、藝術、人文、木工等各領域的學生，整合培育創新設計專業人才，因此，本課程之另一主要學習目標為建構一多元領域交互學習的環境，以專題導向式為學習模式，可分別組合具各種專長的研究生，協同完成生活環境設計的專案設計研究，或是透過生活環境設計專案執行的方式進行。教學將以課堂講授、論文研討與發表以及專案執行為主，並以報告、分組討論與發表以及實作作品為評量方式。\nThe objective of this course is to accumulate practical skills through professional development,to be able to demonstrate the practical operation ability of interior decoration design and material technology,to demonstrate the practical operation ability of living environment design.Through the theme of design competitions and various industry-university cooperation design projects,practical exercises are carried out,focusing on data collection,demand analysis,innovative ideas and achievement expression advanced ability cultivation,hoping to let students show their brilliance on the stage of design competitions.Another objective is to construct a multi-field interactive learning environment,which is a project-oriented learning mode,and graduate students with various specialties can be combined to collaborate on the project design research of living environment design,or through the implementation of living environment design projects.",
    "schedule": "1.\t課程介紹\n2.\t設計主題、方向討論\n3.\t設計動機、目的討論\n4.\t設計方向初擬\n5.\t設計方法、內容\n6.\t設計流程、進度\n7.\t檢討修正\n8.\t期中簡報〈一〉\n9.\t期中簡報〈二〉\n10.\t計畫書繳交\n11.\t文獻資料回顧與蒐集〈一〉\n12.\t文獻資料回顧與蒐集〈二〉\n13.\t相關設計理論分析、探討〈一〉\n14.\t相關設計理論分析、探討〈二〉\n15.\t期末簡報〈一〉\n16.\t期末簡報〈二〉\n17.\t期末簡報〈三〉\n18.\t補救教學",
    "scorePolicy": "Usual grades: 20%\nReport absences, ask questions in class, and interact with teachers.\n平時成績：20%\n出缺席、上課提問、與老師互動討論。\nMidterm grade: 30%\nRead reports on books related to design principles and share them on stage.\n期中成績：30%\n相關書籍讀書報告，並上台分享。\nFinal grade: 50%\nAdopt the method of making reports by group. Each group chooses topics related to design principles to share on stage.\n期末成績：50%\n採分組製作報告方式。各組選擇相關主題上台分享。",
    "materials": "（一）一般教材\n1. 各類教材優劣分析\n（1）室內設計：一般室內設計介紹圖書\n此多為針對室內設計科系學生所編教材，深入淺出，著重全盤整合式學習，學生學習易掌握狀況，且易了解，適合初學者使用。然室內設計尚無設計題目之相關教材出版，故可以此上述教材作為參考。\n（2）造型、空間與秩序 — 王德生 / 唐真真譯 (六合)\n對空間架構之描述著墨頗多，對欲向設計表現之同學助益頗大。\n◎其他教材之缺點：\n(1) 教授重點，內容不夠詳實。\n(2) 部分單元、章節與其他課程有所重疊。\n(3) 內容過於繁多，若依上課週數安排，無法於一年內上完全部內容。\n(4) 省略部份重要的基礎概念，學生學習上無法銜接，易造成學習障礙。\n(5) 內容無法與縱橫向課程銜接，影響學習效果。\n2. 補充教材\n (1) 空間之構成∕蘆原義信著∕王錦堂譯∕臺隆書店出版\n (2) 室內雜誌∕室內雜誌出版社\n（3）空間雜誌∕空間雜誌出版社\n（4）雅砌月刊\n（5）建築技術規則∕營建雜誌社\n（6）設計研究成果發表會論文集∕中華民國設計學會編∕年度主辦學校\n（7）其他相關室內方法論書籍\n\n（二）參考資料\n1. 一般參考資料：書籍包括相關設計方法及各類論文集。\n2. 期刊：各大學及技術學院出版的相關學報及設計類雜誌。\n3. 網路資料：各大學學院及研究機構、圖書館之網頁設計資訊網等網站。\n光碟資料庫：\thttp://www.lib.ckitc.edu.tw/\n國家圖書館：\thttp://readopac.ncl.edu.tw/\n期刊論文索引：\tttp://readopac.ncl.edu.tw/cgi/ncl3/m_ncl3\n\n（三）教材取得\n參考教材可由學生自行借閱或購買，各大書局與圖書館均有藏書，可自由閱覽，或在圖書館借閱，網路資料可上網取得，以網路書店、圖書館、藝術、設計等關鍵字搜尋即可尋獲相關資料。",
    "consultation": "Contact the teacher directly, or consult with the teacher's research room in 406. 直接與老師聯繫，或 406 教師研究室洽詢。Distance teaching adopts TEAMS software for online teaching, and is assisted by LINE groups. 遠距教學採 TEAMS 軟體線上教學，並以 LINE 群組輔助。",
    "remarks": "SDG11：建構具包容、安全、韌性及永續特質的城市與鄉村「永續城市」目標，在於透過住居、運輸、防災、環保、資訊建設、社會安全、民眾參與、文化傳承等不同面向，建構具包容、安全、韌性及永續特質的城市與鄉村。本課程透過理解設計史上的精彩作品，透過政治、宗教、技術、文化、氣候和地理因素影響下的背景梳理，利用設計思維的文化傳承，進而達到建構具包容、安全、韌性及永續特質的城市與鄉村的目標。",
    "foreignLanguageTextbooks": false
  }
]
