[
  {
    "name": "王鴻祥",
    "email": "wanghh@ntut.edu.tw",
    "latestUpdate": "2023-12-07 21:38:30",
    "objective": "本課程幫助學生 (1) 增進解決複雜設計問題的專業知識，(2) 提升發展創新營運模式的企劃能力與 (3) 建立當前科技、經濟與社會文化等變遷下的前瞻設計意識。本課程融合相關理論與實務，透過未來劇本工作坊與校外專業者分享經驗，提供學生全方位的產品服務系統設計體驗。\nThe course is to help students develop an awareness of the implications of current technological, economical and socio-cultural changes to design professional discipline by expanding their expertise for solving complex problems and sharpening their planning capability for business modeling in creative and systematic ways. Integrating theories and design related to Product-Service System, the course provides the students with a comprehensive experience of designing a product and a service in scenario design workshops. Lectures from external professionals will be invited to share their experience with the students.",
    "schedule": "本課程如採線上教學時，請同學利用以 e-mail 和 Google classroom:  wanghh@ntut.edu.tw   112.2 產品服務系統設計\nNotice that the schedule is flexible, depending on the students' learning demands.\nWK Topic- Remarks\n01\tOrientation/ What is PPS design?\t\n02\tProject 1. Build a classification system of design typicality: A. car typicality, B. furniture typicality, C. lighter typicality.\n03\tCollect data\n04\t'Clean' and lable the images\n05\tBuild the dataset and preprocess\n06\tTrain the model of image classificaion\n07\tValidate the model\n08\tEvaluation\n\n09\tNo class \tMidterm exam week\n10\tDiscover Design solutions 4-\tMidterm Presentation: storyboard, video, or demo\n11\tDiscover Design solutions 5-\tGroup tutorial: Test usability and viability\n12\tDevelop design concepts 1- Group tutorial\n13\tDevelop design concepts 2- Group tutorial\n14\tDevelop design concepts 3- Presentation: concept packaging by actually building prototypes, or explaining it through a storyboard, video, or demo\n15\tDevelop design concepts 4- Group tutorial: Each team prepares final presentation through an individual meeting with a professor and TA.\n16\tDevelop design concepts 5- Final presentation and deliverable: Concept movies, slides\n17\tReflections- Share learning experiences\n18\tNo class- Final exam week",
    "scorePolicy": "Participation 30%\nGroup work 50%\nIndividual work 30%",
    "materials": "Introduction to Product/Service-System Design. Editors: Sakao, Tomohiko, Lindahl, Mattias (Eds.)",
    "consultation": "sss",
    "remarks": "1. 本課程將以 https://classroom.google.com/110.2 產品服務系統設計 做為課程網頁 2. 如有加退選或課程問題請寄 email 給老師 (wanghh@mail.ntut.edu.tw)。3. 因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。若無法實體上課，預計，使用 Google Meet 於原定上課時間遠距上課，細節將再另行公布。",
    "foreignLanguageTextbooks": true
  }
]
