[
  {
    "name": "陳文章",
    "email": "wjchen@ntut.edu.tw",
    "latestUpdate": "2023-12-14 10:42:32",
    "objective": "本課程在教授學生藥用及化妝用高分子材料之相關產業製程及配方技術的實務知識，課程設計將首先介紹高分子材料的基本合成方法、物理化學性能、界面活性劑、乳化膠體及生物分解安全性。並教授高分子材料之應用區分為兩大類：其一是指在製藥之劑型加工時所用的和為改善藥物傳輸性能而採用的輔助材料 (Excipients)，例如稀釋劑、潤滑劑、黏合劑、崩解劑、助流劑、緩和劑、穩定劑、保濕劑、膜包衣及膠囊殼等。藥用及化妝用輔助材料本身並不具有藥理作用，只是在藥品及化妝品的製造和使用中起從屬或輔助的作用。另一類高分子藥物則不同於前一類，它依靠連接在聚合物分子鏈上的藥理活性基團或高分子本身的藥理作用，進入人體後，能與機體組織發生生理反應，從而產生醫療美容或預防性效果。\nThe course is to provide the core knowledge for the development of pharmaceutical and cosmetic technology. It aims to educate and train students with the fundamental principles and applications of biodegradable polymers, surfactants, colloids, emulsions and their related physico-chemical properties. Then potential prospects of pharmaceutical and cosmetic polymers will be taught in two parts to help students understand the future frontiers in polymer science and technology. The first part of lectures will cover the wide range of polymer excipients such as diluents, lubricants, binders, disintegrants, glidants, demulcents, stabilizers, humercants, coatings, and capsules etc, which are inactive pharmaceutical ingredients used for assisting drug delivery. The second part will focus on polymer drugs, which are active pharmaceutical ingredients conjugated to polymer matrices such as polymeric micelles, liposomes, colloidosomes, and solid phase nanoparticle",
    "schedule": "1. 課程大綱介紹、修課注意事項\n2. 生技化妝品概論\n3. 皮膚生理學\n4. 防曬與美白用品\n5. 新奇生技化妝品\n6. 專利文獻探索\n7. 化妝品安全衛生管理法\n8. 乳化膠體和高分子溶液\n9. 髮妝品高分子\n10. 美甲與彩繪凝膠高分子",
    "scorePolicy": "a. 考試：期中考佔總分 40%、期末考佔總分 40%。\nb. 出席率及平時表現佔總分 20%。",
    "materials": "主要教材採用書：\n1. 生技化妝品，楊其曄、蘇玉燕 編著，高立出版公司 2013，台北；\n其他參考書：\n2.E. Goddard, J.V. Gruber, Principles of Polymer Science and Technology in Cosmetics and Personal-Care, CRC, 1999",
    "consultation": "有關本學期課程之諮詢，可藉由我的電子信箱聯絡：wjchen@mail.ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
