[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2024-02-18 22:14:23",
    "objective": "This course is ONLY served to INTERNATIONAL students who are at basic level. Exchange students are welcome to take it if it has vacancy. Students are with motivation to study Chinese. Chinese ability is at A1 (could recognize more than 250 Chinese words). Students supposed to introduce yourself in basic Chinese and could ask basic questions in Chinese. It would be better that your English ability has been achieved to B1 at least for communicating with your classmates and teacher. You need to cooperate with people who are from multiple culture. \nThe course is based on daily life speaking and listening, it will be included Chinese culture, grammar. The Chinese learning strategy must be taught for helping you to keep learning further. \nThis semester the curriculum would go further, 30% Chinese speaking in whole class. Whole Chinese listening would be main target. \nFrequently Chinese speaking and reading are necessary in this class.  Writing and listening are the skills which be also enhanced in this class. The assignments will be required.",
    "schedule": "(1)2/19\tReview  \n(2)2/26\tLesson 1  New classmate \n(3)3/4\tPractical:  Hobby\n(4)3/11\tLesson 2: My daddy is in business\n(5)3/18\tPractical activity : family and occupation \n(6)3/25\tLesson 3  Going to the supermarket\n(7)4/1\tPractical:  shopping\n(8)4/8    Midterm exam Practical: Language exchange 1\n(9)4/15  Midterm exam Practical: Language exchange 2\n(10)4/22Lesson 4   I want to eat a hamburger\n(11)4/29Practical :   food\n(12)5/6Lesson 5   Autumn is almost here\n(13)5/13Practical :  feeling and colors\n(14)5/20Lesson 6   Chinese New year\n(15)5/27Practical:   Holidays and culture\n(16)6/3Conclusion and Review\n(17)6/10Dragon boat's festival day\n(18)6/17Final presentation",
    "scorePolicy": "Attendance 20%\nAssignment 20%\nPresentation 20%\nMidterm exam 20%\nfinal exam 20%\n\n(Attendance is very important in this class because the assignment would be done in class. If you have any reason to get off, you need to provide a prove in 1 week.)",
    "materials": "1.<學華語向前走 Let's Learn Chinese> book 2 孫懿芬，行政院僑務委員會，2019/04/01\n2.< 當代中文課程 A Course in Contemporary Chinese>book 1 鄧守信，王佩卿，陳慶華，黃桂英，聯經出版公司，2015/06/02\n3.supplementary material",
    "consultation": "You can contact me via : sweetprettylover@gmail.com",
    "remarks": "Course correspond to index 17th:.Build Partnerships for the Goals.The index correspond to the content : since 3rd week to 15th weekStrengthen the means of implementation and revitalize the Global Partnership for Sustainable Development",
    "foreignLanguageTextbooks": false
  }
]
