[
  {
    "name": "狄雅南",
    "email": "ardilahayu@ntut.edu.tw",
    "latestUpdate": "2023-12-13 19:18:19",
    "objective": "本課程之重點在於將熱力學機基本定律，應用於較為實際的化工問題上。主要內容包括：熱力學及輸送現象性質之估算方法，氣液相平衡及液液相平衡在分離製程的應用等.\nThe objectives of this course are to apply principles of thermodynamics in practical chemical processes. The contents \nof the curricula are 1) estimation of the thermodynamic and transport properties of fluids and solids, 2) vapor-liquid equilibrium as well as liquid-liquid equilibrium for separation processes application.",
    "schedule": "1st week: Phase equilibria introduction\n2nd week: Phase equilibria introduction, vapor-liquid equilibrium\n3rd week: vapor-liquid equilibrium\n4th week: liquid-liquid equilibrium\n5th week: liquid-liquid equilibrium\n6th week: liquid-liquid equilibrium \n7th week: liquid-liquid equilibrium\n8th week: vapor-liquid-liquid equilibrium\n9th week: Midterm exam \n10th week: vapor-liquid-liquid equilibrium\n11th week: vapor-liquid-liquid equilibrium\n12th week: applications of phase equilibria in the distillation\n13th week: applications of phase equilibria in the reactive distillation\n14th week: applications of phase equilibria in the extraction column\n15th week: applications of phase equilibria in the decanter\n16th week: Review and problems in industries\n17th week: Group presentation\n18th week: Group presentation",
    "scorePolicy": "Midterm Exam                                                 40 %\nGroup presentation\t        \t\t\t\t40 %\nClassroom participants (Q&A)\t                20 %",
    "materials": "1.  Walas, S. M., Phase Equilibria in Chemical Engineering, (1985), Butterworth-Heinemann, https://doi.org/10.1016/C2013-0-04304-6.\n2. Poling, B. E., Prausnitz, J. M., and O’Connell, J. P., The Properties of Gases and Liquids, 5th ed., McGraw-Hill, New York, NY (2001).\n3. Geankoplis, C. J., Transport Processes and Unit Operations, 4th Ed., Allyn and Bacon series in engineering, Boston, Massachusetts (1978).",
    "consultation": "offline and online consultation",
    "remarks": "Students can ask any time through the i-Plus system or offline discussions at Chemical Engineering-411. This course will use English.*Online course will be offered depend on pandemic situation.",
    "foreignLanguageTextbooks": true
  }
]
