[
  {
    "name": "蔡修毓",
    "email": "tsaihy@pie.com.tw",
    "latestUpdate": "2023-12-20 17:20:58",
    "objective": "本學期本課程主要以異議申訴、調解、仲裁、司法判決等案例，探討政府採購法及其他土木建築領域之法律爭議問題，並邀請相關領域專家學者，就公共設施經營、營建產業經營、都市整維政策、營建智慧財產權、永續發展目標、營建人員法律責任及公共工程推動等相關議題進行專題演講。期望透過本課程得以提升同學對於土木與法律交集領域之認識，進一步強化同學閱讀相關論文與期刊文獻之能力，並提供同學在工作及研究上不同角度的思考方向。\nThe course primarily focuses on cases involving objections, mediation, arbitration, judicial decisions, etc., to explore legal disputes in the government procurement law and other areas of civil engineering and construction. I will invited experts and scholars in relevant fields to deliver keynote lectures on topics such as public facility management, construction industry operation, urban redevelopment policies, construction intellectual property rights, sustainable development goals, legal responsibilities of construction personnel, and promotion of public engineering projects. Through this course, I aim to enhance students' understanding of the intersection between civil engineering and law, strengthen their ability to read relevant papers and journals, and provide them with different perspectives for consideration in both work and research.",
    "schedule": "週次\t日期\t        單元主題\n1\t2 月 20 日\t課程介紹\n2\t2 月 27 日\t促進民間參與公共建設法案例研究\n3\t3 月 05 日\t政府採購法 - 1\n4\t3 月 12 日\t政府採購法 - 2\n5\t3 月 19 日\t政府採購法 - 3\n6\t3 月 26 日\t政府採購法 - 4\n7\t4 月 02 日\t政府採購法 - 5\n8\t4 月 09 日\t政府採購法 - 6\n9\t4 月 16 日\t期中考週\n10\t4 月 23 日\t政府採購法 - 7\n11\t4 月 30 日\t專題研討：公共設施（博物館）經營\n12\t5 月 07 日\t專題研討：永續綠色土木工程\n13\t5 月 14 日\t專題研討：從永續城市與社區談 SDGs\n14\t5 月 21 日\t專題研討：營建專業人員之法律責任分析\n15\t5 月 28 日\t專題研討：「品質與職安」實務作為分享\n16\t6 月 04 日\t專題研討：如何提升國土防洪治水韌性\n17\t6 月 11 日\t專題研討：都市整維政策推動與方向\n18\t6 月 18 日\t期末考週\n＊\t以上課程內容將視實際上課進度與講者邀請情形調整。",
    "scorePolicy": "課程參與 30％－出席、提問或意見發表情形。\n課程報告 70％－於指定課程提出心得報告，報告內容以有自己的評論意見為佳。課程報告需依指定期限繳交，原則上不接受補交。",
    "materials": "課程教材為指定之司法判決、訴願決定、監察院調查報告或相關碩博士論文，舉例如下：\n臺灣花蓮地方法院 110 年度原矚訴字第 1 號刑事判決\n最高行政法院 104 年判字 102 號判決",
    "consultation": "聯絡方式：蔡修毓 0920-927249　02-239777801　Line ID：tsaihsiuyu",
    "remarks": "對應臺灣永續發展目標核心目標 11：建構具包容、安全、韌性及永續特質的城市與鄉村。",
    "foreignLanguageTextbooks": false
  }
]
