[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2023-12-13 18:05:31",
    "objective": "課程目標：\n本課程旨在全面探討企業倫理與永續經營的重要性，使學生了解企業在當今社會中應承擔的責任與角色。學生將學習企業社會責任（CSR）、利害關係人的倫理、以及企業對消費者、員工、股東和環境的倫理義務。本課程還將涵蓋 ESG（環境、社會及公司治理）、公司治理標準，以及企業永續經營的各項指標與戰略，包括淨零排放、碳中和等主題。課程結束時，學生將能夠瞭解企業如何有效地實施倫理與永續經營的策略，並且能評估企業在這些領域的績效。\n\n課程描述：\n這是一門專注於企業倫理與永續經營的課程。課程從探討企業倫理的必要性開始，逐步深入到企業社會責任、對各利害關係人的倫理義務，以及 ESG 指標的理解與應用。學生將學習如何分析企業的社會與環境影響，並了解公司治理的不同階段。透過研究永續報告書的撰寫標準，學生將獲得實際操作企業永續經營報告的能力。此外，課程還涵蓋了 Net Zero、碳中和、以及與氣候相關的金融風險管理。最終，學生將能夠綜合運用所學知識，評估和提出企業在永續經營方面的改進方案。\nCourse Objectives:\nThis course aims to comprehensively explore the importance of corporate ethics and sustainable management, enabling students to understand the responsibilities and roles that corporations should assume in today's society. Students will learn about Corporate Social Responsibility (CSR), ethics in relation to various stakeholders, and the ethical obligations of corporations towards consumers, employees, shareholders, and the environment. The course will also cover Environmental, Social, and Governance (ESG) standards, corporate governance standards, and various indicators and strategies for sustainable corporate management, including topics like Net Zero emissions and carbon neutrality. By the end of the course, students will be able to understand how corporations can effectively implement strategies for ethics and sustainable management, and evaluate corporate performance in these areas.",
    "schedule": "第 1 週：為何要有企業倫理\n第 2 週：企業倫理 1.0：CSR 企業社會責任\n第 3 週：企業倫理 2.0：企業與利害關係人的倫理\n第 4 週：企業對消費者的倫理\n第 5 週：企業對員工的倫理\n第 6 週：企業對股東的倫理義務\n第 7 週：企業對環境的倫理義務\n第 8 週：企業對競爭者的倫理義務\n第 9 週：期中考\n第 10 週：企業倫理 3.0：ESG：環境保護，社會責任，公司治理績效指標\n第 11 週：企業倫理與 ESG，企業永續經營的 3 大評分標準\n第 12 週：公司治理 1.0，2.0，3.0\n第 14 週：解析永續報告書（三種撰寫準則：GRI，SASB，TCFD）\n第 15 週：Net Zero 淨零排放，Carbon Neutral 碳中和\n第 16 週：2050 淨零排放，碳中和，氣候中和，碳稅，碳費，碳交易，與 ESG\n第 17 週：環境變遷三種撰寫準則：碳盤查 (ISO 14064-1)，碳足跡 (ISO 14067)，碳減量 (ISO 14064-2)\n第 18 週：期末考",
    "scorePolicy": "1. 上課分數：40%\n2. 期中報告：30%\n3. 期末報告：30%\n\n同學們上課繫帶筆記本電腦",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/busEthics/\n\n2. 參考資料：企業倫理 (中華開放教育聯盟)，https://courses.openedu.tw/courses/course-v1:SP+1091004058+110/course/\n\n3. 參考資料：倫理領導 (中華開放教育聯盟)，https://courses.openedu.tw/courses/course-v1:SP+1080023019+109/course/",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 可以在北科 i 學園 PLUS 平台，在課程內留言，諮詢問題 3. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "remarks": "建議同學們上課繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：企業倫理",
    "foreignLanguageTextbooks": false
  }
]
