[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2023-12-19 18:10:48",
    "objective": "21 世紀國際為確保環境、經濟、社會之永續發展，國際紛紛採取氣候變遷相關因應措施，低碳與淨零已成為全球之共同趨勢。本課程將介紹能源轉型 / 節能減碳與低碳經濟及社會之國際趨勢、國際溫室氣體減量與能源安全相關法規、我國溫室氣體減量與節能相關法規等，並介紹碳足跡、碳中和等概念，由國際相關案例看我國邁向低碳經濟與社會挑戰與機會。\nTo ensure the sustainable development of environment, economy and society, effective measures are gradually adopted by internationals. Low-Carbonization and Net-Zero Emission obviously becomes a global common tendency. This course will be introduced the international tendencies of “energy saving & carbon reduction” and “low-carbon society”. It will also be introduced with related regulations of international greenhouse gases reduction, energy security, Taiwan GHG reduction, energy saving. The above concepts and latter concepts of carbon footprints and carbon neutral will be introduced with international practical cases to refer to challenges as well as chances toward a low-carbon Economy and society in Taiwan.",
    "schedule": "Week 1 生命週期評估概論及方法學 (一)：歷史、發展與應用及目標範疇界定與盤查分析\nWeek 2 生命週期評估方法學 (二)：盤查分析與軟體操作\nWeek 3 生命週期評估方法學 (三)：衝擊評估原理及方法\nWeek 4 生命週期評估方法學 (四)：不確定性、敏感度分析與結果闡釋\nWeek 5 生命週期評估應用：綠色設計、環保標章、淨水處理、污水處理、廢棄物處理等\nWeek 6 專題：碳足跡、淨零及碳中和 (Carbon Footprinting, Net Zero and Carbon Neutrality)",
    "scorePolicy": " Participation and Homework：30 %   Exams：30 %\n Team Project (Report and Oral Presentation)： 40 %",
    "materials": "\tHauschild, M. Z., Rosenbaum, R. K., & Olsen, S. I. (2018). Life cycle assessment (Vol. 2018). Springer International Publishing, Cham. https://doi. org/10.1007/978-3-319-56475-3 \n\tJolliet, O. et al., Environmental Life Cycle Assessment, CRC Press, 2016",
    "consultation": "Wednesday 10:00am~16:00pmOr by appointment!",
    "remarks": "SDG 13https://ncsd.ndc.gov.tw/Fore/SDG13",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "簡慧貞",
    "email": "hcchien@sun.epa.gov.tw",
    "latestUpdate": "2023-12-20 10:42:01",
    "objective": "聯合國為了減緩人類對大氣、海洋及陸地暖化的影響，共同遏阻全球暖化趨勢，於 2015 年 12 月 12 日在巴黎協定締約方會議中通過氣候協議，約定避地球升溫超過 2°C，最好控制在 1.5°C 以內，降低氣候變遷帶來的風險。巴黎協議生效後，地球暖化仍持續加速惡化。2018 年聯合國政府間氣候變化專門委員會（The Intergovernmental Panel on Climate Change, IPCC) 重新評估，發表 IPCC 全球暖化 1.5°C 特別報告（Special Report on GlobalWarming of 1.5 °C），分析出全球升溫 1.5°C 與升溫 2°C 的差距意義。報告認為，0.5°C 的差別對某些國土海平面低的國家是生存關鍵。但是，如果要維持升溫在 1.5°C 之內，該報告認為，各國必須在 2050 年前都應採取斷然行動，大幅度削減溫室氣體排放。 而根據「 IPCC 氣候變遷第六次評估報告 (The Sixth Assessment Report,AR6)」第三工作小組在 2022 年 4 月報告中亦提出警示，若不儘速進行深度減碳，2050 年以前就不可能達到全球升溫限制在 1.5℃。因此，呼應全球淨零趨勢，我國於 2021 年 4 月 22 日（世界地球日）宣示 2050 淨零轉型為我國重要政策目標，於 2022 年 3 月 30 日公布我國「2050 淨零排放路徑」，透過推動「能源轉型」、「產業轉型」、「生活轉型」及「社會轉型」四大轉型策略，而與日常生活息息相關的議題即為轉型無毒環境。\n國際為確保環境、經濟、社會之永續發展，國際紛紛採取氣候變遷相關因應措施，低碳與淨零已成為全球之共同趨勢。本課程將介紹能源轉型 / 節能減碳與低碳經濟及社會之國際趨勢、國際溫室氣體減量與能源安全相關法規、我國溫室氣體減量與節能相關法規等，介紹淨零排放路徑「能源轉型」、「產業轉型」、「生活轉型」、「社會轉型」等四大轉型概念，由國際相關案例看我國邁向低碳經濟與社會挑戰與機會。\nIn order to mitigate the impact of human beings on the warmings of the atmosphere, oceans and land, the United Nations (UN) curb the global warming potentials (GWPs) collaboratively. The Paris Climate Agreement was adopted by the Parties at the UN Climate Change Conference in Paris, France, on 12 December 2015. It committed nations to limit the Earth’s temperature rise to well below 2°C, and to aim for 1.5°C to reduce the risks caused by climate change. Global warming continued to accelerate and worsen even the Paris Agreement came into effect. In 2018, the Intergovernmental Panel on Climate Change (IPCC) reassessed and published the IPCC Special Report on Global Warming of 1.5 °C (SR15), which analyzed the significances of the difference between 1.5 °C and 2°C warming. The report highlighted the difference of 0.5°C is the key to survival for some low-lying countries. However, if the temperature rise is to be kept under 1.5 °C limit, the report concluded every nation must take the decisive actions to significantly reduce greenhouse gas emissions by 2050. According to the Sixth Assessment Report (AR6), the Working Group III report in April 2022 warned if deep carbon emissions were not reduced as soon as possible, it would be impossible to reach the global warming limit of 1.5°C before 2050. Therefore, in response to the global net-zero trend, Taiwan declared on Earth Day on April 2021 that the ‘2050 Net-Zero Transition’ is the important national goal. Taiwan officially published “Taiwan’s Pathway to Net-Zero Emissions in 2050”, which based on the four major transition strategies of ‘Energy Transition’, ‘Industrial Transition’, ‘Lifestyle Transition’, and ‘Social Transition’. The issues in our daily life are the transition of a toxic-free environment, which will be discussed in this report.\nTo ensure the sustainable development of environment, economy and society, effective measures are gradually adopted by internationals. Low-Carbonization and Net-Zero Emission obviously becomes a global common tendency. This course will be introduced the international tendencies of introduce the net-zero emission path \"energy transition\", \"Industrial Transformation\", \"Life Transformation\" and \"Social Transformation\" are the four major transformation concepts. It will also be introduced with related regulations of international greenhouse gases reduction, energy security, Taiwan GHG reduction, energy saving. The above concepts and latter conce",
    "schedule": "第 1 週：課程介紹及低碳經濟與淨零路徑建構導論 (簡慧貞老師授課)\n第 2 週：228 放假日\n第 3 週：低碳經濟與淨零路徑建構概論 (簡慧貞老師授課)\n第 4 週：低碳經濟與淨零路徑建構之產業轉型國內外趨勢 (簡慧貞老師授課)\n第 5 週：低碳經濟與淨零路徑建構之生活轉型國內外趨勢 (簡慧貞老師授課)\n第 6 週：低碳經濟與淨零路徑建構之社會轉型國內外趨勢 (簡慧貞老師授課)\n第 7 週：生命週期評估概論及方法學 (一)：歷史、發展及目標與範疇界定 (胡憲倫老師授課)\n第 8 週：生命週期評估方法學 (二)：盤查分析與軟體操作 (胡憲倫老師授課)\n第 9 週：生命週期評估方法學 (三)：衝擊評估原理及方法 (胡憲倫老師授課)\n第 10 週：生命週期評估方法學 (四)：不確定性、敏感度分析與結果闡釋 (胡憲倫老師授課)\n第 11 週：生命週期評估應用：綠色設計、環保標章、淨水處理、污水處理、廢棄物處理等 (胡憲倫老師授課)\n第 12 週：專題：碳足跡、淨零及碳中和 (胡憲倫老師授課)\n第 13 週：綠色稅制與全球綠色新政－綠色金融 (簡慧貞老師授課)\n第 14 週：綠色稅制與全球綠色新政－綠色金融 (簡慧貞老師授課)\n第 15 週：綠色稅制與全球綠色新政－綠色金融 (簡慧貞老師授課)\n第 16 週：低碳經濟與淨零路徑之科技轉型－綠色化學 (簡慧貞老師授課)\n第 17 週：低碳經濟與淨零路徑之科技轉型－綠色化學 (簡慧貞老師授課)\n第 18 週：期末報告",
    "scorePolicy": "期中報告   40% \n期末報告   40%\n平時成績   20%",
    "materials": "OKR 實現淨零排放的行動計畫及教師最新教材",
    "consultation": "可透過電子郵件諮詢課程內容",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
