[
  {
    "name": "鄭建文",
    "email": "ondinecomposer2@hotmail.com",
    "latestUpdate": "2024-02-22 11:43:20",
    "objective": "This course mainly introduces sound design and electronic music production tools and skills. Through the introduction of audio editing technology and the use of related sound design tools, students can learn creative sound design. In the course, students are taught to use the Ableton Live sequencer software, combined with its sound design tools in Max for Live, to design their own software synthesizers and digital effects to be used in the sequencer. These skills may be used in multimedia design, game audio, new media performances, and etc. In addition, this course will also cover the concept and technology of \"adaptive music\", integrating the middleware FMOD into the game engine Unity to establish a prototype framework of adaptive music for interactive design.\n\n本課程提供給對於電子音樂、聲音藝術、數位音樂、遊戲配樂、以及聲音相關研究等有興趣的學習者們一系列有效工具的介紹與實務練習，並為學習者建立數位音樂、遊戲配樂、聲音設計的基本概念。本課程透過介紹音訊編輯的技術、相關聲音設計工具的使用，學習創意的聲音設計與電子音樂製作。課程當中，除了聲音設計的工具介紹之外，並教導學生使用 Ableton Live 序列器軟體，搭配 Max for Live 的聲音設計工具，讓使用者可以在序列器中使用自己所設計的軟體合成器與數位位效果器，進而可延伸至多媒體、遊戲、新媒體展演等之音樂與音效應用。此外，本課程亦將結合「自適性音樂」的技術，透過中介軟體 FMOD 與遊戲引擎 Unity 進行結合，建立自適音樂的雛形架構，作為互動設計的音樂設計依據。",
    "schedule": "Week 1: Course Introduction, Introduction to Digital Music, Introduction to Adaptive Music\nWeek 2: Audio Editing (Adobe Audition)\nWeek 3: Audio Editing (Adobe Audition)\nWeek 4: Sequencer Usage: Introduction to Ableton Live, Session View, Quantization\nWeek 5: Session View to Arrangement View, Quantization, Random Playback (Follow)\nWeek 6: Effects Usage: Live Effects Chain, Delay Effects, MIDI Effects\nWeek 7: Introduction to Synthesizer Architecture, Drum Rack, Macro Automation Control, Wavetable Synthesis, VST Plugin Installation\nWeek 8: Introduction to Max for Live (Part I) - Basic Interface and Interaction\nWeek 9: Introduction to Max for Live (Part II) - Synthesizer Design (Additive Synthesis, AM Synthesis)\nWeek 10: Final Project Proposal, Midterm Report\nWeek 11: Introduction to Max for Live (Part III) - Synthesizer Design (FM Synthesis)\nWeek 12: Introduction to Max for Live (Part IV) - Synthesizer Design (Subtractive Synthesis)\nWeek 13: Introduction to Max for Live (Part V) - MIDI Effects Design\nWeek 14: Introduction to Max for Live (Part VI) - Audio Effects Design, Audio-Visual Interaction\nWeek 15: Introduction to Game Scoring, Introduction to Adaptive Music, Introduction to FMOD\nWeek 16: Adaptive Music - Interactive Weather Sound Design, Vertical Re-mixing\nWeek 17: Adaptive Music - Horizontal Re-sequencing\nWeek 18: Final Presentation of Works (Choose one from Game Scoring, Film Scoring, Adaptive Music)\n\n第一週：課程導論、數位音樂簡介、自適音樂簡介\n第二週：音訊編輯 (Adobe Audition) \n第三週：音訊編輯 (Adobe Audition) \n第四週：序列器使用：Ableton Live 簡介、session view、quantization\n第五週：Session View to Arrangement View、quantization、隨機播放（follow）。\n第六週：效果器使用：Live 效果器串接法、延遲效果器、MIDI 效果器\n第七週：合成器架構簡介、drum rack、macro 自動化控制、wavetable synthesis、VST 外掛安裝\n第八週：Max for Live 簡介（一）- 基本介面與互動\n第九週：Max for Live 簡介（二）- 合成器設計（加法合成、AM 合成）\n第十週：期末製作企劃提案、期中報告\n第十一週：Max for Live 簡介（三）- 合成器設計 （FM 合成）\n第十二週：Max for Live 簡介（四）- 合成器設計（減法合成）\n第十三週：Max for Live 簡介（五）\b- MIDI 效果器設計\n第十四週：Max for Live 簡介（六）- Audio 效果器設計、影音互動\n第十五週：遊戲配樂導論、Adaptive Music 簡介、FMOD 簡介\n第十六週：Adaptive Music - 互動天氣聲音設計、Vertical Re-sequencing\n第十七週：Adaptive Music - Horizontal Re-sequencing\n第十八週：期末作品呈現（遊戲配樂、影像配樂、自適音樂擇一）",
    "scorePolicy": "Class Participation: 30%, Midterm Report and Presentation: 30%, Final Adaptive Game Music Project Presentation: 40%.\n\n課堂參與 30%,  期中報告與作品呈現 30 %，期末自適性遊戲音樂作品呈現 40 %。",
    "materials": "Reference：\n\n1. Writing Interactive Music for Video Games: A Composer's Guide\nhttps://www.amazon.com/Writing-Interactive-Music-Video-Games/dp/0321961587\n2. Principles of Game Audio and Sound Design\nhttps://www.amazon.com/Principles-Game-Audio-Sound-Design/dp/1138738972/ref=sr_1_1?dchild=1&keywords=game+audio&qid=1607837479&s=books&sr=1-1",
    "consultation": "http://cwcheng2009.blogspot.com/p/blog-page_8.htmlYou can send messages to the teacher through email or via the Facebook fan page. The links have been announced on the above-mentioned website.",
    "remarks": "Course Correspondence to SDGs Indicators: 3. Good Health and Well-being; 4. Quality Education.",
    "foreignLanguageTextbooks": false
  }
]
