[
  {
    "name": "陳柏瑄",
    "email": "phc@ntut.edu.tw",
    "latestUpdate": "2024-02-19 14:37:59",
    "objective": "本課程將深入探索互聯網的世界，揭示它如何從一個概念轉變為塑造當代社會和商業環境的關鍵力量。本課程專為希望深入理解互聯網對當今世界影響的商業領袖和決策者角度出發，內容豐富而全面，不僅覆蓋了互聯網的基礎知識，更深入探討了它對各行業的具體影響以及未來的發展趨勢。課程首先介紹互聯網的基本概念，從它的歷史發展到現今的狀態，建立相關的理論基礎。接續深入研究互聯網的核心思維，探索它如何改變了商業策略和市場環境，並分析互聯網與新興的物聯網技術之間的關聯和區別。此外，課程將涵蓋互聯網對各個行業，從金融、零售到製造業等的影響，並探討傳統企業如何在這個數位化時代進行轉型和創新。本課程將通過豐富的案例研究和實際的業界經驗分享，使學生能夠看到互聯網理論在實際業務中的應用。透過專家和企業家的互動將能夠從實務的經驗中學習並獲得寶貴的觀點。最後，課程將聚焦於互聯網技術的未來發展，包括人工智慧、大數據分析和雲端計算等領域的最新趨勢，幫助學生為應對快速變化的數位經濟做好準備，提供一個全面了解互聯網的平台，作為在這個持續變化的數位化時代中成功領導和創新提供必要的知識和工具。\nThis course delves deeply into the world of the Internet, revealing how it has transformed from a mere concept into a key force shaping contemporary society and the business environment. Designed specifically for business leaders and decision-makers eager to gain a comprehensive understanding of the Internet's impact on today's world, the course offers rich and comprehensive content. It not only covers the basic knowledge of the Internet but also explores its specific effects on various industries and future development trends. Initially, the course introduces the fundamental concepts of the Internet, tracing its historical development to its current state, thereby establishing a theoretical foundation. It then proceeds to a thorough examination of the core thought process behind the Internet, exploring how it has revolutionized business strategies and the market environment, and analyzes the relationship and differences between the Internet and emerging Internet of Things (IoT) technologies. Additionally, the course encompasses the impact of the Internet across various sectors, from finance and retail to manufacturing, and discusses how traditional businesses can transform and innovate in this digital era. Through a wealth of case studies and sharing of real-world industry experiences, students will see the practical application of Internet theories in business. Interaction with experts and entrepreneurs will provide valuable insights from practical experiences. Finally, the course focuses on the future developments of Internet technologies, including the latest trends in artificial intelligence, big data analytics, and cloud computing, preparing students to face the rapidly changing digital economy. This course offers a comprehensive platform for understanding the Internet, providing the necessary knowledge and tools for successful leadership and innovation in this continuously evolving digital age.",
    "schedule": "週次\t課名\t備註\n1\t課程介紹與互聯網初探\t\n2\t互聯網與金融：理論與實務一\t\n3\t互聯網演進與應用\t\n4\t區塊鍊新興技術發展\t\n5\t互聯網 + 工業\t\n6\t互聯網 + 商業\t\n7\t互聯網\t\n8\t互聯網與金融：理論與實務二\t\n9\t互聯網與金融：理論與實務三\t期中考周\n10\t互聯網與金融：理論與實務四\t\n11\t互聯網與金融：理論與實務五\t\n12\t互聯網與金融：理論與實務六\t\n13\t專題演講一\n14\t互聯網與金融：理論與實務七\t\n15\t數位轉型與營運模式創新\t\n16\t互聯網社會落地應用議題\t\n17\t地緣政治與價值鏈重組的臺灣產業因應策略\t\n18\t專題演講二",
    "scorePolicy": "1.\t出席 25%\ni.\t嚴禁請人代為出席上課\nii.\t缺席請提早向助教請假\niii.\t無故缺席 5 次以上為缺課超過 1/3，將以修課不及格處理\n2.\t課堂參與 40%\n3.\t課後報告 35%",
    "materials": "教師自編教材",
    "consultation": "請 email 聯絡授課老師",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "陳銘崑",
    "email": "f10361@gmail.com",
    "latestUpdate": "2024-02-19 11:25:17",
    "objective": "本課程只在針對互聯網發展下如何釐清其中關鍵議題如什麼是互聯網、互聯網核心思維、互聯網與物聯網之區別、互聯網影響哪些行業、傳統性企業如何在物聯網時代轉型、及其未來之發展。之後其中之理論及各產業之應用案例之研討亦包含其中。\nThis course will focus on the development of the Internet for how to clarify the key issues such as what is the Internet, the Internet core thinking, the difference between the Internet+ and the Internet of Things, the impact of the Internet on which industry, how traditional enterprises in the era of things transition, and its future development. After which the theory and the application of the case study of the industry also includes them.",
    "schedule": "3/19 互聯網 + 工業\n3/26 互聯網 + 商業\n4/3  互聯網數位轉型",
    "scorePolicy": "1. 課堂討論\n2. 報告",
    "materials": "簡報",
    "consultation": "f10361@gmail.com",
    "remarks": "SDG 4 : 教育品質",
    "foreignLanguageTextbooks": false
  }
]
