[
  {
    "name": "尹秦清",
    "email": "yinchinching@ntut.edu.tw",
    "latestUpdate": "2024-02-20 10:40:46",
    "objective": "本課程主要目的是了解企業與顧客之關係，促使顧客滿意及忠誠回應而產生終身價值，進而提昇企業獲利。課程內容包括顧客關係管理的概念與本質、顧客行為、顧客資料探勘、顧客關係管理系統、顧客關係管理專案之規劃與管理、顧客關係管理的績效衡量、顧客關係管理實務研討。\nThe objectives of this course are to learn the relationship between corporation and customer, to increase the profit by customer lifetime value through customer satisfaction and royalty. The topics of this course includes Concepts and Context of CRM, Consumer Behavior, Customer data mining, CRM system, Planning and management of CRM projects, Performance Measurement of CRM, Customer Relationship Management :Practices.",
    "schedule": "Week 01 顧客關係管理導論\nWeek 02 顧客關係管理與消費者行為 I\nWeek 03 顧客關係管理與消費者行為 II\nWeek 04 顧客關係管理之經營面\nWeek 05 顧客關係管理之流程面\nWeek 06 發展、維繫、強化顧客關係 I\nWeek 07 清明節\nWeek 08 發展、維繫、強化顧客關係 II \nWeek 09 期中評測\nWeek 10 發展掌握目標客群的能力\nWeek 11 發展服務顧客創新商業模式的能耐\nWeek 12 發展顧客服務技術整合能量\nWeek 13 顧客滿意度與忠誠度 \nWeek 14 顧客不滿意與抱怨的處理\nWeek 15 顧客關係管理的銷售與行銷  \nWeek 16 拓展新顧客至非顧客群 I \nWeek 17 拓展新顧客至非顧客群 II\nWeek 18 期末報告",
    "scorePolicy": "期中評考 30％\n平時課堂參與、研討 40％\n期末專題報告 30％",
    "materials": "1. 顧客關係管理─新時代的決勝關鍵，劉文良，碁峰資訊股份有限公司\n2. 顧客關係管理─整合雲端應用服務，陳美純，前程書局",
    "consultation": "Email, Office Hours, and i-School Plus",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2023-12-31 20:14:36",
    "objective": "本課程主要目的是了解企業與顧客之關係，促使顧客滿意及忠誠回應而產生終身價值，進而提昇企業獲利。課程內容包括顧客關係管理的概念與本質、顧客行為、顧客資料探勘、顧客關係管理系統、顧客關係管理專案之規劃與管理、顧客關係管理的績效衡量、顧客關係管理實務研討。\nThe objectives of this course are to learn the relationship between corporation and customer for both B2B and B2C. So to increase the profit by customer lifetime value through customer satisfaction and royalty. \n\nThe topics of this course includes Concepts and Context of CRM, Consumer Behavior, Customer data managing, and CRM system, where we will practice the for CRM Planning and management, and Performance Measurement.",
    "schedule": "Week 1: Introduction and Defining on Customers Relationship Management\nWeek 2:Sales and Marketing play important Role in CRM\nWeek 3: How to develop, maintain and strengthen the relationship with customers (CRM)\nWeek 4:Crisis Management in customers services complaint\nWeek 5: Analysis and Maintaining the Customer Value, Satisfaction, and Loyalty\nWeek 6:Developing a positive and strategy on CRM\nWeek 7: A New Approach on CRM\n             Value Articulation—Customer Complaints and Improvement\nWeek 8: Strategy Plan for CRM\nWeek 9: Design Customer Service and Supporting System | Handle for customers complaints|How to handle VIP premium customers \nWeek 10: Experiential Marketing\nWeek 11: Build up customer database by filling into the survey form to create customer value\nWeek 12: Developing, maintain, and strengthen the customer relationship\nWeek 13: Build up customer Royalty (Organizing the customers Database)\nWeek 14: Case Study:\n                Bring in customers value by knowing where their requirements are\nWeek 15: Strengthen the customers relationship\nWeek 16: A plan for Royal customers service: evaluation and assessment E-commerce service \nWeek 17: Plan for building up the customers satisfactions\nWeek 18: Final Exam",
    "scorePolicy": "Group Presentation: 4-5 people in a group : 30%\nPaper Exam + Individual Report.                : 35%\nParticipation                                                : 35%\n\nProof of documents required, such as sick leave notice can be provided later.\nA wrap-up presentation, reflection, of previous class may be required in next class.\n\t360 degrees evaluation at the end of the class by peers.",
    "materials": "Customer Relationship Management 2nd Edition by Ed Peelen, Rob Beltman \nEffective CRM using Predictive Analytics 1st Edition by Antonios Chorianopoulos \n\nLiterature Reading:\nLampel, J., & Germain, O. Creative industries as hubs of new organizational and business practices. In. UK: Elsevier (2016)\nYang, Angela, Shiyi Multimedia Corporation: The Value Conversion of Intellectual Property of SanYu Special Exhibition (2021)\nConley, J. G., Bican, P. M., & Ernst, H. Value Articulation: A Framework For The Strategic Management of Intellectual Property. California Management Review, 55(4), 102-120. doi:10.1525/cmr.2013.55.4.102 (2013)",
    "consultation": "Afterclass : 30 mins",
    "remarks": "An alternative for course distance learning is on MS teams.  the link will be provided when it is needed.",
    "foreignLanguageTextbooks": true
  }
]
