[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2023-12-14 16:51:25",
    "objective": "In literary studies, when we encounter the term \"legend\", it is often understood as stories that center on human protagonists rather than supernatural beings - as differentiated from \"myth\" - such as the stories of King Arthur and his knights, the search for the Holy Grail, and the dragon-slaying in medieval literature. This course, however, will not be limited by the scope of the Middle Age and will extend the definition of \"legend\" by examining the prominent archetypes in Western literature. The course will explore how these archetypes not only form the basis of classic literature, but also pervade and enrich our popular culture including films, operas, anime, and video games.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction to the course, exercise of critical reading and textual analysis\n\nTeaching session 1: the medieval legend\nWeek 2-3:\nText: Gottfried von Strußburg's Tristan\nOpera: Richard Wagner's Tristan und Isolde\nWeek 4-5: \nText: The Song of Roland\nFilms: Tristan and Isolde (2006), Kingdom of Heaven (2005)\nCritical essay: \"The Necessity of Permanent Criticism: A Postcolonial Critique of Ridley Scott's Kingdom of Heaven\"\n\nTeaching session 2: the Christian legend: God and the Devil\nWeek 6:\nText: The Book of Job\nWeek 7-9: \nText: John Milton's Paradise Lost\nFilm: The Devil's Advocate (1997)\nCritical essay: “‘Better to Reign in Hell than Serve in Heaven’, Is That It?”: Ethics, Apocalypticism, and Allusion in The Devil’s Advocate\"\n\nTeaching session 3: the legend of the libertine and the Romantic hero\nWeek 10-11:\nTexts: Marquis de Sade's The Misfortunes of Virtue\nFilms: Quills (2000)\nCritical essay: \"Nihilism and Dystopian Morality in the Marquis de Sade’s Justine\"\nWeek 12-13:\nText: Byron's selected poems\nFilm: BBC's Byron (2003)\n\nTeaching session 4: the legend of monsters: the vampire and the cannibal\nWeek 14-16:\nTexts: Bram Stoker's Dracula\nFilms: Bram Stoker's Dracula (1992), Interview with the Vampire (1994)\nWeek 17:\nText: Maggie Kilgour's \"Metaphors and Incorporation\"\nFilms: Red Dragon (2002)\nTV: Hannibal (2013-2015), Attack on Titan (2013-2022)\nCritical essay: \"Freud's Worst Nightmare: Dinning with Dr. Hannibal Lecter\"\n\nWeek 18: Mock conference of students' final paper",
    "scorePolicy": "Attendance and participation: 30%\nIndividual presentation (mock conference): 30%\nFinal paper: 40%",
    "materials": "All reading materials will be uploaded to the Google Drive",
    "consultation": "Office: 共同科館 409Email: kpchen@ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
