[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2024-02-18 09:43:05",
    "objective": "In literary studies, when we encounter the term \"legend\", it is often understood as stories that center on human protagonists rather than supernatural beings - as differentiated from \"myth\" - such as the stories of King Arthur and his knights, the search for the Holy Grail, and the dragon-slaying in medieval literature. This course, however, will not be limited by the scope of the Middle Age and will extend the definition of \"legend\" by examining the prominent archetypes in Western literature. The course will explore how these archetypes not only form the basis of classic literature, but also pervade and enrich our popular culture including films, operas, anime, and video games.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction to the course, exercise of critical reading and textual analysis\n\nTeaching session 1: the medieval legend\nWeek 2-3:\nText: Gottfried von Strußburg's Tristan\nOpera: Richard Wagner's Tristan und Isolde\nWeek 4-5: \nText: The Song of Roland\nFilms: Tristan and Isolde (2006), Kingdom of Heaven (2005)\nCritical essay: \"The Necessity of Permanent Criticism: A Postcolonial Critique of Ridley Scott's Kingdom of Heaven\"\n\nTeaching session 2: Shakespeare and the Renaissance\nWeek 6-7:\nText: Remeo and Juliet\nWeek 8-9:\nFilms: Baz Luhrmann's Romeo+Juliet\nCritical essay: \"Closed in a Dead Man’s Tomb’: Juliet, Space, and the Body in \tFranco Zeffirelli’s and Baz Luhrmann’s Films of Romeo and Juliet.” \n\nTeaching session 3: Christianity and literature: God, the devil, and humanity\nWeek 10:\nText: The Book of Job\nWeek 11-12: \nText: John Milton's Paradise Lost\nFilm: The Devil's Advocate (1997)\nCritical essay: “‘Better to Reign in Hell than Serve in Heaven’, Is That It?”: Ethics, Apocalypticism, and Allusion in The Devil’s Advocate\"\n\nTeaching session 4: Romanticism\nWeek 13-15:\nTexts: William Blake's and Byron's selected poetical works\nFilms: BBC's Byron (2003), Red Dragon\n\nTeaching session 5: the monster and modern horror\nWeek 16-17:\nFilms: Alien, The Exorcist\nCritical essay: Barbara Creed's The Monstrous Feminine\n\nWeek 18: Mock conference of students' final paper",
    "scorePolicy": "Attendance and participation: 30%\nIndividual presentation (mock conference): 30%\nFinal paper: 40%",
    "materials": "All reading materials will be uploaded to the Google Drive",
    "consultation": "Office: 共同科館 409Email: kpchen@ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
