[
  {
    "name": "翁文慧",
    "email": "wendywwh@ntut.edu.tw",
    "latestUpdate": "2024-02-21 14:27:25",
    "objective": "The course aims to expose the students to scientific ideas and enable them to apply these ideas in addressing their research problems. It also aims to develop in students a deeper understanding of their own study works, and the others related fields, so they can be active, responsible, and effective contributors in science. The course also aspires to provide students with the required competencies that enable them to think, reflect, wonder, and flourish as responsible and successful individuals.",
    "schedule": "Course content:\n1 class rule introduction, Basic format, Prepare Title and List Authors and Address\n2.Writing Abstract, Introduction, Materials and Methods, Results and Discussion\n3.How to Write a Thesis, Present a paper Orally; Submit a manuscript and Thesis Writing\n4. Presentation skills, the vedio record will be used in the class.\nThe list of invited speakers and student leads seminar as below:\n\t                        \nweek 1. Introduction  ( the schedule will be discussed)\nweek 2 ~3 student presentation in library ( 3/28 no school day)\nweek 4. Discuss scientific Proposal Description Title and Reference Due\t                                                              \nweek 5-18 week  student presentation\nweek 18 Final Report Due",
    "scorePolicy": "The score configuration to this course:\nSeminar performance 20%, discussion with Prof. Weng 25%  \nQuestions proposed on the classes and interact with participants 40%\nPresent 5%\nHand in notes and paper works 10%",
    "materials": "*The extra conferences or lectures are held during the semester will be posted by email from time to time, participates are always welcome to share the information to each other, or try to seek out the conferences outside of school by yourself.  At least one international conference you should attend in this semester.\n\nClass Rules\n1.\tThe presenters have to send all the references (usually 5 papers or more) and PPTs by email to all participants at least TWO DAYS before your presentation.\n2.\tLaptops or any devices can search information are welcome to be used in the class.\n3.\tThe score configuration to this course:\n\tSeminar performance 20%, three titles, references selection and ppt preparations 25% \n\tQuestions proposed on the classes and interact with participants 40%\n\tAttendance 10%\n\tHand in lectures notes and paper works 5%\nPlease hand in your lecture notes include questions and PPTs (in final PDF version) by email to  jayashreechem7@gmail.com (She will burn into a CD then send to Prof. Weng) by the end of semester. \n\tThe cover page should include:  Student name, ID, course name and course number\n\tThis semester you should attend at least 6 lectures. Each lecture note should include: Conference website, name, date and time, speaker’s name, title, note of lecture (can’t copy form conference’s abstract), each lecture note should not less than 2 pages.  \n4.\tThe criteria of papers selection:\nThe selected papers should be top 5 of the ranking or impact factor (IF) higher than 10 in the category. Please labeled the ranking information on the paper to show me. Regarding paper selection, the file name should be labeled as below, then send to professor with the email subject “112.2 EOMP _your name_Student ID”. Please keep to use the same series of subject to reply me.\n1.\tTopic: Title 1 & Paper :1-1, 1-2 …….1-5\n            Title 2 & Paper :2-1, 2-2…….2-5\n            Title 3 & Paper :3-1, 3-2…….3-5\n\n\tAs long as the topic has been selected by one of classmates, you are not allowed to use it. (Try to be an early bird…). The three topics should be given a proper title (this will be evaluated by prof. Weng); I suggest the title better less than 10 words.",
    "consultation": "Any question please fell free to send an email to wendywwh@ntut.edu.tw",
    "remarks": "In case need long distant learning, online course software：microsoftteams will be used, the link as below:https://teams.microsoft.com/l/team/19%3a2sHBNq1_6RwjX291Yo6ema9BpqBtX26Oi163O0AR7cQ1%40thread.tacv2/conversations?groupId=8c3e78c3-c168-4613-a905-2068c3db04c7&tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218In case the schedule has any changes, I will be sent to participant's school email or please don't hesitate to contact: contact:wendywwh@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
