[
  {
    "name": "芮嘉瑋",
    "email": "david@email.ctci.org.tw",
    "latestUpdate": "2023-12-14 14:37:01",
    "objective": "專利文件是最具價值的技術研發資訊。課程除了介紹專利相關基礎知識之外，並以有效的專利檢索分析技藝洞悉未來技術趨勢，特別是針對化學工程、生物科技、生醫材料、智能程序工程、綠色能源、光電半導體、奈米材料等系所研究發展領域的專利文件。透過有系統的分析及視覺化的圖示呈現企業有用的專利情報 (intelligence)，並找到其中潛在的商業利益。\nPatent documents are the most valuable technology research and development information. In addition to introducing the basic knowledge of patents, the course also uses effective patent retrieval and analysis techniques to gain insight into future technological trends. The technical fields of patent documents are especially aimed at chemical engineering, biotechnology, biomedical materials, chemical process and intelligent engineering, green energy, optoelectronic semiconductors and nanomaterials. Present the useful patent intelligence of enterprises through systematic analysis and visual diagrams, and try to find the potential commercial benefits.",
    "schedule": "Course Syllabus\n1 week：Scope of intellectual property rights 智慧財產權的範圍\n2 week：Introduction to basic concepts of patents 介紹專利基本概念\n3 week：How to read the patent specification and patent claims 如何閱讀專利說明書 & 申請專利範圍怎麼看\n4 week：Patent requirements for substantive examination 實體審查之專利要件\n5 week：Patent Search Techniques, Strategies and Processes 專利檢索技巧、策略與流程\n6 week：The Importance and Purpose of Patent Analysis 專利分析的重要性及其目的\n7 - 8 weeks：Patent map analysis practice 專利地圖分析實務\n9 -14 weeks：Patent analysis case 專利分析案例分享 (化學工程、生物科技、生醫材料、智能程序工程、綠色能源、光電半導體、奈米材料、電動車、電池…..)\n15 week：Patent Application Strategies and Strategy Applications 專利申請策略與策略運用\n16 week：Quality and value of patents 專利的品質與價值\n17 week：Enterprise patent management strategy and execution 企業之專利管理策略與執行\n18 week：Final Exam 期末測驗",
    "scorePolicy": "出席與學習態度 20%\nHomework & Presentation & Report  80%",
    "materials": "1. 陳達仁、黃慕萱，專利資訊檢索、分析與策略，華泰文化，2018/04/02，ISBN：9789869531269\n2. 張瑞芬、張力元、吳俊逸、樊晉源，專利分析與智慧財產管理：以資訊技術與知識管理方法為手段，華泰文化，2021/07/21，ISBN：9789869941785\n3. 劉國讚，國際專利分析與布局，元照出版，2021/06/01，ISBN：9789575115050\n4. 自編簡報\n5. 其他網路資源",
    "consultation": "Email: david@email.ctci.org.tw",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
