[
  {
    "name": "狄雅南",
    "email": "ardilahayu@ntut.edu.tw",
    "latestUpdate": "2023-12-13 19:19:27",
    "objective": "本課程旨在教導學生瞭解各類化工程序模式的建立以及其求解的方法。內容包括：輸送動態方程式之建立，線性、非線性、矩陣、微分方程等之轉換及求解。\nThe goal of process simulation is to develop numerical analysis techniques that allow students to simulate the behavior of a chemical process. The contents involving：the development of dynamic equations of transport, the transformations and solutions of linear, nonlinear matrix, and differential equations.",
    "schedule": "1st week : Concept of Process Design and Simulation\n2nd week: Introduction of process design\n3rd week : Thermodynamics (properties and regression) \n4th week : Process simulation \n5th week : Practical simulations\n6th week : Practical simulations\n7th week : Practical simulations\n8th week : Progress Presentation \n9th week : Process Synthesis and Energy Integration\n10th week:  Introduction of process synthesis and energy integration\n11th week: Unit operations (distillation, reactive distillation, heat exchanger, reactor, vessel, pump) and Steam and cooling water systems\n12th week: Engineering Economics and Optimization \n13th week: Engineering Economics and Optimization\n14th week: Economic decision and cost diagram\n15th week: Preliminary cost and cost data\n16th week: Final Presentation\n17th week: Review\n18th week: Final Project Report",
    "scorePolicy": "Progress Presentation \t        \t\t          30 %\nFinal Presentation                                             30%\nFinal Project Report\t\t\t\t\t  35 %\n(Q&A)\t                                                            5%",
    "materials": "1. Smith, Robin, Chemical Process Design and Integration, John Wiley & Sons, Ltd, 2005\n2 Douglas, J. M. Conceptual Design of Chemical Processes, McGraw-Hill, 1988\n3. Peters, Max S., Plant Design and Economics for Chemical Engineers, McGraw Hill, 2004.\n4. Luyben, William L.; Tyreus, Bjorn D.; Luyben, Michael L.; Plantwide Process Control, McGraw-Hill, 1998.",
    "consultation": "Students can ask any time through the i-Plus system or offline discussions at Chemical Engineering-411 on Tuesday (13:10-17:10 p.m.) or Thursday (08:00-20:00 p.m.) . This course will use English.",
    "remarks": "*Online course will be offered depend on pandemic situation via Google Meet or Microsoft Teams.",
    "foreignLanguageTextbooks": true
  }
]
