[
  {
    "name": "陳孝行",
    "email": "f10919@ntut.edu.tw",
    "latestUpdate": "2023-12-11 11:00:16",
    "objective": "本課程介紹科技論文寫作與報告，課程內容包括科技論文寫作元素介紹 (摘要、介紹、方法、結果、討論、結論) 與撰寫方式，文獻搜尋與整理，報告與發表注意事項，以利環境所碩博士生應用於未來論文撰寫與成果發表。",
    "schedule": "Week 1 : Guide for author and Instruction for reviewer \nGuide for author Water research and Environmental Science & Technology \nInstruction for reviewer for Environmental forensics.\nHow to perform well on stage in a world class conference\nEthnics in publishing\nHomework: What are SCI and IMPACT FACTOR? Please select one of you favorite journals, and tell me the ranking in a certain category.\nHomework: Please install Endnote in your laptop.\nWeek 2: How to properly cite a paper? Using citation software (Endnote, version X5)\nCitation and reference (import from sciencedirect, scopus, etc)\nOutput style (name, title ….) \nAbbreviation\nHomework: Please select one of you favorite journals, and cite an article, a conference and a book chapter in a short paragraph.\nWeek 3: Examples between journals and software practice.\nSearch and modification for a journal not in the database (ex. Environmental forensics).\nHomework: Please select another one of you favorite journals not in the database and cite an article, a conference and a book chapter in ENGLISH AND CHINESE in a short paragraph.\nWeek 4: How to publish a paper in a SCI journal\nhandout",
    "scorePolicy": "Homework\t30 %\nReport and presentation\t70\t%",
    "materials": "使用外文原文書",
    "consultation": "Office hour",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "曾昭衡",
    "email": "tsengco@ntut.edu.tw",
    "latestUpdate": "2023-12-12 19:21:25",
    "objective": "本課程介紹科技論文寫作與報告，課程內容包括科技論文寫作元素介紹 (摘要、介紹、方法、結果、討論、結論) 與撰寫方式，文獻搜尋與整理，報告與發表注意事項，以利環境所碩博士生應用於未來論文撰寫與成果發表。\nThis class focuses on the Introduction of major elements in technical writing, including abstract, introduction, research methods, results, discussion, and conclusion. Writing grammar, style, and methods to perform literature search and review are also introduced. The main aim of this course is enhancing the ability of graduate students in future thesis writing and research publication.",
    "schedule": "1.Introduction\n2.Methods section\n3.Results section\n4.Discussion section\n5.How to write the abstract?\nTips for journal submission\nThe writing process",
    "scorePolicy": "3 Presentations",
    "materials": "Steve Wallace\u000b, How to Write and Submit an Academic Paper in 16 Weeks",
    "consultation": "tsengco@ntut.edu.tw",
    "remarks": "因應疫情調整之上課方式：期中考、期末考採實體紙筆測驗；期末報告採線上報告",
    "foreignLanguageTextbooks": true
  }
]
