[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2023-12-13 17:05:15",
    "objective": "這門課除了教授傳統企業環境管理及相關實務之外，特別將著重在企業提升如何透過綠色創新來提升綠色競爭力的策略與做法；此外，課程另一重點將會是企業如何透過協助聯合國永續發展目標 (UN SDGs) 的達成，來創造企業的永續競爭力。學生將會深入探究金字塔底層 (BOP) 與創造共享價值 (Creating Shared Value, CSV) 之理論及實務做法，以及成為一個真正永續企業的策略。\nIn this course, traditional corporate environmental management and the strategies for improving green competitiveness will be taught. In addition, the strategies of corporate sustainability- how the corporate to create sustainable competitiveness by coping with the 17 goals of UN’s Sustainable Development Goals (UN SDGs) will also be taught. Theories and practices of Bottom of the Pyramid (BOP) and Creating Shared Value (CSV), as well as the strategies of being a true sustainable enterprise will be emphasized in the class.",
    "schedule": "Schedule (Tentative)\nWeek 1(2/20) Course Introduction and Introduction to Business Management (Prof. Allen H. Hu)\nWeek 2(2/27) Global Risks and Future Leaders (Dr. Niven Huang, KPMG)\nWeek 3(3/5) Introduction to Corporate Sustainability and ESG (Prof. Allen H. Hu)\nWeek 4(3/12) Special Topic: Towards a Circular and Low-Carbon Economy (Dr. Grace Liu, Acer)\nWeek 5(3/19) Corporate Sustainability - Core Issues of Corporate (Sustainable) Governance (Prof. Allen H. Hu)\nWeek 6 (3/26) Special Topic on Corporate Sustainability (Wim Chang, Delta Electronics Inc.)\nWeek 7 (4/2) National Holiday*\nWeek 8(4/9) Sustainable Finance and Portfolio ESG analysis (Mr. Justin Hsieh, KPMG)\nWeek 9 (4/16) Corporate Strategy for Environmental and Sustainability Management (Prof. Allen H. Hu)\nWeek 10(4/23) Special Topic: Dell’s Perspectives & Practices on Sustainability & Circular Economy (Ms. Vivian Tai, Dell Technologies)\nWeek 11(4/30) Social Innovation and Entrepreneurship Workshop (Ms. Ning Lee, KPMG)\nWeek 12 (5/7) Base of the Pyramid/Inclusive Business- A New Business Ocean Strategy (Prof. Allen H. Hu)\nWeek 13 (5/14) Circular Economy and Corporate Sustainability (topic to be confirmed, Sherry Lin, KPMG)\nWeek 14 (5/21) Climate Risk Management and Net-zero Trends (Toy Wang, KPMG)\nWeek 15 (5/28) Special Topic on Sustainable Business- ESG from the DJSI and CDP Rating (Dr. Jerry Hsu, Dr. Daniel Chen, and Dr. Yao-te Chen, Sustain Vision)\nWeek 16(6/4) Site Visit- Company Tour (to be decided)\nWeek 17(6/11) Group Project Presentation (Prof. Allen H. Hu)\nWeek 18(6/18) Conclusion- Net Positive! Expecting a New Norm for Doing Business (Prof. Allen H. Hu)",
    "scorePolicy": "Homework/Reports: 30%  Participation: 15% Final Exam: 25%   Project: 30%",
    "materials": "1.\tPolman P. and A. Winston (2021). Net Positive- How Courageous Companies Thrive by Giving More Than They Take, Harvard Business Review Pres.\n2.\tSanford C. (2017). The Regenerative Business- Redesign Work, Cultivate Human Potential, Achieve Extraordinary Outcomes, Nicholas Brealey Publishing. \n3.\tWinston, A.S. (2014), The Big Pivot: Radically Practical Strategies for a Hotter, Scarcer, and More Open World, Harvard Business Review Press. \n4.\tBlowfield, Michael (2013), Business and Sustainability, Oxford: Oxford University Press.\n5.\tWeybrecht, Giselle (2010), The Sustainable MBA: The Manager's Guide to Green Business, John Wiley & Sons, Chichester, UK\n6.\tWerther, W.B. and D. Chandler (2011). Strategic Corporate Social Responsibility- Stakeholders in a Global Environment (2nd edition), Sage Publications\n7.\tEsty and Winston (2009), Green to Gold: How Smart Companies Use Environmental Strategy to Innovate, Create Value, and Build Competitive Advantage, Wiley \n8.\tReunhardt, F.L. (2000). Down to Earth- Applying Business Principles to Environmental Management, Harvard Business School Press.\n9.\tOthers (papers, reports…) Supplementary materials",
    "consultation": "Wednesday morning and afternoon, or by appointment!",
    "remarks": "SDG12",
    "foreignLanguageTextbooks": true
  }
]
