[
  {
    "name": "林筱玫",
    "email": "lydia.hmlin@gmail.com",
    "latestUpdate": "2024-02-20 20:16:03",
    "objective": "本課程旨在培養學生了解數位媒體的基本概念、演變歷史、發展趨勢，並掌握現代媒體技術的重要性。本課程將使學生了解和學習生成人工智慧技術的工作原理。 學生將進一步了解人工智慧的定義、特徵和發展趨勢，探索人工智慧在不同領域的創意應用，並進行實踐。\n\nThis course aims to train students to understand the basic concepts, evolution history, and development trends of digital media and to master the importance of modern media technology. This course will enable students to understand and learn how generative artificial intelligence technologies work. Students will further understand the definition, characteristics, and development trends of artificial intelligence, explore the creative applications of artificial intelligence in different fields, and practice it.",
    "schedule": "Week 1-2: Course Introduction and Generative AI Overview\n• Understand the course objectives, content, and assessment methods\n• Introduce the basic concepts and application areas of generative AI\n• Explore the potential of generative AI in the cultural and creative fields\n\nWeek 3-4: Digital Media and Media Literacy Basics\n• In-depth understanding of the characteristics and development trends of digital media\n• Develop students’ awareness of the importance of media literacy\n\nWeek 5-6: Overview of Generative AI Technologies\n• Learn the basic principles and standard models of generative AI\n• Introduction to GANs (Generative Adversarial Networks) and other generative AI models\n\nWeek 7-8: Cultural Creation and Idea Generation\n• Explore the creative application of generative AI in the cultural and creative fields\n• Students shared cultural and creative generative AI cases\n\nWeek 9-10: Language Generation and Literary Creation\n• Learn language generation technology and explore its application in literary creation\n• Carry out language generative AI implementation work\n\nWeek 11-12: Image Generation and Art Creation\n• Explore image-generating AI technology and practice its application in artistic creation\n• Students start to do assignments related to implementing AI technology for generating images.\n\nWeek 13-14: LangChain\n• Implementing Taiwan tourism customer service robot using Embeddings\n• ChatGPT Plugin Development\n\nWeek 15-16: Design Thinking Tool and Exercise\n\nWeek 17-18 Final Project Demo",
    "scorePolicy": "期中考試 35% \n分組作業 35%. \n期末報告 20% \n出缺勤表現與貢獻度 10%\n\nMidterm Exam 35% \nGroup assignments 35%\nFinal report 20% \nAttendance/absence performance and contribution: 10%",
    "materials": "(English)  DeepLearning.AI Website: https://learn.deeplearning.ai/\n \n(Chinese )《從 AI 到 生成式 AI：40 個零程式的實作體驗，培養新世代人工智慧素養》，作者：羅光志 博士著，書籍類別：人工智慧，ISBN：9789863127543\n\n(Chinese )《ChatGPT 開發手冊 - 用 OpenAI API・LangChain・Embeddings 設計 Plugin、LINE/Discord bot、股票分析與客服自動化助理》，作者：施威銘研究室 書籍類別：程式設計 / 資料庫，ISBN：978986312762  \n\nand self-made materials",
    "consultation": "Course host contact account number: https://www.facebook.com/berrymeiTeacher’s school Gmail: Lydia@mail.ntut.edu.twTeacher's personal Gmail: Lydia.HMLIN@gmail.com",
    "remarks": "NO",
    "foreignLanguageTextbooks": false
  }
]
