[
  {
    "name": "丁振卿",
    "email": "chchting@ntut.edu.tw",
    "latestUpdate": "2023-12-12 18:02:42",
    "objective": "本課程將企業教育訓練的專精、實務、效益特質融入學校實務課程。企業教育訓練講究課程要專精、內容要具體針對需求、以實務技術做講解、要能有具體成效、講求時間效率。本課程以落地產業應用技術主題，導入德國工業大學任務導向學習模式，課程教導學生從建置雲端資料庫伺服器到撰寫三機一體網頁控制程式進行工廠 CPS 產銷戰情資訊管理系統，串聯工廠人機物料及生產線與品管，並實務教導開發 AI 瑕疵檢測模型，再利用人機操控 PLC 達到機聯網，進行工廠整廠資訊連線。另外，本課程特別加強 AI 瑕疵檢測技術與應用，導入產業 AI 技術搭配教學。今年的課程將加入生成式 AI，教導學生應用及開發生成式 AI 應用。\nThis course integrates the specialization, practice, and benefit characteristics of corporate education and training into the school's practical courses. Enterprise education and training emphasizes that the curriculum should be specialized, the content should be specific to the needs, the explanation should be based on practical skills, it should be able to have specific results, and it should pay attention to time efficiency. This course is based on the theme of landing industrial application technology, and introduces the task-oriented learning model of the German Technical University. The course teaches students from building a cloud database server to writing a three-in-one webpage control program to implement a factory CPS production and marketing war situation information management system, and connect factories in series. Man-machine material and production line and quality control, and practical teaching to develop AI defect detection model, and then use man-machine control PLC to achieve machine networking, and carry out information connection of the whole factory. In addition, this course especially strengthens AI defect detection technology and application, and introduces industrial AI technology for teaching.",
    "schedule": "W1-2 生成式 AI 應用介紹\nW3 Ubuntu+Anaconda AI 工具平台架設、Tensorflow 與 Pytorch 工作框架架設\nW4-5 Ubuntu+Pytorch+Yolo 開發 AI 模型\nW6-7 Ubuntu+Pytorch+Detectron2 開發 AI 模型\nW8 Ubuntu+Pytorch+Anomaly 開發 AI 模型\nW9 期中考\nW10 Ubuntu+Pytorch+Anomaly 開發 AI 模型\nW11 網頁控制相機技術\nW12-17 AI 瑕疵檢測產業技術介紹\nW18 期末考",
    "scorePolicy": "本課程以企業落地技術作上課題材，教導學生真正的企業技術。\n上課學生分組個別指派一組一個助教輔助教學，由業師協助實務技術教學。\n透過成果展覽的方式，以組單位，相互展示及推銷自己的成果。\n透過學習過程學生完成的任務成品，舉辦成果發表，進行學習成效評分。",
    "materials": "1. PHP: Learn PHP in 24 Hours or Less, A Beginner’s Guide To Learning PHP Programming Now, Robert Dwight, Online, 2021.\n2. Learn PHP 7: Object-Oriented Modular Programming using HTML5, CSS3, JavaScript, XML, JSON, and MySQL, Steve Prettyman, Apress, ISBN-13 (electronic): 978-1-4842-1730-6, 2016. \n3. 林大貴，Tensorflow+Keras 深度學習人工智能實踐應用，清華大學出版社，ISBN:9787302493020，2018.",
    "consultation": "本課程有五位助教帶領同學做學習，課程建立 Line 群組，方便同學隨時發問討論。",
    "remarks": "注意！！本課程技術實作課程，教導授課老師團隊所開發並導給產業的技術，還聘請業師協助上課，教導產業產品技術，課程會教導學生撰寫程式，因此，選修學生必須自備筆電。另外，本課程協助上課的助教安排及搭配上課的設備都是授課老師自行張羅，數量有限，修課人數以 60 人上限，了讓真正有興趣的學生可以選上課並來上課，開學第一週如果沒有出席的學生將被要求退選，或者無法獲得學期成績。第一時間沒有選上課的學生，開學加退選時間可以再注意修課人數變動。本課程以實體教學為主，如遇無法採取實體教學情況，視訊教學將透過 Microsoft Teams 進行，相關訊息會在 Line 群組公布",
    "foreignLanguageTextbooks": false
  }
]
