[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-12-11 15:34:05",
    "objective": "Students will learn how to write and present using professional English, with particular focus on design and cultural vocations majors. In addition to continued focus on vocabulary and grammar, this semester, we will work on correct punctuation. Students will also read Alice's Adventures in Wonderland (partially in class and partially on their own) and design an Alice-in-your-major project. \n\nOfficial course description: This course aims to provide pre-service design students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.",
    "schedule": "In addition to supplemental material related to your majors, we will be working through chapters 7–12 of American Headway, which I find to be a very engaging book that also clearly explains a lot of the grammatical intricacies that often trip up non-native speakers. It is no problem if you have not taken the first half of the course (so long as you can get a copy of the textbook) as the topics taught are not cumulative. We will also read Alice's Adventures in Wonderland and do an Alice-in-your-major project.",
    "scorePolicy": "GRADING CATEGORIES\nHomework: 25%\nQuizzes/Tests: 25%\nSkits and Oral Activities: 10%\nPresentations: 10%\nMidterm: 20%\nParticipation: 10%\n\nThese categories may be modified at my discretion, but the midterm will always be 20%.",
    "materials": "1) American Headway 5, 3rd edition is available at this link: https://www.cavesbooks.com.tw/Caves_Search/TBSearch.aspx?key1=9780194726573&querytype1=EAN. \n\nI believe you need to spend 1000 NT to get free shipping, though. The book is usually also available at Taipei Tech's temporary bookstore. \n\n2) Alice's Adventures in Wonderland (Students usually enjoy reading this classic! It's a great way to improve your vocabulary, logic, understanding of the English language, and cultural knowledge (as well as your understanding of English jokes and puns.)",
    "consultation": "Office hours are on Mondays from 10:10–12:00 and from 3:10 to 4:00 and on Tuesdays from 3:10–4:00 (and by appointment only Tuesday mornings from 10:10–12:00).",
    "remarks": "Students should download MS Teams and check it at least three times per week, as it is the platform I rely on for class announcements and individual communication with students. Students who have COVID or are otherwise verifiably ill may contact me via MS Teams private chat (before class) in order to arrange a hybrid class. When you send an MS Teams message or an e-mail, please make sure to include your English name.You may learn about how to download and sign into MS Teams at this address: https://britamericanlit.wordpress.com/ms-teams-login-information/.",
    "foreignLanguageTextbooks": true
  }
]
