[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2024-02-20 13:37:56",
    "objective": "本課程旨在提升學生學術英文能力，課堂將引導學生透過不同的學術聽力訓練、閱讀學術文章、學術寫作練習、與學術口語訓練等，來增進學生於大學英語授課課堂中的課堂參與，以及整體學術能力的展現，並為未來專業職場上語言能力奠定良好基底。\nThis course is designed for undergraduate students to develop their academic English language skills for success in English-medium university coursework. This course will engage students with active participation in a variety of academic listening, reading, writing, and speaking activities that they would encounter in real-life academic university lectures and professional workplace environments.",
    "schedule": "Week \tWeek starting\t\tActivity\t\t\n\n1\tFeb 19\t\t\tIntroduction\t\n2\tFeb 26\t\t\tNo class (Wed Feb 28 holiday)\n3          Mar 4\t\t\tClass and group presentation (Group 1 and 2)\n4\tMar 11\t\t\tClass and group presentation (Group 3 and 4)\n5\tMar 18\t\t\t(Wed Mar 20 holiday University Sports Day)\n6\tMar 25\t\t\tNo class (Lecturer on leave). Assignment or make-up class to be announced.\n7\tApr 1\t\t\tNo class (Lecturer on leave) (Thurs Apr 4 and Fri Apr 5 holidays). No class (Lecturer on leave). Assignment or make-up class to be announced.\n8\tApr 8\t\t\tClass and group presentation (Group 5 and 6)\n9          Apr 15\t\t\tApr 16 School Mid-term\n10 \tApr 22\t\t\tClass and group presentation (Group 7 and 8)\n11 \tApr 29\t\t\tClass and group presentation (Group 9 and 10)\n12\tMay 6\t\t\tClass and group presentation (Group 11 and 12)\n13 \tMay 13\t\tClass and group presentation (Group 13)\n14\tMay 20\t\tSpeaking test\n15 \tMay 27\t\tTest\n16 \tJun 3\t\t\tClass \n17        Jun 10\t\t\tClass \n18 \tJun 17\t\t \tConsultation",
    "scorePolicy": "Evaluation\n\nGroup presentation\t\t\t20%\nSchool mid-term\t\t\t20%\nSpeaking test*\t\t\t\t20%\nTest*\t\t\t\t\t20%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup test may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of the test or exam. The format of the make-up test will be determined by the lecturer.\n\nAttendance policy\nAttendance is taken by your class rep at a time of her or his choice during the class. Your attendance will be recorded in the University system. You will automatically receive a grade of zero for the course with 8 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system to the Class Rep no later than 10 days after the date of the class. \n\nGroup presentation:\nYou will form groups of three and present a book chapter or article selected by the lecturer for 20 minutes followed by a Q&A session. Sign-up with the Class Rep is on a first-come first-serve basis. \n\nEach member is required to speak during the presentation. You will present major points made in the reading.\n\nReadings for group presentations:\nGroups:\n1.\tJudy Brady, \"Why I Want a Wife\" 184 \n2.\tBertrand Russell,\"What I Have Lived For' 187 \n3.\tMartin Luther King, Jr., \"The Dimensions of a Complete Life\" 190\n4.\tNorthrop Frye, \"Don't You Think It's Time to Start Thinking?\" 277 \n5.\tNeil Bissoondath,\"I'm Not Racist But...\" 284\n6.\tSusan Sontag, \"Beauty\" 288 \n7.\tLewis Thomas, \"Altruism\" 292 \n8.\tLeonard Michaels, \"I'm Having Trouble with My Relationship\" 298\n9.\tStephen King, \"Why We Crave Horror Movies\" 232\n10.\tGloria Steinem, \"Why Young Women Are More Conservative\" 241\n11.\tPaul Theroux, \"Being a Man\" 325 \n12.\tDavid Suzuki, \"A Planet for the Taking\" 330\n13.\tGlenn Adamson, “Introduction” in Fewer, Better Things",
    "materials": "To be provided",
    "consultation": "Students may make appointments for consultation.",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
