[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2024-02-20 22:30:22",
    "objective": "本課程將閱讀並討論聯合國 2030 年持續發展議程的議題，主題和做法。 藉由對全球繁榮，社會平等和環境可持續性共同藍圖的認識，學生能進一步參加全球活動，並在本地和跨域發展共同夥伴關係，以參與持續發展目標的行動。 此外，學生將能夠通過批判性閱讀和討論來強化英語能力，並為與可持續發展目標有關的更深入的交流做好準備。\nThis course will read and discuss issues, topics, and practices of the UN’s 2030 agenda for sustainable development, adopted by all UN member states. With full insights and comprehensive views of the shared blueprint for global prosperity, social equality and environmental sustainability, students are expected to participate in global activities and form partnership locally and across borders to engage in SDGs actions. In addition, students will be able to enhance their English competence through critical reading and discussion, and will be prepared for more in-depth communication pertaining to the SDGs.",
    "schedule": "Week \tWeek starting\t\tActivity\t\t\n\n1\tFeb 19\t\t\tIntroduction\t\n2\tFeb 26\t\t\tClass (Wed Feb 28 holiday)\n3          Mar 4\t\t\tClass and group presentation (Group 1 and 2)\n4\tMar 11\t\t\tClass and group presentation (Group 3 and 4)\n5\tMar 18\t\t\tClass and group presentation (Group 5 and 6) \n6\tMar 25\t\t\tNo class (Lecturer on leave)\n7\tApr 1\t\t\tNo class (Thurs Apr 4 public holiday)\n8\tApr 8\t\t\tClass and group presentation (Group 7 and 8)\n9          Apr 15\t\t\tApr 16 School Mid-term\n10 \tApr 22\t\t\tClass and group presentation (Group 9 and 10)\n11 \tApr 29\t\t\tClass and group presentation (Group 11 and 12)\n12\tMay 6\t\t\tClass and group presentation (Group 13)\n13 \tMay 13\t\tClass\n14\tMay 20\t\tSpeaking test\n15 \tMay 27\t\tTest\n16 \tJun 3\t\t\tClass \n17        Jun 10\t\t\tClass \n18 \tJun 17\t\t \tConsultation",
    "scorePolicy": "Evaluation\n\nGroup presentation\t\t\t20%\nSchool mid-term\t\t\t20%\nSpeaking test*\t\t\t\t20%\nTest*\t\t\t\t\t20%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup exam or test may be granted upon presentation of a note of approval for leave from the university system no later than 7 days after the date of the test or exam. The format of the make-up test or exam will be determined by the lecturer.\n\nAttendance policy\nAttendance is taken by your class rep at a time of her or his choice during the class. Your attendance will be recorded in the University system. You will automatically receive a grade of zero for the course with 16 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system to the Class Rep no later than 7 days after the date of the class. \n\nGroup presentation:\nYou will present the following in pairs:\n1.\tA current news event related to SDG as reported by at least 2 news outlets in detail. You must fully understand the event including the historical, cultural, social, scientific, and theoretical background of the event and present the relevant aspects and answer questions satisfactorily.\n2.\tAnalyze the differences in reportage and reasons for and implications of these different perspectives. You will present for up to 15 minutes followed by a Q&A session. \n\nSign-up with the Class Rep is on a first-come first-serve basis.",
    "materials": "Textbook:\nCalling Bullshit: The Art of Skepticism in a Data-Driven World, Carl T. Bergstrom, Jevin D. West, Random House",
    "consultation": "Students may make appointments for consultation.",
    "remarks": "All SDG items.",
    "foreignLanguageTextbooks": true
  }
]
