[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2024-02-29 22:45:33",
    "objective": "ECA 課程專為大一非英語母語的學生設計，加強英語語言技能，特別強調溝通能力和社會、文化、及專業實務應用。 通過整合四種語言技巧能力（閱讀、聽力、口語和寫作），將課堂英語文教學連結至與實務溝通情境之英語文使用。以下為課程設計及教學法之主軸：溝通語言教學（CLT）、任務型導向（TBL）和內容導向教學（CBI），培養學生的英語語言能力為進階專業英文之基礎。\nThe ECA courses are designed for the first-year (freshman), non-native English speaking students to strengthen their English language skills, with particular emphasis on communicative competence and practical application in social, cultural and professional contexts. By integrating the four skills (reading, listening, speaking and writing), the primary objective is to connect the classroom ELT with the real-life communicative situations. To that end, the courses adopt the following approaches: communicative language teaching (CLT), task-based learning (TBL), and content-based instruction (CBI), building a holistic pedagogy to English instruction and developing students’ English language proficiency for the next level ESP courses.",
    "schedule": "Week \tWeek starting\t\tActivity\t\t\n\n1\tFeb 19\t\t\tIntroduction\t\n2\tFeb 26\t\t\tClasses (Wed Feb 28 holiday)\n3          Mar 4\t\t\tClasses \n4\tMar 11\t\t\tClasses\t\t\n5\tMar 18\t\t\tClasses (Wed Mar 20 holiday University Sports Day)\n6\tMar 25\t\t\tNo class (Make-up: TFAM museum visit)\n7\tApr 1\t\t\tNo class (Lecturer on leave on Wed Apr 3; Thurs Apr 4 and Fri Apr 5 are public holidays)\n8\tApr 8\t\t\tClasses\n9          Apr 15\t\t\tApr 16 School Mid-term; GEPT writing and/or speaking exam in class\n10 \tApr 22\t\t\tGroup presentations\n11 \tApr 29\t\t\tClasses\n12\tMay 6\t\t\tClasses\n13 \tMay 13\t\tClasses\n14\tMay 20\t\tSpeaking test\n15 \tMay 27\t\tClasses\n16 \tJun 3\t\t\tTest\n17        Jun 10\t\t\tClasses\n18 \tJun 17\t\t \tConsultation\n\nGeneral plan:\nFrom Week 2 to Week 9:\nOne-hour class: GEPT exam revision\nTwo-hour class: \nFirst hour: We will read and discuss writings in the textbook (Reading the World: Ideas That Matter, Norton). Subjects may include education, human nature and the mind, language and rhetoric, the arts, science and nature, law and government, wealth, poverty and social class, ethics and empathy, and visual culture.\nSecond hour: Grammar (Advanced Grammar in Use with Answers, Cambridge)\n\nFrom Week 10 to Week 18:\nOne-hour class: Grammar (Advanced Grammar in Use with Answers, Cambridge)\nTwo-hour class: \nWe will read and discuss writings in the textbook (Reading the World: Ideas That Matter, Norton).",
    "scorePolicy": "To be confirmed:\n\nSchool mid-term\t\t\t20%\nGEPT speaking and writing    \t10%\nGroup presentation\t\t\t20%\nSpeaking test*\t\t\t\t10%\nTest*\t\t\t\t20%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup exam or test may be granted upon presentation of a note of approval for leave from the university system no later than 7 days after the date of the test or exam. The format of the make-up test or exam will be determined by the lecturer.\n\nAttendance policy\nAttendance is taken by your class rep at a time of her or his choice during the class. Your attendance will be recorded in the University system. You will automatically receive a grade of zero for the course with 16 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system to the Class Rep no later than 7 days after the date of the class.\n\nGroup Presentation\n\nOrganize into 10 to 11 groups. \nVisit the Taipei Biennale before March 24.  Here is the website: https://www.taipeibiennial.org/2023/list/participants).\nPick ONE artwork. Send a message in the LINE group containing the following information: the title of the artwork, the artist, your group number, your group members’ names and student IDs.\nOnce an artwork is chosen by a group, no other group can pick the same artist or artwork. \n\nIn Week 8, your group will present for 15 min on the following:\n1.\tDescribe the artwork.\n2.\tAnalyze the artwork (What are the themes? How are these themes expressed? What is the artist’s point? How is the artist’s point expressed, i.e. in terms of materials, formal aspects such as color, composition, shape etc. of the artwork. Does the artwork demand interaction from the spectators? Does the artwork challenge our thinking? How are images and words used in the artwork?)\n3.\tIs this a good artwork? Why?",
    "materials": "Textbooks (for two semesters):\nAdvanced Grammar in Use with Answers, Cambridge\nReading the World: Ideas That Matter, Norton",
    "consultation": "Students may make appointments for consultation.",
    "remarks": "Reduced inequalitiesQuality educationClimate action",
    "foreignLanguageTextbooks": true
  }
]
