[
  {
    "name": "陳擎文",
    "email": "ccw@ntut.edu.tw",
    "latestUpdate": "2024-01-06 12:46:02",
    "objective": "課程目標：\n本課程旨在深入教授 Pandas 在經營管理領域的商業數據分析中的應用，讓學生掌握如何使用 Pandas 進行高效的數據處理與分析。學生將學習 Pandas 的基本操作，包括資料結構的建立、操作、數據清理技巧，以及如何使用 Pandas 進行高級數據分析技術。期末會讓學生自行實作 2 個實際商業數據分析的 side project，學生將能夠獨立進行商業數據的分析，並解決實際商業問題。\n\n課程描述：\n這是一門針對經營管理領域的商業數據分析的高級 Pandas 課程。從 Python 的基礎知識開始，本課程將引導學生逐步熟悉 Pandas 的核心功能，包括 Series 和 DataFrame 的操作，數據清理技巧，以及數據分析方法。學生將學習如何處理缺失值、合併數據、進行分群分析，以及應用高級函數處理數據。透過實際案例分析，如系所生源分析和業務銷售分析，學生將能夠將理論知識應用於實際問題。課程強調實際操作和案例研究，旨在提高學生的數據分析技能，為未來職場中的數據分析工作做好準備。\nCourse Objectives:\nThis course is designed to provide an in-depth teaching of Pandas in business data analysis within the field of business management, enabling students to master efficient data processing and analysis using Pandas. Students will learn the basics of Pandas operations, including the establishment and manipulation of data structures, data cleaning techniques, and the application of advanced data analysis techniques with Pandas. By the end of the course, students will be expected to independently undertake two side projects on practical business data analysis, equipping them with the skills to analyze business data and solve real-world business problems.\n\nCourse Description:\nThis advanced Pandas course focuses on business data analysis in the field of business management. Starting with the fundamentals of Python, the course will guide students through the core functionalities of Pandas, including the manipulation of Series and DataFrames, data cleaning techniques, and data analysis methods. Students will learn how to handle missing values, merge data, perform cluster analysis, and apply advanced functions for data processing. Through practical case studies, such as departmental student source analysis and business sales analysis, students will be able to apply theoretical knowledge to practical issues. The course emphasizes hands-on practice and case studies, aiming to enhance students' data analysis skills and prepare them for future data analysis roles in the workplace.",
    "schedule": "第 1 週：chp1. 課程簡介，與安裝使用 python，python 基礎\n第 2 週：Pandas 基礎入門練習\n第 3 週：Pandas 一維資料結構：Series\n第 4 週：Pandas 二維資料結構：DataFrame，DataFrame 的 5 個屬性\n第 5 週：查缺值 NAN，DataFrame 取值，三種格式，新增一欄 / 一列\n第 6 週：用軸 axis 來輔助函數計算 (mean,sum,max,min)，\n第 7 週：篩選資料 2 種方法 (條件查詢，query)，DataFrame 的 3 種合併：concat，append，merge\n第 8 週：DataFrame 的常用函數，chp6-11. 函數處理日期資料型態\n第 9 週：期中考\n第 10 週：map,applymap,apply 迴圈函數計算每個資料格，輸出到 excel，建立 sheet\n第 11 週：分群分析 groupby，建立交叉分析表 / 樞紐分析表\n第 12 週：二層列索引鍵，跨層級的資料索引\n第 13 週：商業數據五大分析型態\n第 14 週：各種資料清理方法：字串處理，正規表達式，日期處理\n第 15 週：各種資料清理方法：電話處理，Email 處理，分割字串\n第 16 週：實例：系所生源分析\n第 17 週：實例：業務銷售分析\n第 18 週：期末考",
    "scorePolicy": "1. 上課實作範例加分 25%，作業分數 25%，期中考 25%，期末考 25%\n期末會讓學生自行實作 2 個經管領域的實際商業數據分析的 side project。\n2. 因為課程全程都要寫程式碼，請你慎重考慮是否要選修這門課。若是經常無法來上課的同學 / 或是回去不複習的同學，請三思，因為這門程式課的特色 1 是：只要 2 週沒來上課，就會跟不上進度。這門程式課程特色 2 是：若是沒有複習或做重點筆記，期中考期末考很會容易不及格。\n3. 課程作業偏多，稍難，不適合給對數據分析沒有興趣，或不想認真學的同學。\n4.735 教室不是電腦教室，是一般教室。要自己帶筆電。\n5. 第一周就要帶筆電來上課",
    "materials": "1. 自編教學網站：https://acupun.site/lecture/pandas\n\n2. 教科書：一行指令學 Python－用 Pandas 掌握商務大數據分析 ，作者： 徐聖訓   ，出版社：全華圖書\n3. 參考書目：Python 商業數據分析：零售和電子商務案例詳解，作者： 零一，電子工業出版社",
    "consultation": "1. 可以在 office hours 時段來諮詢 (科研大樓 537 室) 2. 可以在北科 i 學園 PLUS 平台，在課程內留言，諮詢問題 3. 老師的 email：ccw@ntut.edu.tw，可以用 email 諮詢問題",
    "remarks": "建議同學們上課要繫帶筆記本電腦因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：大數據分析",
    "foreignLanguageTextbooks": false
  }
]
