[
  {
    "name": "陳柏瑄",
    "email": "phc@ntut.edu.tw",
    "latestUpdate": "2023-12-12 22:09:05",
    "objective": "本課程介紹了創新的本質、企業創新的原因以及如何管理創新。課程內容程涵蓋有關創新管理的一系列主題，包括創新動機、企業如何利用知識產權（如專利和商標）保護其創新、“研究與開發”（R&D )、創意人員、流程和團隊的管理，產品、服務和體驗創新的管理，“開放式創新” 的採用和使用，以及創新中模塊化的採用和使用。\n本課程在科技管理的部分主要介紹科技管理廠商層次 (micro-level) 與總體層次 (macro-level) 的相關理論，研究的領域與相關學術期刊。廠商層次介紹開放式創新、創業管理、智慧財產管理、資源論、技術搜尋、產業組織論等。在總體層次介紹科技政策的範疇與相關理論，包括技術典範與軌跡、國家、產業與區域創新系統、服務創新、科技計量與指標與產學合作政策等。\n課程內容包括以案例研究為重點的討論，其中混合使用虛實的公司來討論管理創新的各個面向。這些討論與課程中涵蓋的主題互補，並以加強用予實際應用的想法。透過本課程，學生可以對碩 / 博士論文的研究課題，能有正確且有效地構建文獻探討的能力。\nThis course introduces the nature of innovation, why firms innovate, and how innovation can be managed. The lectures cover a range of topics concerning the management of innovation, including motivations for innovating, how firms can protect their innovations using intellectual property rights (such as patents and trademarks), the nature and organization and management of “research and development” (R&D), the management of creative people, processes and teams, the management of product, service and experience innovations, the adoption and use of “open innovation”, and the adoption and use of modularity in innovation.  \nThis course introduces the micro-level and macro-level of technology management with respect to related theories, research field and academic journal. The micro-level comprises open innovation, entrepreneurial management, management of intellectual property, resource-based view, technology search, industrial organization, etc. The macro-level consists of the extent",
    "schedule": "第  一  週\tThe scope, organizations, journals and conferences of TM\n第  二  週\tThe resource-based and capability-based view on technology and innovation\n第  三  週\tEmerging new issues of technology management: Design innovation, transformative innovation policy, smart city\n第  四  週\tNational systems of innovation\n第  五  週\tTriple-helix, innovation ecosystems\n第  六  週\tService innovation and knowledge intensive business service (KIBS)\n第  七  週\tIndicators for science, technology, and innovation\n第  八  週\t期中考試\n第  九  週\tResearch commercialization & entrepreneurship\n第  十  週\tTechnological latecomer’s catch-up strategy\n第十一週\tTransformation and Re-creation\n第十二週\tMulti-level socio-technical regime\n第十三週\tGreen development and firm’s growth\n第十四週\tEnergy development and transition\n第十五週\tEmerging Technologies-LEO satellite, Autonomous Vehicles, Smart City\n第十六週\t技術路徑分析 (一) 業界講師實作\n第十七週\t技術路徑分析 (二) 業界講師實作\n第十八週\t期末報告",
    "scorePolicy": "平時 50％(包含上課互動與上課個案討論)；期中考試 20％；期末分組報告 30％；並提供個人報告機會可額外加分。",
    "materials": "Tidd, J., & Bessant, J. R. (2020). Managing innovation: integrating technological, market and organizational change. John Wiley & Sons.",
    "consultation": "請 email 聯絡授課老師",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
