[
  {
    "name": "陳盈竹",
    "email": "aliceycchen@ntut.edu.tw",
    "latestUpdate": "2023-12-11 15:54:26",
    "objective": "設計的溝通扮演著如何將設計理念成功地傳達以及讓使用者清楚的理解設計本意的重要角色。\n本課程將透過設計思考過程藉由文字、口說、圖面等達到設計溝通之目的及訓練，經由了解設計領域應用之文字搭配口說及圖面進而增進設計者說明設計概念的溝通能力。\n課程內容包含設計溝通的基本原則、技巧及策略，以及如何利用不同的溝通媒介及工具來傳達設計理念。\n課程操作包含案例分析搭配實際的簡報演練及口說訓練讓同學們累積應用經驗。\nDesign Communication plays an important role in how to successfully deliver design concepts and have users understand the design intention clearly. \nThis course will practice and reach the goal of design communication through design thinking by vocabulary uses, verbal speeches, and image presentations.  From understanding the proper application of design language including vocabularies and diagrams in various design fields, designers may improve their skills of concept presentation and communication.  \nThe course content includes basic principles, techniques, and strategies in design communication as well as how to use different media and tools to deliver design concepts.\nCourse activities include case studies with presentation practice and oral speech to help students have experiences in actual application.",
    "schedule": "Week 1: Introduction\nWeek 2: Case Study and Exercise\nWeek 3: Critique Practice One - Visual\nWeek 4: Critique Practice Two - Visual\nWeek 5: Case Study and Exercise\nWeek 6: Critique Practice Three - Layout\nWeek 7: Critique Practice Four - Layout\nWeek 8: Mid-Review Rehearsal I\nWeek 9: Mid-Review Rehearsal II\nWeek 10: Critique Practice Five - Verbal\nWeek 11: Critique Practice Six - Verbal\nWeek 12: Critique Practice - Overall\nWeek 13: Critique Practice - Overall\nWeek 14: Critique Practice - Overall\nWeek 15: Final Review Rehearsal I\nWeek 16: Final Review Rehearsal II\nWeek 17: Final Review\nWeek 18: Final Review",
    "scorePolicy": "Attendance 20%\nClass Work and Presentation 80%",
    "materials": "Laptop or Tablet is required for class work",
    "consultation": "Office Hour by Appointmentaliceycchen@ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
