[
  {
    "name": "林敬皇",
    "email": "gbox@ntut.edu.tw",
    "latestUpdate": "2023-12-19 14:46:02",
    "objective": "資訊安全保險相關事故的理賠調查，使得數位鑑識在金融或資訊領域的重要性日益提升。數位鑑識與調查課程主要說明如何找到入侵或犯罪留下的可能的足跡，並介紹如何在合法與符合鑑識程序規範的前提下蒐集足夠的證據並保護這些有用的證據，以做為未來訴訟有效的佐證。在課程的設計上將以數位鑑識相關國際證照的領域與內容為主，除了教授學生數位鑑識的專業知識外，期能輔導學生取得數位鑑識相關證照。\nThe cyber security incident investigation for the cyber insurance has made digital forensics more and more important in the financial or information industry. This course focuses on identifying possible footprints of intrusions or crimes and collecting sufficient evidence and protect such useful evidence in order to be effective in future litigation. In the design of the course, the domain and content of the digital forensics international certification licenses will be mainly used. In addition to teaching the professional knowledge of digital forensics, it can also help the students obtain digital forensics certification in the future.",
    "schedule": "週次 / Week - 單元主題 / Topic\n\n1. Introduction Digital Forensic\n2. Systems, Disks, and Media\n3. Forensic Analysis\n4. Acquiring Data, Duplicating Data, and Recovering Deleted Files\n5. Steganography and Application Password Crackers\n6. Forensic Software and Hardware\n7. Windows, Linux, and Macintosh Boot Processes\n8. Windows Forensic Analysis\n9. UNIX Forensic Analysis\n10. Macintosh Forensic Analysis\n11. Embedded Systems Analysis\n12. Mobile Network Investigations\n13. Investigating Network Traffic and Investigating Logs\n14. Router Forensics and Network Investigations\n15. Investigating Wireless Attacks\n16. Intrusion Investigation \n17. Defeating Anti-forensics Techniques\n18. Final Project",
    "scorePolicy": "Participation - 10%\nExercise/Homework - 50% \nLab Report - 30%",
    "materials": "Self-made teaching materials & TextBook： Handbook of Digital Forensics and Investigation, Eoghan Casey, Academic Press, Available, https://www.sciencedirect.com/book/9780123742674/handbook-of-digital-forensics-and-investigation#book-info",
    "consultation": "1. Office Hour: Tuesday and Wednesday 13:00-16:002. Discuss and ask questions through NTUT i Academy PLUS (https://istudy.ntut.edu.tw/)3. Mail me",
    "remarks": "1. The course handouts are published in the NTUT i Academy PLUS course.2. If it is announced that remote classes will be taught online, the relevant course files will be recorded and uploaded in the NTUT i Academy PLUS  (https://istudy.ntut.edu.tw/)",
    "foreignLanguageTextbooks": true
  }
]
