[
  {
    "name": "王李吉",
    "email": "richwang@ntut.edu.tw",
    "latestUpdate": "2024-02-22 15:07:42",
    "objective": "學習相似於 Microsoft Power Point 的「拖 - 拉 - 點 - 選」操作方式，再加上一小部份的 Low Code 程式編碼，即可以設計與製作出:「專業級的 APP」 !\n本課程運用學校內的雲端平台: AgilePoint NX，改變了以往撰寫 APP 的模式，不再需要撰寫複雜的程式碼，讓學生專注於 APP 的邏輯流程與 UI (使用者介面)，進而發展貼近市場裡的商業模式，設計出精彩的 APP!\n課程的教學，採用傳統臺北工專的黑手工程師訓練模式:\n「由經入史」: 先講解理論架構，進而延伸到產業的實務運用。\n嚴格要求上課同學動手實做，達成每週的設定目標。課堂上講師所示範的範例非常豐富，下課後會有一定份量的 Homework (實作型作業)。\n經此系統化訓練，在 APP 的設計與製作上，將擁有踏實的內涵與技術，增強在校學生，未來在職場上的競爭力。\n「讓不懂 IT (資訊工程)、非理工背景的學生，更能設計出高人氣的 APP! 」\nLearn the \"Click and Drag\" operation method, as like Microsoft Power Point, and adds some Low-Code, you can design and create: \"Professional APP\"!This course uses the cloud platform in the school: AgilePoint NX, which changes the mode of writing APP in the past, no longer needs to write complex code, let students focus on the logic flow of the APP and UI (user interface), and then close to the market requirement. This course uses the Taipei Tech Practical-Engineer training method:\"From Theory to Practical\": First explain the theoretical structure, and then extend to the practical application of the industry. Through this systematic training, in the design and production of APP, we will have practical connotation and technology to enhance the competitiveness of students in college and the future in the workplace.\"Let students who don't understand IT (information engineering) and non-technical backgrounds can design great and popular APPs!\"",
    "schedule": "第 01 週 App Inventor 2 概述及開發環境建置\n第 02 週 App Inventor 2 基本操作與手機連結\n第 03 週 基本元件以及事件、方法使用\n第 04 週 事件驅動與條件判斷\n第 05 週 介面配置與 BMI 計算\n第 06 週 迴圈與副程式\n第 07 週 清單元件的介紹與外部資料存取\n第 08 週 多重畫面 (Screens) 的切換應用\n第 09 週 期中測驗 \n第 10 週 影音應用介紹\n第 11 週 簡易瀏覽器的應用開發\n第 12 週 繪圖動畫介紹\n第 13 週 繪圖動畫的應用\n第 14 週 手機影像擷取與檔案存取\n第 15 週 手機通訊介紹與應用\n第 16 週 專題製作 - 1\n第 17 週 專題製作 - 2 \n第 18 週 期末測驗",
    "scorePolicy": "作業與小考 (30%)\n課程參與 (20%)\n期中考試 (25%)\n期末考試 (25%)",
    "materials": "稍後公告。",
    "consultation": "請於課堂上發問，或於輔導時間來討論。",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)* 課程對應 SDGs 指標：4 教育品質 * 指標對應授課內容：此課程主題在提升青年獲取資通訊科技 (ICT) 技能，增加青年獲得相關工作的技術與職業技能。1. 同學如有加退選簽核或課程問題，請寫信至 richwang@ntut.edu.tw，信件標題 [課程名稱]_班級 (或隨班附讀)_名字。2. 本課程其他資料，將透過北科 i 學園 plus 公布。3. 本課程採實體授課方式，但為因應疫情或其它狀況，可能會調整授課內容、授課方式、評分項目與配分比例。如果無法實體上課，預定使用 Teams 於原定上課時段進行遠距上課，相關細節將再另行公告。相關防疫或課程上課形式公告，請參考學校網頁: https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw",
    "foreignLanguageTextbooks": false
  }
]
