[
  {
    "name": "林祐正",
    "email": "yclin@ntut.edu.tw",
    "latestUpdate": "2023-12-11 16:15:04",
    "objective": "Construction project scheduling and control is necessary and important for effective management of construction projects. The course introduces the major concepts and methods for construction project schedule scheduling and control. The course includes plan and analysis of ADM and PDM networks, analysis of critical paths,, plan for catch-up, introduction of PERT and earned value analysis methods. The course will teach students the major concept and methods of construction project scheduling and control. Furthermore, the course will enhance students abilities and techniques integrated with project practices and project schedule software uses.",
    "schedule": "Major topics of this course\n1. Introduction to Construction Project Planning and Control\n2. Concept of Construction Project Planning and control\n3. PDM Approach for Construction Project Planning \n4. ADM Approach for Construction Project Planning\n5. PERT Approach for Construction Project Planning \n6. S-Curve Approach for Construction Project Planning and Control\n7. Risk Management for Construction Project Planning and Control \n8. Stakeholder Management for Construction Project Planning and Control\n9. Earned Valued Management for Construction Project Planning and Control\n10. Related Software for Construction Project Planning and Control\n11. BIM for Construction Project Planning and Control\n12. The Special Topic for Construction Project Planning and Control\n13. Case Study",
    "scorePolicy": "1. Quizzes (20%)\n2. Assignments (30%)\n3. Midterm Report (20%)\n4. Final project presentation (5%) and final project report (25%)",
    "materials": "1. Construction Project Management (2002) by Frederick E and Gould, Nancy E. Joyce. (Prentice Hall; 2 edition)\n2. Project Management in Construction (2006) by Sidney M. Levy (McGraw-Hill Professional Engineering)",
    "consultation": "Use e-mail to confirm the time for discussion.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
