[
  {
    "name": "羅元隆",
    "email": "yllo@ntut.edu.tw",
    "latestUpdate": "2023-12-11 23:27:35",
    "objective": "The subject is designed to include two professional realms – random vibration and time-frequency domain analysis. The fundamentals of random vibration include statistics, correlation analysis, spectrum estimation, spectral analysis of the SDF system, and so on. The time-frequency domain analysis includes the FFT technique, Hilbert Transform, short-time Fourier Transform, and Wavelet analysis, and so on.",
    "schedule": "Week01/Common Probability Functions\nWeek02/Introduction to Probability Distributions and Averages\nWeek03/Joint Probability Distributions, Ensemble Averages\nWeek04/Correlation\nWeek05/Fourier Analysis\nWeek06/Spectral Density\nWeek07/Excitation – Response Relations for Linear Systems\nWeek08/Transmission of Random Vibration\nWeek09/Mid-term Exam\nWeek10/Statistics of Narrow Band Processes\nWeek11/Accuracy of Measurements\nWeek12/Digital Spectral Analysis I: Discrete Fourier Transforms\nWeek13/Digital Spectral Analysis II: Windows and Smoothing\nWeek14/SDOF Spectral Analysis\nWeek15/Short-time Fourier Transform\nWeek16/Hilbert Transform\nWeek17/Wavelet Analysis and Its Application\nWeek18/Final Exam",
    "scorePolicy": "Attendance: 20%\nMid-term Exam: 25%\nFinal Exam: 25%\nReport: 30%",
    "materials": "\"An Introduction to Random Vibrations, Spectral & Wavelet Analysis 3/e\" by D. E. Newland\n\"Probability Concepts in Engineering - Emphasis on Applications to Civil and\nEnvironmental Engineering 2/e\" by A. H-S Ang & W. H. Tang",
    "consultation": "The timetable from 1 to 2 PM every Monday and Tuesday is the consultation time. If necessary, the timetable from 1 to 3 PM every Wednesday can also be reserved. Please write a mail to yllo@mail.ntut.edu.tw in advance to make the appointment.",
    "remarks": "Due to Covid-19, this course will possibly be given in remote lecturing because of the requirement from the university. If so, the online meeting interface of Google Meet will be adopted and the real-time recording will be uploaded to the Taipei Tech i-Campus website. The class quizzes will be replaced with assignments. The mid-term and the final written examinations will be given in class conventionally. However, this is also adjustable depending on the Covid-19 situation. If necessary, a Line based online group will be setup for flexible discussion activities for students.",
    "foreignLanguageTextbooks": true
  }
]
