[
  {
    "name": "陳靜儀",
    "email": "cic@ntut.edu.tw",
    "latestUpdate": "2024-02-05 20:13:50",
    "objective": "Scholars from disciplines such as sociology, economics, literature, drama, and design have offered diverse critiques of lifestyles from various perspectives, including individuality, social roles, consumer behavior, experiences, life satisfaction, and values. This course aims to shift students' focus toward the user context and employ different research methods to study three common integrative elements of lifestyle: cognition, behavior, and context. The course introduces persuasive design and behavior design patterns across different lifestyle scenarios by applying creative, reorganizing, and additive design techniques. The design theme focuses on creating products (both physical and digital) that 'change lifestyles' to achieve Sustainable Development Goals, while also reflecting on the technical difficulties and ethical challenges of applying design to behavior change.\nStarting from 'lifestyles', this course focuses on considering different lifestyles/groups to design objects under a 'research-driven design' process to change behaviors while avoiding design pitfalls.\nStudents will learn to:\n1. Understand the various aspects of lifestyles.\n2. Consider the diversity of groups.\n3. Apply several common design research methods in practice.\n4. Acquire a wide range of professional design terminology.\n5. Grasp the techniques and ethical considerations for persuasive design in behavior change.\n6. Aim for sustainable development through design objectives.\n\n社會學、經濟學、文學、戲劇、設計等學科的學者都從不同的角度對生活型態做出了不同的評論，如個人、社會角色、消費行為、經驗、生活幸福、價值觀等。本課程試圖將學生的眼光拉到使用者的情境，並利用不同的調查方法，研究生活型態的三個常見的整合元素：認知、行為與情境。以創造、重組與附加的不同設計手法，在不同生活型態的場景中，導入說服設計與行為設計模式。設計主題為設計「改變生活型態」以達到永續發展目標的設計成品（不限實體或數位）。同時，也反思設計應用於行為改變的技術困難與道德挑戰。\n以「生活型態」出發，考慮不同生活型態 / 族群，在「研究驅動設計」流程下設計出目的在於改變行為的設計物並避設計陷阱。\n\n學生將學會：\n1. 理解生活型態的不同面向\n2. 考量群體的多樣性\n3. 實務中常應用之數種設計研究方法\n4. 習得設計領域多種面向的設計專業用語\n5. 說服性設計行為改變的技術與道德思考\n6. 永續發展的設計目標",
    "schedule": "W01. Outline course objectives, structure, content, and grading criteria. \n     說明課程目標、架構、內容與評分方式\nW02. The role of designers; why designers should conduct research.\n     設計師的角色；設計師為什麼要做研究\nW03. Definitions, categories, scenarios, and case studies of 'lifestyles'; ethnography\n     「生活型態」的定義、類別、場景與案例；人物誌\nW04. Users' Needs, Wants, and Goals.\n     使用者的 Needs, Wants, and Goals\nW05. Empathy and Empathy Maps\n     同理心與同理心地圖\nW06. Design Research Method I: Contextual Inquiry\n     設計師的調查方法 I：脈絡訪查法\nW07. Design Research Method II: Case Study\n     設計師的調查方法 II：個案研究\nW08. Design Research Method III: Desk Research.\n     設計師的調查方法 III：次級研究\nW09. Midterm: Team selection of topics, methods report, and discussion\n     期中：小組選題與調查方法報告與討論\nW10. User Journey Map\n     使用者旅程地圖 User Journey Map\nW11. Generative AI in research and design support\n     生成式 AI 輔助研究與設計\nW12. Understanding cognitive Biases\n     理解「認知謬誤」 \nW13. Persuasive techniques and patterns, behavioral science theories, and nudging in design\n     說服技術與模式、行為科學理論與助推設計\nW14. Reflection and Challenges: The pitfalls of dark patterns, ethical issues, and technical difficulties\n     反思與挑戰：暗黑模式的陷阱、道德議題與技術困難\nW15. Design Communication: Stakeholder engagement, storytelling, and presentations\n     設計溝通：利害關係人與溝通、說故事與簡報\nW16. Group discussions\n     小組分組討論\nW17. Group oral presentations and design proposal\n     小組口頭簡報與設計表板展示\nW18. Final report\n     期末報告與總結",
    "scorePolicy": "::: Personal grade 個人分數 :::\n態度 Attitude (10%): 準時 & 主動 Punctuality & Initiative\n獨立 Independence (5%)\n課堂互動 Classroom Interactive（5%） \n協作與協調能力 Coorperation & Coordination (15%)\n批判性思考（10%）\n\n::: Team grade 團體分數 :::\n期中報告 Midterm presentation (15%)\n創新 Innovation (10%)\n設計專案能力 Design Project Capability  (15%)\n期末簡報表現 Final presentation (15%)",
    "materials": "::: 自編教材:::\n將更新於 http://cic-lab.design/\n\n::: 參考書目:::\n-Peter Joore, Guido Stompff et.al., 2022, Applied Design Research: A Mosiac of 22 Examples, Experiences and Interpretations Focussing on Bridging the Gap between Practice and Academics\n-Jenn Visocky O’Grady and Ken Visocky O’Grady, 2017, A Designer's Research Manual, 2nd edition, Updated and Expanded: Succeed in design by knowing your clients and understanding what they really need\n-Gjoko Muratovski, 2022, Research for Designers: A Guide to Methods and Practice, 2nd Edition\n-Chataway Richard, 2020, The Behaviour Business: How to apply behavioural science for business success\n\n* 教材、書目介紹與其他參考資料更新於：http://cic-lab.design/",
    "consultation": "Tue. 3:30 pm. - 5:30 pm.Wed. 3:30 pm. - 5:30 pm. 課程相關諮詢預約面談請利用 http://cic-lab.design/ 教師 Email: cic@ntut.edu.tw",
    "remarks": "SDG 3、SDG 5、SDG 6、SDG 10、SDG 12",
    "foreignLanguageTextbooks": true
  }
]
