[
  {
    "name": "郭儀風",
    "email": "cannonkuo@hotmail.com",
    "latestUpdate": "2023-12-13 15:27:18",
    "objective": "本課主旨在設計課程，提供練習，俾使學生嫻熟各式的英語測驗，如全民英檢、托福測驗、TOEIC 測驗或類似性質的測驗，希冀能夠藉由本課程的修習，提升學生不斷的學習外國語的興致，並且，藉由通過考試取得證照，增加未來職場的競爭力。\nThis course is designed to familiarize the students with various kinds of language proficiency tests such as GEPT, TOEFL, TOEIC and many others to the same end. It is our hope that the students who finish taking the course will go on with their enthusiasm on studying foreign languages; besides, through the acquisition of the certificate when the students pass the tests, they are sure to enhance their capability in the increasingly competitive job markets.",
    "schedule": "Week1- Introduction and practice of short monologue question types\nWeek2- Introduction and practice of short monologue question types\nWeek3- Introduction and practice of short monologue question types\nWeek4- Introduction and practice of short monologue question types\nWeek5- English Sentence and Verse Fill-in-the-Blank Question Types and Exercises\nWeek6- English Sentence and Verse Fill-in-the-Blank Question Types and Exercises\nWeek7- English Sentence and Verse Fill-in-the-Blank Question Types and Exercises\nWeek8- English Sentence and Verse Fill-in-the-Blank Question Types and Exercises\nWeek9- Midterm Oral Report\nWeek10- Midterm Oral Report\nWeek11-Reading Comprehension and Practices\nWeek12- Reading Comprehension and Practices\nWeek13- Reading Comprehension and Practices\nWeek14- Reading Comprehension and Practices\nWeek15- Reading Comprehension and Practices\nWeek16- Reading Comprehension and Practices\nWeek17- Final Oral Report\nWeek18- Final Oral Report",
    "scorePolicy": "Attendance 20%\nDaily performance 20%\nMidterm 30%\nFinal 30%",
    "materials": "English For International Communication, 3rd Edition",
    "consultation": "0926185528cannonkuo@hotmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
