[
  {
    "name": "陳靜儀",
    "email": "cic@ntut.edu.tw",
    "latestUpdate": "2024-02-05 20:14:28",
    "objective": "Course Overview:\nThis course aims to familiarize students with research methods in the design field, balancing academic outputs with practical applications. Through the latest literature produced under the concept of research-driven design, students will understand current research trends. The course will gradually guide students to become proficient in research methods.\n\nCourse Objectives:\nDesign science research emphasizes creating and solving practical, real-world problems. The goal is to develop solutions with practical value that can be implemented in practice or to further validate designs. \nStudents will learn to:\n* Understand the scope and trends of design science.\n* Comprehend how to formulate research propositions and design research methods.\n* Grasp quantitative and qualitative research methods.\n* Interpret and visualize research findings.\n* Formulate research propositions, frameworks, processes, and methods.",
    "schedule": "W01. Introduction\n------\nDesign Science Research \n\nW02. The Scope of Design Science and Academic Research Trends\nW03. Aspects of Design\nW04. Research Foundations and Preparation, Comparison of Research Paradigms, Comparison between Qualitative and Quantitative Research\nW05. Research Thinking in Design Science \nW06. Common Research Methods in Design Science and Their Connections with Psychology, Statistics, Semiotics, Management, Communication, and User Experience\n------\nResearch Methods \n\nW07. Research Objectives, Processes, and Methods; Research Framework Diagrams and Process Flowcharts\nW08. Research Method 1 - Secondary Research: Literature Review\nW09. Research Method 2-1 - Quantitative Research\nW10. Research Method 2-2 - Quantitative Research\nW11. Research Method 2-3 - Quantitative Research\nW12. Research Method 3-1 - Qualitative Research\nW13. Research Method 3-2 - Qualitative Research\nW14. Research Method 3-3 - Qualitative Research\nW15. Characteristics of Mixed Methods, Triangulation in Mixed Methods, Action Research\n------\nInterpretation and Presentation of Research Findings \n\nW16. Interpretation of Data, Visualization of Data Analysis, Presentation of Research Outcomes\nW17. Final Report",
    "scorePolicy": "* Attitude (10%): Punctuality & Initiative\n* Independence (5%)\n* Interactive（15%） \n* Exercise（15%）\n* Midterm report (15%)\n* Final report（20%）\n* Critical thinking（10%）",
    "materials": "::: 自編教材 :::\n請參考（將持續更新）： http://cic-lab.design/ \n::: 參考書目 :::\n* Peter Joore, Guido Stompff et.al., 2022, Applied Design Research: A Mosiac of 22 Examples, Experiences and Interpretations Focussing on Bridging the Gap between Practice and Academics\n* John W. Creswell and Vicki L. Plano Clark, 2009, Understanding Research: A Consumer’s Guide\n* Wayne C.Booth, Gregory G. Colomb, Joseph M. Williams, 2016, The Craft of Research\n* 蘇蘅，2020, 傳播研究方法\n* 林品章，2013, 設計學方法論\n* 教材、書目介紹與其他參考資料更新於：http://cic-lab.design/",
    "consultation": "開放諮詢時間 Tue. 3:30 pm. - 5:30 pm.Wed. 3:30 pm. - 5:30 pm. 課程相關諮詢預約面談請利用 http://cic-lab.design/ 教師 Email: cic@ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": true
  }
]
