[
  {
    "name": "柯俊宏",
    "email": "Maning_98@yahoo.com",
    "latestUpdate": "2023-12-14 12:02:49",
    "objective": "With the aging population trend, healthcare-related industries are already witnessing significant growth, and biomedical engineering plays a crucial role in this expanding market.\n\nBiomedical engineering is an interdisciplinary field that leverages various engineering knowledge and technologies to contribute to biological research. Its primary goal is to provide information beneficial for the diagnosis, treatment, and prevention of diseases in medicine.\n\nWithin the broad category of biomedical engineering, our focus will be on the field of medical electrical engineering, particularly in laser medicine. This specialization aims to offer information that aids in diagnosis and assists in the treatment and prevention of diseases.\n\nLaser technology, recognized as one of the three great inventions of the 20th century, has found widespread applications in various medical fields. This course will delve into the following topics:\n\n1. Basic principles of laser\n2. Diverse applications of laser in medicine\n3. Laser applications in dentistry\n4. PBM PhotoBioModulation applications in Medicine and Dentistry\n5. Advanced thesis writing in laser medicine\n\nJoin us to explore the cutting-edge advancements and applications of laser technology in the medical field.",
    "schedule": "2/21 Introduction to Medical-Electrical Engineering\n2/28 National holiday, one day off\n3/6 Fundamentals of Medical Electronics\n3/13 Basic principles of lasers\n3/20 Applications of laser in aesthetic medicine\n3/27 Applications of Laser Dentistry\n4/3 Applications of Low-Level Laser Therapy and PBM\n4/10 Applications of PBM (PhotoBioModulation)\n4/17 Midterm exam\n4/24 Laser operation and clinical demonstration\n5/1 Medical Electrical Engineering Thesis Writing Guidance\n5/8 Ultrasonic, infrared, X-ray, CT, magnetic resonance imaging principles and image processing\n5/15 Application of laser in oral surgery\n5/22 Applications of Laser in Dentistry\n5/29 Final paper presentation\n6/5 Final paper presentation\n6/12 Final paper presentation\n6/19 Final exam",
    "scorePolicy": "(1) Midterm Exam)   30 %, \n(2) Presentation)  30 %,\n(3) Final Exam)  30 %\n(4) Attendance Rate and Class Interaction)  10 %",
    "materials": "References:\n1.\tOral Laser Application\n    by Prof. Andreas Moritz\n2. Laser 101\n    by Prof. Jyuhn Ke",
    "consultation": "Students can ask questions in the LINE Group or email directly to me:Professor Jyuhn KeEmail: jyuhnk@gmial.comCell: 0935421518",
    "remarks": "1. It is recommended that instructors use multiple evaluation methods (such as participation in discussions, online tests or quizzes, submission of reports and assignments, adjustment of grading criteria, etc.) to evaluate students’ learning performance for semester grades. 2. Based on the pandemic classification, we will follow the rules by the school:a. Class I Warning:  courses will still be held in personb. Class III or higher Warning: courses will be held onlinec. Class II Warning: courses will be held either online or partial attendance every other week.",
    "foreignLanguageTextbooks": false
  }
]
