[
  {
    "name": "林信標",
    "email": "hplin@en.ntut.edu.tw",
    "latestUpdate": "2023-12-12 17:10:08",
    "objective": "太空科技應用課程旨在介紹太空技術在各種應用領域的應用，並探討太空科技如何影響人類生活和科學研究。課程涵蓋的主題包括：太空探索，地球觀測，通訊和衛星導航，太空工程和材料科學，太空生物學和醫學，太空經濟和商業。通過這些主題的介紹，學生將了解太空科技在各個領域的應用和未來發展方向，並能夠掌握相關技術和知識。\nThe Space Technology Application Course aims to introduce the application of space technology in various fields, and explore how space technology impacts human life and scientific research. The course covers topics including space exploration, Earth observation, communication and satellite navigation, space engineering and materials science, space biology and medicine, and space economy and business. Through the introduction of these topics, students will understand the application of space technology in various fields and future development directions, and be able to master relevant technologies and knowledge.",
    "schedule": "邀請專家學者分享太空科技之進展與太空產業之發展趨勢\n10 weeks 專家學者演講\n6 weeks 分組討論",
    "scorePolicy": "演講心得報告 60%\n期末分組報告 40%",
    "materials": "講者自製教材",
    "consultation": "使用網路 i 學園聯繫上課資訊其他課程相關事宜請用 email 聯繫 hplin@mail.ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "莊嶸騰",
    "email": "rtjuang@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-12 11:04:33",
    "objective": "太空科技應用課程旨在探討太空技術在各種應用領域的應用，與太空科技如何影響人類生活和科學研究。課程涵蓋的主題包括：太空探索，地球觀測，通訊和衛星導航，太空工程和材料科學，太空生物學和醫學，太空經濟和商業。通過這些主題的專題演講與小組討論，學生將了解太空科技在各個領域的應用和未來發展方向，並能夠掌握相關技術和知識。\nThe aim of the Space Science & Technology Seminar is to enable students to understand and master practical skills and knowledge in the field of space engineering, as well as to cultivate their teamwork, problem-solving, and innovative thinking abilities. Students will undertake a practical space engineering design project to understand the design, testing, implementation, and management processes of space engineering through practice, and demonstrate project outcomes through reports, presentations, and assessments. Through this course, students can understand the latest developments in the field of space engineering, master relevant skills and knowledge, and enhance their teamwork and project management abilities. This course can also provide practical exercises through industry-academia collaboration.",
    "schedule": "Week 1: Unit 1. Space technologies and applications\nWeek 2: Unit 2. Space exploration\nWeek 3: Unit 3. Earth observation\nWeek 4~6: Unit 4. Space communications\nWeek 7~8: Unit 5. Satellite navigation\nWeek 9: Midterm report\nWeek 10~12: Unit 6. Space Engineering\nWeek 13: Unit 7. Materials science\nWeek 14~15: Unit 8. Space biology and medicine\nWeek 16~17: Unit 9. Space economy and business.\nWeek 18: Final report",
    "scorePolicy": "Class Participation (30%)\nMidterm Report (30%)\nFinal Report (40%)",
    "materials": "Use of self-made materials",
    "consultation": "Office Hoursor Email: rtjuang@mail.ntut.edu.tw",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
