[
  {
    "name": "華國媛",
    "email": "kyhwa@ntut.edu.tw",
    "latestUpdate": "2024-02-19 12:58:48",
    "objective": "Nanomaterials are materials with a single unit small sized between 1 and 100 nm.  They have unique optical, electronic, thermo-physical or mechanical properties. Since some nanomaterials have properties of enzyme-like characteristics.They are artificial enzyme, which can be used for many applications in such as biosensing, bioimaging, tumor diagnosis and so on.  We will also discuss about the safety issues, regulation and public percpetin on nanomaterials. \nStudents are expected to learn the types, the basic theory, unique properties of nanomaterials, the syntehsis and characterization of nanomaterials. This class is for upper level undergraduate students, with interested on material science and nanotechnology.",
    "schedule": "Week        Title\n1      Introduction on nanomarterials- nanotechnology in the ancient days and nature\n2.     Different types of nanomaterials - OD, 1D, 2D and 3D\n3.     Bulk nanomaterials - nanocrystalline materials, nanocomposites, nanoporous material\n4. Bulk nanomaterials- metal-organic frameworks (MOFs), inorganic-organic hybrid nanocomposites\n5.    Quantum mechanics and Jellium model\n6.    Electrical properties - ballistic transport, Coulomb blockade\n7.    Magnetic nanoparticles and superparamagnetism\n8.    Surface properties\n9.    Midterm Exam\n10.  Mechanical properties & Stabilisation \n11.  Optical properties \n12.  Core-shell nanoparticles and gold nanoshells\n13.   Carbon nanoworld - fullerenes, graphenes and carbon nanotubes\n14.   Synthesis of nanomaterials - vapour and solution phases\n15.   Characterization of nanomaterials - SPM, STM, AFM, SEM, TEM, XR\n16.    Applications of nanomaterials and nanotechnology\n17.    Safety Issues, Regulations and Public Perception\n18.    Final exam",
    "scorePolicy": "Class participation (10%), Homework (20%), Midterm (30%), Final (40%)",
    "materials": "Nanomaterials: An Introduction to Synthesis, Properties and Applications,  Wiley-VCH, 2nd Edition (2013) by Dieter Vollath\n\nhttps://www.amazon.com/-/zh_TW/Dieter-Vollath-ebook/dp/B00DWIHYVA/ref=sr_1_3?crid=1TYU55I6Y41F4&keywords=nanomaterials+textbook&qid=1641202272&s=digital-text&sprefix=nanomaterials+textbook%2Cdigital-text%2C227&sr=1-3\n\n(optional)Nanomaterial: Impacts on Cell Biology and Medicine (Advances in Experimental Medicine and Biology Book), Springer, 2014, by David G. Capco (Editor), Yongsheng Chen (Editor)\n\nhttps://link.springer.com/book/10.1007/978-94-017-8739-0",
    "consultation": "Students are welcome during my office hour, Tue or Wed 9:30 a.m. to 11:30 a.m.Or leave a message in the Team group.",
    "remarks": "We will use Microsoft Team for the class.  Register and download the software:https://www.microsoft.com/zh-tw/microsoft-teams/group-chat-software",
    "foreignLanguageTextbooks": true
  }
]
