[
  {
    "name": "楊琇惠",
    "email": "hhyang@ntut.edu.tw",
    "latestUpdate": "2024-01-08 14:42:44",
    "objective": "本課程將帶領同學從兒童詩、繪本、小說、電影來品味兒童文學的真、善與美，藉此喚醒被世俗蒙塵的沉睡心靈，以重返純真的赤子心境。 教學方式以互動為主，期待藉由討論兒童文學名著，閱讀相關論文，來帶領同學進入兒童文學的殿堂。 除了閱讀與討論之外，還會教導同學創作；創作的內容含括了兒童詩及手工繪本製作。希望透過作品的完成，來喚起學生的創作興趣，並建立學生創作的信心。\nThis course will lead the students to read the poems, picture books, novels and films of children literature, and hope to find out the beauty of the children's world. Wish in this way can help the sleeping soul to wake up, and return to pure childhood state. This course will try to lead the classmates to appreciate the children's literature by discussing and questioning the masterpieces, hope in this happy way to help the students to get enter the children's literature. Besides reading and discussing, the course will also teach students how to write. The content of writing course would include the poem and the story which would ask the students to finish the work by themselves. Hope through the works, can arouse students' creation interest, and build up students' confidence of creation.",
    "schedule": "第一週 課程簡介及兒童身心發展\n第二週  童詩、童謠、童歌賞析及創作\n第三週 繪本賞析及創作 —— 自我探索篇 \n第四週 繪本賞析及創作 —— 家庭關係篇\n第五週 繪本賞析及創作 —— 朋友關係篇\n第六週 情緒認知\n第七週 放假\n第八週 繪本賞析及創作 —— 情緒篇 (一)\n第九週 繪本賞析及創作 —— 情緒篇 (二)\n第十週 AI 協作導入繪本創作\n第十一 期中小劇場 — 我來說故事\n第十二週 第十三週 永續工作坊一\n第十四週 AI 協作導入繪本創作 (永續篇)- 永續主題發想\n第十五週 第十六週 永續工作坊二\n第十七週   環境永續繪本發表\n第十八週 赴國小或是兒童醫院講故事",
    "scorePolicy": "1. 出席及平時作業 30%\n2. 工作坊參與：30% \n3. 期中期末繪本創作及說故事 - 40%",
    "materials": "使用大量繪本、兒童文學作品",
    "consultation": "可用 email : hhyang@ntut.edu.tw 約時間，再來研究室討論。",
    "remarks": "本課程會讓學生創作關於環境永續的繪本，會涉及到聯合國可持續發展目標（Sustainable Development Goals, SDGs）的面向如下：1. 目標 4 - 優質教育：通過創意和環境省思的教學方式，促進學生的全面發展，這正是實現優質教育的關鍵。2. 目標 11 - 可持續城市與社區：由於繪本中會探討如何建立更綠色、更可持續的城市和社區，來提高生活質量並減少環境影響，是以符合此面向。3. 目標 12 - 負責任消費與生產：繪本創作可以包含關於減少浪費、可持續消費和生產的信息，教育學生如何做出更環保的選擇。4. 目標 13 - 氣候行動：關注氣候變化及其影響，並通過繪本來提高學生對這一全球性議題的認識。5. 目標 15 - 陸地生物多樣性：繪本可以展示如何保護生態系統和生物多樣性，強調保護自然環境的重要性。",
    "foreignLanguageTextbooks": false
  }
]
