[
  {
    "name": "邱弘緯",
    "email": "hwchiu@ntut.edu.tw",
    "latestUpdate": "2024-01-11 16:59:25",
    "objective": "This course offers a comprehensive exploration of Natural Language Processing (NLP) and its application in the realms of information Intelligence (II) and Information Intelligence (II). Aimed at providing students with practical skills and theoretical knowledge, the course covers a range of topics from the fundamentals of NLP and II to advanced techniques in machine learning and deep learning. Students will engage in hands-on projects and case studies to apply NLP in real-world business scenarios, focusing on market analysis, customer relationship management, and ethical considerations in AI.",
    "schedule": "Week 1-2: Foundations of Natural Language Processing (NLP) and Information Intelligence (II)\n•\tIntroduction to NLP and Its Role in Information \n•\tFundamentals of Information Intelligence\nWeek 3-4: Text Processing and Analysis in Information \n•\tTechniques for Text Preprocessing\n•\tAnalyzing Customer Reviews for Information Insights\nWeek 5-6: Machine Learning in Information Analytics\n•\tMachine Learning Approaches in NLP\n•\tUtilizing Predictive Analytics for Strategic Information Decisions\nWeek 7-8: Advanced NLP: Deep Learning and Sentiment Analysis\n•\tDeep Learning Techniques in NLP\n•\tLeveraging Sentiment Analysis to Understand Information Trends\nWeek 9-10: NLP for Enhanced Information and Competitive Intelligence\n•\tTechniques for Entity Recognition and Relationship Extraction\n•\tNLP Applications in Analyzing Intelligence Reports and Market News\nWeek 11-12: NLP in Information  Management \n•\tImplementing Chatbots and Automated Responses\n•\tText Analytics for Enhanced Information Strategies\nWeek 13-14: Ethical and Legal Dimensions in Information Intelligence\n•\tNavigating Ethical Challenges in NLP and AI\n•\tLegal Considerations in Information Intelligence\nWeek 15-16: Capstone Project Development\n•\tDeveloping Projects that Integrate NLP with Information Intelligence\nWeek 17: Final Presentations and Course Closure\n•\tCapstone Project Presentations\n•\tComprehensive Course Review and Feedback",
    "scorePolicy": "1. Homework assignments - 40%\n2. Mid-term project 30%\n3. Final proejct 30%",
    "materials": "•\thttps://twpat.tipo.gov.tw/\n•\thttps://patents.google.com/\n•\tPython Data Science Handbook by Jake VanderPlas, O'Reilly Media, Inc. (ebook available on https://jakevdp.github.io/PythonDataScienceHandbook/ )\n•\tData science from scratch by Joel Grus, O’Reilly Media, Inc., 2019 ISBN: 9781492041139 \n•\tNatural Language Processing Specialization https://github.com/amanjeetsahu/Natural-Language-Processing-Specialization",
    "consultation": "Course Line and Teams group",
    "remarks": "需要有 Python 基礎能力。",
    "foreignLanguageTextbooks": false
  }
]
