[
  {
    "name": "羅彥棻",
    "email": "fenlo@mail.usc.edu.tw",
    "latestUpdate": "2023-12-26 15:53:47",
    "objective": "這 e 世紀時代的資訊交流是一個廣泛、多樣化與複雜的；究竟人們如何透過溝通表達意識與行為，卻變成非常重要。有效的溝通程度常視為學習溝通的指標，須視事實、竟見、感覺、嗜好和經驗進行徹底地交融與分享的結果。因此，本課程重視現代社會學習「溝通管理」的二項關鍵技術包括：有效溝通結合自我學習技巧和方法：商業知識與科技結合促成人的系統互動能力，配合多媒體傳輸工具完成學習個人與團體溝通效益。課程涵概主題：1. 溝通管理定義與本質元素。2. 溝通管理內涵分析。3. 學習個人溝通能力。4. 學習溝通程序。5.e 化自我學習技巧、方法與表達能力。6. 學習全球化溝通科技工具。7. 團隊溝通的策略與協同戰術。8. 塑造整體溝通文化。\nThe information exchange is wide, variety, and complicated in the e-era; how do people express their consciousness and behavior turn to become very important. Effective communication degrees usually are seen as the index of learning communication. It depends on thoroughly melting and sharing with fact, opinion, feeling, interesting and experience. Therefore, \"Communication Management,\" in this course we emphasize on two key techniques of modern society learning including: effective communication with self-learning skill and method; Business knowledge and technology with interactive ability of human system. By using multimedia transmitting tools to complete self and group learning communication and get benefit.",
    "schedule": "1 週 課程規劃與規定介紹。報告個案研擬說明\n2 週 溝通管理定義與本質元素\n3 週 溝通管理內涵分析\n4 週 溝通管理策略思維\n5 週 溝通技巧對組織績效的影響\n6 週 團體溝通與解決問題\n7 週 塑造團隊溝通文化\n8 週 期中考\n9 週 學習個人溝通能力 (效益)-- 訓練長話短說的能力   個案討論\n10 週 學習個人溝通能力 (品質)-- 高評價的說話方式   個案討論\n11 週 學習個人溝通能力 (效率)-- 不浪費時間的說話術 個案討論\n12 週 學習個人溝通能力 (影響力)-- 讓說話更有生命力  個案討論\n13 週 智慧化 (AI, ChatGpt) 與溝通管理 個案討論\n14 週 會議溝通與表達能力 個案討論\n15 週 團隊衝突溝通策略與管理 個案討論\n16 週 職場溝通與倫理\n17 週 期末考試",
    "scorePolicy": "1. 平時成績佔 55%：包括課堂 Oral 報告 20% 與課堂討論 20% 及出席狀況 15%。\n2. 期中考 25% \n3. 期末考 20%\n4. 平時學習態度評量做為最後成績調整的依據\n5. 分組口頭報告需繳交 word & ppt files (word file 10~12 pages, 含封面封底，及研擬的個案及三題問題)。",
    "materials": "自製教材",
    "consultation": "fenlo@g2.usc.edu.tw",
    "remarks": "課程規劃 SDGs 指標 4: 確保有教無類，公平及高品質的教育，及提倡終身學習。課程中職場溝通。網路溝通。衝突溝通主題，對應 SDGs 指標 4 之 4.7 確保所有學子都能獲得永續發展所需的知識與技能，包括永續發展教育、永續生活模式、人權、性別平等、促進和平與非暴力文化、全球公民意識、尊重文化多樣性，以及文化對永續發展的貢獻。",
    "foreignLanguageTextbooks": false
  }
]
