[
  {
    "name": "吳孟茜",
    "email": "mira@emfc.com.tw",
    "latestUpdate": "2024-01-26 17:45:08",
    "objective": "本課程教授日語基礎語法，以期建立自學興趣與啟發閱讀日文資料之能力。前階段教授五十音、助詞、形容詞及動詞變化等基礎；後半階段將學習句型結構及產業界實務日文。本教學著重日語基礎之語法架構練習，學成後亦能自行取得日本新科技知識，廣泛應用於未來工作及日常生活中。語言是不斷的自我學習。與時俱進。\nThis course teaches Japanese basic grammar, in order to establish students' ability to read and understand Japanese technical articles. The first half of the course teaches Japanese syllabary, auxiliary words, adjectives and verb conjugations, and then introduces Japanese grammar structure, common sentence patterns, etc… Focusing on the concepts and methods necessary for Japanese reading so that students can still enhance themselves and apply in work and daily life to read instructions and manuals of equipment or products.\nThis course teaches Japanese basic grammar, in order to establish students' ability to read and understand  Japanese technical articles. The first half of the course teaches Japanese syllabary, auxiliary words, adjectives and verb conjugations, and then introduces Japanese grammar structure, common sentence patterns, etc… Focusing on the concepts and methods necessary for Japanese reading so that students can still enhance themselves and apply in work and daily life to read instructions and manuals of equipment or products.",
    "schedule": "第 1 週  教學課程與評分標準說明\t\n第 2 週  第一課：「平假名」聽、說、讀、寫及發音規則 (清音)\t\n第 3 週  第二課：「平假名」聽、說、讀、寫及發音規則\n                          (撥音 + 濁音 + 半濁音 + 促音 + 拗音 + 長音)\t\n第 4 週  第三課：「片假名」聽、說、讀、寫\t\n第 5 週  第四課：自我介紹及句型學習\n                       (姓名、職業、家族稱謂、年齡、生肖 / 星座等學習)\t\n第 6 週  第五課：學習表達時間及日期\t\n第 7 週  第六課：指示代名詞之學習與表達 / 周遭環境及物品句型結構之練習\t\n第 8 週  第七課：形容詞分類及用法\t\n第 9 週  期中考   口試  [日語發表] 自我介紹\t\n第 10 週 第八課：學習表達願望 / 喜好 / 能力 / 擁有\t\n第 11 週 第九課：學習來去動詞及句型描述\t\n第 12 週 第十課：常用動詞字彙與練習\t\n第 13 週 補充教材：日文常用語法學習及動詞變化 / 分類 / 單字 / 句型 講解 (一)\t\n第 14 週 補充教材：日文常用語法學習及動詞變化 / 分類 / 單字 / 句型 講解 (二)\t\n第 15 週 補充教材：學習閱讀並理解設備技術手冊 (一)\t\n第 16 週 補充教材：學習閱讀並理解設備技術手冊 (二)\t\n第 17 週 期末考    筆試  [日翻中] 技術資料手冊",
    "scorePolicy": "1. 隨堂測驗 占總分 30%\n2. 期中考試 占總分 30%\n3. 期末考試 占總分 30%\n4. 學習表現 占總分 10%     (學習表現之評分項目：學習態度，出席率，作業提交等)",
    "materials": "1. 自購教課書.\n   書名: [趣上日本語] 新版 \n   作者：林京佩 / 陳冠敏 / 木村翔\n   出版日：2023 年 12 月出版\n   出版社：瑞蘭國際有限公司\n2. 補充教材\n    將依教學進度上傳至 i 學園 PLUS\n    供同學自行下載學習",
    "consultation": "可於每周上課詢問，或以郵件聯繫寄至 mira@emfc.com.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
