[
  {
    "name": "陳志遠",
    "email": "cychen123@ntut.edu.tw",
    "latestUpdate": "2023-12-12 17:15:32",
    "objective": "專利攻防已變成產業策略之一，越來越多的訴訟案件逼使廠商進行專利迴避設計。事實上台灣的產業界對於迴避設計、專利策略與專利佈局理論上並不陌生，但在實務上卻很少實際執行，所以每年仍然付出五十億美金的權利金。因此本課程主要強調專利策略與專利布局分析在企業界的運用分析。",
    "schedule": "主題一 (第 1~4 週):\nPCT 專利系統、多國專利與檢索報告閱讀、國際專利家族與布局、國際專利申請策略。\n主題二 (第 5~15 週):\n老師會在開學第一周提供約 10 幾篇 papers 供同學們閱讀，主題與下列有關\nPatent strategy、Patent portfolio、Patent mapping、Patent quality、patent life cycle、Knowledge flows、patent classification\n主題三 (第 16~18 週):\n請同學在期初提出期末報告之 proposal，並與老師討論，並在最後期末時進行期末報告。",
    "scorePolicy": "1 st Mid-exam (30%)、2nd- Mid Exam (30 %)、Final reports (40%)",
    "materials": "劉國讚，” 國際專利分析與佈局”，元照出版社",
    "consultation": "請修課同學第一次上課加入 LINE 群組 (連結屆時公布)",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "楊侑倫",
    "email": "y.yang@ntut.edu.tw",
    "latestUpdate": "2023-12-12 17:51:56",
    "objective": "高科技產業的專利攻防已變成產業策略之一，越來越多的訴訟案件逼使廠商進行專利迴避設計。事實上台灣的產業界對於迴避設計、專利策略與專利佈局理論上並不陌生，但在實務上卻很少實際執行，所以每年仍然付出數十億美金的權利金。本課程將從專利申請策略開始，告訴同學專利申請上常見的錯誤，如何以較低的成本取得、維護我國專利，並利用我國專利進行全球專利佈局。\nPatent litigation, either initiation or defense, has become one of the high-tech industrial strategies, and more and more patent suit cases have forced the manufacturers to undertake patent design around. In fact, the industrial fields in Taiwan, theoretically, do not feel strange on design around and patent strategies. However, in practice, they perform much less. That is the reason why Taiwan still has to pay more than five billion US dollars each year for royalty. This course will start from patent filing strategy, getting patent claims well known, then following with introduction on orientation of patent strategies, and providing theory and practice on patent strategies. The outline of this course is given as follows: Patent claim interpretation; Process of patent infringement analysis; Requirements of patent design around; Patent strategy analysis; Practice on patent strategies; and Study on patent cases.",
    "schedule": "主題一 (第 1~4 週):\nPCT 專利系統、多國專利與檢索報告閱讀、國際專利家族與布局、國際專利申請策略。\n主題二 (第 5~15 週):\n老師會在開學第一周提供約 10 幾篇 papers 供同學們閱讀，主題與下列有關\nPatent strategy、Patent portfolio、Patent mapping、Patent quality、patent life cycle、Knowledge flows、patent classification\n主題三 (第 16~18 週):\n請同學在期初提出期末報告之 proposal，並與老師討論，並在最後期末時進行期末報告。",
    "scorePolicy": "1 st Mid-exam (30%)、2nd- Mid Exam (30 %)、Final reports (40%)",
    "materials": "劉國讚，” 國際專利分析與佈局”，元照出版社",
    "consultation": "請修課同學第一次上課加入 LINE 群組 (連結屆時公布)",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
