[
  {
    "name": "林雅惠",
    "email": "yhvica@ntut.edu.tw",
    "latestUpdate": "2024-01-21 23:45:04",
    "objective": "本課程旨在幫助學生在論文寫作以及企業研究方法上建立足夠的知識與技能。課程內容主要分為兩部分，第一部分將介紹論文架構，緊接著介紹如何撰寫緒論、文獻探討、研究方法、結果分析、討論、結論及參考文獻，配合課程中的實際案例討論，指導學生應注意的論文格式與規範。本課程的第二部分則在介紹目前企業研究上常用的各種數量方法，各種數量方法的原理及其應用的領域將以實際案例解釋說明，透過上課解說演練、討論、作業、報告等方式使學生熟悉各種研究方法。主要教授的研究方法包括層級分析法、網路程序分析、TOPSIS、VIKOR、灰關聯法、決策實驗分析法、模糊理論、約略集合及基本多變量分析。所教授的各種的研究方法將以 Excel 進行分析與計算演練，本課程學習結束後，學生應當能具備足夠的能力撰寫論文並了解使用各種研究方法於企業問題解決。\nThe objective of this course is to help students build up the knowledge/skills in thesis writing and business research methods. The content of the course can be divided into two major parts. The first part will begin from the introduction of thesis structure, followed by how to write the introduction, literature review, methodology, result analysis, discussion, remarking and reference. The format of thesis will also be illustrated by some class examples. The second part of the class will begin with the introduction of different quantitative methods commonly used in business research methods today. The categories of research methods and their applicable problems are then presented using real-world case studies. Students can learn different decision-making tools through lectures, discussions, assignments, term-projects, and in-class practices. The main methods include AHP, ANP, TOPSIS, VIKOR, DEMATEL, Gray Relation Methods, Fuzzy Set Theory, Rough Set Theory, and some basic multivariate",
    "schedule": "第 4 週 科學方法的基本概念\n第 5 週 企業研究的類型\n第 6 週 資料蒐集方法\n第 7 週 問卷設計與衡量 (1)\n第 8 週 問卷設計與衡量 (2)\n第 9 週 SPSS 軟體介紹與資料整理技巧\n\n\n預計 12 週上課時間 2/24、3/2、3/9、3/16、3/23、3/30、4/20、4/27、5/4、5/11、5/18、5/25",
    "scorePolicy": "出席狀況 50% \n課堂討論 25%\n課堂報告 25%",
    "materials": "吳萬益，廖英凱：企業研究方法。華泰文化。第 6 版\n 授課教授提供相關的講義。",
    "consultation": "1. 課程上課時間，同學有問題可以直接詢問 2. 可以透過 e-mail 與老師約時間討論",
    "remarks": "根據學校規定",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "蔡榮發",
    "email": "jftsai@ntut.edu.tw",
    "latestUpdate": "2023-12-28 16:49:14",
    "objective": "主要內容包含：企業研究的本質、研究流程、研究問題與假設、文獻評論、資料收集、操作性定義、測量、理論架構模型化、研究設計、量化與質化研究、個案研究法、資料分析與解釋、研究報告撰寫。\nThe course mainly discusses concepts of business research methods. The contents will include following topics：（1）the nature of business research, （2）elements of research and research process, （3）research problem and hypothesis,（4）literature review, （5）research design, （6）research proposal, （7）case study, （8）analysis and the interpretation of data, （9）quantitative and qualitative research,(10) research report.",
    "schedule": "週次\t授課老師\t內容\n1.\t課程大綱與課程介紹\n2.\t管理研究主題探討 (1)\n3.\t管理研究主題探討 (2)\n10.\t量化與質化研究方法介紹 (1)\n11.\t量化與質化研究方法介紹 (2)\n12.\t研究計劃書撰寫與報告\n預計 12 週上課時間 2/24、3/2、3/9、3/16、3/23、3/30、4/20、4/27、5/4、5/11、5/18、5/25",
    "scorePolicy": "出席狀況 50% \n課堂討論 25%\n課堂報告 25%",
    "materials": "Business Research Methods (12th Ed.), McGraw Hill, 2013\n企業研究方法 (12 版), 華泰書局，2014\n授課教授提供相關的講義、案例等資料",
    "consultation": "Office Hours：星期三上午 9：00～12：00；下午 1：00～4：00（科研大樓 1132 室）學生加退選簽核及諮詢管道：Email: jftsai@ntut.edu.tw 校內分機 3420",
    "remarks": "若學校宣布需採用遠距教學，遠距教學期間上課資訊如下：評量方式：課堂報告採線上報告上課影音或教材錄製：本校教學全都錄錄製，並放在北科 i 學園上課網址：遠距上課 WEBEX 連結公布於 LINE 群組",
    "foreignLanguageTextbooks": false
  }
]
