[
  {
    "name": "林淑玲",
    "email": "shuling@ntut.edu.tw",
    "latestUpdate": "2023-12-20 00:26:02",
    "objective": "為因應瞬息萬變的金融投資環境，期許學生具備宏觀的投資管理知識，本課程主要本課程結合資訊工具與軟體運用、以深入淺出方式介紹投資決策之基本觀念及理論架構，並搭配財務軟體、財金資料庫、與財金資訊網站的應用。藉由這些資訊工具與技術，將財務投資的觀念與原理加以運用於重要的投資決策。課程內容架構包括：(1) 財務與投資學原理；(2) 資料庫的使用；(3) 財務軟體的操作；(4) 財務與投資個案分析。透過本課程之學習，促使投資人能獲取合理的投資報酬或擊敗大盤，領先各基金之績效，以制訂出正確的長短期投資決策。\nIn response to the rapidly changing environment of financial investments, expecting that students have knowledge of macro investment management, this course combines information and software tools to use, the major goal of this course is to help students understanding the basic principles and theories of investments. By mixing explanation and implementation using financial software and database, it can give students the skills to conduct a sophisticated assessment on investment decisions. The major topics include the following: (1) principles of investments, (2) financial database, (3) financial software, and (4) case study in investments. Through the learning of this course, prompting investors to be able to obtain a reasonable return on investment or beat the market, ahead of the performance of each Fund, in order to work out the correct short and long term investment decisions.",
    "schedule": "週次\t課程內容\n一\t證券投資導論 & 投資理財哲學\n二\t金融市場功能\n三\t 貨幣市場金融商品\n四\t 資本市場金融商品\n五\t 投資策略 \t\n六\t 投資人行為\n七\t風險與報酬率\n八\t投資組合 \t\n九\t效率多元分散\n十\t 運用「投資決策分析系統」擬定投資策略\n十一\t 運用「決策精靈」於金融商品資產配置之應用\n十二\t【金融商品資產配置決策分析之簡報】",
    "scorePolicy": "1. 出席參與 & 投資決策個案報告：50%。\n2. 金融商品資產配置決策分析之簡報：50%。",
    "materials": "1. 教師自編講義。\n2. 林哲鵬 & 謝東昇譯（Zvi Bodie、Alex Kane、Alan J. Marcus 著），投資學－基礎與應用，第 11 版，2018 年 9 月，McGraw-Hill International Edition (華泰文化事業股份有限公司)。\n3. 李華驎 & 孔繁華，「公司的品格 2：從本地個案看懂台灣公司治理，拆解上市櫃公司地雷」，2016 年 11 月。（先覺出版社）\n4. 李華驎 & 鄭佳綾，「公司的品格：22 個案例，了解公司治理和上市櫃公司的財務陷阱」，2014 年 2 月。（先覺出版社）\n5. 鍾惠民，「財務管理個案：策略與分析」，二版，2012 年 2 月。(新陸書局)\n6. 薛琦，「財務金融個案 III」，2006 年 7 月，財團法人台灣金融研訓院 。",
    "consultation": "Emails: shulingntut@gmail.com 或 本課程 LINE 群組",
    "remarks": "4. 教育品質 8. 就業與經濟成長",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "陳煒朋",
    "email": "wpc@ntut.edu.tw",
    "latestUpdate": "2023-12-18 21:15:32",
    "objective": "為因應瞬息萬變的金融投資環境，必須具備宏觀的投資理財知識，本課程主要本課程結合資訊工具與軟體運用、以深入淺出方式介紹投資理財之基本觀念及理論架構，並搭配財務軟體、財金資料庫、與財金資訊網站的應用。藉由這些資訊工具與技術，將財務投資的觀念與原理加以運用於重要的投資決策。課程內容架構包括：(1) 財務與投資學原理；(2) 資料庫的使用；(3) 財務軟體的操作；(4) 財務與投資個案分析。透過本課程之學習，期望能制訂出最適的長短期投資決策，以獲取合理的投資報酬或超越市場績效表現。\nIn response to the rapidly changing environment of financial investments, expecting that students have knowledge of comprehensive investment management, this course combines information and software tools to help students understanding the basic principles and theories of investments. By mixing explanation and implementation using financial software and database, it can provide students with skills to conduct a sophisticated assessment on investment decisions. The major topics include the following: (1) principles of investments, (2) financial database, (3) financial software, and (4) case study in investments. Through the learning of this course, prompting students to be able to obtain a reasonable return on investment or beat the market by working out the optimal short- and long-term investment decisions.",
    "schedule": "1. 總體經濟與產業分析\n2. 公司分析\n3. 技術分析\n4. 投資組合管理\n5. 共同基金\n6. 衍生性金融商品",
    "scorePolicy": "課堂參與：50%\n作業報告：50%",
    "materials": "(1) Bodie, Z., Kane, A., & Marcus, A., “Investments” 11th Edition., 2018, McGraw-Hill International Edition. (華泰書局)。\n(2) Benninga, S., “Financial Modeling” 3rd Edition. (指南書局)。\n(3) 姜堯民，財務軟體應用，（新陸書局）。\n(4) 謝劍平著，投資學基本原理與實務，（智勝文化）。",
    "consultation": "學生加退選簽核及諮詢課程問題管道：研究室：科研大樓 940 室 Email：wpc@ntut.edu.tw 分機：6721Office Hours：可隨時 Email 聯繫",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
