[
  {
    "name": "余貞儀",
    "email": "cy1269@gmail.com",
    "latestUpdate": "2023-12-13 23:57:34",
    "objective": "This is a history course of western classical music, of which the definition, according to The New Harvard Dictionary of Music and The Oxford Dictionary, is \"art music” or \"serious music\", that written in a Western musical tradition, using an established form. \"Classical music is generally considered to be serious and to have a lasting value.”\nThe styles of various periods will be introduced, from the Medieval, Renaissance, Classical, Romantic, to the Contemporary eras. The goal of this course is helping students to equip a general comprehension of Classical Music in terms of basic elements of musical art, technical theory, historical, social and cultural background extends to related arts and humanities. \n\nIn order to pursue the most accurate references and info, the major key-points and terminology used in this course will be in English or original European text.",
    "schedule": "1st week: Introduction to Western Art Music—Greek origin as the foremost culture before Christianity entered Europe\n\n2nd week: The Medieval Period--folk music, church music in relation to arts and culture\n\n3rd week: From Medieval to Renaissance period--Madrigals, church music, dance music.\n\n4th week: Renaissance period--from Monophony to Polyphony; Introduction to Italian composers, artists, and some of the most popular musical instruments; the Reformed Church and Martin Luther that not only changed the society and belief system but also aethesticism in arts. \n\n5th week: Baroque--Louis XIV and his influence on French music,in comparison to English Baroque\n\n6th week: Baroque--Italian and French legends--Corelli, Lully and Couperin, Introduction to Concerto Grosso\n\n7th week: Baroque--Italian and French legends continues--Vivaldi, Scarlatti, and Rameau--Court Dance and French Ballet\n\n8th week: Baroque--Comparison among Handel, Telemann, and J.S.Bach\n\n9th week: Baroque--J.S. Bach in-depth--his string works, orchestral music, choral music, keyboard music, and Fugues.\n\n10th week: Midterm Report\n\n11th week: Classical period (Classicism)--The Age of Enlightenment--Frederick the Great as a passionate patron of music and art; Danish royal house contributing Jean-Jacques Rousseau's ideology in Denmark; Catherine the Great and The Hermitage\n\n12th week: The First Viennese School; Gluck and Habsburg family; Marie Antoinette\n\n13th week: Romantic period--Beethoven and the beginning of Romantic era; how Schubert was influenced by Beethoven \n\n14th week: The pinnacle of Romantic era--Chopin, Schumann, Brahms, Liszt, Tchaikovsky, to the late Romantic period\n\n15th week: A counterpart of Romantic style with Naionalism--Music by Bohemian and Russian composers; 19th Century Russian ballet and music\n\n16th week: Impressionist Music, The Second Viennese School and related art styles in the period\nThe Contemporary Music--from Twelve- tone music (The 2nd Viennese School), Neoclassicism, to Existentialism, music of Minimalism, and experimental music.\n\n17\t期末考\n17th week: Final Exam.",
    "scorePolicy": "20% Attendance \n20% Impressions from in-class presentations & discussions\n30% Midterm Report\n30% Final Exam",
    "materials": ". Fleming, William., and Frank Macomber. Musical Arts and Styles. Gainesville: University of Florida Press, 1990. \n\n2. Martin, Gary. and Miller, James. A History of Music in Western Culture. New York: McGraw-Hill Education, 1995",
    "consultation": "We'll have a LINE group in case of emergency:)I'll also use the LINE group to give assignments, video clips, and referencesEmail:cy1269@gmail.comMidterm paper submission to: yucheyne@gmail.com",
    "remarks": "課程名稱：音樂欣賞課程對應指標：3. 健康福址；4. 教育品質指標對應授課內容：科學家經過十幾年的研究發現，古典音樂是治癒身體與精神創痛的良藥，可提升心智。音樂療法 (Music Therapy，MT) 在過去四十年來在不同臨床領域的應用一直受到重視。多項研究顯示古典音樂與現代音樂對人身心健康的差異。",
    "foreignLanguageTextbooks": true
  }
]
