[
  {
    "name": "盧美凡",
    "email": "sofarjay@yahoo.com.tw",
    "latestUpdate": "2023-12-20 09:56:48",
    "objective": "每個人都不想孤獨地活著，學習建立親密關係是幸福的來源。\n本課程透過講解、討論、體驗、分享，幫助學生認識自己，發揮最大潛能，懂得溝通連結，能處理情緒與壓力，尊重個別差異與性別平等，從而尋覓最對的人。\n在親密關係中鼓勵彼此做最真最喜歡的自己，也樂於分工合作，建立最美好的家庭，進而活出有意義有價值的人生。\n本課程是真正的成年禮，從自我到互依，是成長與成熟的必修課。\nNobody wants to live a lonely life. Having an intimate relationship is a source of happiness.\nIn this course, students will be given a skill set for understanding themselves, exploring their potential and managing emotional stress. They will also learn to communicate and connect with others through personal sharing, group discussions and in-class exercises. Issues like individual difference and gender equality will be emphasized, since respecting each other is the base for any good relationship, not to mention finding the right partner.\nIt is only when both partners are true to themselves and like the way they are in the relationship will they be willing to share the hard and fun work of building a family and living a meaningful life together.\nOne can see this course as a rite of passage into adulthood.  It is a prerequisite for growing mature, from being self-centered to being able to rely on one another.",
    "schedule": "第 1 週\t課程結構說明與課程期待蒐集\n第 2 週\t生命週期與賀爾蒙\n第 3 週\t壯遊對於生命週期的啟發\n第 4 週\t愛情的生命週期\n第 5 週\t如何調情與製造情調\n第 6 週\t愛情影片賞析\n第 7 週\t失戀情傷與危險情人\n第 8 週\t情傷影片賞析\n第 9 週\tLGBT 性別多元化\n第 10 週\t期中課堂作業\n第 11 週\tSEX！複雜的性事 - 1\n第 12 週\tSEX！複雜的性事 - 2\n第 13 週\t家庭暴力防治法\n第 14 週\t家庭暴力防治法\n第 15 週\t家暴防治影片\n第 16 週\t地方法院家事庭參訪\n第 17 週\t界線與性平法規介紹",
    "scorePolicy": "■   作業\t                10%\t參訪心得與電影賞析心得\n■   期中作業\t        10%\t依據主題以媒體形式完成\n■   期末考\t        50%\t重點主題紙本測驗\n■   課堂討論參與\t10%\t主動度與參與度\n■   出席\t                10%\t課堂隨機點名出席狀況\n■   報告\t                10%\t課堂依據主題現場呈現或發表",
    "materials": "葉重新 (2012)。發展心理學。心理出版社\n陸洛等譯 (2007)。社會心理學。心理出版社\n劉泗翰譯 (2011)。性別的世界觀。書林出版\n現代婦女基金會 (2016)。爸媽不暴走，孩子正成長。城邦文化",
    "consultation": "設立班群 Line 群組助教 LineFB 親密關係社團教師 email: sofarjay@yahoo.com.tw",
    "remarks": "4 優質教育 5 性別平等 10 減少不平等",
    "foreignLanguageTextbooks": false
  }
]
