[
  {
    "name": "陳冠薇",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2024-02-12 22:43:16",
    "objective": "This course adapts a genealogy perspective and begins with a general overview of modern Chinese literature as a journey of discovery. The course will start with an introduction of A new literary history of modern China edited by Wang David Der-wei Wang (王德威), and then review how Wang succeeded Chih-tsing Hsia’s (夏志清)   work to present a new, diversify, and historically poetic version of Chinese literature history. This course will take these authors as cases for discussion, mapping Lu Hsun (魯迅) and Eileen Chang (張愛玲). With further navigating their positions in the literary genealogy, the lecturer aims to address how their literary works construct contemporary culture. In addition, two films, Spring in a Small Town and New Women, will be discussed in order to understand the cultural situation at that time.\n本課程將以華語譜系為視角，以中國現代文學的總體概述為起始，進行一場發現之旅。課程將以王德威的《哈佛新編中國現代文學史》切入，介紹王德威如何繼承夏志清的工作，呈現新格局、輻射的、「史蘊詩心」的中國文學史呈現。課程中將著重介紹魯迅、張愛玲的文學地位，解釋他們在文學系譜上承前啟後的位置，以各種面向來看待文學作品對於當代文化建構的貢獻。此外，也將特別探討《小城之春》與《新女性》兩部電影，以了解當時的文化情境。",
    "schedule": "1. Course overview    \n2. From Late Qing Dynasty to Republic of China\n3. Worlding Literary China  \n4. Lu Hsun  \n5. Lu Hsun’s short story:  Medicine\n6. Lu Hsun’s short story:  New Year’s Sacrifice  \n7. Eileen Chang \n8. Eileen Chang’s short story: Sealed off \n9. Midterm exam week    \n10. Eileen Chang’s short story: Lust, Caution \n11. Morden Chinese Flim: The New Woman(1935)\n12. Ruan Lingyu and Chinese Women \n13. Morden Chinese Flim: Spring in a Small Town(1948)\n14. The Film Art of Fei Mu  \n15. Review \n16. Final exam\n17. Dragon Boat Festival holiday\n18. Independent learning or Flexible courses",
    "scorePolicy": "Attendance & Participation: 30% \nOral presentation:20%\nAssignment:10%\nFinal exam:40%",
    "materials": "Wang, David Der-wei, ed. A new literary history of modern China. Harvard University Press, 2017.\n\nC. T. HSIA, A History of Modern Chinese Fiction 1917-1957. New Haven, Yale University Press, 1961.",
    "consultation": "kuanwei31433@mail.ntut.edu.tw",
    "remarks": "*Due to limited classroom capacity, it is not possible for everyone to enroll in this course. Students who want to add course must come to the classroom in the first week and then decide on the candidates.kuanwei31433@mail.ntut.edu.tw*Courses correspond to SDGs indicators：5 Gender equality*The index corresponds to the teaching content： In the 12th-13th weeks, the theme is “Ruan Lingyu and Chinese Women\". The corresponding indicators 5 Gender equality, achieving gender equality, and empowerment of all women.",
    "foreignLanguageTextbooks": true
  }
]
