[
  {
    "name": "余貞儀",
    "email": "cy1269@gmail.com",
    "latestUpdate": "2023-12-18 12:38:58",
    "objective": "This is a history course of western classical music, of which the definition, according to The New Harvard Dictionary of Music and The Oxford Dictionary, is \"art music” or\"serious music\", that written in a Western musical tradition, using an established form.\"Classical music is generally considered to be serious and to have a lasting value.”\nThe styles of various periods will be introduced, from the Medieval, Renaissance, Classical, Romantic, to the Contemporary eras. The goal of this course is helping students to equip a general comprehension of Classical Music in terms of basic elements of musical art, technical theory, historical, social and cultural background extends to related arts and humanities. \n\nIn order to pursue the most accurate references and info, the major key-points and terminology used in this course will be in English or original European text.\n\n音樂欣賞為西洋藝術音樂史，即古典音樂歷史的課程。根據「新哈佛音樂辭典」 (New Harvard Dictionary of Music) 與 「牛津字典」 的詮釋，所謂古典音樂為「嚴肅藝術」音樂，以嚴謹成型的作曲公式創作音樂，經過歷史洗練的時間藝術。透過此課程學生對西洋古典音樂會有總體認識，了解音樂的元素、技術理論及社會人文背景，從音樂美感構成與相關人文藝術和文化歷史的議題作連結。",
    "schedule": "1. 古希臘藝術與人文，信仰：古歐洲在基督教傳入前的文化，音樂，文學，戲劇，跟人文背景\t\n1st week: Introduction to Western Art Music—Greek origin as the foremost culture before Christianity entered Europe\n\n2. 從基督教傳入，到中世紀：古歐洲承襲希臘時代以來的傳承，展現於壁畫，以及基督教傳入歐洲後對文化及藝術的影響；音樂記譜方式，表演方式，天主教會對社會的影響；拜占庭建築到哥德式大教堂，中世紀歐洲社會與歷史\n2nd week: The Medieval Period--folk music, church music in relation to arts and culture\n\n3. 中世紀到文藝復興音樂的演變 (舞蹈與民謠): 庶民文化與音樂\n3rd week: From Medieval to Renaissance period--Madrigals, church music, dance music.\n\n4. 文藝復興時期：宗教音樂由單一旋律演化為複音音樂，作曲家 雕塑家。畫家介紹。以義大利為首的時代。此時期受歡迎的樂器介紹；源於德，法，蘇格蘭宗教改革與英國王室的關聯\n4th week: Renaissance period--from Monophony to Polyphony; Introduction to Italian composers, artists, and some of the most popular musical instruments; the Reformed Church and Martin Luther that not only changed the society and belief system but also aethesticism in arts. \n\n5. 巴洛克時期：法國巴洛克 -- 英國巴洛克與法國巴洛克比較，王室音樂跟庶民音樂介紹；法王路易十四世與凡爾賽宮\n5th week: Baroque--Louis XIV and his influence on French music,in comparison to English Baroque\n\n6. 巴洛克時期:\t義大利式協奏曲介紹；巴洛克時代小型管弦曲；宗教信仰不同形成南歐與北歐教堂建築文化迴異\n6th week: Baroque--Italian and French legends--Corelli, Lully and Couperin, Introduction to Concerto Grosso\n\n7. 巴洛克時期:\t基本舞曲，組曲形式 -- 宮廷舞步與巴洛克芭蕾\n7th week: Baroque--Italian and French legends continues--Vivaldi, Scarlatti, and Rameau--Court Dance and French Ballet\n\n8. 巴洛克時期：德意志巴洛克 -- 韓德爾，泰雷曼，巴赫\n8th week: Baroque--Comparison among Handel, Telemann, and J.S.Bach\n\n9. 巴洛克時期：深度探討巴赫生平與作品\n9th week: Baroque--J.S. Bach in-depth--his string works, orchestral music, choral music, keyboard music, and Fugues.\n\n10. \t期中報告\t\n10th week: Midterm Report\n\n11. 古典時期：啟蒙時代崛起，腓特烈二世 (普魯士) 對德意志音樂藝術的影響。波次坦忘憂宮介紹；盧梭之民約論，丹麥王室實現其理念；俄羅斯凱撒琳大帝對藝術的貢獻 — 聖彼得堡冬宮博物館介紹\n11th week: Classical period (Classicism)--The Age of Enlightenment--Frederick the Great as a passionate patron of music and art; Danish royal house contributing Jean-Jacques Rousseau's ideology in Denmark; Catherine the Great and The Hermitage\n\n12. 古典時期：德奧樂派 (第一代維也納樂派); 葛路克與哈布斯堡家族及其小公主，後來為法國波旁王朝最後的皇后瑪麗．安東尼；海頓，莫札特，貝多芬 (前期)\n12th week: The First Viennese School; Gluck and Habsburg family; Marie Antoinette\n\n13. 浪漫派時期：從貝多芬中期開啟德奧浪漫派\n13th week: Romantic period--Beethoven and the beginning of Romantic era; how Schubert was influenced by Beethoven \n\n14. 浪漫派時期：法國，北歐，波西米亞 -- 區域性的不同風格\n14th week: The pinnacle of Romantic era--Chopin, Schumann, Brahms, Liszt, Tchaikovsky, to the late Romantic period\n\n15. 浪漫派時期：國民樂派，俄羅斯音樂與十九世紀俄國芭蕾\n15th week: A counterpart of Romantic style with Naionalism--Music by Bohemian and Russian composers; 19th Century Russian ballet and music\n\n16. 二十世紀現代樂派：法國印象樂派，第二代維也納樂派；法國印象畫派與樂派的相輔相成；包浩斯學院，Art Deco (裝飾風藝術) Art Nouveau (新藝術運動) 介紹\n16th week: Impressionist Music, The Second Viennese School and related art styles in the period\n後現代主義：音樂學界的實驗性音樂；\tPhillip Glass 獨創的極簡樂風；電腦與傳統樂器結合\nThe Contemporary Music--from Twelve- tone music (The 2nd Viennese School) to Existentialism, music of Minimalism, and experimental music.\n\n17\t期末考\n17th week: Final Exam.",
    "scorePolicy": "20% Attendance \n20% Impressions from in-class presentations & discussions\n30% Midterm Report\n30% Final Exam",
    "materials": ". Fleming, William., and Frank Macomber. Musical Arts and Styles. Gainesville: University of Florida Press, 1990. \n\n2. Martin, Gary. and Miller, James. A History of Music in Western Culture. New York: McGraw-Hill Education, 1995",
    "consultation": "We'll have a LINE group in case of emergency:)I'll also use the LINE group to give assignments, video clips, and referencesEmail:cy1269@gmail.comMidterm paper submission to: yucheyne@gmail.com",
    "remarks": "課程名稱：音樂欣賞課程對應指標：3. 健康福址；4. 教育品質指標對應授課內容：科學家經過十幾年的研究發現，古典音樂是治癒身體與精神創痛的良藥，可提升心智。音樂療法 (Music Therapy，MT) 在過去四十年來在不同臨床領域的應用一直受到重視。多項研究顯示古典音樂與現代音樂對人身心健康的差異。",
    "foreignLanguageTextbooks": true
  }
]
