[
  {
    "name": "陳儀",
    "email": "chenyi@ntut.edu.tw",
    "latestUpdate": "2023-12-19 09:55:58",
    "objective": "This course deals mainly with the essence of Chinese traditional thought, trying to sovle the riddles lying behind the msytery of Asian philosophy. Through lectures and class discussion, students are expected to have a better command of the significant stream of thinking development for the Chinese people and look into the future cultural development. As for the course planning, this course consists of the following five topics: Pre-Chin philosophers, Taoism in Wei and Jin Dynasties, Buddism in Sui and Tang dynasties, Confucianism in Song and Ming Dynasties and modern philosophy. The course will be presented with simple approaches and lots of class discussions in the hope that  students will realize the wisdom explored by important philosophers throughout Chinese history, which will in returen provide students with much more promising and enrihed way of life.",
    "schedule": "Week 1  Course Introduction: The Spirit of Chinese Philosophy\nWeek 2  Confucius\nWeek 3  Mencius\nWeek 4  Xunzi\nWeek 5  The logicians\nWeek 6  Laozi\nWeek 7  Tomb Sweeping Day\nWeek 8  Zhuangzi\nWeek 9  Class Discussion (Students need to give a specific topic of interest for the oral presentation.)\nWeek 10  Mozi\nWeek 11  Hanfeizi\nWeek 12  The Chinese Buddhism\nWeek 13  Film Discussion\nWeek 14  Group Presentation\nWeek 15  Group Presentation\nWeek 16  Group Presentation\nWeek 17  Group Presentation\nWeek 18  Research and Discussion",
    "scorePolicy": "Class Participation and Assignment: 60%\nGroup Presentation: 40%",
    "materials": "JeeLoo Liu (2006). An Introduction to Chinese Philosophy: From Ancient Philosophy to Chinese Buddhism, Blackwell Publishing\nLily Zhang (2011). Thirty Chapters on the History of Chinese Philosophy, Le Jin Books.\nWing-Tsit Chan (1973). A Source Book in Chinese Philosophy, 4th Printing, Princeton University.\nI will be selecting some of the primary literatures in Chinese Philosophy as a self-made teaching material. Translations of some of the texts can also be found online on the Chinese Text Project: https://ctext.org/",
    "consultation": "Course Information will be announced on the website of NTUT i-school.Contact Information: chenyi@mail.ntut.edu.tw",
    "remarks": "If online teaching is necessary, we will use Google Meet.* This course corresponds to SDGs goal: 16 Peace, Justice and Strong Institutions * The SDGs goal corresponds to the course content: From the third week to the thirteenth week of the semester, the teaching theme includes Confucius, Mencius, Xunzi, Mozi and Hanfeizi which corresponds to the target of SDGs goal 16, Promote and enforce non-discriminatory laws and policies.",
    "foreignLanguageTextbooks": true
  }
]
