[
  {
    "name": "陳冠薇",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-18 19:54:59",
    "objective": "這門課為喜歡小說，也想嘗試寫作的同學而開。本課程需要閱讀的文本較多，請先詳閱課綱，再評估自己是否適合選修。\n--\n本課程，擬引領修課同學們徜徉中外愛情文學作品，並以主題單元方式進行之。從中，仔細咀嚼或清澀曖昧、或清新動人、或可歌可泣、或刻骨銘心、或纏綿悱惻、或黯然銷魂的愛情文學作品；從中，與作品中所傳達的心情、心事、心聲產生共鳴，由此來發現：在塵世的繁華裡，情感的傳遞是沒有時空隔閡，是可以心心相映。\n鑑於修課同學正值青春年華、正將展翅翱翔，因此本課程除了鑑賞、品味古今愛情文學作品，並欲與吾人現實人生作一連結，由此思考愛情、婚姻、兩性、家國、社會、政治等議題，由此尋求愛情的本質與真諦。\nThe course to be taught to lead students know the love of ancient and modern literature; content encompasses poems, prose, fiction, drama, music, video works, etc., and will be conducted in a manner theme unit. From this, clear astringent taste ambiguous, fresh and moving, epic, unforgettable, deeply grieved and other types of love literature. \nIn the process, the works convey mood, thoughts, aspirations, etc. to produce spiritual resonance. Thus to discover: In dust, there is no time and space to pass emotional estrangement, is matched heart.\nAs the students is young, will start his life being so understanding of the course in addition to the love of ancient and modern literature, and our desire to make a real life connection. Thus thinking love, marriage, gender, home country, society, politics and other topics. Thus, the nature and essence of seeking love.",
    "schedule": "1.Intro_當我們談論愛情，我們在談論什麼？—— 瑞蒙．卡佛，〈新手〉\n2.「那麼然後呢？然後 —— 就沒了。」—— 契訶夫，〈小玩笑〉、〈某某小姐的故事〉、〈帶小狗的女士〉\n3. 街頭搭訕指南 —— 村上春樹，〈遇見 100% 女孩〉\n4.「在靈魂黝黑的深夜，時時刻刻都是凌晨三點」—— 費茲傑羅，〈冬之夢〉\n5. 冰山之下 —— 海明威，〈白象般的群山〉、〈一則很短的故事〉\n6. 主題寫作 1：暗戀       \n7. 清明連假 \n8. 主題寫作 2：錯過\n9. 「生在這世上，沒有一樣感情不是千瘡百孔的」—— 張愛玲，〈留情〉、〈傾城之戀〉\n10. 期中考週\n11. 我們如何失去玫瑰色的世界 —— 鐘曉陽，〈哀歌〉、〈喚真真〉 \n12. 感情中的「輸家」與「贏家」—— 蘇偉貞，〈陪她一段〉；蔣曉雲，〈掉傘天〉 \n13.「火車一定要在這裡轉一個彎」—— 吳明益，〈強尼．河流們〉、〈金魚〉 \n14. 壞掉的血 —— 胡淑雯 〈墮胎者〉、〈與男友的前女友密談〉 \n15. 天才少年相愛相殺 —— 寺尾哲也，〈渦蟲〉、〈健康病〉 \n16. 主題寫作 3：「人與人隔著永恆的距離啊」、「無論多小心翼翼地活著，也得損壞」_愛的不可觸碰性與傷害\n17. 創作展示與討論 (fb 社團) \n18. 期末考週",
    "scorePolicy": "1. 口頭報告：20%  \n2. 期中作業（繳交愛情書寫創作或文本評述短文一篇) ：20%\n3. 期末書面報告（1. 課堂讀寫歷程 2. 創作成果繳交）或期末考：30%\n4. 平時成績 (出缺席與參與課堂活動)：30%",
    "materials": "每週閱讀文本會上傳至 i 學園，請自行下載。",
    "consultation": "kuanwei31433@mail.ntut.edu.tw",
    "remarks": "* 因教室容量有限，無法讓所有人加簽。請想加選的同學第一週務必至教室上課，再決定加簽人選。課程對應指標：5 性別平等指標對應授課內容：第 15 週授課主題「天才少年相愛相殺」對應指標 5 性別平等中的「通過多元管道對民眾傳播性別平等觀念」",
    "foreignLanguageTextbooks": false
  }
]
