[
  {
    "name": "鄭又平",
    "email": "youpingcheng@gmail.com",
    "latestUpdate": "2023-12-21 18:51:19",
    "objective": "本課程由全球化框架來檢視兩岸關係的演進、現況、及發展趨勢。\n由政治、經濟、乃至社會心理層面分析海峽兩岸錯綜複雜的互動關係。\n並檢視國際政治經濟體系中，美國與日本兩大國對兩岸關係的影響。\nThis introductory course on the complex cross-strait interactions will examine\nTaiwan’s role in the intricate web of international power politics; as well as the structure of hegemonic power rivalry, particularly Sino-US-Japan triangle, and its impact on cross strait relations. The material will cover the evolution, status quo, and developmental path of the cross strait relations in a global framework.",
    "schedule": "第一週 20240223 課程總論：兩岸關係的現實和國際政治的關鍵要素\n第二週 20240301 大國政治的悲劇：美國的戰略布局與修昔底德陷阱 \n第三週 20240308 中美博弈：科技與貿易角力 \n第四週 20240315 中美博弈：軍備競賽、島鏈之爭 \n第五週 20240322 國際政治的現實：中美霸權如何相互抗衡？\n第六週 20240329 國際政治的現實：世界亞洲化趨勢 \n第七週 20240405 清明放假\n第八週 20240412 國際政治的現實：國際供應鏈的移轉可能嗎？\n第九週 20240419 期中考週\n第十週 20240426 區域經濟整合趨勢下的台灣 \n第十一週 20240503 以全球視野揭露中國戰略佈局 \n第十二週 20240510 高度發展的中國經濟與軍事：從粵港澳大灣區到北斗系統 \n第十三週 20240517 兩岸關係的本質：一張圖道盡兩岸現實\n第十四週 20240524 兩岸經貿、產業關係與全球化：依賴？競爭？脫鉤？剝削？雙贏？\n第十五週 20240531 兩岸關係與台灣政黨政治、民意趨勢、認同政治\n第十六週 20240607 中美台三角戰略互動：棋手與棋子的視角\n第十七週 20240614 結論：國際政經舞台上，台灣命運劇本結局何去何從？\n第十八週 20240621 期末考",
    "scorePolicy": "出席率：30%\n期末報告：70%",
    "materials": "1. Elizabeth C. Economy，習近平與新中國：中國第三次革命的機會與挑戰 The Third Revolution Xi Jinping and the New Chinese State（台北：天下文化，2019）\n2. Andrew J. Nathan（黎安友）、Andrew Scobell，沒有安全感的強國 China’s Search for Security（新北：左岸，2018）\n3. Graham Allison，注定一戰？中美能否避修昔底德陷阱 DESTINED FOR WAR： Can America and China Escape Thucydides’ Trap?（台北：八旗文化，2018）\n4. Peter Navaro，美、中開戰的起點 Crouching Tiger: What China’s Militarism Means for the World (台北：光現，2017)\n5. Tom Miller (唐米樂)，中國的亞洲夢：一帶一路全面解讀，對台灣、全球將帶來什麼威脅和挑戰 China’s Asian Dream (台北：時報出版，2017)\n6. 易思安，中共攻台大解密 The Chinese Invasion Threat: Taiwan’s Defense and American Strategy in Asia（台北：遠流，2017）\n7. John Mearsheimer，大國政治的悲劇 The Tragedy of Great Power Politics（台北：麥田，2014）",
    "consultation": "對於課程有任何問題可以寄信給助教詢問助教：許庭瑋信箱：glimmer.900111@gmail.com",
    "remarks": "課程名稱：兩岸關係與國際政治課程對應指標：4 教育品質 10 減少不平等 16 和平與正義制度 17 全球夥伴指標對應授課內容：4 教育品質：第 16 週 結論：國際政經舞台上，台灣命運劇本結局何去何從？10 減少不平等：第 5 週 國際政治的現實：中美霸權如何相互抗衡？16 和平與正義制度：第 3 週 中美博弈：科技與貿易角力 17 全球夥伴：第 8 週 區域經濟整合趨勢下的台灣",
    "foreignLanguageTextbooks": false
  }
]
