[
  {
    "name": "吳斯偉",
    "email": "swu@ntut.edu.tw",
    "latestUpdate": "2024-02-02 20:31:36",
    "objective": "隨著科技的發展與產值快速成長，網路、電商、商業新模式等各式創業大行其道，成為許多創業者的新選擇，本課程邀請國內知名創業楷模或創業成功典範之企業經理人分享創業成功之經驗。以真實具體的創業經驗為教材，讓學生更深刻體驗創業家之精神。希冀以觀摩學習典範企業的具體經驗，帶領學生學習企業創新與創業的思維，進而激發學生追求成就的渴望，強化青年學子對人生願景的規劃。\nAlong with the prosperous development of Internet, the output value of E-commerce is growing fast. Launching a business on the internet has become a new choice for many entrepreneurs. We invite the domestic business manager, as the model of outstanding and successful enterprise, to share his experiences of achievement with students. By offering the real and specific examples, business manager will make students learn further about the enterprisers' entrepreneurship. Through their experiences, we hope students can learn innovations and creations of enterprise; furthermore, students can be inspired to pursue their ambition to strengthen their wills to plan the future.",
    "schedule": "本課程為密集授課 本課程為密集授課\n請注意上課日期，第一堂課開始算出缺席。\n要候補加選的同學，請第一堂課務必要出席，若無出席，恕不加選。\n第一次上課:  2/21   ABC 節 1830-2110  經營管理系 吳斯偉老師 課程簡介與說明\n第二次上課:  3/6    ABC 節 1830-2110 創業講座一：講者待聘                   \n第三次上課:  3/13  ABC 節  1830-2110 創業講座二：講者待聘\n第四次上課:  3/27 ABC 節  1830-2110 創業講座三：講者待聘\n第五次上課:  4/3   ABC 節  1830-2110 創業講座四：講者待聘\n第六次上課:  4/10 ABC 節  1830-2110 創業講座五：講者待聘\n詳細情形於第一次上課時公布",
    "scorePolicy": "心得報告 50%　出席 45%　課堂表現 5%\n\n一、點名暨作業繳交方式\n     18：30 前助教會在門口發心得單暨點名單 (心得報告＋問卷調查)\n　　 20：30 演講結束後繳交，可寫到 21：00\n二、遲到扣分方式\n　　18：40 之後列入遲到，遲到次數累積 2 次視同曠課 1 次，以此類推\n三、曠課扣分方式\n　    每次曠課扣 20 分 ※曠課不提供補課，曠課 2 次高機率不及格\n四、請假方式\n　　請同學備妥證明文件（如參賽證明／就診記錄……）\n　　最晚在請假當週星期五填寫請假單，逾時一律視為曠課。\n　　每次請假扣出席 + 表現分數 4-10 分（依請假原因及證明斟酌扣分）\n五、補課方式　\n　　課後約 2 週上傳影片，助教會以 E-MAIL 提供連結，期中前補心得\n六、課堂表現加分方式\n　　於課程進行 Q&A 時提出問題（務必主動登記學號＋姓名）\n七、期中預警 \n        80 分以下皆會期中預警，請收到期中預警通知的同學主動聯繫授課 \n        教師，若無聯繫，期末不接受成績更改。",
    "materials": "無",
    "consultation": "請第一堂課一定要到，第一堂課會發 Line 群組連結。有事聯繫請 email: swu@mail.ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
