[
  {
    "name": "房同經",
    "email": "nathan1@ms39.hinet.net",
    "latestUpdate": "2023-12-25 00:36:25",
    "objective": "人的身體一接觸自然界，便開始各個器官的功能，人不如機器，無法汰換零件，加上身體機能遇到問題之後，許多人往往不知如何處理應對，甚至身體出現徵兆也渾然不知。所以此科目最主要的目的是希望藉由對醫學的認識，讓大學生們更瞭解自己的身體，進而保護並時時自我偵測身體是否正常運作，要培養健全的大學生，而不是只會讀書的大病貓。\nOnce the human body contacts the natural environment, the organs of the body begin to function.  But the human body can not change it's organizational like machine.  So when our body's function is in trouble, we always have no idea how to solve it, either to find out.  One of these course's objection is to let college students understanding their own body by learning some important medical concepts.  We hope that our country both has excellent and healthy college students,  and not all sick.",
    "schedule": "週次\t日期\t課程內容\n1\t2/23\t你的人生是不是卡住了？一日一頁醫學知識 (p. 1-14)\n2\t3/1\t注意力被偷走了？一日一頁醫學知識 (p. 13-28)\n3\t3/8\t年輕而迷惘和憤怒，你抗壓性強嗎？一日一頁醫學知識 (p. 29-42)\n4\t3/15\t不是在打瞌睡，就是睡不著？一日一頁醫學知識 (p. 43-56)\n5\t3/22\t就是「很不公平」？別以為這不正常！一日一頁醫學知識 (p. 57-70)\n6\t3/29\t忘東忘西，是失智嗎？一日一頁醫學知識 (p. 71-84) (作業報告)\n7\t4/5\t放假 (一日一頁醫學知識 (p. 85-98) ) \n8\t4/12\t媽媽中風 10 年臥床從沒褥瘡！作為子女的必修課？一日一頁醫學知識 (p. 99-112) \n9\t4/19\t期中考：一日一頁醫學知識 (p. 1 – p. 112)\n10\t4/26\t誰說分數不重要！讀同一本書，為何學習結果大不相同？一日一頁醫學知識 (p. 113-126) \n11\t5/3\t你一天上幾次廁所？一日一頁醫學知識 (p. 127-140) (作業報告)\n12\t5/10\t做愛做的事，可不可以不受限制？一日一頁醫學知識 (p. 141-154)\n13\t5/17\t男性雄風和女人味？一日一頁醫學知識 (p. 155-168)\n14\t5/24\t看東西變得吃力？螢幕保母？一日一頁醫學知識 (p. 169-182)\n15\t5/31\t聽不清楚？ 一邊耳朵還是兩邊？一日一頁醫學知識 (p.183-196)\n16\t6/7\t眾多年齡段人群體能下降？一日一頁醫學知識 (p. 197-210) (作業報告)\n17\t6/14\t挑醫生、選醫院，吃藥當吃補？一日一頁醫學知識 (p. 211-224)\n18\t6/21\t期末考：一日一頁醫學知識 (p. 113 – p. 224)",
    "scorePolicy": "計分：讀書作業及報告【60%】\n期中考【20%】\n期末考【20%】\n* 上課注意事項:\n1. 堅持 100% 比堅持 99% 做得到\n2. 遲到與早退扣學期成績 5%\n3. 上課不到扣學期成績 10%\n4. 請假：公假請提前一周報告；臨時病 / 事假出示正式證明文件\n5. 上課禁止飲食及手機使用\n6. 欺騙造假作弊經證實，成績零分並依校規辦理",
    "materials": "1\tKidder, David S.: The Intellectual Devotional Health: Revive Your Mind, Complete Your Education, and Digest a Daily Dose of Wellness Wisdom 一日一頁醫學知識：看就懂的必修健康課 （墨刻）城邦出版集團 2021 \n2\tNina Shapiro: Hype：A Doctor’s Guide to Medical Myths, Exaggerated Claims and Bad Advice - How to Tell What’s Real and What’s Not 誇大不實的醫療迷思：醫師教您如何分辨虛與實 天下文化 2022 (作業報告) \n3\tDaniel Kahneman: Noise: A Flaw in Human Judgment 雜訊：人類判斷的缺陷 天下文化 2021 (作業報告) \n4\tDavid Robert Grimes: The Irrational Ape《反智》：鍛煉批判性思考，看透那些好像講什麼都很有道理的猿人 天下文化 2022 (作業報告)",
    "consultation": "email: ftj@ntut.edu.tw",
    "remarks": "SDG3 健康福祉",
    "foreignLanguageTextbooks": true
  }
]
