[
  {
    "name": "陳宏佳",
    "email": "honga.chen@mail.ntut.edu.tw",
    "latestUpdate": "2023-12-20 15:11:38",
    "objective": "This course mainly explores how to apply generative AI technology to commercial creation and multimedia production processes. The course introduces commonly used generative deep learning models, such as Generative Adversarial Networks (GANs), discusses the topics of AI Generated Content (AIGC), and focuses on how they can enhance the efficiency of the creative process and tool operation.\n\nThe purposes of this course are fourfold:\n\n1. Understand the relevant business processes of multimedia development.\n2. Use generative AI models and multimedia-related platforms, and apply these technologies to content output, such as image generation, video content, and music creation etc.\n3. Discuss how to combine these new technologies with traditional multimedia production processes, and how to operate related multimedia software.\n4. Discuss relevant intellectual property rights, ethics and other social issues.\n\nThis course is suitable for students who are interested in artificial intelligence, multimedia applications, and how to apply these technologies in a business environment.",
    "schedule": "Course schedule:\nWeek 1: Course introduction\nWeek 2: Presentation and text media application (1)\nWeek 3: Presentation and text media application (2)\nWeek 4: 2D image media application (1)\nWeek 5: 2D image media application (2)\nWeek 6: Publication vector media application (1)\nWeek 7: Publication vector media application (2)\nWeek 8: 3D media application (1)\nWeek 9: 3D media application (2)\nWeek 10: Midterm exam\nWeek 11: Music media application (1)\nWeek 12: Music media application (2)\nWeek 13: Audiovisual media application (1)\nWeek 14: Audiovisual media application (2)\nWeek 15: Internet media application (1)\nWeek 16: Internet media application (2)\nWeek 17: Comprehensive topics\nWeek 18: Final exam",
    "scorePolicy": "I. Course participation and attendance: 10% of the total grade\n\n1. Class and group discussion learning situation.\n2. Semester attendance and proportion of mining classes, partial scores can be obtained for leave due to special reasons.\n3. If you miss more than half of the classes before the midterm and final exams, you will lose the eligibility to take the exam.\n\nII. Regular homework and discussion: 30% of the total grade\n\n1. If necessary, in-class discussions or quizzes will be held at any time.\n2. The test will be based on the course content and discussion topics.\n3. Group discussion and report.\n\nIII. Midterm exam score: 30% of the total grade\n\n1. Test: 30% of the total score\n2. Method: Conducted by a written test.\n\nIV. Final score: 30% of the total grade\n\n1. Report: 30% of the total score\n2. Method: Conducted by group reporting.\n\nV. Distribution ratio\nCourse participation and attendance: 10% of the total grade\nRegular grades: 30% of the total grade (Group report 10%; Random quiz 20%)\nMidterm grades: 30% of the total grade\nFinal grades: 30% of the total grade",
    "materials": "1. General Textbook:\n2. Supplementary Textbook:",
    "consultation": "email: honga.chen@ntut.edu.tw",
    "remarks": "1. 本課程將以北科 i 學園 plus 做為課程網頁，並於開學後選定課代設 line 群方便同學聯繫與討論。2. 如有加退選或課程問題請寄 email 給老師 ([honga.chen@ntut.edu.tw](mailto:honga.chen@ntut.edu.tw))。3. 因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。4. 若無法實體上課，採取學校的 Microsoft Teams（學號 @cc.ntut.edu.tw）於原定上課時間遠距上課。",
    "foreignLanguageTextbooks": false
  }
]
