[
  {
    "name": "林濬璈",
    "email": "jalin@ntut.edu.tw",
    "latestUpdate": "2024-02-15 14:37:28",
    "objective": "本課程將涵蓋電腦科學的理論基礎。其內容包含自動機理論，電腦語言學，以及計算形式等。電腦相關的基本數學也將涵蓋在課程範圍之中。包括集合論，基本關係及及操作，以及理論證明工具與技術。課程大綱：基礎理論介紹，有限狀態自動機 / 一般敘述語法，Regular 集合的基本性質，前後文無相關文法， Pushdown 自動機，杜林機（turning machines），Chomsky 層次結構，基本關係及操作，理論證明技術及工具。\nThis course will look the theoretical foundation in computer science.  Automata theory, languages, and computation formalism will be examined in details.  Various fundamental computer-related mathematics will also be covered.  They include, sets/subsets, basic relations and operations and tools/techniques for proving theorems. Course Outline: Introduction to Theoretical Foundations, Finite Automata / Regular Expression, Properties of Regular Sets, Context-Free Grammars, Pushdown Automata, Turing Machines, The Chomsky Hierarchy (tentative), Basic Relations and Operations, Tools/Techniques for Proving Theorems.",
    "schedule": "1)\tRegular Languages (4 weeks): Deterministic and non-deterministic finite automata, closure properties, regular expressions, Brzozowski derivatives, the pumping lemma for regular languages, DFA minimization, the Myhill-Nerode theorem.   \n2)\tContext-Free Languages (4 weeks): Context-free grammars, normal forms, the pumping lemma for context-free languages, pushdown automata, closure properties.\n3)\tDecidable and Undecidable Languages (6 weeks): Turing machines, the Church-Turing thesis, computability, undecidability, the Halting Problem, reductions, basic complexity classes.",
    "scorePolicy": "Homework 50%\nMid-term 20%\nFinal 20%\nAttendance 10%",
    "materials": "There is no required textbook for this course. However, lectures are based largely on the following sources—you can consider one of these if you're looking for a reference:\n1. Michael Sipser. “Introduction to the Theory of Computation”\n2. John Hopcroft and Jeffrey Ullman. “Introduction to Automata Theory, Languages, and Computation”",
    "consultation": "Email: jalin@ntut.edu.tw",
    "remarks": "課程網頁： https://carquois42.github.io/formal.html",
    "foreignLanguageTextbooks": false
  }
]
