[
  {
    "name": "宋裕祺",
    "email": "sungyc@ntut.edu.tw",
    "latestUpdate": "2024-01-29 17:23:17",
    "objective": "本課程主要教授學生：(1) 結構分析原理、(2) 結構物穩定度判別、(3) 靜定結構的分析、(4) 虛功法、(5) 靜定結構影響線的分析與 (6) 共軛梁法。\n\nThis course provides the students an insight into structural analysis. Some essential classical analysis methods are described. The purpose of this course is to make the students a better understanding of analytical principles of structures. The practical applications to structural engineering are also discussed.",
    "schedule": "第一週：課程介紹 (Introduction) \n第二週：結構分析原理 (Background of Structural Analysis)\n第三週：結構物穩定度判別 (一) (Justification of Stability Degree of Structure I)\n第四週：結構物穩定度判別 (二) (Justification of Stability Degree of Structure II)\n第五週：靜定結構反力的分析 (Analysis of Reactions of Statically Determinate Structure)\n第六週：靜定梁剪力與彎矩的分析 (Analysis of Shear Force & Bending Moment of Statically Determinate Beam)\n第七週：靜定剛架軸力、剪力與彎矩的分析 (Analysis of Axial Force, Shear Force & Bending Moment of Statically Determinate Rigid Frame)\n第八週：靜定桁架軸力的分析 (一) (Analysis of Axial Force of Statically Determinate Truss I)\n第九週：靜定桁架軸力的分析 (二) (Analysis of Axial Force of Statically Determinate Truss II)\n第十週：靜定桁架軸力的分析 (三) (Analysis of Axial Force of Statically Determinate Truss III)\n第十一週：期中考試 (Midterm)\n第十二週：虛功法 (Virtual Work Theory)\n第十三週：靜定梁與剛架影響線的分析 (Analysis of Influence Line of Statically Determinate Beam & Rigid Frame)\n第十四週：靜定桁架影響線的分析 (一) (Analysis of Influence Line of Statically Determinate Truss I)\n第十五週：靜定桁架影響線的分析 (二) (Analysis of Influence Line of Statically Determinate Truss II)\n第十六週：共軛梁法 (一) (Conjugate Beam Method I)\n第十七週：共軛梁法 (二) (Conjugate Beam Method II)\n第十八週：期末考試 (Final)",
    "scorePolicy": "期中考試 (Midterm)    40% \n期末考試 (Final)   40%\n課後習題 (Homework)   10%\n隨堂小考 (Quiz)   10%",
    "materials": "Handout of “Structural Analysis”, by Dr. Yu-Chi, Sung",
    "consultation": "可來先科技大樓 903 辦公室洽詢",
    "remarks": "公布 GoogleMeet 等遠端教學網址 achgfhg",
    "foreignLanguageTextbooks": false
  }
]
