[
  {
    "name": "林佑達",
    "email": "Roylin918@gmail.com",
    "latestUpdate": "2024-02-23 11:01:50",
    "objective": "當代都市議題經常為跨領域、開放性的複雜問題，在資料蒐集與分析上，需要整合地理空間、時間的維度；在分析與對策上，須平衡公部門、私部門、民眾等多重利害關係者的，是一門相當複雜但重要的學問。本課程從真實的都市議題出發，教導學生掌握地理空間資訊、資料處理與分析、資訊視覺化、策略論述等綜合能力，培養學生對於都市複雜議題的觀察與剖析，進而對真實環境提出洞見與創意。本課程以分組操作為主，每組需挑選各自關切的都市議題，進行相關分析作業。內容包括：都數據獲取與處理、資訊視覺化、地理運算、都市建模、策略形塑，並包含一次期中報告，與一次期末成果報告。\n\nContemporary urban issues are often complex, interdisciplinary, and open-ended. In terms of data collection and analysis, they require the integration of geographical, spatial, and temporal dimensions. In analysis and strategy formulation, it is necessary to balance the interests of multiple stakeholders such as the public sector, private sector, and the general public. It is a highly complex yet crucial field of study. This course starts from real urban issues, teaching students to master skills in geographic information, data processing and analysis, information visualization, strategic discourse, and other comprehensive abilities. It aims to cultivate students' observation and analysis of complex urban issues, thereby enabling them to propose insights and creativity for real environments. This course primarily involves group work, where each group selects urban issues of their concern for relevant analysis tasks. The content includes data acquisition and processing, information visualization, geographic computation, urban modeling, and strategic shaping. It also includes one midterm report and one final project report.",
    "schedule": "第一週：都市數據與應用概論\n第二週：放假\n第三～四週：都市數據處理\n第五～七週：空間運算與資料視覺化\n第八週：期中分組報告\n第九～十三週：都市數據建模\n第十四～十七週：都市策略形塑\n第十八週：期末分組報告\n\nWeek 1: Introduction to Urban Data and Applications\nWeek 2: Holiday\nWeek 3-4: Urban Data Processing\nWeek 5-7: Spatial Computation and Data Visualization\nWeek 8: Midterm Group Presentation\nWeek 9-13: Urban Data Modeling\nWeek 14-17: Urban Strategy Formulation\nWeek 18: Final Group Presentation",
    "scorePolicy": "個人課程參與 30%：\n平時上課出席率、討論參與度、每週進度等綜合評比。\n\n分組期中成果 30%：\n各組期中簡報的成果總體評比，同一組每個成員評分相同。\n\n分組期末成果 40%：\n各組期中簡報的成果總體評比，同一組每個成員評分相同。\n\nIndividual Course Participation 30%:\nComprehensive assessment of regular class attendance, participation in discussions, weekly progress, etc.\n\nGroup Midterm Results 30%:\nOverall evaluation of each group's midterm presentation results, with the same score given to each member within the same group.\n\nGroup Final Results 40%:\nOverall evaluation of each group's final presentation results, with the same score given to each member within the same group.",
    "materials": "必備軟體：Excel, QGIS, R-studio, Tableau Public\n選用軟體 / 語言：Python, R, Power BI\n數據來源：國內外開放資料\n\nRequired Software: Excel, QGIS, R-studio, Tableau Public\nOptional Software/Languages: Python, R, Power BI\nData Sources: Domestic and international open data",
    "consultation": "授課老師：roylin918@gmail.com 助教一名。",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
