[
  {
    "name": "黃增隆",
    "email": "blessing@ntut.edu.tw",
    "latestUpdate": "2024-02-16 11:56:41",
    "objective": "本課程主要目的培養同學實務的數據分析與洞察力。因此本課程讓同學實際操作數據平台進行數據的分析與解讀，以培養如何獲取消費者洞察與行銷意涵的能力。特別是導入 Eastern Integrated Consumer Profile (E-ICP) 與 QSearch 兩大數據分析平台。因此課程將需要使用網路與電腦查詢資料。同時也特別邀請實務經理人以成功商業案例分享從數據分析到行銷方案擬定的流程，以促使同學學習的理論與實務並重效益.\n\nThe primary purpose of this course is to cultivate students' practical data analysis and insights. Therefore, this course allows students to operate the data platform to analyze and interpret data, resulting in developing the ability to obtain consumer insights and marketing implications via data. In particular, the course offers Eastern Integrated Consumer Profile (E-ICP) and QSearch, two significant data analysis platforms. Therefore, the course will require using the Internet and computers to search for information. Practical managers are also specially invited to share the process from data analysis to marketing plan formulation with successful business cases, facilitating the learning effect.",
    "schedule": "Weekly course schedule and teaching methods:\nWeek 1 Course Introduction\nWeek 2 Viral Marketing\nWeek 3 Influencer Marketing\nWeek 4 Social Media Marketing\nWeek 5 Live Streaming Marketing\nWeek 6 Instagram/ Line official account Marketing\nWeek 7 Eastern Integrated Consumer Profile (E-ICP): Insights from consumer behavior data (Business case)\nWeek 8 Eastern Integrated Consumer Profile (E-ICP): E-ICP introduction\nWeek 9 Eastern Integrated Consumer Profile (E-ICP): Practical use of E-ICP to get consumer insights.\nWeek 10 Eastern Integrated Consumer Profile (E-ICP): Practical use of E-ICP to get consumer insights\nWeek 11 Social listening: Insights from social media monitoring (Business case)\nWeek 12 Social listening: QSearch introduction\nWeek 13 Social listening: Practical use of QSearch to get consumer insights.\nWeek 14 Social listening: Practical use of QSearch to get consumer insights.\nWeek 15 Discuss Final Project Presentation\nWeek 16 Discuss Final Project Presentation \nWeek 17 Final Project Presentation\nWeek 18 Final Project Presentation",
    "scorePolicy": "1.\tReflection report on weekly course content  30%\n2.\tFinal Project Presentation 45%\n3.\tPeer review 25%",
    "materials": "Academic articles\nBusiness cases\nData analysis software",
    "consultation": "Consultations are available during office hours (reservation in advance).",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
