[
  {
    "name": "陸元平",
    "email": "yuan@ntut.edu.tw",
    "latestUpdate": "2024-03-04 12:24:40",
    "objective": "為培養大學部學生自主學習能力，由學生主動積極創造並實現自己有興趣之主題。學生於特定主題之創造與實現中，學習到思考批判與問題解決等能力。教師擔任輔助指導角色，引導學生從實踐中學習問題解決能力。\n學生根據自己的興趣與能力訂定自主學習計畫，並於開學前向各系提出申請，由本系專任老師擔任指導教師，審查計畫及評核學期成績。\nThis course aims to develop undergraduates’ active learning skills by making students engage in the creation and realization of topics of students’ own interest. In the process of specific topic creation and realization, students will proactively learn critical-thinking and problem-solving skills. Instructors cultivate the active engagement of students in problem solving, without actually participating in it. \n\nIn this course, students are required to draw up self-learning plans based on their own interests and capabilities and then submit their plans to the departmental office for approval by the beginning of the semester.",
    "schedule": "第 1 週～第 8 週：AI 基礎知識預習：包括 AI 概念、Web3.0、眼底攝影技術、AI 在預防性維護 (PHM) 的應用等。\n第 8~12 週：AI 應用探討與模型設計：深入探討工業和醫學領域中 AI 的輔助應用，並嘗試設計或最佳化 AI 模型。學習 AI 模型的運行架構。\n第 12~16 週：研究項目執行與完成：根據設定的研究目標，完成之前階段設定的研究項目。\n第 16~18 週：成果整合與報告製作：統整研究成果並製作成果報告。",
    "scorePolicy": "A（優秀）：超出預期完成課程要求，展現出色的創意與技術實現能力，項目具有高度的創新性和實用性，積極參與課程互動和同儕評價，提供有價值的反饋。\nB（良好）：滿足課程要求，項目展現良好的技術實現和一定程度的創新，能夠有效溝通和展示工作成果，積極參與課程互動。\nC（中等）：基本滿足課程要求，項目實現基本功能，但缺乏創新或技術深度，參與課程互動但較少提供反饋。\nD（及格）：未完全滿足課程要求，項目完成度低，展示和報告未能清楚傳達工作成果，參與課程互動不積極。\nF（不及格）：未達到課程基本要求，項目未提交或質量極差，幾乎沒有參與課程互動。",
    "materials": "為了提升本課程的學習效果和針對性，我們將採用自編教材。這些教材經過精心設計，旨在深化學生對 AI 技術的理解，並與當前工業和醫學領域內最前沿的應用相結合。自編教材將包含豐富的案例研究、實用的技術指導以及最新的行業動態，以幫助學生建立堅實的理論基礎，並能將所學知識應用於實際問題解決中。\n\n此外，自編教材還將提供互動式學習元素，如線上討論、實時反饋和項目導向的任務，以促進學生的主動學習和深度參與。我們相信，通過這種量身定制的學習材料，學生將能夠更有效地掌握 AI 相關知識，並準備好將這些知識應用於未來的學術或職業生涯中。",
    "consultation": "為方便學生直接接觸教師和業界專家，我們提供一種直接且靈活的諮詢管道。學生可透過指定的電子郵件與教師或專業人士直接聯繫，請求諮詢並提出具體問題。此外，學生也可與教師和專業人士約定面對面諮詢的時間，以便進行更深入的討論和指導。請在諮詢請求中包含您的姓名、聯絡資訊、討論主題和希望諮詢的時間。我們鼓勵學生充分利用這個管道，以獲得最大的學習支持和專業指導，促進自主學習的發展。",
    "remarks": "",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "曾百由",
    "email": "stephen@ntut.edu.tw",
    "latestUpdate": "2024-03-04 08:44:42",
    "objective": "為培養大學部學生自主學習能力，由學生主動積極創造並實現自己有興趣之主題。學生於特定主題之創造與實現中，學習到思考批判與問題解決等能力。教師擔任輔助指導角色，引導學生從實踐中學習問題解決能力。\n學生根據自己的興趣與能力訂定自主學習計畫，並於開學前向各系提出申請，由本系專任老師擔任指導教師，審查計畫及評核學期成績。\nThis course aims to develop undergraduates’ active learning skills by making students engage in the creation and realization of topics of students’ own interest. In the process of specific topic creation and realization, students will proactively learn critical-thinking and problem-solving skills. Instructors cultivate the active engagement of students in problem solving, without actually participating in it. \n\nIn this course, students are required to draw up self-learning plans based on their own interests and capabilities and then submit their plans to the departmental office for approval by the beginning of the semester.",
    "schedule": "依研究專題給予指導。前半學期教授機械視覺與機械手臂系統整合，後半學期則進行專題製作研究。",
    "scorePolicy": "醫學生進度個別予以指導與評分。分數依專題成果與報告評量。",
    "materials": "依參考文獻而定。",
    "consultation": "個別訂定諮商時間。",
    "remarks": "",
    "foreignLanguageTextbooks": false
  }
]
