[{"name":"蔡敏崑","email":"mktsai@ntut.edu.tw","latestUpdate":"2007-09-19 13:20:32","objective":"國立台北科技大學九十六學年度第一學期授課科目教材大綱\n科目名稱　　中文　　台灣史\n　　英文　　History of Taiwan\n開課班級　　二土四　　任課教師　　蔡敏崑\n敎學目標　　1.　　介紹史學方法，以培養學生觀察、分析之能力。\n2.　　以專題討論強化學生表達之能力。\n3.　　介紹以台灣為主體的史觀，以培養學生寬廣的分析視野。\n開課學期別　　V一學期課程　　□二學期課程\n本學期學分　　 2  學分　　每週時數　　 2  小時\n教科書　　書名　　台灣歷史圖說　　作者　　周婉窈\n　　出版書局　　聯經出版事業公司　　出版日期　　1998年9月\n參考書　　書名　　台灣史　　作者　　李筱峰、林呈蓉\n　　出版書局　　華立圖書股份有限公司　　出版日期　　2003年8月\n教材大綱　　本課程的設計，其目標是建構在臺灣為主體的歷史價值觀念上，以培養學生有更寬廣的視野。在探討臺灣歷史上，統治者史觀與臺灣人民的史觀，二者是並行發展的。若執著於統治史觀而湮滅臺灣人民史觀，難免會陷於認識上的缺陷與傷害，那是不智的。\n臺灣自始為一地理名詞，它歷經荷蘭、西班牙、鄭成功、清朝、日本與國民政府的統治，很自然地呈現了殖民社會的特質。而在殖民社會下的人民，也流露出其靭性與活力。因而在認識臺灣社會的特質、人民的心靈活動與處境上，分別介紹統治者的政策、臺灣人民的價值觀、社會、宗教、學生運動、歌謠、戲劇、舞蹈、雕刻、美術等主題，以了解臺灣發展的歷史軌跡。\n認識臺灣史觀的意識是相當艱辛的，因為長久以來在人民意識中的帝王史觀、民族主義史觀、與英雄史觀相當牢固。期待藉著臺灣人民的史觀能幫助學習者有更嶄新的寬廣視野。\n評分方式：平時成績：45%  期中考：15%  期末考：40%\n\n\n國立台北科技大學九十六學年度第一學期授課科目教材大綱\nCourse Title　　Chinese　　台灣史\n　　English　　History of Taiwan\nDepartment &amp; Class　　二土四　　Teacher　　蔡敏崑\nMin-kun Tsai\nObjectives　　1.　　Introducing historical methodology; Cultivating student’s analytical ability\n2.　　Promoting students’ presentation ability through group discussion and seminar \n3.　　Introducing Taiwan-based historical perspectives; Broadening students’ views \nYear/Semester　　V One semester　　□ Two semesters\nCredits　　 2  credits　　Hour/per week　　 2  hours\nTextbook　　Title　　台灣歷史圖說　　Author　　周婉窈\n　　Publisher　　聯經出版事業公司　　Date　　September, 1998\nReference Books　　Title　　台灣史　　Author　　李筱峰、林呈蓉\n　　Publisher　　華立圖書股份有限公司　　Date　　August, 2003\nCourse description　　This course is meant to construct Taiwan-based historical values and to broaden students’ horizons.  In the study of the history of Taiwan, two perspectives co-exist: the ruler’s perspectives and the Taiwanese’s perspectives.  If we honor only the ruler’s perspectives and neglect Taiwanese’s perspectives, we fall short of a comprehensive view of one part of human history in an important island in the Pacific Ocean.\nTaiwan has been a geographical entity ruled by Holland, Spain, Cheng Ch'eng-kung, the Ch’ing Dynasty, Japan, and the KMT government.  Naturally, it has developed a colonial culture.  Taiwanese living in such a colonial society have cultivated perseverance and vitality.  Therefore, to make students fully understand the characteristics Taiwanese society and Taiwanese’s spiritual activities, I intend to cover the following topics in this course: (1) the policies of the rulers, (2)  Taiwanese philosophy, (3) Taiwanese society, (4) Taiwanese religions, (5) Taiwanese students’ movements (6) Taiwanese folk songs (7) Taiwanese drama (8) Taiwanese dance, (9) Taiwanese sculpture (10) Taiwanese paintings, etc. \nIt is not easy to establish Taiwan-based historical perspectives because the history of Taiwan has long been approached in the light of the ruler’s perspectives, the national perspectives, and the heroic perspectives.  We sincerely hope that the Taiwan-based historical perspectives can help broaden people’s horizons.\n","schedule":"國立台北科技大學九十六學年度第一學期教學進度計畫表\n班級　　二土四　　課程名稱　　台灣史　　任課教師　　蔡敏崑 老師\n教本或參考書　　台灣歷史圖說　　出 版 者　　聯經出版事業公司\n週 次　　月  日　　時數　　授課內容要項　　備           註\n１　　9月　　2　　課程介紹　　\n２　　9月　　　　歷史與人生　　\n３　　10月　　　　台灣的自然環境　　\n４　　10月　　　　國際競爭中的台灣－荷蘭、西班牙、鄭成功、清朝時期　　\n５　　10月　　　　國際競爭中的台灣－日本政府時期　　\n６　　10月　　　　國際競爭中的台灣－國民政府時期　　\n７　　10月　　　　台灣的小說－亞細亞的孤兒　　\n８　　11月　　　　台灣的雕刻與美術　　\n９　　11月　　　　期中考試　　\n１０　　11月\n　　　　台灣民謠　　\n１１　　11月　　　　台灣戲劇　　\n１２　　12月　　　　歷史方法論　　\n１３　　12月　　　　台灣的學生運動　　\n１４　　12月　　　　台灣民間的宗教活動　　\n１５　　12月　　　　台灣的舞蹈　　\n１６　　1月　　　　台灣人價值觀　　\n１７　　1月　　　　台灣的自由、民主與法治　　\n１８　　1月　　　　期末考試　　\n\n\n","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
