[{"name":"周至如","email":"cjchou@ntut.edu.tw","latestUpdate":"2007-09-27 17:05:32","objective":"The electrical power for high-tech industries are requested with very high safety, reliability and quality. In general, even a small fault on power system or/and apparatus may lead to large outage and hazards. Power system and apparatus faults (power fault) had become one of the most important risks in the high-tech industries e.g. the semiconductor industries. Hence, the issues of preventing power fault and to reduce their risks are more and more important, which will very rely on well fault diagnosis and remedy for the power systems and apparatuses. This course is aimed to the power faults usually occurred in the high-tech industries, where the root causes of faults are diagnosed and the improved measures are proposed. The scope includes the power distribution systems and apparatuses of the utility and the customer plants in the science-based industrial parks, in which the fault types are described and the root causes of faults will be diagnosed based on theoretical analysis and practical cases investigations. Furthermore, the remedy methods and their related feasible measures will be discussed.","schedule":"PART I-1: Utility Related Problems:(1～4週）\n1. Hidden risks and fault types descriptions.\n2. Harmonics problems on the very high voltage (VHV) underground\ndistribution system with loop structure\n3. Protection coordination problems on the VHV underground\ndistribution system with loop structure.\n4. Hazards due to ground fault transfer problems on the VHV\nunderground distribution system with loop.\nPART I—2:Utility Related Problems:（5～7週）\n1. Damages due to surges and low frequency resonant (including Ferro-\nresonant) on the VHV underground distribution system.\n2. Faults on the main transformers, VHV underground cables and their\naccessories.\n3. Operation and maintenance defects on the VHV underground\ndistribution system with loop structure.\nPART II-1: Customer Related Problems:（8～13週）\n1. Hidden risks due to change of feeding voltage.\n2. Review and midterm\n3. System grounding problems on the customer main transformer.\n4. Boundary fitting problems between customer substations and VHV\nunderground cable.\n5. Quality and surge damages problems on the resin cast transformers.\n6. Malfunction on the electronic types of protection relies.\nPART II—2: Customer Related Problems:（14～18週）\n1. Backup power system related problems.\n2. UPS system related problems.\n3. DC power supply systems related problems.\n4. EMI problems due to earth leakage stray current and induction\ncurrent on the grounding system and distribution system.\n5. Final Examination\n","scorePolicy":".評量方式：期中考佔30%，期末考佔30%，學習報告/作業佔20％，平常表現（含出席率）佔20%。","materials":"本課程以課堂講解為主，輔以資料補充，重點為：1.科技產業電力事故議題之本質探討及實務問題點之解說以建立學生基觀念。2.理論分析、數學推導及模型之建立。 3. 科技產業電力事故診斷及分析方法，並能判讀系統特性及相關參數影響評估，導引出診斷方法及防治方法。4. 實際案例探討及演練。主要參考教材為：\n1. Lecture Materials, prepared by C.J. Chou ,2006 （教師自編教材）\n2. Analysis of Faulted Power system, P. M. Anderson, Iowa State   University Press/Ames","foreignLanguageTextbooks":false}]
