[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2007-10-08 10:41:30","objective":"英語教學實作課程，將課本上的英語教學法應用至實際的教學狀況中。兩學分的課程，提供學生將理論應用至實際的教學情境中。主旨在於利用英語教學實務，讓學生應用教學法，改善教學的方法技巧及加強教學領域…等。課程中由老師或合作學校及教室的指導老師從旁評估分析。在此課程中，學生還會與指導教授及在場的指導老師定期的討論以期能達到評估教學的目的。學生在這一學期中，最少需教學24個小時。學生在本課程結束完成後，學生們將會獲得由合作學校所頒發的教學實習證明。\nCourse Title:　　　　English Teaching Practicum\nCredit Hours:　　　　2\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nOffice: 　　        General Education Building Rm.805-1 / Extension:3941\nTerm Offered:　　　　Fall, 2007\nRequired Text:　　Teachers’ Manual for Happy English Village\nStudent Activity Book for Happy English Village by Dr. Yun-Hua Yang &amp; Dr. I-Chien Chen\nCourse Description: 　　The course offers unpaid internship for students enrolled in English Teaching Practicum, and will last 18 weeks. The course also aims to prepare quality English teachers. Student intern teachers are obligated to assist English teaching as assigned in the affiliated institutes. The current practicum, as part of the teaching development curriculum, provides the opportunity for students to employ theories to classroom practice. Student are also required to abide by the conditions drawn in the cooperative agreement signed by the Department of the current affiliated institute(s).\nCourse Requirements:  To ensure the stability of teaching personnel, students enrolled in the class are required to make a full commitment to the partner institute. Thus the following requirements:\n(1)　　Student interns, once past the deadline for course adding and dropping (Sep.28), forfeit the right to withdraw the course during the semester. The university’s midterm withdrawal policy does not apply to this course. Enquiry for course withdrawal will be denied.\n(2)　　Student intern teachers have to arrive class on time: attendance record will be kept by the partner school coordinator(s) and the current instructor.\n(3)　　Student intern teachers are required to work as an assistant to the partner school teachers.\n(4)　　Student intern teachers will devise teaching plans, develop materials, and implement teaching in the partner school classrooms as assigned.  All teaching plans and activities will be based on the curriculum guide developed for the partner school. (*1)\n(5)　　At the semester end, each student teacher needs to compile the teaching plans, materials and assessment as a portfolio.\n(6)　　Classes will be assigned to student teachers. Any change of classes will need to be approved by the partner school coordinator(s) and the instructor.\n(7)　　Student intern teachers are required to teach 24 hours in one semester, excluding the teaching preparation hours. (*2)\n(8)　　In Fall Semester, 2007, student intern teachers will be working at Happy English Village, located in Taoyuan County. (*3)\n(9)　　Student teachers will not receive compensation for teaching. Transportation is also not covered. (*4)\n(10)　　The Fall 2007 practicum will be administered during the weekend. Student internship classes will be arranged on Saturday from 9:40 a.m. to 4:30 p.m.\n(11)　　Student intern teachers will be certified by Department of English and Happy English Village at the end of the internship.\n(12)　　Student intern teachers will be considered scholarship opportunities based on their teaching performance.\nEvaluation:　　　　　　(1) Student intern assessment will be conducted on the collaboration of\nthe partner school supervisors, coordinator(s) and the faculty moderator (the course instructor).\n(2) All site evaluation will adopt the qualitative assessment method. Final grades will be given by the faculty moderator (the course instructor).\n(3) Student interns will need to submit midterm and final teaching reports to the instructor. Format and details for the report will be provided at a later time.\n","schedule":"Wk1 Orientation\nWk2 Syllabus Design and Outing\nWk3--Wk17 Internship Work\nWk18--Teaching Portfolio Submission / Final Appraisal","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
