[{"name":"許震毅","email":"evanhsu2004@yahoo.com.tw","latestUpdate":"2007-11-12 09:47:47","objective":"近年來，在科技高度發展與商業尖銳競爭化的多元社會裡，科技與法律的糾紛、工程災害與自然災害對社會造成重大的危害，成為共同的熱門議題。科技工程師對企業發展與社會責任益形重要，科技工程師的道德良知在職場也遭受各種試探與挑戰，如何發揮科技工程師的專業素養，堅持良好的品格操守，造福企業與社會人群是當前迫不及待的課題。科技工程師若只學習專業技能，提昇實驗與研發科技，而忽視培育人文倫理與心靈的涵養，將自限個人於科技工程專業的範圍，無法跨越工程界、製造界或實驗室的領域，在多元化的社會裡，難以成為跨越專業的經理人，或成功的獨自創業者，或多角事業的經營者。本課程的目的要協助大專學生，在學期間促進自我成長與突破，樹立全人全方位的養成教育，提升日後對社會國家的實質貢獻。本課程的目標：\n1. 使同學認識科技工程與法律對個人與社會的影響層面。\n2. 使同學瞭解工程倫理規範的內容、意義及實際的應用。\n3. 幫助同學結合科技工程的應用與人文倫理涵養的能力。\n4. 培養同學面對工程科技倫理難題時的抉擇與處理能力。\n5. 增進同學個案的分析、角色的定位、人際溝通的能力。\n6. 幫助同學體會團隊合作的精神，培育優秀領導的能力。\n7. 提升同學的專業素養，擬定生涯規劃，促進全人教育。\n本課程先從學理上探討科技工程與社會法律和人文倫理的關連，鼓勵同學廣泛閱讀相關書籍與報刊，多方面吸收新知識，進而對各種不同的情境與個案，提出客觀的分析與評價，並建立主觀上認知與抉擇。課程上針對一些特別專業的主題，也可能邀請校外學有專精且有實務應用的賢達人士現身說法，提供知識與實際經驗的交流。課堂上除了知識的講授，強調師生之間的討論，也成立專題學習小組，以兩三人為一個專題學習小組，促進同學之間的相互學習，發揮團隊合作的精神。專題報告要選擇實用的科技應用與倫理議題，除學術討論外，力求實務化與生活化，盼望藉著各組同學的專題報告，提昇同學的溝通表達的能力和研究評析的能力，以及判斷抉擇的能力。","schedule":"週次  　　日期　　課程內容　　教師或特別講員\n1　　9/20　　科技工程倫理簡介、議題、分組、彼此認識 許震毅\n2　　9/27　　世界各國專業工程師的倫理守則與解讀 　　  許震毅\n3　　10/4　　工程倫理面面觀與專業工程師的社會責任   許震毅\n4　　10/11　　智慧財產權與工程理賠 　　           許震毅\n5　　10/18　　專題報告、個案研究分享、核能電廠　　  許震毅、同學\n6　　10/25　　專題報告、專業工程師與企業雇主的關係   許震毅、同學\n7　　11/1　　職場倫理與個人品格、個案研究分享 　　  許震毅、同學\n8　　11/8　　專題報告、個案研究分享　　           許震毅、同學\n9　　11/15　　個案研究分享，專題報告　　           許震毅、同學\n10　　11/22　　公共衛生與倫理、專題報告　　           許震毅、同學\n11　　11/29　　專題報告、個案研究分享　　           許震毅、同學\n12　　12/6　　從聖經看環保工程與倫理　　           許震毅、同學\n13　　12/13　　夢幻工程團隊精神與角色配搭互動　　  許震毅、同學\n14　　12/20　　科技工程師邁向主管的成長突破途徑　　  許震毅、同學\n15　　12/27　　期中考專題論文預備　　                     同學、許震毅\n16　　1/3　　期末考專題論文預備　　                     同學、許震毅\n17　　1/10　　專題論文發表與討論、生涯規畫與工程倫理 同學、許震毅\n18　　1/17　　專題論文發表與討論、總結　　            同學、許震毅\n","scorePolicy":"課堂出席率與互動學習的精神              20%\n小組個案研究與課堂報告分享              40%\n期末專題論文與課堂報告分享              40%\n","materials":"現今科技界備受爭議的議題與考量Current Issues and Concerns in Modern-day Technological Applications\n工程教育與倫理：\n工程教育品質合格證ISO in national engineering education quality assurance\nAn understanding of professional and ethical responsibility，character development\nAn effective communication of project leader in building engineering teamwork\nA full recognition of the need and practical engagement for life-long learning\n國際重大工程事故：\nChallenger disaster of the NASA，Exxon oil spill and environmental pollution\n工程保險理賠，921大地震災區工程品質調查報告\n基因工程與醫學倫理：\n絕症患者手術的醫療糾紛，生命的複製與基因生物工程幹細胞的爭議\n基因生物工程與胚胎的爭議，代理孕母的法律與倫理問題，安樂死的問題\n工程產品、環境與健康：\nDow Corning Breast Implant Trail，Union Carbide的毒氣外洩災害，福特小馬車禍\n公共衛生與工廠排出的化學廢物處理，砂輪製造工廠如何防範員工的工業病\n台灣發展核能電廠的利弊得失，台灣發展六輕裂油場對環境的衝擊評估\n科技工程與法律常識：\n解決科技工程糾紛與爭議的法律常識，營建工程品質維護與工程師職責\n了解工程保險理賠與相關的業務，專業工程師應具備的基本法律常識\n智慧財產權，BOT工程的相對職責與有效管理(高鐵工程、巨蛋工程)\n科技工程師的生涯規劃：\n專業工程師的十誡與成功的要害，專業工程師邁向一級主管之途徑\n專業工程師邁向企業僱主之途徑，從台電工程師成為令人敬佩的領導人\n從電子工程師成為電子工業創業的先驅，從機械工程師成為集團企業創辦人\n從營造業的板模工到集團企業的總裁，從小秘書升任美商知名企業的總經理\n工程災害與預防：\n汐止林肯大郡擋土牆斷裂事，台北東興大樓於九二一大地震倒塌事件，\n高屏橋斷裂事件，美國價值航空的空難事件，華航的機件維修與飛機事故\n工程團隊的組成：\n如何組織一個天才團隊，如何建立一個高效率能完成使命的工程團隊\n曼哈頓計畫Manhattan Project/原子彈小組/新墨西哥州洛沙拉摩斯Los Alamos\n臭鼬工廠Skunk Works的F-117夜鷹隱形飛機/Lockheed Martin Co.\n全錄公司的帕洛奧圖研究中心與蘋果電腦的研發團隊\n世界首座大船(創世紀挪亞方舟)的建造，初世紀翻轉世界的使徒宣教團隊\n參考書籍：\n「Engineering Ethics」（工程倫理）Charles B. Fleddermann著，張一岑 許宏德譯，台北：全華科技圖書公司出版，2002年。\n中華民國通識教育學會&lt;通識教育季刊&gt;，第三卷第二期，新竹：清華大學1996。\n聖經the Bible，中文合和譯本或新國際版(NIV)，台北：國際聖經學會。\n\n『工程倫理』學生個案研究小組分配表\n授課老師：許震毅\n時間：每週四上午10:10~12:00\n\n個案研究題目  　　個案研究小組組員名字　　日期\n北縣汐止林肯大郡颱風擋土牆斷裂事件　　林威宏、莊承穎　　10/18\n代理孕母與安樂死的科技、法律與倫理　　楊衍鴻/周士平/張巽昕　　10/18\n曼哈頓計畫/原子彈研究發展的團隊精神　　劉洋域　　10/18\n基因生物工程與複製人的倫理道德爭議　　郭至軒/陳豪麟/王毓麟　　10/25\n專業工程師邁向主管與企業雇主之途徑　　蔡坤龍/張智凱/謝宏宜　　10/25\nBOT工程的相對職責與有效的經營管理　　　　10/25\n從挪亞建造方舟探討現今的工程倫理 　　　　11/1\n　　　　\n鴻海企業集團發展策略與專利法律事務　　林宗凱/林忠誠/蕭承佑　　11/1\n公共衛生與化學工廠廢物排放處理 　　陳賜豪/蕭萌鏵/陳振華　　11/8\nUnion Carbide聯合碳化印度毒氣外洩事 　　　　11/8\n了解工程保險理賠與相關業務 　　郭育誠、陳建銘　　11/8\nNASA太空船挑戰者號爆炸事件調查 　　邱健銘/張嘉琪/王哲輝　　11/15\n蘋果電腦研發團隊 　　蘇東柏、黃文正　　11/15\n台灣發展核能電廠的利弊得失 　　許湘婷、林宜君　　11/15\n臭鼬廠F-117夜鷹隱形飛機的研發團隊 　　趙子超/彭一文/陳立和　　11/22\n智慧財產權與企業經營管理之道　　林良達、黃進松　　11/22\n台北東興大樓於九二一大地震倒塌事件 　　林紹洲/吳岳青/高嘉祿　　11/22\n台灣發展六輕裂油場對環境的衝擊 　　李竣穎、方偉德　　11/29\n從台電的建廠工程師成為全國行政首長　　　　11/29\n從美國德儀的工程師成為台灣晶圓教父　　　　11/29\n電子工程師開創企業並培育企業經營者　　傅義翔、王瑞榮　　12/6\n從亞當在伊甸園的失職看工程師的守則　　黃啟輔/呂思鍏/許凱傑　　12/6\n從小秘書升任台灣IBM總經理的童至祥　　　　12/6\n由模板工成為建築與集團總裁的趙藤雄　　　　12/13\n從機械工程師創辦奇美集團的許文龍　　　　12/13\n全錄Xerox公司的帕洛奧圖研究中心　　　　12/20\nExxon oil spill and environmental pollution 　　林豫馗、陶終孝　　12/20\nGoogle公司研發與人才管理　　吳建興、柯忠成　　1/10\n網路虛擬物品與金錢交易衍生的問題　　龔俊豪　　1/17\n\n","foreignLanguageTextbooks":false}]
