[{"name":"王清祿","email":"chinglu1831@gmail.com","latestUpdate":"2007-12-04 22:52:20","objective":"本課程設計重點有三：(1)藉由精選的中級程度教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)透過練習加強聽、說、讀、寫的知能及表達。\nCourse Title: English\nInstructor: Wang Ching-lu\nCourse Description:\nI. Introduction: Focus on Reading Skills\nThe major objective of this course is to equip students with intermediate or higher reading skills essential for college students in focus on: (1) speed reading in large quantity and (2) in-depth and critical reading.  Other skill areas such as grammar, sentence structures, and writing are also taught through reading acativities.\nII. Teaching Materials\nAside from required textbook readings, handouts will be given as supporting if textbooks are insufficient to meet the needs of studnets and the course.  Included in the handouts could be: (1) my lectures on essential English grammar and reading skills;  (2)) essays on technology and humanity;  (3) prose or literature about loife, humor, encouragement, art, etc.;  (4) articles about survival skills for college students in academic life such as study and note-taking methods.  The selection of reading materials is based on the criteria: inspirational, original, informative, enteraining, and practical.  In order to continue students' feel for English during the winter break, they are required to read assigned texts from handouts and the textbook.\nAnother aim of this course is to engage students in various outside English-learning programs made available by the English Department of the NTUT.  Among them are English Corner, Learning English through Film, and Learning English through Newspaper, to name but a few.  Since these programs provide diverse learner-oriented activities that enhannce studnets' English ability, if necessary, some of these programs will go into this course.\nIII.  Conclusion: the Purposes\nOn the whole, this course is designed specifically for the majority of NTUT science-based jamors in ways that help them (1) enhance language acquisition,  (2) form good reading and English-learning habits, (3) develop students' interest in English, and  (4) promote humanity and technology literacy.\n\n＊ ＊ ＊ ＊ ＊ ＊ ＊\n\n課程名稱：英文 \n授課教師：王清祿 \n課程簡介：\n\n壹、前言：主攻閱讀能力\n本英文課定位在中級或以上的大學閱讀。由於每週僅有兩小時，非常珍貴，所以不同於高中教學，以大學需求為考量，同時顧及本校學生的程度、特性、及學習狀況。\n\n貳、教學策略與教材 \n一、閱讀為主－－強調（1）大量閱讀。（2）快速閱讀與理解、深度與批判。區隔其他課程，如會話、聽力。透過閱讀訓練學習語法、結構與作文技巧。\n二、輔助教材－－若教科書無法滿足學生和本課程的需求，則不定時加發講義：（1）語言學習類：本人撰寫的英文學習專題，如文法綱要、閱讀方法等。（2）科技類：熱門科技議題與未來趨勢的。（3）人文類：勵志、人生、文學、幽默、藝術等。（4）應用類：有關大學生的讀書技巧，如學習方法、如何做筆記等。以上四大類視學生學習情\n況做調整。\n三、培養興趣－－鼓勵同學利用本校提供的周邊學習管道，如《英語角落》、《看電影學英文》、或《新聞英語》等。如有必要，挑選一部份納入本課程。\n四、寒假作業－－閱讀課本與講義，延續英語學習熱忱與習慣。\n\n參、結語：四大目標 \n本課程針對本校主修科技的學生，透過教學材料的啟發性、創意、知識性、實用性、以及娛樂性，（1）提升同學英語文能力、（2）誘發英語學習興趣、（3）培養健康的英文學習觀念與方法、（4）進而提升人文與科技素養。 ■\n\n＊ ＊ ＊ ＊ ＊ ＊ ＊\n\n","schedule":"Week/Date\n3/10.1. Classes begin.\nTextbook: RRW 1(Reading for the Real World 1)\nHandouts:\n~ ”Creativity” (reading comprehension test)\n~ ”Culture Shock” (cloze test)\n4/10.8.\n~ ”Creativity” (continued)\n~A Brief Indroduction to Reading Skills\n~ RRW 1: pages, 6-8, 12, 14-17.\n5/10.15.\nRRW 1: pages, 6-8, 12, 14-17.\nWriting: Summarize in English ONE of the following articles in no more than 50 words (including punctuation marks): ”Unlucky Number 13” (p. 12) and ”Bigfoot” (p. 14-16)\n6/10.22.\n~ RRW: pages: 30-33, 36, 38-42, 44.\n~ ”Searching for the soul in the machine”\n~ ”How to Read Faster” by Bill Cosby (reading comprehension test)\n7/10.29.\n~ Screening of the film ”Just Visiting” (Learning English through Film)\n~ RRW 1: pages, 46-50, 52, 54-56, 60.\n8/11.5.\n~ RRW 1: pages, 62-66, 68, 70-74, 76.\n~ Discussing ”Just Visiting”\n9/11.12.\n~ English Composition:\n(1) Summarizing Adgar Allan Poe's short story ”The Masque of the Red Death”\n(2) Writing in response to ”Just Visiting”\n(3) Summarizing ”Just Visiting”\n10/11.19.\n~ RRW 1: pages, 78-82, 64, 86-90, 92, 94-98.\n~ ”Searching for the soul in the machine”\n11/11.26.\n~ ”Searching for the soul  in the machine” (continued)\n~ ”Lessons to be learned from society of robots”\n12/12.3.\n~ RRW 1: pages, 98, 100, 102-6, 108.\n13/12.10.\n~ RRW 1: pages, 110-2, 116, 118-120, 124.\n14/12.17.\nRRW 1: pages, 126-8, 132, 134-6, 140.\n15/12.24.\n~ RRW 1: pages, 142-4, 148, 150-2, 156.\n16/12.31.\n~ RRW 1: pages, 158-60, 164, 166-8, 172.\n17/2007.1.7.\nFinal Exam\n","scorePolicy":"Final Exam: 40%\nMid-Term Exam:20%\nQuizzes and Assignments:20%\nAttendance and Participation: 20%\n","materials":"~ ”A Brief Outline English Grammar” by Wang Ching-lu\n~ ”Reading Skills” by Wang Ching-lu\n~ ”How to Prepare for Reading” by Wang Ching-lu\n~ ”Scientists work to create nanogenerator”  from http://www.physorg.com/news104084433.html\n~ ”Google bans essay writing adverts” by Sean Coughlan, BBC News education reporter, 2007/05/22. BBC NEWS: http://news.bbc.co.uk/\n~ ”Net reaches out to final frontier” from BBC NEWS:http://news.bbc.co.uk/\nAssignments for the Winter break:\n~ Reading for the Real World 2 (Textbook for the next semester)\nRaeadings:\n~ ”Geneticists explore the next frontier: human genotypes” by Sydney Brenner\n~ ”Brave New World in Genetics” by Lee M. Silver.\n~ ”SQ3R” (from College Reading Book 1)\n~ ”The Making of a Father”\n","foreignLanguageTextbooks":false}]
