[{"name":"陳建文","email":"a868@ntut.edu.tw","latestUpdate":"2007-11-16 00:15:38","objective":"面對日益複雜的社會現象與社會組織，生活規範已由傳統的道德習俗，逐漸代之以法律倫理，生活在現代化的社會，有必要從認知法理、遵守法律，進而要求落實法治。俾政府施政依法而治，社會倫理得以重建，個人權益亦獲得確實的保障。本課程兼顧理論與實例的探討，包括法律的理念與概念、法律與社會生活各層面的關聯性、現行法體制的基本認識、法治生活的檢視與展望。","schedule":"取消開課\n第1周  課程概介及上課方式說明\n第2周  當愛已成往事！--男女交往情感紛爭的法律問題\n探討男女交往在法、理、情等層面所引發的相關問題，所介紹的法律規\n定及觀念，包括性騷擾、妨礙性自主、妨礙自由、妨礙名譽等規定。\n第3周  無殼蝸牛的夢靨！--租屋紛爭處理\n房屋租賃是大學生常有的法律行為經驗。租屋除了房屋的使用權限外，\n還涉及跟房屋所有人房東間的人際互動問題。本子題探討實務上常見的\n租屋糾紛包括，屋主不退還押租金、不修繕房屋設備、任意提高房租、\n擅入房間..等等，針對房屋租賃之相關法律規定進行介紹，並講解如何\n與房東應對，才能減少糾紛。\n第4周  爆料所引起的人際紛爭\n由於媒體談話性節目及政治人物惡意攻詰起不良示範作用，逞口舌之\n快、揭人隱私的爆料文化日益盛行。更有甚者，乃網路、電子郵件等通\n訊設施的便利，大大的助長了爆料對於他人人格、信譽的殺傷力，以將\n其個人隱私在網路上散佈作為要脅手段之不當行為，亦時有所聞。爆料\n固然具有揭發不法的正面作用，但是如果沒有正確的觀念，爆料不僅會\n引起人際糾紛、傷害別人人格、信譽，同時也會讓整個社會的信任關係\n動搖。因此，課程子題4擬就爆料所引起的人際糾紛問題進行探討，讓\n學生了解毀謗及言論自由在法律界線，並學習如何公正客觀的評論別人\n事務或舉發不法。\n第5周  花錢買罪受？--消費紛爭處理\n日常生活的食衣住行育樂無不充滿消費行為。花錢消費原本是一種享\n受，然而如果花錢買來的服務出了問題，那就變成受罪。沒有人希望花\n錢買罪受，所以要學會如何妥適的處理消費糾紛。一般消費糾紛如洗\n衣、飲食、購物的服務品質不良，因其所涉金額不大，如一狀告上法院\n爭訟，一來不敷成本，二來緩不濟急，比較理想的處理方式是直接與廠\n商溝通與協商爭取權益。本課程將介紹這些處理小額消費糾紛的溝通與\n協商技巧，同時講解消費者保護法相關規定，包括消費者保護官及集體\n訴訟等保護機制的運用。\n第6周  購屋糾紛處理\n不動產買賣牽涉金額龐大。購屋常常是受薪階級一生最大筆的消費行\n為。然不動產交易過程複雜，建商利用複雜的建築技術法規或是華麗不\n實的廣告宣傳促銷，導致實務上購屋糾紛頗多。本課程子題將針對購屋\n包括新屋、預售屋、中古屋的相關法律爭議進行介紹，期能讓學生了解\n如何選擇購屋標的，留意付款、交接及瑕疵擔保等細節，減少購屋糾紛\n的發生。\n第7周 車禍紛爭處理\n以汽機車代步已成現代社會不可避免的現象。汽機車帶來行的便利與快\n速，也產生車禍造成傷害或死亡的風險。車禍糾紛涉及民法侵權行為、\n汽機車強制責任保險以及勞工保險及全民健康保等相關法律。而發生車\n禍時實務上亦常見賠償金額談不定，提起刑事官司相逼的做法。課程子\n題7，將針對這些車禍糾紛所涉及的法律問題進行講解，並透過實際案例\n解說理賠協商的技巧。\n第8周 家醜不可外揚？--家庭糾紛處理\n「我的家庭真可愛，整潔美滿又安康，兄弟姊妹很友愛，父母都慈\n詳。…」，著名兒歌「我的家庭」的歌詞，訴說著我們對家庭生活的期\n待及理想想像。然而，隨著社會變遷，家庭暴力跟離婚這兩個悖離理想\n家庭生活期待的現象，卻有增無減，令人擔憂。課程子題8：家醜不可外\n揚？--家庭糾紛處理，除了強調健全家庭之重要性，鼓勵維持良好和諧\n之家庭生活外，將教導學生對於家庭暴力跟離婚等家庭糾紛問題，不該\n再報守「家醜不可外揚」的傳統觀念，而應該積極正視，妥善利用家庭\n暴力防治法人身保護令措施、民法夫妻財產制、離婚、監護及贍養費等\n規定，來處理家庭糾紛。\n第9周 英雄所見略同！？--智慧財產權糾紛處理\n隨著科技進步，智慧財產權的觀念日受重視。然而，文章被抄襲、努力\n研發成果被別人捷足先登的智慧財產權糾紛卻也不斷。如何避免或妥適\n處理已發生的智慧財產權糾紛，儼然成為科技時代的重要課題。課程\n子題9：英雄所見略同！？--智慧財產權紛糾處理，將講授智慧財產權包\n括專利權、商標權及著作權的基本法律概念，以及專利發明之申請實\n務、發現屬於自己所有之智慧財產權受侵害時可以採取之法律措施以及\n侵害智慧財產權的賠償問題。\n第10周 與政府的紛爭處理--行政救濟\n民主時代，政府必須依法行政，與政府的糾紛處理，例如不服交通罰單\n或是稅捐稽徵機關的稅款核定，都可以依法律透過行政救濟的程序處\n理。課程子題10：與政府的紛爭處理（一）--行政救濟，講授重點擺在\n行政法律關係的架構及行\n\n課程子題11：國家賠償\n我國憲法第二十四條規定：「凡公務員違法侵害人民之自由或權利者，除依法律受懲戒外，應負刑事及民事責任。被害人民就其所受損害，並得依法律向國家請求賠償。」，隨著民國六十九年七月二日國家賠償法公布，人民如因依法令從事於公務之人員於執行職務行使公權力時之故意或過失，或是公務員怠於執行職務，公有公共設施因設置或管理有欠缺，致人民自由、權利或生命、身體、財產遭","scorePolicy":"1.平時課堂討論及口頭報告表現  40%\n2.期末書面報告  60%","materials":"　","foreignLanguageTextbooks":false}]
