[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2014-09-18 15:48:23","objective":"本課程旨在幫助學生經由閱讀與討論以了解全球共同面對的課題，包括：全球化的趨勢、文化衝突與恐怖主義、全球貧富差距、環境保護問題、基因工程所衍生的倫理道德問題等等。\nCourse Title:　　　　Global Issues and Events : Reading and Discussion \nCredit Hours:　　　　2 \nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw \nTerm Offered:　　　　Fall, 2014\nScheduled Class Hours: Wednesday 08:10—10:00 \nOffice Hours:      By appointment \nRequired Texts:   1) Official Reports prepared and issued by the United Nations\n                2) World news updates (mainly the Economist) \n              \nCourse Description: This course aims to engage students in understanding current issues and events taking place in the world that are redefining our global reality and restructuring the world order. A greater goal of such studies of global issues and activities is to urge students to participate in the dialogues and actions to change and to make better of the world.  Given the physical constraints of the current course offered, it is of the pivot that the course content centers on reading, discussing and debating on selected reports and news to uphold all that matters for the aforementioned pursuits. The selection of materials / events to be discussed in class shall be the least representation of attitudes, ideologies, or beliefs towards the issues / people in question. The course instructor and student presenters shall bear in mind to give the unbiased read and introduction to integrate all likely angles to the magnitude of the issues.  \nCourse Objectives:  This course aims to:\n(1)　　Develop critical reading and thinking capacity through guided, reflective and analytical \nstudies of news events \n(2)　　Evaluate information, ideas and opinions in order to critique constructively \n(3)　　Acquire essential vocabulary and discourse to understand and discuss history and background toward major world events and conflicts","schedule":"# Schedule for weekly reports and discussions will be arranged as the class proceeds. \n\nCourse Requirements:\n(1)　　It is recommended that students take class notes for further review and discussion. The use of any form of recording device and/or photographing is strictly prohibited. \n(2)　　Students will form pairs on the first day of class and be responsible for in-class presentations as assigned. \n(3)　　Each week, two groups of students (2-3 in each) will be responsible for briefing on Politics this week and Business this week, available for downloading when registered as a member at the official site of the Economist. Briefing notes shall be provided in details, including the event background and expanded vocabulary learning.\n(4)　　Report cycle: Students are also required to select one of the most pressing concerns facing the world as a topic for reports and in-class presentation, following a group written analysis / report submitted a week prior to the presentation. An individual revised and expanded paper (3 pages w/ 1,000 words at least) shall be submitted TWO weeks later. Failure of completing the report cycle will result in the loss of the 30% of the semester grade, plus a 10% penalty (deducted from the final semester grade). More details about the report:   \ni.　　Detailed notes of handouts for distribution in class need to incorporate all necessary details, including backgrounds, arguments, discussions and studies reviewed in the text. English-Chinese bilingual handouts are allowed. \nii.　　The hard-copy notes shall be submitted to the class instructor a week prior to the presentation session. Such notes shall also be made available to the class in any form at the best convenience. \n(5)　　Each student will be given abundant opportunities to provide his/ her response toward the assigned reading content as class proceed. Students will only be considered to award the 10% in-class discussions with at least three feedbacks and responses made in class. Students must complete all readings assigned prior to the class session. \n(6)　　Attendance: Students are required to attend the class as scheduled. \ni.　　Each unexcused absence will result in 10% semester grade deduction. \nii.　　At the sole discretion of the instructor, some absence penalties may be waived with valid proof and just cause. Penalty waiver request will only be accepted within two weeks after the date of absence. Students forfeit the right of contention after that. It is important to know that usually only ONE- time penalty waiver will be considered.  \niii.　　Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each occasion of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.","scorePolicy":"Evaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, handouts, written report(s), in-class exams, and attendance. Please be advised that class notes, covering all lectures and discussions, shall be respectively submitted in the week prior to the midterm (TBD) and final exam. The failure will result in a 20% grade deduction of the exam. \n(1)　　Attendance 30% \n(2)　　Reports: oral and written 30%\n(3)　　Midterm &amp; Final Exams 30%\n(4)　　Class notes and in-class discussions 10%","materials":"Required Texts:   　　1) Global Risks Report 2014 by the World Economic Forum                 2) World news updates (mainly the Economist)","foreignLanguageTextbooks":false}]
