[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2014-09-19 14:55:30","objective":"Fairies, Myths, and Monsters: the Fantastic in Literature from Beowulf to Harry Potter\n\nWhen studying literary history, students are generally exposed to a limited number of works from various periods. Professors hope to show students the most significant changes in literature and the themes, issues, and genres of literature that people found most appealing in different time periods. Today, fantasy literature is a part of popular culture, but, surprisingly, much of the canonical literature that we read is actually fantastic—it contains elements of the supernatural and it uses those elements for specific purposes.   \n\nIn this course, we will address one main question: Is there such a thing as the fantastic genre? Authors consistently have used fantastic elements within poetry, song, and prose fiction. The imagination and the speculative have been a key part of philosophy, official histories, and theology. Not until the 20th century, however, has there been a “fantasy” section in the bookstore. In this course, we will take a historical approach, examining how and why the fantastic has been used in Western (and predominately British) literature. We will look at some early examples of the fantastic (such as Beowulf), examine the flowering of the fantastic during the 19th century, and explore how authors’ have used the fantastic in twentieth and twenty-first century literature.","schedule":"Students usually have an assigned reading most weeks (unless we are going to be reading a work aloud in class, as we sometimes do). Students will write two papers and make one presentation. \n\nTEXTS\nTexts will include Beowulf, A Midsummer Night’s Dream, Frankenstein, The Princess and the Goblin, The Rose and the Ring, The Voyage of the Dawn Treader, The Fellowship of the Ring, Harry Potter and the Philosopher’s Stone, and Dracula OR The Hobbit (In weeks 13–16, you will choose either Dracula or The Hobbit to read and will come to either the first or second half of our assigned period, when we will discuss that book.) \n\n\nSections of theoretical works on the fantastic by writers and critics including Plato, Philip Sidney, Samuel Taylor Coleridge, J.R.R. Tolkien, Tvetzan Todorov, Rosemary Jackson, and Kathryn Hume.","scorePolicy":"ASSESSMENT\n\nStudents will be assessed in four main areas: (1) the quality of their participation in class discussions, (2) their responses on in-class writing, quizzes, and reflections (3) their presentation on a particular article about literary fantasy, (4) their two papers.","materials":"We will attend a performance of Shakespeare's A Midsummer Night's Dream at the National Theater in October. I have already reserved tickets for eight students. If the number of students is higher, we can check to see if tickets will still be available.","foreignLanguageTextbooks":false}]
