[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2014-08-29 22:14:15","objective":"本課程重點在於台灣專利法的主要法律議題，包括產業利用性、新穎性、進步性、可實施性、說明書支持性、請求項不明確性、請求項解釋、侵權行為、救濟手段、專利授權、強制授權、專利訴訟之展開和舉發。本課程教材包括專利法教科書、智慧局頒發的專利審查基準和智慧財產法院裁判。","schedule":"Week 1-9/14-專利制度101 \n\nWeek 2-9/23-停課\n\nWeek 3-9/30-研究工具介紹：Westlaw、司法院法學資料庫、立法院資料庫等等。\n\nWeek 4-10/7-發明人、申請人、與專利申請權歸屬：智慧財產法院民事判決101年度民專上更(二)字第5號（標的物）；Mayo Collaborative Servs. v. Prometheus Labs., Inc., 132 S. Ct. 1289 (2012) (law of nature).\n\nWeek 5-10/14-顏吉承科長：專利要件與先占之法理\n\nWeek 6-10/21-發明人、申請人、與專利申請權歸屬：智慧財產法院民事判決98年度民專訴字第153號（職務上發明）；林希彥，「有關我國專利權歸屬爭執案件之判決研析」，智慧財產權月刊，第144期，2010，頁5-26。\n\nWeek 7-10/28-顏吉承科長：修正及更正審查\n\nWeek 8-11/4-發明人、申請人、與專利申請權歸屬：智慧財產法院民事判決102年度民專上字第18號（專利申請權）；最高法院民事裁定93年度台抗字第563號；最高法院民事裁定94年度台抗字第177號；最高法院民事裁定95年度台抗字第58號（外籍權利人）。\n\nWeek 9-11/11-顏吉承科長：新型專利審查及專利權範圍\n\nWeek 10-11/18-新穎性與優先權：行政法院判決89年度判字第1358號；臺北高等行政法院判決95年度訴字第1384號、最高行政法院判決93年度判字第22號；陳秉訓，「多此一舉？評2010年8月專利法第二十七條和第二十八條修正案」，新新季刊，第38卷第4期，2010，169-180頁；智慧財產法院民事判決98年度民專上字第14號（擬制新穎性）。\n\nWeek 11-11/25-顏吉承科長：解釋申請專利範圍之依據及基礎\n\nWeek 12-12/2-進步性：智慧財產法院行政判決100年度行專訴字第52號；智慧財產法院民事判決97年度行專訴字第24號。\n\nWeek 12-12/2-可實施性與充分揭露原則：智慧財產法院行政判決97年度行專訴字第78號；台灣台北地方法院民事判決95年度智字第40號；智慧財產法院行政判決98年度行專訴字第121號；智慧財產法院民事判決102年度民專上字第35號（不明確之物與方法分不清）。\n\nWeek 13-12/9-可實施性與充分揭露原則：In re Wands, 858 F.2d 731 (Fed. Cir. 1988); Monsanto Co. v. Syngenta Seeds, Inc., 503 F.3d 1352 (Fed. Cir. 2007).\n\nWeek 14-12/23-期中考；新型專利：最高法院民事判決96年度台上字第2787號；智慧財產法院民事判決100年度民專上字第48號；智慧財產法院民事判決100年度民專上字第33號；陳秉訓，「新型專利權人之危機」，工業雜誌，4月號，2005，71-77頁。\n\nWeek 15-12/23-專利權與請求項解釋：最高法院民事判決100年度台上字第986號；智慧財產法院民事判決98年度民專上字第42號。\n\nWeek 15-12-23-專利權與請求項解釋：Markman v. Westview Instruments, Inc., 517 U.S. 370 (1996); Phillips v. AWH Corp., 363 F.3d 1207 (Fed. Cir. 2004); Phillips v. AWH Corp., 415 F.3d 1303 (Fed. Cir. 2005).\n\nWeek 16-12/30-專利權與權利限制：智慧財產法院民事判決98年度民專上更(二)字第2號；陳秉訓（2007年11月），「論專利權是排他權而非實施權—以最高法院民事判決88年度台上字第656號為中心」，中律會訊雜誌，第10卷，第2期，頁67-75。\n\nWeek 16-12/30-損害賠償：最高法院民事判決99年度台上字第2437號；智慧財產法院民事判決97年度民專上字第19號；陳秉訓（2012年5月），「2011年專利法修法後，你可能不用再怕專利權人！」，2012年中小企業經營管理研討會，佛光大學管理學系主辦，2012年5月11日，宜蘭縣；最高法院民事判決102年度台上字第1316號；智慧財產法院民事判決100年度民專上字第47號；智慧財產法院民事判決99年度民專訴字第215號。 \n\nWeek 17-1/6-Class Presentation\nWeek 18-1/13-Term paper due","scorePolicy":"原始分數：上課參與10％、期中考30％、期末口頭報告30％、和期末書面報告30％。","materials":"1. 無使用參考書。\n2. 期刊論文可從華藝資料庫和智慧局網站下載。\n3. 本學期開始進行課程大綱的調整，從原本只談台灣專利法到加入美國專利法。\n4. 歡迎對專利法有興趣的學生選修。我會盡力讓本課程能夠開成。","foreignLanguageTextbooks":false}]
