[{"name":"陳生明","email":"smchen@ntut.edu.tw","latestUpdate":"2014-11-25 12:46:47","objective":"課程兩個主要目標為光譜學方法及分離方法。光譜學方法內容含紫外、可見、紅光、核磁、x-ray等光譜法。電子譜及質譜也將被討論。分離方法方面有液層、氣層、膠層等層析法。分離後串聯之光譜分析也會學習。\nThis course is designed to provide graduate students an advanced, cohesive understanding of advanced instruments, analytical chemistry methods and instrumentation principles, theory to promote success in their graduate careers. Core concepts will be presented by both students and course instructor via lecture presentations, discussions and with real time experiments. The curriculum will be wide in scope incorporating aspects of trouble shooting, experimental result discussion, chemical measurements, modern analytical instrumentation, and determination of chemical structure via analytical techniques. Special emphasis will be put on the appropriate preparation, and meaningful presentation, of scientific results. The student is expected to dedicate significant effort both in and out of lectures to be successful.","schedule":"Corse Name: Advanced Instrumental Analysis\nCourse Code: 194123\nCredits: 03\nTime: Fall semester 2014\nInstructor: Prof: Shen-Ming Chen\n\n Course Description: This course is designed to provide graduate students an advanced, cohesive understanding of advanced instruments, analytical chemistry methods and instrumentation principles, theory to promote success in their graduate careers. Core concepts will be presented by both students and course instructor via lecture presentations, discussions and with real time experiments. The curriculum will be wide in scope incorporating aspects of trouble shooting, experimental result discussion, chemical measurements, modern analytical instrumentation, and determination of chemical structure via analytical techniques. Special emphasis will be put on the appropriate preparation, and meaningful presentation, of scientific results. The student is expected to dedicate significant effort both in and out of lectures to be successful.\n\nObjectives: \nSpecific goals for the course include the student learning:\n\n1) Proper interpretation of data (including results and theoretical comparisons)\n2) The characteristics and working mechanisms of common analytical tools\n3) The application of analytical methods to current scientific challenges\n4) To prepare and present data in an accurate and meaningful way\n\n\n Texts and Materials: Available in library and my lab, you can read at any time in my lab those who take this course.\n\nGrading: The primary metric for grades in this course will be the student’s ability to effectively communicate mastery of the goal areas outlined above. This will be assessed through group discussions, exams, class presentations, written reports, and class participation. \n\nThis course will use the +/- system of letter grades. Specific assessments are provided here:\nGroup discussions: --------------------15%\nExams (including final):-------------- 15%\nClass Presentations: -------------------15%\nWritten Reports:------------------------ 25%\nExperimental results:-------------------20%\nIn Class Participation:----------------- 10%\n                            ======\nTotal score                     100%\n\nSyllabus for the whole weeks for the fall semester 2014\n\nUnit-I:   Spectroscopy-I\n\nRaman spectroscopy - Raman scattering - stoke's and anti stokes lines - instrumentation - differences between IR and Raman spectroscopy - mutual exclusion principle - applications - structural diagnosis.\n\nUV- Visible spectroscopy - Absorbtion laws - calculations involving Beer - lambert's law - instrumentation - spectrophotometer - block diagrams with description of components - theory - factors governing absorbtion maximum and intensity\n\nInfrared spectroscopy - principle - types of stretching and bending vibrations - vibrational frequencies - instrumentation - block diagram - source - detector and recorders.\n\nNuclear Magnetic Resonance (NMR)  \nMagnetic and non magnetic nuclei, Larmor frequency, absorption of radio frequency. Instrumentation (FT-NMR). Sample preparation, chemical shift, anisotropic effect, spinspin coupling, coupling constant, applications to simple structural problems.\n\nUnit-II:   Spectroscopy-I\n\nMicrowave spectroscopy \nBasic concept, rotation spectra of simple inorganic compounds, Classification of molecules, rigid rotor model, effect of isotopic substitution on transition frequencies &amp; intensities non rigid rotor, stark effect nuclear and electron spin interaction and effect of external field. Applications of Micro wave Spectroscopy.  \n\nMass spectroscopy (MS) \nPrinciple, working of mass spectrometer (double beam). Formation of different types of ions, Mclafferty rearrangements, fragmentation of alkanes, alkyl aromatics, alcohols and ketones, simple applications, simple structural problems based on IR, UV , NMR and MS.\n\nElectron spin Resonance (ESR) \nPrinciples of ESR, hyperfine splitting in simple systems, Instrumentation, factors affe","scorePolicy":"Group discussions: --------------------15%\nExams (including final):-------------- 15%\nClass Presentations: -------------------15%\nWritten Reports:------------------------ 25%\nExperimental results:-------------------20%\nIn Class Participation:----------------- 10%","materials":"　","foreignLanguageTextbooks":false}]
