[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2014-06-16 12:45:00","objective":"本課程針對幼稚園、國小、與國中階段的英語師資而設計，在教材與教法的搭配上提供學理的引介與實務上的訓練。本課程設計考量這些階段學生之身心發展程度與興趣，將屬於兒童與青少年文學範疇的文本（例如：希臘神話、哈利波特系列、波西傑克森系列等等）作創意運用，幫助老師們擷取並改編合宜的教材，經由活潑的教學活動（包括：改編戲劇演出、繪本製作、歌唱舞蹈等等），提高學生的英語能力，也在培養他們體察文化差異的深層素養。","schedule":"Week 1: Introduction\nUnit One: How children's literature can help you teach phonics? 兒童文學在拼字發音教學之應用\nWeek Two: Phonics I\nWeek Three: Phonics II\nWeek Four: Phonics III\nWeek Five: Phonics IV\nUnit Two: How children's literature can help you build up students' full language skills? 兒童文學在培養學生全方位表達能力之應用\nWeek Six: Listening comprehension and oral articulations\nWeek Seven: Reading skills\nWeek Eight: Writing skills\nWeek Nine: Performing skills\nUnit Three: How children's literature can you adapt a story into drama script? 兒童文學如何改編成戲劇演出劇本\nWeek Ten: Reading the original work\nWeek Eleven: Discussions on the strategies of adaptation I\nWeek Twelve: Discussions on the strategies of adaptations II\nWeek Thirteen: Practicum of adaptation skills\n實作探索主題:改編兒童劇本的技巧~~以”巧克力工廠”為例\nStrategies of Script Adaptations for Children, with the Example of “Charlie and the Chocolate Factory”\nI.　　原著主題的掌握\nII.　　原著趣味的保留\nIII.　　考量學生的英語程度與演技潛力\nThe following examples, as shown in the script adaptation of “Charlie and the Chocolate Factory,” offer some suggestions.\n(1) 轉換較適合學生吸收與使用的字彙\n(2) 歌曲依學生熟悉的曲調修改\n(3) 布景數量,演出服裝與必需製作之道具作適度精簡\n(4) 控制全劇演出的時間\nUnit Four:  How Greek/Roman mythology can be used in English teaching?希臘羅馬神話在英語教學上的應用\nWeek fourteen: Stories for young children\nWeek fifteen: The Percy Jackson Series\nWeek sixteen: The Harry Potter series I\nWeek Seventeen: The Harry Potter series II\nWeek Eighteen: Final exam\n探索主題:希臘羅馬神話故事的深層結構\nThe Deep Structure of Roman/Greek Mythology in Social, Cultural, and Psychological Spheres\n1.象徵大自然力量的神力呼應人類社會權力結構\n2.象徵大自然力量的神力應人類文明的結構與分工\n3.眾神與人類英雄的偉大功績呼應人類種族的生存奮鬥\n4.眾神與人類英雄荒腔走調的行徑表現出人類心靈的暗影\n5.不知名的怪物奇獸與其不可思議的奇幻力量象徵人類文明所可能遭遇到的困境與挑戰","scorePolicy":"1. Attendance and participation in classroom discussions: 30%\n2. Presentations in the class: 20%\n2. Practicum of drama script adaptations: 20%\n3. Final examination:30%","materials":"Textbooks: \n(1) Phonics Fun Books1-6 , \n(2) Greek Mythology Short Plays, and \n(3) Charlie and the Chocolate Factory by Roald Dahl, with play script by Richard George.","foreignLanguageTextbooks":false}]
