[
  {
    "name": "陳長忻",
    "email": "charngshin.chen@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-14 10:58:48",
    "objective": "本課程研究建築細部設計，並幫助學生發展建築和其組成元素之間的關係的理解，藉由分析和設計練習如何建造的邏輯、建築元素的製造與組構，接頭、以及整個結構的組織構成，以確保具備技能來面對在建築細部設計中的挑戰。\n\n本課程也透過各種材料和工法的探究，以及銜接設計概念與構築過程，為學生在細部設計上提供多樣化的創作可能性。\nThe course studies architectural detailing and helps students to develop an understanding of the relationship of architecture and its elements, for ensuring their skills and capabilities to the challenges in detailing for architectures as well as researching the existing cases inbuilt examples, through one series of trainings of analyzing and practicing the logic of construction, fabrication of architectural elements, joints, and the organization of entire structures. \nBy engaging in various aspects of materials and methods, this course aims to provide students the unlimited creative possibilities in Detail Design by making connections between the design concept and fabrication processes.",
    "schedule": "第 01 週 課程教學內容介紹與細部設計思維說明\n第 02 週 建築房屋構造入門講解教學\n第 03 週 認識建築物各種帷幕牆設計與細部介面教學 (1-1)\n第 04 週 認識建築物各種帷幕牆設計與細部介面教學 (1-2)\n第 05 週 第一次校外建築物教學參觀與細部大樣說明 - 1\n第 06 週 利用 3D 建模軟體繪製帷幕牆與設計 (1-1)\n第 07 週 利用 3D 建模軟體繪製帷幕牆與設計 (1-2)\n第 08 週 利用 3D 建模軟體繪製帷幕牆與設計 (1-3)\n第 09 週 繳交第一次參觀後實作細部設計作業與講評\n第 10 週 第一次參觀後實作細部設計評圖後檢討\n第 11 週 認識建築物室內常用建材與細部介面教學 (2-1)\n第 12 週 認識建築物室內常用建材與細部介面教學 (2-2)\n第 13 週 利用 3D 建模軟體繪製室內設計細部 (2-0)\n第 14 週 利用 3D 建模軟體繪製室內設計細部 (2-1)\n第 15 週 利用 3D 建模軟體繪製室內設計細部 (2-2)\n第 16 週 利用 3D 建模軟體繪製室內設計細部 (2-3)\n第 17 週 繳交第二次參觀後實作細部設計作業與講評\n第 18 週 第二次參觀後實作細部設計評圖後檢討",
    "scorePolicy": "1.　成績考核方式：分組練習作業 60 %，展覽製作 15%，出席狀況 25%，\n2.　每堂課會確實點名。無特殊原因，事、病假請於課前寄 Email 告知，並於下一堂課提供線上假單截圖消曠課。",
    "materials": "1.《施工圖學：建築與結構施工圖的繪製原理與運用》，許玉明，詹式書局，2021.12。\n2.《The Function of Ornament》，Farshid Moussavi & Michael Kubo，Harvard University GSD，2008。\n3.《建築材料：營建材料全圖解》，Area045、洪淳瀅（譯），城邦文化，2020.04。\n4.《建築現場施工全解》，建築知識、石國瑜（譯），城邦文化，2021.08。\n5.《室內設計必學施工圖》，陳文亮、林麗菁、邱志豪，城邦文化，2022。",
    "consultation": "Email：charngshin.chen@gmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
