[
  {
    "name": "陳長忻",
    "email": "charngshin.chen@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-23 07:28:03",
    "objective": "作為建築師顯示其技藝性的主要圖面，細部大樣詳圖用來表達構造技術與材料品質。然而，細部設計學習養成深具挑戰性，因為設計作品集雖具細部設計照片或圖說，但缺乏說明其設計所產生的影響以及生成原因；而具專業性的細部設計書籍僅是詳盡紀錄複雜的建造細節，甚少解釋其設計動機。\n\n因此，本課程選用由 Farshid Moussavi 和 Michael Kubo 所編撰的《The Function of Ornament》的架構引導學生對細部設計的認識。透過整理知名案例圖說及製作細部模型，以及實地參訪完成之建築物之細部做法並記錄繪製，以彌合了上述學習的挑戰，讓學生能夠對相互關聯的建造細節與型式生成知識更全面的理解。\n\nAs the main drawing for the architects to show their skills, the drawings of the detail design are used to express the construction technology and materiality. However, the effective learning of detailed design is very challenging since though the design portfolios have clear design photos or illustrations, it lacks the explanation of the impact of the design and the reasons for its generate; and professional, detailed tool books only record complex construction details, little explanation of the motivation for its design. \n\nBy sorting out well-known case illustrations and making detailed physical models, as well as on-site visits to the completed buildings and recording and drawing their details, the above-mentioned learning challenges can be bridged, allowing students to have a more comprehensive understanding that construction details and their generation mechanisms knowledge.",
    "schedule": "第一週　（02/23）說明課程與作業練習方式\n第二週　（03/02）《The Function of Ornament》架構說明、練習 #01：操作說明\n第三週　（03/09）建築物各種帷幕牆設計與細部教學、練習 #01：分組發展討論\n第四週　（03/16）建築物各種帷幕牆設計與細部教學、練習 #01：分組發展討論\n第五週　（03/23）建築物各種帷幕牆設計與細部教學、練習 #01：分組發展討論\n第六週　（03/30）3D 建模軟體繪製帷幕牆與設計、練習 #01：分組發展討論\n第七週　（04/06）3D 建模軟體繪製帷幕牆與設計、練習 #01：分組發展討論\n第八週　（04/13）3D 建模軟體繪製帷幕牆與設計、練習 #01：分組發展討論\n第九週　（04/20）練習 #01 成果檢討\n第十週　（04/27）3D 參數模型與模型製作教學、練習 #02：操作說明\n第十一週（05/04）3D 參數模型與模型製作教學、練習 #02：操作說明\n第十二週（05/11）3D 參數模型與模型製作教學、練習 #02：操作說明\n第十三週（05/18）練習 #02：分組發展討論\n第十四週（05/25）練習 #02：分組發展討論\n第十五週（06/01）練習 #02：分組發展討論\n第十六週（06/08）成果展覽準備\n第十七週（06/15）成果展覽發表\n第十八週（06/22）端午節放假、期末作業檢討、成果上傳雲端資料夾",
    "scorePolicy": "1.　成績考核方式：分組練習作業 60 %，展覽製作 15%，出席狀況 25%，\n2.　每堂課會確實點名。無特殊原因，事、病假請於課前寄 Email 告知，並於下一堂課提供線上假單截圖消曠課。",
    "materials": "1.《施工圖學：建築與結構施工圖的繪製原理與運用》，許玉明，詹式書局，2021.12。\n2.《The Function of Ornament》，Farshid Moussavi & Michael Kubo，Harvard University GSD，2008。\n3.《建築材料：營建材料全圖解》，Area045、洪淳瀅（譯），城邦文化，2020.04。\n4.《建築現場施工全解》，建築知識、石國瑜（譯），城邦文化，2021.08。\n5.《室內設計必學施工圖》，陳文亮、林麗菁、邱志豪，城邦文化，2022。",
    "consultation": "Email：charngshin.chen@gmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
