[
  {
    "name": "王伯雅",
    "email": "diff@cmgsh.tp.edu.tw",
    "latestUpdate": "2022-12-19 15:49:24",
    "objective": "此專科英文課程共四年：專一、專二、專三、專四。其課程目標為培養學生獨立閱讀、進階寫作與口語溝通能力，並培育學生逐漸成為獨立的語言學習者。教學採符合溝通互動取向與全語言哲學的教學法，並依學生特點和課堂文化做適當教學調整與輔助。學生經由大量閱讀具知識性、趣味性、適合其程度的作品，經由經常參與角色扮演、分組討論、口頭報告與短文寫作等學習活動，逐漸提昇語言溝通能力與善用學習策略來解決問題的能力。\nThis junior-college English program consists of four-year English courses, with the purposes to develop fluency in reading and writing, and to improve listening and speaking abilities. The communicative approach and the whole language philosophy are thus adopted to implement the curriculum. In these courses, students have plenty of opportunities to take part in role-plays, oral presentations, pair work, small-group discussions and whole-class discussions for communicative purposes; they have good opportunities to express their feelings and thoughts in their essays and journal entries. A variety of reading, writing, and oral communication tasks are provided with a view to developing students' reading, writing, and oral communication skills, and to facilitating their using appropriate, effective learning strategies to accomplish learning tasks. In a word, the purpose of this curriculum is to motivate students to learn English, and to help them gradually become confident and competent use",
    "schedule": "The detailed schedule will be distributed on the first day of class.\nW1. Course Introduction; Learning Resources\t\t\nW2.  Lesson 1 The Day I Broke the Rules\t\nW3.  Lesson 2 The Marshmallow Challenge: A Lesson in Keeping It Simple\nW4.  Lesson 3 Prometheus: The Champion of Humankind \nW5.  Review 1 3-D Printing: Imagination Is the Only Limit\t\nW6.  Project Presentation\t\t\nW7.  Project Presentation\t\t\nW8.  Exam & Project Presentation\t\t\nW9.  Lesson 4 Day of the Dead: Joyous Celebration of Death\t\nW10.Lesson 5 Kyoto: The Heart of Japan\nW11. Lesson 6 My Life in Your Hands\t\nW12. Review 2 The Mystery of the Disappearing Bees\t\t\nW13. Exam & Project Presentation\t\nW14. Lesson 7 Bodies Speak Louder Than Words\t\nW15. Lesson 8 Elephant Abuse: The Thai Tourism Industry's Dard Secret \nW16. Lesson 9 Mazu Mania: A Great Pilgrimage that Unifies the People\nW17. Review 3 Fast Fashion, But at What Cost?  \t\nW18. Exam & Project Presentation",
    "scorePolicy": "Exams I, II, II: 50%  \nProject Presentations & Feedback: 15%\nVocabulary Quizzes: 15% \nAssignments: 10% (workbook, worksheets, etc.)\nGroup Participation: 10% (group discussion & involvement)",
    "materials": "龍騰 Ｂook 4",
    "consultation": "線上預約的方式如下 https://oaa.ntut.edu.tw/p/412-1008-12998.php?Lang=zh-tw 系統是設定最早一周前可以最遲三天前要預約：))))",
    "remarks": "遠距上課，教材以 zuvio 提供，於上課第一週於課堂告知選上學生 zuvio 課號若為購書課程，會於加退選週確定書籍送達方式● 上課網址：google meet 連結 meet.google.com/wwa-rvvm-mfx● 學生加退選簽核及諮詢課程問題管道：diff@cmgsh.tp.edu.tw 加簽方式：加選人數以不超過學校規定人數 N 為限。更完善的加簽方式會於第一堂課再更新說明，懇請體諒 QAQ <3",
    "foreignLanguageTextbooks": true
  }
]
