[
  {
    "name": "吳欣怡",
    "email": "cinewu@mail.ntut.edu.tw",
    "latestUpdate": "2022-12-22 10:03:03",
    "objective": "This course will provide an introduction to the history and theory of moving images with a focus on the spectatorship. Moving images have a variety of art forms, such as film, video, streaming media and the other different kinds of audiovisual installations. This course attempts to begin with historical film contexts. Furthermore, the discussion moves to the changing paradigms of moving images, and ends with considering the digital media as a new art form which shifts the moving images from movie theater to the diverse exhibiting, such as museum, gallery and online sites. A variety of cinematic contexts from essays to the selected experimental moving images will be screened and discussed.",
    "schedule": "Section 1 \nwk1-3\nWhat is moving images?\nA sensory approach to the interaction between screen and spectators.\n(R): Berger, John. Ways of Seeing. Ch 1\n(R): Sobchack, V.. 2004. ”What My Fingers Knew,” in Carnal Thoughts: Embodiment and Moving Image Culture. CA: University of California Press, Ltd.. 53-84.\n(Hang-out): Gorky, Maxim. 1896. “Lumiere’s Cinematograph”.\n\nSection 2\nWk4-6\nGaze and body on screen\n(R): Berger, John. Ways of Seeing. Ch2-3\n(R): Laura Mulvey, 1975, Visual Pleasure and Narrative Cinema.\n(S): Vertigo，1958、Rear Window，1954、The Piano，1993.\n\nWk 7-8 Mid-term oral presentation\nWk 9 mid-term study\n\nSection 3\nwk10-12\nMoving images in museum \n(R): McKenzie Jon, 1997. “Laurie Anderson for Dummies,” TDR, Vol. 41. No.2 (Summer) pp.30-50. The MIT Press.\n(S): The Raft, Bill Viola(2004) , Laurie Anderson。\n\nSection 4\nwk13-17\nImmersive screen \nInvited speaker (TBC)\n\nwk 18 feedback",
    "scorePolicy": "• Attendance and strong participation in class. 20%\n• Film analysis. 30%. \n• Midterm  Oral presentation. 30% \n• Final project. 20%",
    "materials": "Refer to the syllabus.",
    "consultation": "cinewu@mail.ntut.edu.tw",
    "remarks": "課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
