[
  {
    "name": "鄭麗玲",
    "email": "liling@ntut.edu.tw",
    "latestUpdate": "2022-12-21 01:16:58",
    "objective": "對青年世代而言，國語（華語）雖普及，但本土語文則有斷層的危機。台灣為多族群的社會，從原住民族的語言，到漢族裔的各種語言，其背後擁有豐厚的文化意涵，是本土文化傳承的重要工具與途徑。在強調多元價值的今日，國際化固可加強與世界文化接軌，對本土語文的學習與使用，可建立對自我文化的認同與信心，是文化保存與延續的不二法門。\nFor the young generation, although familiar with the National language (Chinese) ,almost unknown about the native languages ,so the local languages is being lost .Taiwan is a multi-ethnic society,the languages of different peoples ,from Indigenous peoples to Han Chinese ,have rich cultural heritage in it. The goal of this course is to inherit the native language of Taiwan, including basic listening, speaking, reading and writing skills, learning the pinyin system, daily conversation and reading, writing articles, etc. It is hoped that students can use the native language to communicate with others, even use in work times,further to understand the local culture.",
    "schedule": "1\t課程介紹\t介紹各週授課課程、學習網站、寫自己名字、介紹自己、分組\n2\t規工 ê 台語\n* 實體卡牌遊戲\t介紹生活台語的時間用法、菜市場所見物品、價錢用語\n3\t台語用的間隔式複習軟體\t介紹 Anki，2 款遊戲牌組分別為課程 2 課的相關內容 / 下載並給予老師製作的牌組，練習製作自己的記憶卡牌使用\n4\t斑芝花\t高中閩南語課本，第一課。延伸教學到教室外\n\n5\t從斑芝花到發現故鄉 ê 名\n* 九方陣 (九宮格) 遊戲\t延續閩南語課本第一課到介紹各自故鄉、地名台語如何唸、由來與轉變\n6\t定定是十七歲的彼畫面\t參考高中閩南語課本，第三課。預定邀請作者鄭順聰演講\n7\t十七歲 ê 我\t聽歌曲：故鄉 (葉啟田)家鄉的人事物\n向前走 (林強)\n拜啟 — 給十五歲的你\n8\t下晡 ê 一場秀\t介紹歌曲歌詞資料庫 / 小組討論\n各組挑一首台語歌，修正其內容期中考後報告並唱出\n9\t期中考週\t紙筆與口頭測驗\n10\t下晡 ê 一場秀\t各組歌唱大賽（每組 10 分鐘）\n11\t中年阿伯的太空夢\t使用高中閩南語課本，第三課\n每位同學製作自己的遊戲牌組 1 組，並分享給同組同學。\n12\t一陣人做伙做 ê 夢\t使用高中閩南語課本，第三課\n介紹北科校友的創業、走讀校園的美援建築\n13\tMIT 從頭說起\t從茶糖樟腦到半導體\n討論猶閣有啥物 MIT 的物件佇國際是排第一的？ \n14\t國家鐵道園區籌備處參訪\t國家鐵道博物館過去俗稱台北機廠，日治時期是許多台北工專前身台北工業學校實習處\n15\t逐家攏是油土伯\t從中年阿伯太空夢請各組報告\nyoutuber 內容翻成台語，\n16\t茫茫渺渺的未來\t使用高中閩南語課本，第四課。我的志向、興趣介紹\n17\t課程討論：我的志向的討論\t延續課本內容，討論自己的志願與興趣、油土伯\n18\t期末考週\t學期課程回顧 — 歌詞、歌唱歌詞編修、youtuber 內容翻成台語調整後整理回顧",
    "scorePolicy": "紙筆測驗 30%、口頭報告、小組討論、小組作品競賽等 60%，出缺席等平時表現 10%",
    "materials": "李勤岸總編，莊雅雯主編《高中 閩南語 1》，台南，真平企業有限公司，2022。",
    "consultation": "週二 56、週三 5678，E-mail: liling@mail.ntut.edu.tw",
    "remarks": "4. 教育品質 10 減少不平等 16 和平與正義制度",
    "foreignLanguageTextbooks": false
  }
]
