[
  {
    "name": "施佳瑩",
    "email": "kcyshih@gmail.com",
    "latestUpdate": "2022-12-20 20:20:51",
    "objective": "中文課程共分四年三階段授課。 第一、二年以華語教學為主，授課重點為：（一）華語基本句型句法；（二）華語基本會話；（三）生活語言；（四）標音系統。第三年 (一學期)，除延續第一、二年華語授課重點外，以段落朗讀和基本認字為主要訓練，並給與中國文字書寫訓練。 第四年 (一學期)，加強會話能力，認字與閱讀能力，並傳授中國文化。\nThe course of Chinese is categorized as three individual stages for four years. In the first year, the course focuses on: (a) Basic Sentence Patterns, (b) Basic Conversation, (c) Languages in the Real Life and (d) the phonetic system for the Chinese language. In the second and the third year (one semester), the training focuses on paragraph reading and term/character recognition-in addition to the teaching themes set in the first year. Writing courses are also added during this stage. In the fourth year (one semester), we add more emphasis on the conversational ability, term/character recognition and reading ability. More culture-related information will be included.",
    "schedule": "Week\tDate\t\nWeek 1\t2/24\tShopping and Business I\nWeek 2\t3/03\tShopping and Business II\nWeek 3\t3/10\tShopping and Business III\nWeek 4\t3/17\tShopping and Business IV\nWeek 5\t3/24\tFood and Culture I \nWeek 6\t3/31\tFood and Culture II\nWeek 7\t4/07\tFood and Culture III\nWeek 8\t4/14\tFood and Culture IV\nWeek 9\t4/21\tMidterm Exam\nWeek 10\t4/28\tTravel and Transportation I\nWeek 11\t5/05\tTravel and Transportation II\nWeek 12\t5/12\tTravel and Transportation III\nWeek 13\t5/19\tTravel and Transportation IV\nWeek 14\t5/26\tLife and Fashion I\nWeek 15\t6/02\tLife and Fashion II\nWeek 16\t6/09\tLife and Fashion III \nWeek 17\t6/16\tFinal exam\nWeek 18\t6/23\tDragon Boat Festival Holiday",
    "scorePolicy": "Attendance：15%\nHomework and school work：25%\nMidterm exam：30%\nFinal written exam：30%",
    "materials": "1.\tModern Chinese 2\n2.\tRelated video clips",
    "consultation": "If any questions, please contact the instructor by e-mail:kcyshih@gmail.com",
    "remarks": "During the period of pandemic, when necessary, the instructor and students meet at the scheduled course time on Google Meet. Under the premise of meeting the epidemic prevention regulations, students may take tests, such as mid-term and final examinations, in the classroom at school. Please pay attention to the information posted by the teacher before the exam.Google Meet Link:https://meet.google.com/nam-fjzd-mff",
    "foreignLanguageTextbooks": false
  }
]
