[
  {
    "name": "陳柔妃",
    "email": "roufei@ntut.edu.tw",
    "latestUpdate": "2022-12-22 03:12:07",
    "objective": "本課程主要授與學生程式設計的觀念與方法，程式設計語言以 Python 語言為基礎，在 Python 包索引（PyPI 中）的主機中，擁有成千上萬的 Python 模組。本課程內容著重邏輯思考與程式設計能力之訓練，同時輔以程式設計過程所應注意之程式結構、偵錯、可攜性、軟體工程的基本概念，使修習者得以奠定程式設計之基礎。",
    "schedule": "Ｗeek 1-2 運算思維與程式設計 - 跨入程式設計的大門\n程式設計，是針對電腦要解決的問題提供處理方式的過程，也是軟體開發時的重要步驟。Python 是一個執行功能強大，但語法簡潔優雅的程式語言，不僅容易學習，更容易應用實作在許多專題上！\n\nＷeek 3-5 變數與運算式 - 不只先乘除後加減\n變數建立時，應用程式就會配置一塊記憶體，並以變數名稱做為辨識此塊記憶體的標誌，設計者就可在程式中將各種資料存入使用。運算式包含了運算元與運算子，可以進行程式的運算動作。\n・本章範例包括：成績單、稅率報表及薪資表格式化輸出 \\ 梯形、長方形面積計算 \\ 複利本金計算... 等。\n\nWeek 6-8 判斷式 - 邏輯思維的起點\n程式設計也和日常生活雷同，常會遇到一些需要做決策的情況，再依決策結果執行不同的程式碼，這就是「判斷式」。\n・本章範例包括：密碼比對判斷 \\ 輸入成績評等 \\ 電影分級判斷 \\ 百貨公司折扣戰 \\ 數字比大小... 等。\n\nWeek 9 期中上機檢核\n\nWeek 10-11 迴圈 - 翻滾吧！程式碼\n電腦最擅長處理的工作就是重複執行的事情，而日常生活中到處充斥著這種不斷重複的現象，程式專門用來處理重複事件的命令稱為「迴圈」。\n・本章範例包括：建立數列 \\ 計算正整數總和 \\ 井字直角三角形 \\ 九九乘法表 \\ 找最小公倍數 \\ 階乘計算... 等。\n\nWeek 12-14  串列與元組 - 大量數據收納術\n串列又稱為清單或列表，與其他語言的陣列相同，其功能與變數相類似，是提供儲存資料的記憶體空間。元組的結構與串列完全相同，不同處在於元組的元素個數及元素值皆不能改變。\n・本章範例包括：串列初值設定 \\ 迴圈讀取串列 \\ 成績計算 \\ 刪除串列元素 \\ 成績排序... 等。\n\nWeek 15  字典 - 為資料貼上標籤\n字典資料型態，其元素是以「鍵 - 值」對方式儲存，運作方式為利用「鍵」來取得「值」。・本章範例包括：血型個性查詢 \\ 四季天氣查詢 \\ 成績查詢 \\ 產品銷售查詢 \\ 世大運獎牌數查詢... 等。\n\nWeek 16 函式與模組 - 簡化運算擴充功能的利器\n在程式中通常會將具有特定功能或經常重複使用的程式，撰寫成獨立的小單元，稱為函式。Python 擁有許多模組，可讓功能可以無限擴充。\n・本章範例包括：攝氏華氏溫度 \\ 公斤英磅轉換 \\ 均分蘋果 \\ 電費、家庭支出查詢 \\ 網址格式檢查 \\ 檔案格式檢查 \\ 成績單、業績報表列印 \\ 日期時間格式轉換 \\ 擲骰子遊戲 \\ 大樂透抽獎 \\ 四星彩開獎... 等。\n\nWeek 17  演算法：排序與搜尋 - 用邏輯來解決問題\n演算法就是為了解決一個問題而採取的方法和步驟，通常會以虛擬碼來表示，再以熟悉的語言來實現。・本章範例包括：數字排排站 \\ 追蹤泡沫排序 \\ 搜尋中獎者 \\ 彩券對獎... 等。\n\nWeek 18 期末上機檢核",
    "scorePolicy": "出席率 10%、平時成績 30%、期中成績 30%、期末成績 30%。",
    "materials": "■「Python 零基礎入門班」本書適用無程式設計經驗，想打好程式語言基礎者，內容為程式觀念的建立與重要語法的學習 + 實用小範例，可一步一步紮實打好基本功。\n■「Python 初學特訓班」本書適用初學 Python，想一次就從基礎跨入專案開發者，內容為基礎語法 + 專案實例，以快速具備 Python 開發力。\n■「Python 大數據特訓班：資料自動化收集、整理、分析、儲存與應用實戰」本書適用想完整學習 Python 資料處理三大觀念與技術「擷取分析、視覺化呈現與儲存應用」者，內容全面深入不同應用面向，如：網路爬蟲、資料正規化 / 視覺化 / 儲存與讀取… 等，並以國內熱門實例進行大數據專案實作。\n■「Python 架站特訓班：Django 最強實戰」本書適用想直接打造超強互動網站者，內容涵蓋正規化網站開發流程，結合資料庫，並透由主題範例實戰，架構出專業實用的網站。",
    "consultation": "教師辨公室材資館 508-1 室；助教辨公室材資館 204-3 室！開學第一週請修課同學都加入即時通訊軟體之群組。",
    "remarks": "配合教育部及學校規定，授課採取Ｍicrosoft terms 遠距線上通訊軟體。",
    "foreignLanguageTextbooks": false
  }
]
