[
  {
    "name": "黃青萍",
    "email": "chanmaster6@gmail.com",
    "latestUpdate": "2022-12-20 19:53:37",
    "objective": "本課程「國語文實務應用」，專為本校科技大學的同學而設計，以未來於職場（生存）與人生（生活、生命）之實務應用為教學標的。 \n    奠基於大學之前 12 年的國語文能力上，課程設計朝向多元實務應用的方向，以建構學生多元溝通表達之職場需求力為要，包括資訊蒐集力、資訊應用力、簡報製作力、文案企劃力、自我宣傳力、口語溝通力、採訪寫作力、理念論述力、創新思維力等諸多領域的能力，並重視啟發學生培養生活品味力，深化學生對於生命關懷力的體認，以契合本校重視實務應用的優良傳統，以及學生未來畢業後的實務需求。\nThis course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "中國哲學名篇選讀與表達能力訓練\n1. 課程介紹 (Introduce the curriculum content, grade point standard)\n2. 短講作業說明－短講形式與內容 (How to Give a Presentation)\n3. 短講作業說明－自我介紹的重點 (How to Give a Presentation)\n4.《孫子兵法》選讀 The Chinese Classic: The Art of War\n5.《孫子兵法》選讀 The Chinese Classic: The Art of War\n6.《孫子兵法》選讀 The Chinese Classic: The Art of War\n7.《孫子兵法》選讀 The Chinese Classic: The Art of War\n8.《論語》選讀 The Chinese Classic: Ｔhe Analects\n9.《論語》選讀 The Chinese Classic: Ｔhe Analects\n10.《論語》選讀 The Chinese Classic: Ｔhe Analects\n11. 個人三分鐘短講 3 minutes presentation\n12. 個人三分鐘短講 3 minutes presentation\n13. 個人三分鐘短講 3 minutes presentation\n14. 個人三分鐘短講 3 minutes presentation\n15.《道德經》選讀 The Chinese Classic: Tao Te Ching\n16.《道德經》選讀 The Chinese Classic: Tao Te Ching\n17.《道德經》選讀 The Chinese Classic: Tao Te Ching\n18. 期末考 Final Exam",
    "scorePolicy": "會考 10% \nClass Attendance 出席 30%\nPresentation 個人短講 30%(ppt 短講)\nFinal Exam 期末考 30%",
    "materials": "自編講義",
    "consultation": "1. 加退選一律以網路簽核為主。2. 加退選人數，以不超過教室座位量為限。3. 如有問題，請使用 chanmaster6@gmail.com 信箱聯絡老師。",
    "remarks": "1. 上課時間：使用 teams 進行同步線上教學。(按課表時間上課) 2. 上課方式：請同學下載 teams 程式並登入學校設定的帳號，於上課時間進入國文課程團隊，老師會召開會議，並於線上點名。帳號：學號＠cc.ntut.edu.tw 密碼：同校園入口網站密碼 3. 教材提供：請於 i 學園下載 word 檔講義。",
    "foreignLanguageTextbooks": false
  }
]
