[
  {
    "name": "陳儀",
    "email": "chenyi@ntut.edu.tw",
    "latestUpdate": "2023-02-20 12:04:30",
    "objective": "本課程「國語文實務應用」，專為本校科技大學的同學而設計，以未來於職場（生存）與人生（生活、生命）之實務應用為教學標的。 \n    奠基於大學之前 12 年的國語文能力上，課程設計朝向多元實務應用的方向，以建構學生多元溝通表達之職場需求力為要，包括資訊蒐集力、資訊應用力、簡報製作力、文案企劃力、自我宣傳力、口語溝通力、採訪寫作力、理念論述力、創新思維力等諸多領域的能力，並重視啟發學生培養生活品味力，深化學生對於生命關懷力的體認，以契合本校重視實務應用的優良傳統，以及學生未來畢業後的實務需求。\nThis course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "第 1 週  課程說明、學期反思及構想\n第 2 週  和平紀念日放假\n第 3 週  閱讀寫作討論\n第 4 週  生命設計：本週將介紹生命設計思考理論，幫助同學創造理想人生；並介紹職涯測驗以進行自我深度探索。\n第 5 週  人物訪談：本週將介紹訪談寫作，透過訪談以充分了解他人處境，打造自身生命原型體驗。\n第 6 週  履歷自傳寫作：本週將介紹履歷及自傳寫作方法，以及相關原則。\n第 7 週  兒童節調整放假\n第 8 週  職涯探索：本週將運用遊戲進行自我深度探索；同時也將引導同學針對未來工作進行資料蒐集。\n第 9 週  履歷自傳討論 1：本週將採取一對一修改討論，協助同學修改整潤履歷自傳。\n第 10 週  履歷自傳討論 2：本週將採取一對一修改討論，協助同學修改整潤履歷自傳。\n第 11 週  企畫書發想：本週將介紹設計發想技巧，並以工作坊形式進行實作練習。\n第 12 週  企畫書結構與評估：本週將介紹企畫書內容結構、書寫要點，以及可行性評估原則，並以工作坊形式進行實例討論。\n第 13 週  小組討論：本週為小組討論時間，協助同學準備期末企畫專題。可自備筆電，以利作業。\n第 14 週  企畫書提案設計及小組討論：本週將說明企畫提案設計技巧，並以工作坊形式進行實例討論；同時也安排小組討論時間，協助準備期末企畫提案。請自備筆電，以利作業。\n第 15 週  小組提案報告 1\n第 16 週  小組提案報告 2\n第 17 週  小組提案報告 3\n第 18 週  小組提案報告 4",
    "scorePolicy": "評量標準：課堂出席 20%、活動與作業 60%、書香計畫 10%、國文會考 10%。\n作業不接受補交，若有特殊情形，請提前告知商量。",
    "materials": "教師自編教材。\nCarmine Gallo 著，羅雅萱、劉怡女譯：《跟 TED 學表達，讓世界記住你：用更有說服力的方式行銷你和你的構想》，臺北市：先覺，2014 年。\nSam Horn 著，洪慧芳譯：《說出亮點吸引力》，臺北市：天下雜誌，2017 年。\n徐秀菁等合著：《南瓜變馬車 —— 應用文故事指導書》，臺北：五南，2018 年。\n清水久三子著，賴庭筠譯：《用對圖，簡報更有力：IBM 簡報教主傳授打動人心的圖表簡報術》，新北市：好優文化，2018 年。",
    "consultation": "本課程將以北科 i 學園做為課程網頁，並以 Zuvio 進行課堂互動。如有問題請聯繫：chenyi@mail.ntut.edu.tw。",
    "remarks": "因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。若無法實體上課，預計使用 Google Meet（zva-ptjq-okm）於原定上課時間遠距上課。",
    "foreignLanguageTextbooks": false
  }
]
