[
  {
    "name": "羅梅君",
    "email": "mcl@mail.shu.edu.tw",
    "latestUpdate": "2022-12-20 02:07:31",
    "objective": "本課程將介紹程式設計的基礎，透過腳本式語言及基礎程式語言的應用，培養學生程式設計的基本能力。本課程除加強技術開發能力外，也將導引學生，如何透過獨立思考來面對問題及分析問題，並透過程式的撰寫來解決問題。\nThis course will introduce the fundamental of computer programming design. Student will learn the capability of programming design using script language and basic programming language. This course will also provide the knowledge and methods for students to realize and analyze specific problem independently. So that they can using computer program to solve the problems.",
    "schedule": "第 1 週\tHello: (The Beginning) Pixels, Processing, and Interaction\n第 2 週\tStarting to Codes: Your First Program; Show; Save and New; Share\nThe Foundation of Drawing\n第 3 週\tWorking with Preexisting Images (I)\n第 4 週\tWorking with Preexisting Images (II)\n第 5 週\t2D Graphics and Animation.\n第 6 週\tWorking with Text and Files\n第 7 週\tCreating User Interfaces and Widgets\n第 8 週\tMid-Term\n第 9 週\tNetwork Communications\n第 10 週\t3D Graphics and Animation (I)\n第 11 週\t3D Graphics and Animation (II)\n第 12 週\tAdvanced Graphics and Animation\n第 13 週\tWorking with Sound\n第 14 週\tWorking with Video\n第 15 週\tMeasuring and Simulating Time\n第 16 週\tCreating Simulations and Games\n第 17 週\tMaking Your Work Public\n第 18 週\tFinal-Exam (Project)",
    "scorePolicy": "平時成績 (出席率、上課表現和作業):55%  期中成績：20%   期末考：25%\n上課表現包括：熱心教導同學，學習大進步，態度積極進取。 \n特別必須注意者：每周所交代規定之作業 (Homework) 若未繳交 (包含未完成基本該有的進度和功能，亦視同未繳交；就算是當周缺席未到課，仍然得繳交當周所交代的作業)\n曠課 12 小時扣考 (以老師點名記錄為主，就算學校點名系統關閉之後的曠課時數也在計算在內)。",
    "materials": "使用教材 (教科書)\n1.\tJim Parker, An Artist’s Guide to Programming-A Graphical Introduction, No Starch Press, 2022. \n2.\tCasey Reas and Ben Fry, Make: Getting Started with Processing, Second Edition, Maker Media, September 2015.\n參考書目\n3.\tMargaret Noble, Programming Media Art Using Processing: A Beginner's Guide, CRC Press, 2021.\n4.\tYu Zhang (Author), Mathias Funk (Contributor), Coding Art: The Four Steps to Creative Programming with the Processing Language (Design Thinking) (English), Apress, 01/2021\n5.\tCasey Reas & Ben Fry, Make: Getting Started with Processing, MAKER MEDIA, 2015.\n6.\tLauren McCarthy, Casey Reas & Ben Fry, Make: Getting Started with p5.js, MAKER MEDIA, 2016.\n7.\tCasey Reas and Ben Fry, Processing: A Programming Handbook for Visual Designers, Second Edition, The MIT Press. December 2014.\n8.\tDerek Runberg, The SparkFun Guide to Processing, No Starch Press, 2015.\n9.\tDaniel Shiffman, Learning Processing, Second Edition: A Beginner's Guide to Programming Images, Animation, and Interaction, Morgan Kaufmann, August 2015.\n10.\tAllison Parrish, Ben Fry, and Casey Reas, Make: Getting Started with Processing.py, MAKER MEDIA, 2016. (有中文翻譯本)\n11.\tDaniel Shiffman, The Nature of Code: Simulating Natural Systems with Processing, December 2012.\n12.\tHartmut Bohnacker, Benedikt Gross, Julia Laub, and Claudius Lazzeroni,Generative Design: Visualize, Program, and Create with Processing, Princeton Architectural Press, August 2012.\n13.\tJeffrey L. Nyhoff, Larry R. Nyhoff, Processing: An Introduction to Programming,  CRC Press, May 2017.\n14.\tIra Greenberg, Dianna Xu, Deepak Kumar, Processing: Creative Coding and Generative Art in Processing 2, friends of ED, April 2013.\n15.\tAndrew S. Glassner, Processing for Visual Artists: How to Create Expressive Images and Interactive Art, A K Peters, August 2010.\n16.\tPenny de Byl, Creating Procedural Artworks with Processing A Holistic Guide, CreateSpace Independent Publishing Platform, May 2017. \n17.\tNikolaus Gradwohl, Processing 2: Creative Coding Hotshot, PACKT, May 2013.\n18.\tJan Vantomme, Processing 2: Creative Programming Cookbook, PACKT, September 2012.\nOther Materials from Websites.\n19.\thttps://processing.org/\n20.\thttp://learningprocessing.com/examples/           \n21.\thttp://learningprocessing.com/exercises/\n22.\thttp://learningprocessing.com/videos/\n23.\thttp://learningprocessing.com/resources/\n24.\thttps://www.youtube.com/user/shiffman              \n25.\thttps://www.youtube.com/user/shiffman/videos  \n26.\thttp://happycoding.io/tutorials/processing/          Processing Tutorials\n27.\thttp://happycoding.io/tutorials/  \n28.\thttps://en.wikipedia.org/wiki/Processing_(programming_language)\n29.\thttp://happycoding.io/teaching/",
    "consultation": "課外，將由班代為管道以 Line 和老師聯絡預約，以 Discord 為課程諮詢討論管道。",
    "remarks": "因應新冠肺炎疫情延燒，為確保校園安全維護教職員生健康，若課程採遠距教學方式進行，後續將因應疫情發展與實際情況，隨時做滾動式修正。本課程將使用 Teams/Discord 平台為遠距教學工具，課程連結 將因應狀況 提前告知學生。",
    "foreignLanguageTextbooks": true
  }
]
