[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2023-03-15 10:21:24",
    "objective": "The course is designed for first-year students to strengthen their English language skills. The four English skills (reading, listening, writing and speaking) will be taught in an integrated manner.",
    "schedule": "Week \t\tActivity\t\t\n\n1\t\tIntroduction\t\n5\t\tMar 25 (Sat) Museum Visit (make-up for Apr 6 and Apr 7 holiday)\n7\t\tHoliday (Apr 6 and Apr 7)\n8 \t\tWriting test\n9\t\tSchool Mid-Term (no class)\n13\t\tSpeaking test\t\t\n14\t\tSpeaking test\t\n15\t\tFinal exam \n17\t\tHoliday\n18\t\tConsultation (no class)\n\nAll other weeks:\nWe will read and discuss writings in the textbook. Subjects may include education, human nature and the mind, language and rhetoric, the arts, science and nature, law and government, wealth, poverty and social class, ethics and empathy, and visual culture.",
    "scorePolicy": "Evaluation (to be finalized)\n\nGroup presentation*\t\t\t15%\nSchool mid-term\t\t\t20%\nSpeaking test*\t\t\t15%\nFinal Exam*\t\t\t\t30%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup exam or test may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of exam. The format of the makeup exam will be determined by the lecturer.\n\nAttendance policy\nYou will automatically fail the course (0%) with 8 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system.",
    "materials": "Reading the World: Ideas That Matter (Fourth Edition) by Michael Austin, W. W. Norton & Company",
    "consultation": "Students may make an appointment with the lecturer in advance by email for consultation.",
    "remarks": "Online courses will be conducted here - https://meet.google.com/ecz-jamj-ozu.",
    "foreignLanguageTextbooks": true
  }
]
