[
  {
    "name": "吳宙霖",
    "email": "jonrcarter@mail.ntut.edu.tw",
    "latestUpdate": "2022-12-20 10:27:47",
    "objective": "ECA 課程專為大一非英語母語的學生設計，加強英語語言技能，特別強調溝通能力和社會、文化、及專業實務應用。 通過整合四種語言技巧能力（閱讀、聽力、口語和寫作），將課堂英語文教學連結至與實務溝通情境之英語文使用。以下為課程設計及教學法之主軸：溝通語言教學（CLT）、任務型導向（TBL）和內容導向教學（CBI），培養學生的英語語言能力為進階專業英文之基礎。\nThe ECA courses are designed for the first-year (freshman), non-native English speaking students to strengthen their English language skills, with particular emphasis on communicative competence and practical application in social, cultural and professional contexts. By integrating the four skills (reading, listening, speaking and writing), the primary objective is to connect the classroom ELT with the real-life communicative situations. To that end, the courses adopt the following approaches: communicative language teaching (CLT), task-based learning (TBL), and content-based instruction (CBI), building a holistic pedagogy to English instruction and developing students’ English language proficiency for the next level ESP courses.",
    "schedule": "第 1 週   \tFeb. 23rd (Thur..)\tWorld English 3, Unit 6 Art Matters, Part A\n\t        Feb. 24th (Fri.)\tWorld English 3, Unit 6 Art Matters, Part B\n第 2 週   \tMar. 02nd (Thur..)\tWorld English 3, Unit 6 Art Matters, Part C\n\t        Mar. 03rd (Fri.)\tWorld English 3, Unit 6 Art Matters, Part D\n第 3 週   \tMar. 09th (Thur..)\tWorld English 3, Unit 6 Art Matters, Part E\n\t        Mar. 10th (Fri.)\tWorld English 3, Unit 6 Art Matters, Video\n第 4 週   \tMar. 16th (Thur..)\tWorld English 3, Unit 7 Getting Around, Part A\n\t        Mar. 17th (Fri.)\tWorld English 3, Unit 7 Getting Around, Part B\n第 5 週   \tMar. 23rd (Thur..)\tWorld English 3, Unit 7 Getting Around, Part C\n\t        Mar. 24th (Fri.)\tWorld English 3, Unit 7 Getting Around, Part D\n第 6 週   \tMar. 30th (Thur..)\tWorld English 3, Unit 7 Getting Around, Part E\n\t        Mar. 31st (Fri.)\tWorld English 3, Unit 7 Getting Around, Video\n第 7 週   \tApr. 6th (Thur..)\tWorld English 3, Unit 8 Competition, Part A\n\t        Apr. 7th (Fri.)\tWorld English 3, Unit 8 Competition, Part B\n第 8 週   \tApr. 13th (Thur..)\tWorld English 3, Unit 8 Competition, Part C\n\t        Apr. 14th (Fri.)\tWorld English 3, Unit 8 Competition, Part D\n第 9 週   \tApr. 20th (Thur..)\tMid-Terms Week\n\t        Apr. 21st (Fri.)\tMid-Terms Week\n第 10 週   \tApr. 27th (Thur..)\tWorld English 3, Unit 8 Competition, Part E\n\t        Apr. 28th (Fri.)\tWorld English 3, Unit 8 Competition, Video\n第 11 週   \tMay. 4th (Thur..)\tWorld English 3, Unit 9 Danger, Part A\n\t        May. 5th (Fri.)\tWorld English 3, Unit 9 Danger, Part B\n第 12 週   \tMay. 11th (Thur..)\tWorld English 3, Unit 9 Danger, Part C\n\t        May. 12th (Fri.)\tWorld English 3, Unit 9 Danger, Part D\n第 13 週   \tMay. 18th (Thur..)\tWorld English 3, Unit 9 Danger, Part E\n\t        May. 19th (Fri.)\tWorld English 3, Unit 9 Danger, Video\n第 14 週   \tMay. 25th (Thur..)\tWorld English 3, Unit 10 Mysteries, Part A\n\t        May. 26th (Fri.)\tWorld English 3, Unit 10 Mysteries, Part B\n第 15 週   \tJun. 1st (Thur..)\tWorld English 3, Unit 10 Mysteries, Part C\n\t        Jun. 2nd (Fri.)\tWorld English 3, Unit 10 Mysteries, Part D\n第 16 週   \tJun. 8th (Thur..)\tWorld English 3, Unit 10 Mysteries, Part E\n\t        Jun. 9th (Fri.)\tWorld English 3, Unit 10 Mysteries, Video\n第 17 週\tJun. 15th (Thur..)\tWorld English 3, Unit 11 Learning, Part A\n\t        Jun. 16th (Fri.)\tFinal Exam\n第 18 週\tJun. 22nd (Thur..)\tHoliday\n\t        Jun. 23rd (Fri.)\tHoliday",
    "scorePolicy": "期中考 Mid-Term Exam (20%)\n\n期末考 Final Exam (30%)\n\n課堂參與與練習 In-class Participation (40%)\nIn class participation and discussion is required.\n\n課程出席率 Attendance (10%)",
    "materials": "World English 3",
    "consultation": "jonrcarter@mail.ntut.edu.tw",
    "remarks": "https://meet.google.com/tfc-texo-wrg",
    "foreignLanguageTextbooks": true
  }
]
