[
  {
    "name": "林筱玫",
    "email": "lydia.hmlin@gmail.com",
    "latestUpdate": "2023-02-19 19:23:29",
    "objective": "在這個 e 化的時代，傳送訊息的表現手法如文字、影像、聲音、影片等都被廣泛的運用，組織這些文字、影像、聲音、影片等資料的就成了一個必須重視的課題。媒體產業和文創產業除了深受媒體定律影響，還包括無所不在的網路對於經濟、文化、和社會衝擊，衍生的直接和間接效應。本課程中講解文創的法則並依序從媒體理論、經濟理論、管理理論與文化理論加以說明，並同學需選定某一產業如：電影、音樂、出版、遊戲、博奕、職業運動、表演藝術、主題樂園、時尚奢華等，提出期末報告。\n\nThe industry and the media have a far-reaching influence, and the laws and regulations of the Internet have direct and indirect impacts on the economy, society, culture, and social power. In the electronic age, text, image, sound, and video are all widely used; the organization of these data has become an important issue. This course illustrates and explains the principles of cultural creativity from media, economics, management, and cultural theories. Further, students must choose a specific industry, such as film, music, publishing, games, gaming, professional sports, performing arts, theme parks, fashion, luxury, etc., and put forward the end-of-term report.",
    "schedule": "1.  課程導覽 -《文化創意：產業、就業與創業》和《文創的法則》。\n2.  文化創意產業概論、文創的法則 1-6\n3.  文化創意產鏈與趨勢、文創的法則 7-12\n4.  文化創意產品開發、文創的法則 13-18\n5.  文化創意品牌經營、文創的法則 19-24\n6.  細項產業分類與概論 - Proposal 提案簡報. (3/28) \n7.  創意生活產業、文創的法則 25-30\n8.  工藝產業與產品設計產業、文創的法則 31-36  \n9.  期中考：學科測驗 (文創的 36 法則).  (4/17)\n10. 流行時尚產業導讀與討論\n11. 表演 / 視覺藝術產業導讀與討論\n12. 文化傳播產業導讀與討論\n13. 動畫產業與數位內容產業導讀與討論\n14. 會展產業導讀與討論\n15. 智財法律與藝術授權導讀與討論\n16. 文創產業資源整合運用導讀與討論\n17. 地方創生與社會設計導讀與討論\n18. 綜合討論",
    "scorePolicy": "期中考試 35% \n分組報告 35%. (提案簡報 5% + 報告 30%)\n期末報告書 20% \n出缺勤表現與貢獻度 10%\n\nMidterm Exam 35% \nGroup report 35%  (Proposal 5% + Presentation 30%)\nFinal report 20% \nAbsence performance and contribution: 10%",
    "materials": "《文化創意：產業、就業與創業》\n作者： 張耀文，李秉儒，張智琦，張榕茜\n出版社：全華圖書\n出版日期：2021/05/20\n\n\n《文創的法則》\n36 Ideas to Learn in Cultural and Creative Industries\n作者：陳智凱 / 邱詠婷\n出版社：台灣東華書局股份有限公司\n出版日期：2016/01/01\n\n\n《文創學》\nA Big Idea on the Cultural and Creative Economics\n作者： 陳智凱 / 邱詠婷\n出版社：台灣東華書局股份有限公司   \n出版日期：2016/05/04",
    "consultation": "https://www.facebook.com/berrymeiLine ID: hmlin546018 教師學校 Gmail 信箱帳號: Lydia@mail.ntut.edu.tw 教師個人 Gmail 信箱帳號: Lydia.HMLIN@gmail.com",
    "remarks": "Google Meet  以學生帳號於學校課程系統登入。課程主持人聯繫帳號：Line ID: hmlin546018 教師學校 Gmail 信箱帳號: Lydia@mail.ntut.edu.tw 教師個人 Gmail 信箱帳號: Lydia.HMLIN@gmail.com",
    "foreignLanguageTextbooks": false
  }
]
