[
  {
    "name": "陳起鳳",
    "email": "cfchen@ntut.edu.tw",
    "latestUpdate": "2023-03-08 17:41:17",
    "objective": "Disaster is divided to natural and anthropogenic disaster. Either natural or anthropogenic disaster damage can be minimized by proper management, including pre- and post- management. Learning from the history, several disasters have been identified and more and more technologies have been developed to mitigate the possible disasters. In this course, natural disasters are focus because it is more difficult to predict and prevent. With the changing environment and climate, the intensity and frequency of natural disasters become more strong and unpredictable; therefore, the disaster management is very important. Real cases for different types of disaster will be chosen and discussed in this course. Facing these disasters, what we can do and how we can prepare is a survival issue. Through the comprehensive discussion, the students are expected to learn the structural and nonstructural solutions for the various disasters. Especially, the solutions are focus on ecological engineering and environmental friendly methods. A new and widely accepted idea, natural-based solutions (NBS) or ecosystem-based approaches, is increasingly applied to disaster management and will be discussed in this course.",
    "schedule": "draft schedule ( it might be revised in the semester)\nWeek 1　Introduction \nWeek 2　Disaster types and current states\nWeek 3-4　Disaster management \nWeek 5　Impacts and adaption of flood disaster\nWeek 6　Impacts and adaption of drought disaster\nWeek 7-8　Impacts and adaption of climate change\nWeek 9 midterm exam\nWeek 10-11 natural-based solutions and ecological approaches on disaster management \nWeek 12-14　case study-short report \nWeek 15-17　case study- group discussion and report \nWeek 18 Conclusion remark",
    "scorePolicy": "Attendance 20%\nMidterm exam 20%\nShort report 20%\nGroup report 40%",
    "materials": "ppt materials will be provided. \nBut all the students will be assigned reading materials from the book: Ecosystem-Based Disaster and Climate Resilience: Integration of Blue-Green Infrastructure in Sustainable Development. 2021. Edit by Mukherjee, M., and Shaw, R., Springer. ISBN 978-981-16-4815-1 (eBook).\nNature-based Solutions to address global societal challenges. 2016. Editors: E Cohen-Shacham, G Walters, C Janzen, S Maginnis. International Union for Conservation of Nature (IUCN). ISBN: 978-2-8317-1812-5.",
    "consultation": "If you have any questions on the class, you can email to me:  cfchen@ntut.edu.tw.Or you can find me in my office hours.My office is 301 in the building of civil engineering.",
    "remarks": "If there is any situation and is not allowed to be in the classroom, the course will be taken by Teams system. The online link will be announced in the class system. If you have any question, you can email to me: cfchen@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
