[
  {
    "name": "李達生",
    "email": "f11167@ntut.edu.tw",
    "latestUpdate": "2022-12-19 08:32:45",
    "objective": "實驗與量測方法將教授各式物理量之量測方法、量測誤差分析及多變數實驗設計",
    "schedule": "1 課程綱要簡介\n2-4 各種物理量的量測方法、儀器、量測誤差及其校正追溯方式\n5-7 實驗不確定度分析方法\n7-8 以冷凍機冷凍能力量測結果為例，介紹如何進行不確定度分析\n9-12\t針對不同實驗型態使用不確定度分析方法\n13-14 多變數實驗規劃方法\n15-16 田口品質工程法\n17-18 以多變數實驗規劃法進行製程最佳化\n19 期末",
    "scorePolicy": "期中考 10% (視狀況舉行)\n實驗規劃報告 80%\n期末考 10% (視狀況舉行)",
    "materials": "自編教材",
    "consultation": "每周固定時間開放課程諮詢，諮詢時間依照課堂上跟學生議定為準，上課後公布。",
    "remarks": "使用 Teams 工具遠距教學，並以混成教學模式（同步互動 + 非同步影音），提供因新冠疫情影響無法到校之學生進行線上學習。",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "蔡府伯",
    "email": "fu6370@gmail.com",
    "latestUpdate": "2023-04-16 16:06:20",
    "objective": "實驗是進行科學與工程研究不可或缺的工具，實驗方法的設計與實驗數據的分析更是決定實驗結果品質優劣的關鍵，本課程將介紹實驗過程所必須具備的各項知識，以數據的量測與分析為開始，並介紹量測各類物理量的感測元件，如壓力、溫度、流量及聲波等，以建立學生具備實驗量測的基礎。課程主要內容包含有基本量測、量測標準、量測單位、訊號讀取、資料簡報、數據的準確性與變異性、類比訊號量測、數位訊號量測、系統響應、感測器。\nIntroduction of Experiment and Measurement Method\nExperiment is the essential tool for the research of science and engineering. The design of experiment and the analysis of data are the keys of the high quality of experiment. The course will introduce the materials of experiment and measurement. The procedures of measurement and the analysis method of data will be detailed investigated. And then the sensors to measure the interested physical parameters of pressure, temperature, flow rate and acoustic will be introduced. The technology of measurement and analysis of experiment will be built up in the course. The contents of the course are basic measurement, standards of measurement, dimension of measurement, access data, data presentation, accuracy and uncertainty of data, analog signal measurement, digital signal measurement, system response, and sensors.",
    "schedule": "2023.03.08 第 3 週：\n1. 教學大綱說明 2. 空調趨勢與業界現況分析 3. 同學論文領與分享與討論\n\n2023.05.10 第 12 週",
    "scorePolicy": "1. 出席率及課程互動參與頻率 30%\n2. 期末報告：簡報內容、簡報製作、上台報告口條 70%",
    "materials": "2016 空調系統測試平衡 (TAB)",
    "consultation": "「每周固定時間開放課程諮詢，諮詢時間依照課堂上跟學生議定為準，上課後公布。」",
    "remarks": "若因應疫情需要採用 Google Meet 遠距教學",
    "foreignLanguageTextbooks": false
  }
]
