[
  {
    "name": "程聖倫",
    "email": "scheng@ntut.edu.tw",
    "latestUpdate": "2023-02-13 11:46:52",
    "objective": "Career management is the study of managing and developing career of self and employees, and\nhandling career related issues. This course provides knowledge and skills required for\neffectively managing and developing career of self and others. In this course, we will cover topics related to explaining career management concepts, models, and theories; evaluating the applicability of career management, models and theories; discussing the inter-relatedness of career management, family and personal life involvements; and applying knowledge on career management to make career development decisions in an organization and personal life.",
    "schedule": "01 2/22 Course introduction & Introduction to the Study of Careers\n02 3/01 Career Contexts and Stages\n03 3/08 A Model of Career Management\n04 3/15 Applications of the Career Management Model: A Guide to Career Exploration\n05 3/22 Applications of the Career Management Model: Goals, Strategies, and Appraisal\n06 3/29 Occupational and Organizational Choice\n07 4/05 No class (Children's Day)\n08 4/12 The Early Career Stage: Establishment and Achievement/*Attending the annual meeting of AERA (American Educational Research Association)\n09 4/19 Midterm Week\n10 4/26 The Middle and Late Career Stages: Career Challenges for Seasoned Employees\n11 5/03 Job Stress and Careers\n12 5/10 The Intersection of Work and Family Roles: Implications for Career Management\n13 5/17 Managing Diversity\n14 5/24 Entrepreneurial Careers\n15 5/31 The Role of Strategic Human Resource Management Systems in Career Management\n16 6/07 Closing Thoughts on Career Management/Final Presentation 1 \n17 6/14 Final Presentation 2\n18 6/21 Final week",
    "scorePolicy": "Attendance 20%\nMid-term presentation and report 40% \nFinal presentation and report 40%",
    "materials": "Course materials will be prepared by the instructor.\n\nOptional:\n\nGreenhaus, J. H., Callanan, G. A., & Godshalk, V. M. (2009). Career management (4th ed.). Sage.",
    "consultation": "The best way to reach out to me is through my email: scheng@ntut.edu.tw. I am happy to speak with you during my office hours (10AM-noon on Mon/Thu)",
    "remarks": "Google Meet will be used in case in-person classes are suspended due to the pandemic. The instructor will send an invitation link to the whole class in advance.",
    "foreignLanguageTextbooks": true
  }
]
