[
  {
    "name": "王錫九",
    "email": "sjwang@ntut.edu.tw",
    "latestUpdate": "2022-12-18 19:37:04",
    "objective": "本「材料分析」課程主要建構於晶體繞射學、顯微術、光譜學三大基礎原理，旨在闡釋固態材料內部與表面的晶體結構、顯微結構和化學成分之分析技術。現代科技探究精密、準確與高解析度，本課程逐步精要剖析 X 光繞射儀、各式光學和電子顯微鏡、掃描探針顯微鏡、歐傑電子能譜儀、二次離子質譜儀、核磁共振波譜儀、各式光譜儀，以及其他如熱分析、同步輻射與中子分析等分析儀器，特別應用案例解析與討論，以增進對先進新穎材料的認識，使學生得以了解並深入各種常見材料分析的原理、方法及其應用。\nThis \"characterization of materials\" course is mainly based on three fundamental principles of crystal diffractometry, microscopy and spectroscopy; and aims to illustrate the characterization techniques of crystal structure, microstructure and chemical composition inside and on the surface of solid materials. Exploring precision, accuracy and high resolution of modern science and technology, this course gradually analyzes X-ray diffractometer, various optical and electron microscopy, scanning probe microscope, AES, XPS, SIMS, NMR, all kinds of spectrometers, as well as other analytical instruments such as thermal analysis, synchrotron radiation and neutron analyses. Special application case study and discussion are provided to enhance the understanding of advanced and novel materials, so that students can know well and fully utilize a variety of important materials analysis technique and their principles, methodology and proper applications.",
    "schedule": "w1 -2 Resistivity.\n\nw3-4 Carrier and Doping Density.\n\nw5-6  Contact Resistance, Schottky Barriers, and Electromigration.\n\nw7-8  Series Resistance, Channel Length and Width, Threshold Voltage, and Hot Carriers.\n\nw9-10 Defects.\n\nw11-12 Oxide and Interface Trapped Charges, Oxide Integrity.\n\nw13-14 Carrier Lifetime.\n\nw15-16 Mobility.\n\nw17-18 Optical Characterization.\n\nw19-20 Chemical and Physical Characterization.",
    "scorePolicy": "one oral report to score \nThe report will be favor to present the characterization technique and knowledge about your research work and with 30 minutes.",
    "materials": "\"Semiconductor Material and Device Characterization\" Author(s):Dieter K. Schroder,",
    "consultation": "Consulting can be by:1.e-mail sjwang@ntut.edu.tw2. mobile phone: 0916320396",
    "remarks": "如遇疫情嚴重時，依照學校及教育部的規定從事相關教學工作",
    "foreignLanguageTextbooks": true
  }
]
