[
  {
    "name": "曹筱玥",
    "email": "sytsau@ntut.edu.tw",
    "latestUpdate": "2022-12-25 19:42:19",
    "objective": "This course is focused on introducing the knowledge for human-computer interaction (HCI) design, accompanying with design practice. This will allow students to understand the process of user interface design and related application, so as to be capable of practical interface design. The contents include conceptual model, interface usability, HCI process, user requirements, interface prototyping, principles of interface design and user testing. The course is preceded by means of lecturing, case study and practical work, and evaluated by students' reports, oral presentation and design work",
    "schedule": "Week\tContent\n1\t\tCourse introduction\n2~10\tCourse by Prof. Tsao\n10\t        Human computer system, input/output, control and display design\n11\t\tHCI theory, human cognition and mental model\n12\t\tHCI paper study and report\n13\t\tUsability engineering\n14\t\tTask analysis, information architecture\n15\t\tHCI, usability study project proposal\n16\t\tProgress discussion\n17\t\tHCI, usability study project presentation\n18\t\tCourse summary and report submission",
    "scorePolicy": "Paper study and report 20%, Final project 30%",
    "materials": "Jenny Preece, 1994, Human-Computer Interaction, Pearson: London.\nJakob Nielsen, 1993, Usability Engineering. Morgan Kaufmann: San Francisco.\nLouis Rosenfeld, Peter Morville, Jorge Arango, 1998, Information Architecture. O'Reilly Media Inc: Sebastopol.\nMark Sanders, Ernest McCormick, 1986, Human Factors In Engineering and Design. McGraw-Hill Education.",
    "consultation": "https://ixd.ntut.edu.tw/p/406-1089-89584,r1713.php?Lang=zh-tw",
    "remarks": "If the physical class is suspended due to the COVID-19, the Google Meet will be used.Google Meet URL will be announced at “北科 i 學園 \"If you have any questions, please contact sytsau@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "蕭雨青",
    "email": "bluerain@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-21 22:53:09",
    "objective": "本課程之目標在於介紹人機介面設計過程中所需了解之相關專業知識，俾使學生能在進行互動介面設計中，具備充分之理論基礎，同時了解人機介面設計之相關研究與應用，始其具有能進行人機使用者介面實務製作與企劃之能力。課程內容包含介面設計概念模式、介面使用性、人機介面設計程序、使用者需求、介面原型設計、介面設計原則以及使用者測試與評估等。教學將以課堂講授、個案研討以及實作等方式進行，並以報告繳交與課堂發表及作品為評量依據。\nThis course is focused on introducing the knowledge for human-computer interaction (HCI) design. Students can understand the basic knowledge, application and research relevant to HCI design, which make them to be capable of practical interface design and planning. This course is set up under the structure of Human-Machine-Scenario theory and case study. The contents include concept model of interface design, interface usability, HCI process, user requirements, interface prototyping, principles of interface design and user testing. The course is preceded by means of lecturing, case study and practical work, and evaluated by students' reports, oral presentation and design.",
    "schedule": "Week\tContent\nW 01. Course introduction\nW 02. UX design - user research\nW 03. UX design - wireframe & prototype\nW 04. UX design - visual design & mockup\nW 05. Visit National Palace Museum (故宮)\nW 06. Project presentation\nW 07. Visit Speed 3D Inc. 啟雲科技\nW 08. Visit TECHARTGROUP 天工開物\nW 09. Visit Two.Dot 兩打半\nW 10. Visit Peppercorns 黑川互動\nW 11. Visit Axis 3D Technology 愛迪斯科技\nreality.\nW 12. Use your illusions1: Sci-Fi Movies have led us to the Matrix already!\nW 13. Use your illusions2: UI interface for virtual reality\nW 14. Use your illusions3: in metavese, you see…what?\nW 15. Use your illusions4: workshop\nW 16. Workshop-welcome to your own metaverse!\nCreate your own metaverse involving chatbot, NPC (non-player character), and virtual \nW 17. Presentation\nW 18. Course summary and report submission",
    "scorePolicy": "Paper study and report  / Attendance 30%, \nWorkshop project 30%\nFinal project 40%",
    "materials": "self-made materials",
    "consultation": "bluerain@mail.ntut.edu.tw",
    "remarks": "Implement the teleconference by Teams (Mail contact confirmation)",
    "foreignLanguageTextbooks": false
  }
]
