[
  {
    "name": "曹筱玥",
    "email": "sytsau@ntut.edu.tw",
    "latestUpdate": "2022-12-25 19:39:19",
    "objective": "This special topic is a continuous course within two semesters. This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of graduate of interactive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of interactive media design. Therefore, one of the aims of this course is to construct a multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate an interactive media design project. The course is preceded by means of lecturing, case study and practical work, and evaluated by students' reports, oral presentation and design work.",
    "schedule": "The thesis progress would be arranged by supervisors respectively.",
    "scorePolicy": "1. Final project ( Location is TBD) 50 ％\n2. Evaluation by supervisor  30％\n3. Attendance   20%",
    "materials": "None",
    "consultation": "https://ixd.ntut.edu.tw/p/406-1089-89584,r1713.php?Lang=zh-tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "黃儀婷",
    "email": "evie.ting.huang@gmail.com",
    "latestUpdate": "2022-12-21 11:31:07",
    "objective": "This special topic is a continuous course within two semesters. This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of graduate of interactive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of interactive media design. Therefore, one of the aims of this course is to construct a multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate a interactive media design project.",
    "schedule": "Week01 Introduction\nWeek02 Exploration: Field\nWeek03 Exploration: Topic\nWeek04 Exploration: Keywords\nWeek05 Ideas\nWeek06 Research vs Design\nWeek07 Research vs Engineering\nWeek08 Publications\nWeek09 Conference Papers\nWeek10 Journal Publications\nWeek11 Proposal Development\nWeek12 Proposal Development\nWeek13 Proposal Development\nWeek14 Proposal Development\nWeek15 Abstract\nWeek16 Outline\nWeek17 Proposal Writing\nWeek18 Final Proposal",
    "scorePolicy": "Participation 50%\nProposal 50%",
    "materials": "None",
    "consultation": "ythuang@mail.ntut.edu.tw",
    "remarks": "Google Classroom:https://classroom.google.com/u/1/c/MTAwODExMzA1NDQx",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "戴楠青",
    "email": "nctai@ntut.edu.tw",
    "latestUpdate": "2022-12-20 20:35:23",
    "objective": "Group discussions to develop thesis topics.",
    "schedule": "Week01 Introduction\nWeek02 Exploration: Field\nWeek03 Exploration: Topic\nWeek04 Exploration: Keywords\nWeek05 Ideas\nWeek06 Research vs Design\nWeek07 Research vs Engineering\nWeek08 Publications\nWeek09 Conference Papers\nWeek10 Journal Publications\nWeek11 Proposal Development\nWeek12 Proposal Development\nWeek13 Proposal Development\nWeek14 Proposal Development\nWeek15 Abstract\nWeek16 Outline\nWeek17 Proposal Writing\nWeek18 Final Proposal",
    "scorePolicy": "Participation 50%\nProposal 50%",
    "materials": "None",
    "consultation": "If there is any question, please contact instructor, Nan-Ching Tai, nctai@mail.ntut.edu.twOffice Hours:Mon: 14:00-17:00Fri: 09:00-12:00",
    "remarks": "Google Classroom:https://classroom.google.com/u/1/c/MTAwODExMzA1NDQxnctai@mail.ntut.edu.tw",
    "foreignLanguageTextbooks": false
  }
]
