[
  {
    "name": "曹筱玥",
    "email": "sytsau@ntut.edu.tw",
    "latestUpdate": "2022-12-25 19:42:19",
    "objective": "This course is focused on introducing the knowledge for human-computer interaction (HCI) design, accompanying with design practice. This will allow students to understand the process of user interface design and related application, so as to be capable of practical interface design. The contents include conceptual model, interface usability, HCI process, user requirements, interface prototyping, principles of interface design and user testing. The course is preceded by means of lecturing, case study and practical work, and evaluated by students' reports, oral presentation and design work",
    "schedule": "Week\tContent\n1\t\tCourse introduction\n2~10\tCourse by Prof. Tsao\n10\t        Human computer system, input/output, control and display design\n11\t\tHCI theory, human cognition and mental model\n12\t\tHCI paper study and report\n13\t\tUsability engineering\n14\t\tTask analysis, information architecture\n15\t\tHCI, usability study project proposal\n16\t\tProgress discussion\n17\t\tHCI, usability study project presentation\n18\t\tCourse summary and report submission",
    "scorePolicy": "Paper study and report 20%, Final project 30%",
    "materials": "Jenny Preece, 1994, Human-Computer Interaction, Pearson: London.\nJakob Nielsen, 1993, Usability Engineering. Morgan Kaufmann: San Francisco.\nLouis Rosenfeld, Peter Morville, Jorge Arango, 1998, Information Architecture. O'Reilly Media Inc: Sebastopol.\nMark Sanders, Ernest McCormick, 1986, Human Factors In Engineering and Design. McGraw-Hill Education.",
    "consultation": "https://ixd.ntut.edu.tw/p/406-1089-89584,r1713.php?Lang=zh-tw",
    "remarks": "If the physical class is suspended due to the COVID-19, the Google Meet will be used.Google Meet URL will be announced at “北科 i 學園 \"If you have any questions, please contact sytsau@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
