[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2022-12-20 23:50:03",
    "objective": "This course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\nThe curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.\nStudents suppose to achieve to Chinese level 4(HSK4 or TOCFL B). There are more Chinese speaking in class, and discuss the issues which are connected to Taiwan or Chinese culture. Present your opinion in class is necessary.",
    "schedule": "Week 1 introduce\nWeek 2 Holiday\nWeek 3 <This movie is great>\nWeek4 Grammar U8-10\nWeek 5 <Bad habits>\nWeek 6 Grammar U11-13\nWeek 7 Holiday\nWeek 8 Review\nWeek 9 Midterm\nWeek 10 <About relationship>\nWeek 11 Grammar U13-15\nWeek 12 <Women's poistion>\nWeek 13 Grammar U16-18\nWeek 14 <Economic Development>\nWeek 15 Grammar U19-21\nWeek 16  <Story telling>\nWeek 17  Grammar U22-24\nWeek 18  Final",
    "scorePolicy": "Attendance 20%\nMidterm 30%\nDiscussion and conclusion 20%\nFinal 30%\nspeaking is necessary in class",
    "materials": "1.<實用視聽華語 4 Practical audio-visual Chinese book 4>，范慧貞，劉秀芝，蕭美美等人著，正中書局。\n2.< 看圖學中文語法：進階篇\nThe Ultimate Illustrated Chinese Grammar Guide: Advanced Level > 劉崇仁著，聯經出版。\n3.< 寓言 >，楊琇惠著，五南。",
    "consultation": "Email : sweetprettylover@gmail.comFor helping you well, please tell me about your basic background(inc. your nationality) and situation first.Line ID: drprettyIt's for emergency case.",
    "remarks": "Line ID: drprettyIt's for emergency case.The materials and video recording would be uploaded on I-school Plus and be uploaded to iCloud, you can find the link on Line Group.The online meeting room is with MS Teams.",
    "foreignLanguageTextbooks": false
  }
]
