[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2022-12-20 23:17:10",
    "objective": "This course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.\nThis class is for the students who are foreigners and the Chinese level is basic. There is 2 sections for this basic class. First section, we had learned the basic Hanyu pinyin and daily conversation. Students might achieve to A1 level . In this semester, let's head to A2. Daily conversation is getting complicated and we need to bring them in real life. Some simple texts would be read, expand to more vocabulary, writing and listening are the abilities should to be trained a lot. Students need to practice hard in class and in private.",
    "schedule": "week 1 introduce\nweek 2 review (bring your handouts which I assigned last semester)\nweek 3 vocabulary expand\nweek 4 grammar and texts structure\nweek 5 number and daily life: list, buy a ticket, \nweek 6 number and daily life : make a phone call discount\nweek 7 colors and dress\nweek 8 colors and makeup\nweek 9 assignment\nweek 10 direction, location\nweek 11 place and map \nweek 12 adventure: shopping and go to convenience stores\nweek 13 body and organs\nweek 14 see a doctor: illness\nweek 15 house and furniture\nweek 16 go to bank\nweek 17 I need a vacation \nweek 18 Final task",
    "scorePolicy": "attendance(inc. attitude) 20%\nassignment 30%\nDiscussion 20%\nFinal task 30%\nspeaking is necessary in class\nYou can bring any Chinese texts to class for discussing.",
    "materials": "Handout (Download it before you're in class)\n1.< 當代中文課程課本 1,2\nA Course in Contemporary Chinese (Textbook) 1,2 > 鄧守信，王佩卿，陳慶華，黃桂英著，聯經出版公司。\n2.< 看圖學中文語法：基礎篇\nThe Ultimate Illustrated Chinese Grammar Guide: Basic Level > 張黛琪著，聯經出版公司。\n3. 實用華語單句書 楊琇惠五南出版 /integrated Chinese lvl2 Cheng & Tsui Company/ 華語文閱讀測驗初級篇 楊琇惠 五南出版",
    "consultation": "Email : sweetprettylover@gmail.comFor helping you well, please tell me about your basic background(inc. your nationality) and situation first.Line ID: drprettyIt's for emergency case.",
    "remarks": "The materials and video recording would be uploaded on I-school Plus and be uploaded to iCloud, you can find the link on Line Group.The online meeting room is with MS Teams.",
    "foreignLanguageTextbooks": false
  }
]
