[
  {
    "name": "陳煒朋",
    "email": "wpc@ntut.edu.tw",
    "latestUpdate": "2022-12-19 16:57:08",
    "objective": "本課程主要介紹期貨、選擇權與相關衍生性金融商品的理論基礎與實務概念，了解衍生性金融商品在套利、避險與投機策略上的應用。課程內容包含期貨與選擇權兩個部分：在期貨議題方面，主要介紹期貨市場的組織結構、期貨契約的理論價格、以及避險策略；在選擇權議題方面，則是涵蓋選擇權市場的介紹、選擇權的理論價格、交易策略、與市場資訊分析。藉由對期貨與選擇權理論基礎的建構，期望能強化同學對於衍生性金融商品的實務應用能力。\nThis course is designed to introduce students to the theoretical and practical aspects of financial futures, options, and other derivatives. Derivatives have become one of the most important tools of modern finance, from both the academic and the practical standpoint. They are used for compensation, speculation, yield enhancements of investments, and, most importantly, for risk management. This course consists of two parts. The first part of the course deals with futures issues including the structure of futures markets, pricing of futures contracts, and hedging with such contracts. The second part of the course deals with options issues including options markets, strategies, pricing, and hedging analysis. Students will learn about the theoretical underpinnings and the practical applications in real world of derivative securities.",
    "schedule": "1. 第 1 章 導論\n2. 第 2 章 期貨市場之運作\n3. 第 3 章 使用期貨的避險策略\n4. 第 4 章 利率 \n5. 第 5 章 遠期和期貨價格的決定\n6. 第 6 章 利率期貨合約\n7. 第 7 章 交換合約\n8. 第 9 章 選擇權市場之運作\n9. 期中考\n10. 第 10 章 股票選擇權的特質\n11. 第 11 章 選擇權的交易策略\n12. 第 12 章 二項樹之簡介\n13. 第 13 章 股票選擇權之評價： Black- Scholes - Merton 模型\n14. 第 14 章 員工股票選擇權\n15. 第 15 章 股價指數與外幣選擇權\n16. 第 16 章 期貨選擇權與 Black’s 模型\n17. 第 17 章 希臘字母\n18. 期末考",
    "scorePolicy": "先修課程：統計學、投資學\n期中考 (Midterm Exam)：40%\n期末考 (Final Exam)：40%\n出席與作業 (Assignment)：20%",
    "materials": "教科書：\n黃泓人編譯，期貨與選擇權市場 9e，華泰書局。\nJohn C. Hull, Fundamentals of Futures and Options Markets, 9th Edition, 2017. Pearson Prentice Hall. (8th Edition, 2017, 雙葉書局)\n\n參考書：\nJohn C. Hull, Options, Futures, and Other Derivatives, 9th Edition, 2018. (Global Edition) Pearson Prentice Hall. (雙葉書局)\n張傳章，期貨與選擇權概論，第三版，2018 年。(雙葉書局)",
    "consultation": "學生加退選簽核及諮詢課程問題管道：研究室：科研大樓 940 室 Email： wpc@ntut.edu.tw 分機：6721Office Hours：可隨時 Email 聯繫約時間",
    "remarks": "若因疫情而暫停實體上課時，將使用 Microsoft Teams 視訊上課，會議網址將公告於北科 i 學園，或請洽 wpc@ntut.edu.tw (分機 6721) 詢問。",
    "foreignLanguageTextbooks": false
  }
]
