[
  {
    "name": "陳國樑",
    "email": "glchen33@nstc.gov.tw",
    "latestUpdate": "2023-02-03 11:21:02",
    "objective": "本課程探討當今新科技產業發展趨勢與國家政策推動，觀察科技政策與國家競爭力的影響，並以全球化的產業觀點、現今前瞻新科技的運用發展及各國案例討論方式，幫助同學了解高科技產業發展與國家推動策略，進而培養國際觀及全球化視野。課程內容注重理論與實務，會以演練及個案研究為主要教學內容。\nThis course discusses the development trend of today's new technology industry and the promotion of national policies, observes the impact of technology policies and national competitiveness, and helps students understand high technology with a global industrial perspective, the application and development of new technologies and case discussions in various countries Industrial development and national promotion strategies, and then cultivate an international outlook and a global perspective. The course content focuses on theory and practice, with drills and case studies as the main teaching content.",
    "schedule": "第一週  課程說明（評分標準、考試方式、報告規定）\n       新科技產業趨勢介紹\n第二週  我國科技發展與挑戰\n第三週  創新創業與創新思維\n第四週  美中貿易戰局勢下之科技機會與策略\n第五週  半導體與全球產業發展\n第六週  專題演講與座談 (一)\n第七週  淨零科技發展對臺灣帶來的轉變 (一)\n第八週  我國及各國太空科技發展現況趨勢\n第九週  期中報告  \n第十週  專題演講與座談 (二) \n第十一週  各國高齡科技產業及策略發展\n第十二週  人工智慧跨域發展與產業的鏈結\n第十三週  國際智慧移動 (Smart Mobility) 發展與挑戰\n第十四週  專題演講與座談 (三)\n第十五週  臺灣疫後的數位轉型與升級\n第十六週  建立國際觀與全球化視野－大陸與臺灣的互動\n第十七週  期末報告",
    "scorePolicy": "1. 分組作業 50%：分組與報告\n2. 課堂討論 50%：課堂發言 (含出席討論內容、提問和答辯)、個人與分組之完成次數、正確度和完整度）\n3. 當次未出席課程或未參與課堂討論，該次不計分。學期僅出席部分堂數的組員，則依出席比例計分。\n4. 無法到課或遲到早退，請務必至校務系統請假，如有事需早退，請務必先通知老師。\n(評量方式視疫情滾動調整)",
    "materials": "1. Why Nations Fail: The Origins of Power, Prosperity, and Poverty\n    ( Daron Acemoglu、James A. Robinson)\n2. Sapiens: A Brief History of Humankind\n    (Yuval Noah Harari)\n3.Managing Technology and Innovation for Competitive Advantage \n    (V.K. Narayanan)\n4. Management of Technology and Operations\n    (R. Ray Gehani)\n5. The Wealth and Poverty of Nations\n    (David S. Landes)\n6.Evolution and Institutions: On Evolutionary Economics and the Evolution of Economics\n    (Geoffrey M .Hodgson)\n7.The Structure of Scientific Revolutions\n    (Thomas S.Kuhn)\n8.History of economic analysis\n    ( Joseph A. Schumpeter)",
    "consultation": "學生有任何問題可電郵 Emai:glchen33@nstc.gov.tw 與我溝通聯繫",
    "remarks": "1. 本課程重視出席率，準時到課及課堂學習態度 2. 採問題導向與團隊合作學習，適合願意及主動學習的同學。",
    "foreignLanguageTextbooks": false
  }
]
