[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2023-04-22 15:57:14",
    "objective": "課程重點：(1) 藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2) 使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3) 熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4) 透過練習加強聽、說、讀、寫的知能及表達。\nThis course is designed (1) to strengthen students' previously acquired knowledge in English with basic grammatical ideas and sentence patterns reviewed through reading materials appropriate to their levels; (2) to develop reading skill by giving explanations of difficult words, phrases, and syntax, as well as analysis of basic writing skill; (3) to familiarize students with useful expressions in conversation and build up their confidence in cross-cultural communication; (4) to reinforce the competence and performance of listening, speaking, reading and writing by practice.",
    "schedule": "Subject to change:\n\nWeek 1 Introduction\nWeek 2 Holiday\nWeek 7 Holiday\nWeek 9 Mid-term week. Consultation (no class)\nWeek 17 Holiday\nWeek 18 Finals week. Consultation (no class)",
    "scorePolicy": "Evaluation (subject to change):\n\nMid-term 10%\nPresentation 30%\nIn-class quizzes** 30%\nParticipation and attendance 30%\n\n*At the lecturer’s sole discretion, a makeup exam or test may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of exam or test. The format of the makeup exam will be determined by the lecturer.\n\n**There is no makeup quiz. If you present a note of approval for leave from the university system for the date of the quiz no later than 5 days after such date, your score for this component will exclude the quiz given on such date.\n\nAttendance policy\nYou will automatically fail the course (0%) with 8 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system.",
    "materials": "Wider World Student’s Book 2, Pearson, 2020",
    "consultation": "Students may make consultation appointments during office hours with the lecturer in advance by email.",
    "remarks": "Online classes may be conducted on google.",
    "foreignLanguageTextbooks": true
  }
]
