[
  {
    "name": "薩克提",
    "email": "sakthinathan1988@gmail.com",
    "latestUpdate": "2023-01-18 15:05:17",
    "objective": "由量子化學及結晶化學等理論為基礎，討論一些分析儀器的原理，構造及應用。特別是原子光譜法，電化學分析法及離子層析儀及質譜儀等，針對無機物之分析方法。\nConsidering the theories of quantum and crystal chemistry, discuss the theories, structure and applications of some instruments.  Those are used for chemical analysis, especially for inorganic materials: atomic spectroscopy, electrochemical analysis methods, ion-exchange chromatography and mass spectroscopy.",
    "schedule": "Material Chemistry\nAllotropes of carbon-fullerene (C60), 1D, 2D, and 3D carbon nanostructure, and graphene. Boron materials: borophene, and borospherene, Metals alloys, delafossite material, zeolites, Microporous, and mesoporous materials: Structure, properties, and application. semiconductors, superconductors, insulators, ceramics, and glass. \nElectrochemistry\nVoltammetry: Cyclic voltammetry, linear sweep voltammetry, differential pulse voltammetry, amperometry, chronopotentiometry, oxidations, and reductions. Types of electrode and electrode reactions: Standard Electrode Potentials, Standard Hydrogen Electrode, Calomel electrode, Carbon electrodes, Microelectrodes, Ultra-micro electrodes, Ion-selective electrodes, porous electrodes, Semiconductor electrodes, Hydrodynamic/Rotating disk electrodes. Electrolytes, classification of electrolytes, liquid, solid electrolytes. Reversible, quasi-reversible, and Irreversible electrode processes, Characteristics of commonly used working electrodes such as glassy carbon, pyrolytic graphite, platinum, and reference electrodes. Liquid junction potential, salt bridge, conductometric and potentiometric titrations (acid-base).\nModified electrodes and their application, Electrochemical sensor: Fundamentals of electrochemical sensors, Electrochemical sensor for food and water analysis, Electrochemical DNA sensors. Design of third-generation electrochemical sensors. Electroanalytical chemistry in neuroscience. Electrochemistry sensors of biological molecules like glucose, insulin, and cholesterol. Electrochemical impedance spectroscopy and their application. Electrochemical quartz crystal microbalance and its applications. Electrochemical cell-redox reaction, electrode potential, EMF. Corrosion: Basics, chemical, and electrochemical principles corrosion, and electrodeposition. Electrochemical CO2 reduction, Electrochemical detection of environmental pollutants.\nElectrochemical devices and techniques: Fundamental concepts of electrochemical energy conversion and storage, irreversible systems. Supercapacitors and their working principle. Electrochemical energy systems, lithium batteries, photocathode.  Fuel cells: Electrode materials, fuel cell research. Batteries: Principles of operation of cells and batteries; Electrochemical principles and reactions; Factors affecting battery performance; Battery design; Fundamentals of Primary cells and batteries, secondary batteries, Advanced lead-acid, Ni-based and lithium-ion batteries, next-generation batteries, materials for batteries, batteries electrode preparation, cell assembly, electrochemical performance analysis. Fuel cells: Introduction to fuel cells: working principle, direct methanol fuel cells, proton exchange membrane fuel cells, alkaline fuel cells, phosphoric acid, solid oxide, molten carbonate Fuel cells. \nDebye - Huckel - Onsager Equation, Kinetics- over-potential, Butler Volmer equation, Tafel equation, Nernst equation. Electrochemical cells: Galvanic cell, Daniel cell, Half-cell, Overpotential, Oxidation potential, Reduction potential. The rate of charge transfer, Current density, Ionic equilibria, Electro Kinetic Phenomena, Electrical double layer potential, Zeta potential, electro-osmosis, and sedimentation potential.",
    "scorePolicy": "Exam, Report and Seminar",
    "materials": "1.\tArun Bahl, Essential of Physical Chemistry (M.E), S. Chand Limited, 2010, ISBN, 8121929784, 9788121929783\n2.\tAllen J. Bard, Larry R. Faulkner, Electrochemical Methods: Fundamentals and Applications, 2nd Edition, ISBN: 978-0-471-04372-0\n3.\tRichard G Compton (Oxford) and Craig E Banks (Manchester Metropolitan University, UK) Understanding Voltammetry, 2nd Edition, https://doi.org/10.1142/p726 | November 2010\n4.\tJohn Newman, Nitash P. Balsara, Electrochemical Systems, 4th Edition, ISBN: 978-1-119-51460-2\n5.\tJournal Research Papers, and Online sources.",
    "consultation": "email and line ext 2791",
    "remarks": "TEAMS",
    "foreignLanguageTextbooks": true
  }
]
