[
  {
    "name": "曾俊儒",
    "email": "ktseng@pddlab.org",
    "latestUpdate": "2022-12-23 14:10:02",
    "objective": "Brundtland 報告在 1987 年將永續發展定義為「在不損害後代子孫滿足其自身需求的能力的前提下滿足當前需求的發展。」17 個永續發展目標依循千禧年共同訂定發展目標的成功基礎上延展，其中包括諸如氣候變化，經濟不平等，創新，可持續消費，和平與正義等新領域。17 個永續發展目標更於 2016 年 1 月成為聯合國致力發展推動政策及生效直至 2030 年。本課程旨在探討研究「永續發展」新概念和理論基礎。課程論述著重於工業化國家（尤其是台灣地區）的永續性問題，例如教育，可持續消費等。課程中透過創新產品設計與開發方法來系統化引導學生探索有關可持續性，經濟和技術層面以及相關知識社會學，並嘗試帶領學生提出具可行性的新產品、系統及服務概念，為當前狀態下提供更好的友善環境解決方案。課程期待學生透過修習該課程，應可以掌握跨學科永續發展的設計原理，並教導如何藉由創新產品設計和開發方法來引導不同永續相關背景和設計背景的專業人員合作以瞭解開發市場上成功之環境友善產品之關鍵課題，針對環境需求，提出創新友善環境解決方案並進而產生創新環境友善產品。\nSustainable development is defined by Brundtland Report (1987) as “development that meets the needs of the present without compromising the ability of future generations to meet their own needs.” There are 17 Sustainable Development Goals (SDGs) built on the successes of the Millennium Development Goals, including new areas such as climate change, economic inequality, innovation, sustainable consumption, peace and justice, among other priorities. The 17 SDGs came into effect in January 2016, and they will continue to guide UNDP policy and funding until 2030. This course aims to explore alternative conceptions and theoretical underpinnings of the notion of “sustainable development.” It intends to use the IPDD approach systematically to explore the sociology of knowledge around sustainability, the economic and technological dimensions and institutional imperatives along with implications for the political constitution of economic performance and design the feasibility of new products, systems, or services for better solutions in current status. To enable students to master the principles of interdisciplinary sustainable development, and teach them how to use innovative product design and development approaches to guide professionals in sustainability backgrounds and design backgrounds to understand the key issues in developing successful sustainable products in the market and address the needs of consumer services, propose innovative solutions for the environment, and develop innovative sustainable products.",
    "schedule": "TThis course aims to help postgraduate students developing several fundamental skills associated with conducting scientific research. In particular, it aims to improve the ability of students to plan, design, manage and execute scientific research whilst providing opportunities for formative assessment and rapid feedback. The pre-selected research topic entitled “rural education and sustainable development goals.” Therefore, the following design topics for sustainability will be discussed in this course:\n•\tDesigning rural school\n•\tInnovation in rural education\n•\tEtc.",
    "scorePolicy": "One written assignment:\t    30%\n•\tStudents can freely use the workshop finding and extend any thought they can put his/her hands on from any academic database.\n•\tPresent observations and comments on the data gathered (mainly applying the concepts related to new product development covered in the classes) in a Twelve-page proposal (and the students can attach any figures or graphs as he/she wishes, but submit just one synthesized file). \n \nClass presentation/discussion: 30%\nClass participation: \t10%\nFinal project: 30%\nTwelve-page proposal: 30%",
    "materials": "•\tReading pack.\n•\tMaddock M. and Uriarte L. (2011). Brand New: Solving the Innovation Paradox – How Great Brands Invent and Launch New Products, Services and Business Models. John Wiley & Sons, Inc., Hoboken, New Jersey.\n•\tSustainability Journal\n•\tSustainable Development Journal",
    "consultation": "Wednesday discussion by appintment",
    "remarks": "若因疫情而暫停實體上課時，將使用 Google Meet 視訊上課，會議網址 meet.google.com/cbj-omuh-cgp, 或相關加退選請洽 ktseng@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
