[
  {
    "name": "陳斌豪",
    "email": "binhao17@mail.ntut.edu.tw",
    "latestUpdate": "2022-12-21 11:51:34",
    "objective": "Heat and Mass Transfer is a vital subject for mechanical, chemical, production, aeronautical \nand metallurgical engineering disciplines. As a result of its multidisciplinary nature, it has \nmany engineering applications. This course will introduce to students basic understanding of \nheat and mass transfer processes and their application to engineering problems. T",
    "schedule": "Week 1.  INTRODUCTION – Typical heat transfer situations, Modes of heat transfer Introduction to laws, some heat transfer parameters \nWeek 2.  CONDUCTION – Fourier’s law and thermal conductivity 1 hour \nDifferential equation of heat conduction, boundary conditions and initial conditions \nWeek 3.  Simple one dimensional steady state situations – plane wall, cylinder, sphere (simple and compex situations), concept of thermal resistance, concept of U, critical radius. variable thermal conductivity (exercise) 3 hours \nWeek 4.  Special one dimensional steady state situations – heat generation, pin fins Other fin configurations (exercise) \nWeek 5.  Two dimensional steady state situations \nTransient conduction Lumped capacitance model One dimensional transient problems – analytical solutions One dimensional Heisler charts Product solution \nWeek 6.  Numerical methods in conduction Steady state one dimensional and two dimensional problems One dimensional transient problems – Explicit and implicit \nWeek 7.  RADIATION Basic ideas, spectrum, basic definitions 1 hour \nLaws of radiation, black body radiation, Planck’s law, Stefan Boltzman law, Wien’s Displacement law, Lambert cosine law \nWeek 8.  Convection heat transfer\nFORCED CONVECTION Concepts of fluid mechanics  \nDifferential equation of heat convection  \nWeek 9. Mid term\nWeek 10.  Laminar flow heat transfer in circular pipe – constant heat flux and constant wall temperature, thermal entrance region, Turbulent flow heat transfer in circular pipe, pipes of other cross sections  \nWeek 11.  Heat transfer in laminar flow and turbulent flow over a flat plate, Reynolds analogy, Flow across a cylinder and sphere, flow across banks of tubes, impinging jets \nWeek 12.  NATURAL CONVECTION Introduction, governing equations,Vertical plate – Pohlhausen solution, horizontal cylinder, horizontal plate, enclosed spaces  \nWeek 13.  HEAT EXCHANGERS Types of heat exchangers, LMTD approach – parallel, counter-flow, multi-pass and cross flow heat exchanger, NTU approach – parallel, counterflow, shell and tube, cross flow heat exchanger \nWeek 14.  Condensation and Boiling Dimensionless parameters, boiling modes, correlations, \nWeek 15.  Forced convection boiling, laminar film condensation on a vertical plate, turbulent film condensation  \nWeek 16.  Mass Transfer Analogy between heat and mass transfer, mass diffusion, Fick’s law of diffusion, boundary conditions, \nweek 17.  steady mass diffusion through a wall, transient mass diffusion, mass convection, limitations of heat and mass transfer analogy. \nWeek 18 final term",
    "scorePolicy": "出席 10%\n作業 20%\n期中考 30%\n期末考 40%",
    "materials": "Fundamentals of Heat and Mass Transfer / Incropera, DeWitt",
    "consultation": "office hours 至綜合科館 526-16R",
    "remarks": "1. 因應疫情 111-2 學期採遠距教學。2. 於 i 學員公告，並提供教材與下載平台。3. 上課網址以 google meets 為主 https://meet.google.com/vid-chxp-cyn",
    "foreignLanguageTextbooks": true
  }
]
