[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2022-12-23 12:35:03",
    "objective": "Advanced Robotics and Automation Applications (ARAA) course is offered only for up to 28 graduate students with programming experience. In addition to lectures on robotic manipulation, ARAA requires oral presentations and reports on robotics papers also focuses on projects with mobile robots and manipulators in the topics of interest related to:\n\n1. Spatial descriptions and transformations  2. Manipulator kinematics  3. Manipulator inverse kinematics  4. Paper presentation and report  5. Project topics: manipulator and mobile robot control, and robot control system based on visual sensing\n\nCourse handouts will be available via iStudy web. In addition to homework assignments, a number of quizzes will be taken weekly during lectures. The quiz questions are based on problem sets in the textbook. Each student is required to make an oral presentation and submit a report based on a technical paper preferably related to proposed final project in related topics. All projects must be completed and evaluated in class under supervision of Professor and TA with particular attention to equipment operation safety.",
    "schedule": "Tentative schedule\n1\t02/23\tIntroduction\n2\t03/02\tSpatial Descriptions & Transformations\n3\t03/09\tRepresentations for Orientation\n4\t03/16\tForward Kinematics\n5\t03/23\tInverse Kinematic\n6\t03/30\tMobile Robot Control Project: Visual Tracking\n7\t04/06\tMobile Robot Control Project: Eye-in-Hand\n8\t04/13\tMobile Robot Control Project: Eye-to-Hand\n9\t04/20\tManipulator Control Project: Visual Tracking\n10\t04/27\tManipulator Control Project: Eye-in-Hand\n11\t05/04\tManipulator Control Project: Eye-to-Hand\n12\t05/11\tPaper presentation & Final Project (1/4)\n13\t05/18\tPaper presentation & Final Project (2/4)\n14\t05/25\tPaper presentation & Final Project (3/4)\n15\t06/01\tPaper presentation & Final Project (4/4)\n16\t06/08\tFinal Presentation and Demo\n17\t06/15\tFinal Project Report Due\n18\t06/22\tHoliday\n\nPS: The contents and order of lectures and projects will be adjusted according to actual needs",
    "scorePolicy": "The final grade will be a weighted average of attendance and homework quizzes 20%, paper presentation and report 20%, projects 40%, and final project 20%.",
    "materials": "1. Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company.\n2. Robotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke, Publication Year: 2013 | ISBN 3642201431 | 1st Edition",
    "consultation": "Prof. Wen-Chung Chang(02)27712171 Ext. 2125, wchang@ntut.edu.twOffice hours: Check official EE websiteTAs: Yi-Da Chen  t111318129@ntut.edu.tw、Che Huang t111318182@ntut.edu.tw, (02)27712171 Ext. 2130",
    "remarks": "※ Class offering：Course lecture and presentations will be offered online via Microsoft Teams at class hours and recorded lectures are available in iStudy.※ Evaluation：Following the same criterion but in a more flexible way.  Grading will be based on the same criterion but evaluated based on the adopted formats for each part of the course.※ Remote classes  ：Microsoft TeamsTA will provide related information in iStudy’s [Annoucements] and in class group such as Line afterwards.※ Supplement：Class group such as Line will be established in the first class.",
    "foreignLanguageTextbooks": true
  }
]
