[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-12-23 13:26:13",
    "objective": "While this course is designed for kindergarten, elementary school, junior high, and high school English teachers, non-teachers are also very welcome to join. If you like reading children’s literature and wish to improve your cultural knowledge and public speaking skills, this will be a useful course for you. Students will read engaging children’s and young adult literature, including picture books, classics, popular fiction, and multicultural stories, and learn to adapt these stories into materials suitable for students of a particular age group (or, for non-teachers, into materials suitable for office book clubs or volunteer activities). Creative learning activities will also be explored as methods to develop students' English proficiency and cultural awareness.\n\n本課程針對幼稚園、國小、與國中階段的英語師資而設計，在教材與教法的搭配上提供學理的引介與實務上的訓練。本課程設計考量這些階段學生之身心發展程度與興趣，將屬於兒童與青少年文學範疇的文本（例如：希臘神話、哈利波特系列、波西傑克森系列等等）作創意運用，幫助老師們擷取並改編合宜的教材，經由活潑的教學活動（包括：改編戲劇演出、繪本製作、歌唱舞蹈等等），提高學生的英語能力，也在培養他們體察文化差異的深層素養。",
    "schedule": "Each week, students will read a portion of a children's chapter book or YA novel. Texts chosen may include the following (though I will adapt the week-by-week syllabus over the break and may cut or add a text--contact me with any concerns):\n\nAlice's Adventures in Wonderland\nThe Year of the Dog\nThe Silver Chair\nProject Mulberry\nHarry Potter and the Sorcerer's Stone (or another Harry Potter text)\nPercy Jackson and the Sea of Monsters\nA Wrinkle in Time\nThe Devil's Arithmetic\n\nEvery week we will additionally explore one or more picture books (pre-K to grade 2--though, in foreign language classes, picture books are appropriate at any level). Some of the picture books we may explore include Hair Love, Trombone Shorty, the Poppleton series, the Frog and Toad series, The Name Jar, Elephant and Piggie, If the S in Moose gets Loose, and Llamaphones. We will also read some children's poetry, including Edward Lear poems, Ogden Nash poetry, and Hillaire Belloc. (Picture books will be read in class and will not usually require advance preparation.)\n\nStudents may also read short, useful articles on pedagogy and teaching methods.",
    "scorePolicy": "Students will be evaluated based on reading quizzes, informal lesson plan ideas, presentations/teaching demonstrations, and a final paper in which the students describe their hypothetical literature curriculum for an English club or class. \n\nAgain, while this course is especially designed for teachers, you certainly do not have to be a teacher to take this course, and non-teachers are very welcome.",
    "materials": "The texts we are using are listed in the schedule above.",
    "consultation": "Office hours will be held on Mondays from 3:00–6:00 and on Thursdays from 3:00–4:00. Appointments may be made if neither time works.",
    "remarks": "Students should download MS Teams and check it a few times per week, as it is the platform I rely on for class announcements and individual communication with students. Students who have COVID or are otherwise verifiably ill may contact me via MS Teams private chat (before class) in order to arrange a hybrid class.",
    "foreignLanguageTextbooks": true
  }
]
