[
  {
    "name": "郭政淳",
    "email": "kuojona@gmail.com",
    "latestUpdate": "2022-12-20 16:28:54",
    "objective": "本課程旨在探討英語與漢語在結構與功能上的主要異同，涵蓋語意、語音、音韻、詞法、句法、語用與社會文化等特徵，同時類比與對比這兩個語言使用何種語言策略達到溝通的目的。本課程之本質在訓練學生往後如何解決語言對比分析的問題，在學期結束時，學生需要針對英語與漢語某一特定語言現象獨立完成對比分析。\nThis course aims at investigating the major structural and functional differences and similarities of Chinese and English. The differences and similarities identified include semantic, phonetic, phonological, morphological, syntactic, pragmatic, and sociocultural features. We will also compare and contrast linguistic strategies the two languages employ to achieve communicative purposes. This course is exploratory in itself, directed toward providing students with keys to tackling linguistic issues they may encounter in their future careers. Students will be required to present an ultimate Chinese-English contrastive analysis in a certain aspect at the end of this course.",
    "schedule": "Week 1 Course Introduction\nWeek 2 Morphological Processes\nWeek 3 Syntactic Categories & Components of Sentences\nWeek 4 Contrastive Linguistics and Error Analysis\nWeek 5 Linguistic Typology and Parameters of Language\nWeek 6 Invited Talk (I) \nWeek 7 Holiday-No Class\nWeek 8 Sentence Structure and Basic Word Order\nWeek 9 Transitivity \nWeek 10 Tense and Aspect\nWeek 11 Interrogative\nWeek 12 Invited Talk (II)  \nWeek 13 Spatial Relations \nWeek 14 Temporal Expressions\nWeek 15 Emotions\nWeek 16 Student Presentation (I)\nWeek 17 Student Presentation (II)\nWeek 18 Term Paper due",
    "scorePolicy": "Participation \t\t\t\t20% \t\t\nAnalysis \t\t\t\t\t20%\nShort Reports\t\t\t\t10%\nResponse to Invited Talks\t10%\nPresentation\t\t\t\t20%\nTerm Paper\t\t\t\t20%",
    "materials": "Ke, Ping. 2019. Contrastive Linguistics. Springer.\n陳俊光。2012。對比分析與教學應用 [修訂版]。台北：文鶴出版社。\n\nSelected book chapters and journal articles (TBA).",
    "consultation": "Please contact the instructor via email.",
    "remarks": "Remote learning may take place in response to the pandemic. Please make sure you have access to Google Meet or Microsoft Teams.",
    "foreignLanguageTextbooks": false
  }
]
