[
  {
    "name": "劉俊麟",
    "email": "junlin@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-01 12:00:01",
    "objective": "理解機器學習 (Machine Learning) 的原理與應用是相對重要的，掌握機器學習相關之數學基礎將有助於理解機器學習使用方法之假設和局限性，輔以對機器學習較具經典代表性應用案例的深入探討，將有助於在面對新的問題時，能有效與快速地提出以機器學習為基礎的新興解決方案。課程將以兩部份來進行，第一部份介紹機器學習相關的數學基礎理論包含線性代數、幾何解析、矩陣分解、機率與最佳化等；第二部份則以第一部份之理論為基礎，探討機器學習相關的衍生應用如線性回歸、維度降低、密度估計和分類等應用。\nWhile machine learning software is available to design and train rich and flexible machine learning systems, the mathematical foundations of machine learning are important in order to understand fundamental principles for creating new machine learning solutions, and learn about the inherent assumptions and limitations of the methodologies. This course will contain two parts, where Part I lays the mathematical foundations in Linear Algebra, Analytic Geometry, Matrix Decomposition, and Probability theory and Optimization. Part II applies the concepts from Part I to a set of fundamental machine learning problems including Regression, Dimensionality Reduction, Density Estimation, and Classification.",
    "schedule": "Week1 Introduction (Part I, Ch.01, Part II Overview)  \nWeek2 Linear Algebra (Ch.02)\nWeek3 Linear Algebra (Ch.02)\nWeek4 Analytic Geometry (Ch.03)\nWeek5 Analytic Geometry (Ch.03)\nWeek6 Matrix Decomposition (Ch04)\nWeek7 Matrix Decomposition (Ch04)\nWeek8 Dimension Reduction with PCA (Part II, Ch.10)\nWeek9 Midterm Exam. \nWeek10 Dimension Reduction with PCA (Ch.10)\nWeek11 Vector Calculus (Ch.05)\nWeek12 Vector Calculus (Ch.05)\nWeek13 Probability & Distributions (Ch.06)\nWeek14 Probability & Distributions (Ch.06)\nWeek15 When Models Meet Data (Part II, Ch.08)\nWeek16 Linear Regression (Part II, Ch.09)\nWeek17 Linear Regression (Ch.09)\nWeek18 Final Exam.",
    "scorePolicy": "出席: 10%\n課堂參與度: 5%\n作業: 25%\n期中考: 30%\n期末考：30%",
    "materials": "Textbook: \nMathematics for Machine Learning by Marc Peter Deisenroth, et al., 2020, Cambridge University Press (東華書局代理)",
    "consultation": "可透過 email (junlin@ntut.edu.tw) 聯繫教師，就課程內容進行 email 或線上會議諮商，或可於教師規劃的學期諮商時段以 email 預約以進行面對面諮商與討論",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 疫情嚴重期間將依學校公告改採線上教學，以線上會議軟體如 MS Teams 或 Google Meet 進行線上教學與討論",
    "foreignLanguageTextbooks": true
  }
]
