[
  {
    "name": "陳惠芬",
    "email": "email2sino@gmail.com",
    "latestUpdate": "2022-12-23 15:11:30",
    "objective": "本課主旨在設計課程，提供練習，俾使學生嫻熟各式的英語測驗，如全民英檢、托福測驗、TOEIC 測驗或類似性質的測驗，希冀能夠藉由本課程的修習，提升學生不斷的學習外國語的興致，並且，藉由通過考試取得證照，增加未來職場的競爭力。\nThis course is designed to familiarize the students with various kinds of language proficiency tests such as GEPT, TOEFL, TOEIC and many others to the same end. It is our hope that the students who finish taking the course will go on with their enthusiasm on studying foreign languages; besides, through the acquisition of the certificate when the students pass the tests, they are sure to enhance their capability in the increasingly competitive job markets.",
    "schedule": "Week\tTopic \n\n1.  2/23 Introduction + 字根字綴講義 \n\n2.  3/2 Chapter 1 \n\n3.   3/9 Chapter 1 \n\n4.   3/16  Chapter 2 \n\n5.   3/23 Chapter 2 (Easy Test 多益模擬測驗第一第二回合，須自備載具並且到班考試) \n\n6.  3/30 Chapter 3   \n\n7.  4/6  Chapter 3 \n\n8.  4/13  \n\n9. 4/18 週二統一會考，校方統一命題，佔總成績 20%。本週四     4/20 不上課，4/18 週二請到校考試。 \n\n \n\n10. 4/27 Chapter 4 ( Easy Test 多益模擬測驗第三第四回合，需 自備載具並且到班考試) \n\n11.\t5/4 Chapter 5 \n\n12.\t5/11 Chapter 5   \n\n13.\t5/18  Chapter 6 \n\n14.\t5/25 Chapter 6 \n\n15.\t6/1 Chapter 7 ( Easy Test 多益模擬測驗第五第六回合，需自備載具並且到班考試) \n\n16.\t6/8 Chapter 7 \n\n17.\t6/15  Final Exam  期末考，Easy Test 多益模擬測驗第一到第六回合，佔總成績 30%。請到班考試。 \n\n18.\t6/22 Dragon Boat Festival",
    "scorePolicy": "成績計算: \n\nUnified Test 統一會考：20% \n\nFinal Exam 期末考: 30 % \n\nEasy Test Quizzes 混題測驗: 30% \n\nAttendance/Participation 出勤與上課參與: 20 % \n\n \n\n1. FIVE absences or THREE unexcused absences will yield a failing grade. For graduate students, a total of three absence will yield a failing grade. \n\n2.\t學士班同學三次無正當理由缺課，或缺課連同請假共計五次以上，將導致學期成績不及格。 \n\n3.\t碩士班同學缺課連請假三次，將導致學期成績不及格。 \n\n4.\tThere will be neither make-up quiz nor make-up final exam. 平日 Easy Test 小考及期末考試，無法補考。 \n\n5.\tCellular phone should be turned off during the two-hour class period. 上課不得使用手機。 \n\n6.\tYou need to turn your camera on when having online courses. 遠距上課必需全程打開鏡頭． \n\n7.\tSleeping through the class will be considered absent. 睡覺等同曠課。",
    "materials": "TOEIC 全面備戰 (七大題型 + 十三大情境) LiveABC (2020, 6 月新版 or 2020,11 月新版) \n\n \n\nEasy Test 線上教材",
    "consultation": "email2sino@gmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
