[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2022-12-21 07:05:38",
    "objective": "這門課除了教授傳統企業環境管理及相關實務之外，特別將著重在企業提升如何透過綠色創新來提升綠色競爭力的策略與做法；此外，課程另一重點將會是企業如何透過協助聯合國永續發展目標 (UN SDGs) 的達成，來創造企業的永續競爭力。學生將會深入探究金字塔底層 (BOP) 與創造共享價值 (Creating Shared Value, CSV) 之理論及實務做法，以及成為一個真正永續企業的策略。\n\nIn this course, traditional corporate environmental management and the strategies for improving green competitiveness will be taught. In addition, the strategies of corporate sustainability- how the corporate creates sustainable competitiveness by coping with the 17 goals of the UN’s Sustainable Development Goals (UN SDGs) will also be taught. Theories and practices of Bottom of the Pyramid (BOP) and Creating Shared Value (CSV), as well as the strategies for being a truly sustainable enterprise, will be emphasized in the class.",
    "schedule": "Week 1 (2/21) Course Introduction and Introduction to Business Management (Prof. Allen H. Hu)\nWeek 2 (2/28) National Holiday*\nWeek 3 (3/7) From Corporate Environmental Management to Corporate Sustainability (Prof. Allen H. Hu)\nWeek 4 (3/14) Sustainability: The Business Perspective\nWeek 5 (3/21) Vision 2050 and Future Leader- Stakeholder Capitalism and triple bottom line (Dr. Niven Huang, KPMG)\nWeek 6 (3/28) Special Topic on Social Innovation Trends and Social Enterprise landscapes\nWeek 7 (4/4) National Holiday*\nWeek 8 (4/11) Corporate Sustainability - Core Issues of Environmental Aspect (Environmental Management Strategy)\nWeek 9 (4/18) Special Topic on Climate Risk Management and Net-zero Trends\nWeek 10 (4/25) Special Topic: Dell’s Perspectives & Practices on Sustainability & Circular Economy* (Ms. Vivian Tai, Dell Technologies)\nWeek 11 (5/2) Corporate Sustainability - Core Issues of Social Aspect (Base of the Pyramid/Inclusive Business- A New Business Ocean Strategy)\nWeek 12 (5/9) Special Topic on Sustainable Finance and Portfolio ESG analysis\nWeek 13 (5/16) A new vision of value - Valuation of Environmental and Social Impacts (Ms. Annie Ti, KPMG 副總經理)\nWeek 14 (5/23) Special Topic (Topic TBA), Guest Lecture Ms. Christine Chiang, (HPE Inc.)\nWeek 15 (5/30) Special Topic on Sustainable Business- ESG from the DJSI and CDP Rating (Dr. Jerry Hsu, Dr. Daniel Chen, and Dr. Yao-te Chen, Sustain Vision)\nWeek 16 (6/6) Project Group Presentation\nWeek 17 (6/13) Final Exam (Open Book)\nWeek 18 (6/20) Conclusion- Net Positive! Expecting a New Norm for Doing Business",
    "scorePolicy": "1In-class lecture 2Group discussion  3Site visit-Acer  4Invited Guest Experts\nHomework/Reports: 30%  Participation: 15% Final Exam: 25%   Project: 30% (TBA in the class)",
    "materials": "1.\tPolman P. and A. Winston (2021). Net Positive- How Courageous Companies Thrive by Giving More Than They Take, Harvard Business Review Pres.\n2.\tAndrew S. Winston (2014), The Big Pivot: Radically Practical Strategies for a Hotter, Scarcer, and More Open World, Harvard Business Review Press \n3.\tElkington, J. and J. Zeitz (2014). The Breakthrough Challenge- 10 Ways to Connect Today’s Profits with Tomorrow’s Bottom Line, Jossey-BassBlowfield, Michael (2013), Business and Sustainability, Oxford: Oxford University Press, 2013.\n4.\tWeybrecht, Giselle (2010), The Sustainable MBA: The Manager's Guide to Green Business, John Wiley & Sons, Chichester, UK\n5.\tWerther, W.B. and D. Chandler (2011). Strategic Corporate Social Responsibility- Stakeholders in a Global Environment (2nd edition), Sage Publications\n6.\tEsty and Winston (2009), Green to Gold: How Smart Companies Use Environmental Strategy to Innovate, Create Value, and Build Competitive Advantage, Wiley \n7.\tMarketing 3.0- From Products to Customers to Human Spirit, 2011. Can be downloaded from http://ishare.iask.sina.com.cn/f/10664542.html\n8.\tOthers (papers, reports…)",
    "consultation": "Consultations can be done by making an appointment with Prof. Hu.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
