[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2023-02-16 15:31:56",
    "objective": "As an all-encompassing term, the word culture has multiple meanings. Anything involving human activity can be included in the domain of culture. Most importantly, culture is deeply connected with our sense of identity; our culture defines who we are. Culturally-determined identification can be a blessing that empowers our subjectivity, but it can also be a confinement that we strive to be free from. In this course, we will approach important topics in cultural studies from the perspectives of gender, race, and violence, the three issues that most intrinsically connected to identity, by reading theoretical texts and critical essays and viewing related films. Ideally, the course will familiarize students with key concepts in cultural studies and cultivate their critical thinking. Furthermore, the instructor hopes that the course can help students identify potential topics of their senior projects and establish valid approaches.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction: culture and cultural studies\n\nGender and discourse\n\nWeek 2: No class\nWeek 3: \"Gender and Sexuality” by Michael Ryan\nWeek 4: \"The Incitement to Discourse” by Michel Foucault\nWeek 5: “Visual Pleasure and Narrative Cinema” by Laura Mulvey\nWeek 6: \"Defining the Monster Queer in Classical Hollywood Horror Films\" by Harry Benshoff\nWeek 7: No class\nWeek 8: Film viewing & discussion: Interview with the Vampire (1994)\n\nRace and Cross-cultural Encounters\n\nWeek 9: “Ethnicity” by Michael Ryan\nWeek 10: “Introduction” to Orientalism by Edward Said\nWeek 11: \"Can the Subaltern Speak?\" by Gayatri Chakravorty Spivak \nWeek 12: Discussion: Madame Butterfly & Miss Saigon \n\nViolence and Horror in Popular Culture\n\nWeek 13: “Approaching Abjection” by Julia Kristeva\nWeek 14: “Her Body, Himself” by Carol Clover \nWeek 15: Film viewing & discussion: Alien (1979)\nWeek 16: \"Horror and the Archaic Mother: Alien\" by Barbara Creed\n\nWeek 17-18: Final discussion and Group presentations",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 40%\nFinal paper: 40%",
    "materials": "All reading materials will be provided by the instructor.\n\nhttps://drive.google.com/drive/folders/172Y6XT-krUeNkYUlrm_Ig9DaQZgVCZVJI5kQJORkcioO-_1AHuot_IVkjINeg_G5Q0dW_vAH\n\nRyan, Michael. Cultural Studies: A Practical Introduction. \nFoucault, Michel. The History of Sexuality, Vol 1.\nMulvey, Laura. \"Visual Pleasure and Narrative Cinema\"\nClover, Carol. Men, Women, and Chain Saws: Gender in the Modern Horror Film.\nBenshoff, Harry. Monsters in the Closet: Homosexuality and the Horror Film.\nSaid, Edward. Orientalism.\nSpivak, Gayatri Chakravorty. \"Can the Subaltern Speak?\"\nCreed, Barbara. The Monstrous-Feminine Film, Feminism, Psychoanalysis\nKristeva, Julia. Powers of Horror: An Essay on Abjection.",
    "consultation": "kpchen@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
