[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2022-12-16 19:29:13",
    "objective": "As an all-encompassing term, the word culture has multiple meanings. Anything involving human activity can be included in the domain of culture. Most importantly, culture is deeply connected with our sense of identity; our culture defines who we are. Culturally-determined identification can a blessing that empowers our subjectivity, but it can also be a confinement that we strive to be free from. In this course, we will approach important topics in cultural studies from the perspectives of gender, race, and violence, the three issues that most intrinsically connected to identity, by reading theoretical texts and critical essays and viewing related films. Ideally, the course will familiarize students with key concepts in cultural studies and cultivate their critical thinking. Furthermore, the instructor hopes that the course can help students identify potential topics of their senior projects and establish valid approaches.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction: culture and cultural studies\n\nWeek 2-8: Gender and discourse\nIntroductory text: “Gender and Sexuality” by Michael Ryan\nSupplementing theoretical text: “The Incitement to Discourse” by Michel Foucault\nCritical essay 1: “Visual Pleasure and Narrative Cinema” by Laura Mulvey\nCritical essay 2: “Her Body, Himself” by Carol Clover \nCritical essay 3: “Defining the Monster Queer in the Classical Hollywood Horror Film” by Harry Benshoff\nFilm viewing: Interview with the Vampire (1994)\n\nWeek 9-12: Race and identification\nIntroductory text: “Ethnicity” by Michael Ryan\nSupplementing theoretical text: “Introduction” to Orientalism by Edward Said\nCritical essay 1: “Blaxploitation Horror Films: Generic Reappropriation or Reinscription?” by Harry Benshoff \nCritical essay 2: “The Women of Get Out: Femininity, Race, and Betrayal in the Contemporary Horror Film” by David Greven\nFilm viewing: Get Out (2017)\n\n\nWeek 13-17: Violence and horror in popular culture\nIntroductory text: excerpts from Regarding the Pain of Others by Susan Sontag\nSupplementing theoretical text: “Approaching Abjection” by Julia Kristeva\nCritical essays: to be decided\nFilm viewing: The Silence of the Lamb (1991)\n\nWeek 18: Group presentations",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 40%\nFinal paper: 40%",
    "materials": "All reading materials will be provided by the instructor.\n\nRyan, Michael. Cultural Studies: A Practical Introduction. \nFoucault, Michel. The History of Sexuality, Vol 1.\nMulvey, Laura. \"Visual Pleasure and Narrative Cinema\"\nClover, Carol. Men, Women, and Chain Saws: Gender in the Modern Horror Film.\nBenshoff, Harry. Monsters in the Closet: Homosexuality and the Horror Film.\nSaid, Edward. Orientalism.\nSontag, Susan. Regarding the Pain of Others.\nKristeva, Julia. Powers of Horror: An Essay on Abjection.",
    "consultation": "kpchen@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
