[
  {
    "name": "楊韻華",
    "email": "yhyang@ntut.edu.tw",
    "latestUpdate": "2023-02-19 03:03:51",
    "objective": "Course Title:\t\tGlobal Issues and Trends\nCredit Hours:\t\t2\nInstructor’s Name:\tDr. Yun-Hua Yang\nContact E-Mail:\tyhyang@ntut.edu.tw\nTerm Offered:\t\tSpring 2023\nCourse Description: \tThis course aims to prepare students for collaborative participation in global activities by exploring global topics, issues and critical agenda of actions. In the process of cultivating engaged global citizens, the utmost task is to advance students’ understanding and critical evaluation of compelling evidence to apprehend the nature as well as complexity of issues and trend. With panoramic views of global agendas, comprehensive reviews of research studies, and social, cultural, political and economic assessments, global learning underscores collective awareness and brings in an analytical approach with emphasis on individuals’ global accountability, interconnectedness, and rigorous actions. More importantly, this current course provides the opportunity for students to be familiarized with the narrative / discourse style, language use and data description that will support their future pursuit for a global career. Reports adopted are available at major news outlets, research institutions and organizations.",
    "schedule": "Weekly Schedule (Subject to change)\n\nWeek \tReports and Discussions \n1.   Orientation / Post-pandemic recovery by McKinsey Global (1/3)\n2.  National Holiday \n3.\tPost-pandemic recovery by McKinsey Global (2/3)\n4.\tPost-pandemic recovery by McKinsey Global\t (3/3)\n5.\tWEF AI series 1 Davos 2023: Generative AI as a game changer   https://www.weforum.org/agenda/2023/01/davos23-generative-ai-a-game-changer-industries-and-society-code-developers\n6.\tWEF AI series 2: ChatGPT: the start of generative AI boom https://www.weforum.org/agenda/2023/01/chatgpt-start-generate-ai-boom-work-technology   \n7.\tSpring Break\n8.\tLook Forward: A World in Disruption 2023 by HIS Markit (1/2)\n\t---Crunch Time: Adaptation Finance & Climate Risks \n9.\tLook Forward: A World in Disruption 2023 by HIS Markit (2/2)\n\t--- The EV Revolution \n10.\t Midterm Oral Exam \n11.\t Global Risk Outlook 2023 \n12.\t China / Asia Outlook 2023 by the Economist Intelligence\n13.\t Zero-Sum & ESG: The Economist featured stories \n14.\t WEF Global Risk Report 2023 (1/3)\n15.\t WEF Global Risk Report 2023 (2/3)\n16.\t WEF Global Risk Report 2023 (3/3)\n17.\t Being a global participant; SDGs\n18.\t Final Written Exam",
    "scorePolicy": "Course Requirements: \tStudents’ responsibilities in this class include:\n(1)\tAttending class regularly and to arrive on time (See Grading Policy)\n(2)\tPresentations and discussions \ni.\tStudents (w/ or w/o partners) can volunteer and/or will be conveniently selected to present on issues and topics through the infographics provided in reports with fully-elaborated explanations and analyses on data / concept exhibits. \nii.\tStudents who prepare to give a presentation need to post handouts / study notes on Google Classroom a day before the scheduled presentation. \niii.\tStudents are obligated to participate in class discussion by Q&A.\n(3)\tQuizzes will be administered at the instructor’s discretion, and will not necessarily be announced in advance. \n(4)\tAll student panelists videotape their sessions for further revisions. A complete portfolio (preferably on compact disc) including all recordings will be considered for extra credit bonus at the end of the semester.\nGrading Policy: \t(1) Academic honesty is prioritized in this class. Plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their work. \n(2) Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their panel discussions, submitted materials and debates. (Adjustments will be made if necessary.) \n\nPresentations (voluntary and/or assigned)\n(study notes and interactive feedbacks)\t10% X 2 /3 = 20% / 30%\nQuizzes \t20%\nMidterm Oral and Final Written Exams \t20% X 2 = 40%\nAttendance \t20% \n*Students are obligated to attend all class sessions on time. Each absence / lateness will generate 10% / 5% deduction of the semester grades on the 100% scale. A university approved leave of document is accepted as one absence penalty waiver in the entire semester. AWOLs will be marked and entered into the penalty calculation if not corrected in two weeks of time, and lateness upon class dismissal. \n*This syllabus is subject to change at the instructor’s sole discretion. Changes made to the grading policy will be discussed in class. \nScoring Criteria\n1.\tResearch & analysis: understanding information introduced in the report and seeking additional support or discovering alternative or opposing studies; selection of important information from the report, with coherent and accurate presentation of such information in relation to other information /ideas in the reading and/or concerning issues in question; highly intelligible with exhibition of a sustained discourse \n2.\tContent and structure: presenting a clear progression of ideas and conveying the relevant information required by task by providing and explaining substantive ideas and arguments in the reading; making necessary clarifications on facts and data introduced and critical analyses \n3.\tLanguage use: demonstrating good control of basic and complex grammatical structures to allow coherent, efficient expression of ideas; using advanced and domain-specific and topic appropriate registers // Delivery and session management: speech being clear, concise, fluid and sustaining; maintaining the flow of discussions, stating and explaining ideas, arguments, facts and data as planned, asking and answering questions\n4.\tStudy notes: clear and concise outline of content in the reading (report); language support, definitions of terms, and other useful information to enhance comprehension for ensuing discussion",
    "materials": "Required Texts: All course materials are available for download at Google Classroom.",
    "consultation": "Office hours by appointment with the department secretary and/ or by email.",
    "remarks": "EMI / All information and resources are available on Google classroom. Link will be provided before the first class.Please join Google Classroom: https://classroom.google.com/c/NTkyNzY4NjAyODI1?cjc=gxhqhng",
    "foreignLanguageTextbooks": true
  }
]
