[
  {
    "name": "羅元隆",
    "email": "yllo@ntut.edu.tw",
    "latestUpdate": "2022-12-16 10:56:02",
    "objective": "This course bridges the learning subjects in the undergraduate courses and the future subjects in graduate courses. The content is focused on an SDOF system's governing equation. Students will review what they’ve already learned in their first three years and learn two approaches to dynamic analysis. The main content includes reviews of solutions to 2nd order differential equations, problem statements, free vibration, response to harmonic and periodic excitations, response to arbitrary, step, and pulse excitations, numerical evaluation of dynamic response, and estimation of earthquake responses of a linear system.",
    "schedule": "W01: Derivation and solutions of 2nd order ODEs\nW02: Static analysis of trusses, beams, and frames\nW03: Equation of motion, problem statement, and solution methods\nW04: Free vibration\nW05: Free vibration\nW06: Response to harmonic and periodic excitations\nW07: Response to harmonic and periodic excitations\nW08: Mid-term Exam (Written Test)\nW09: Response to arbitrary step and pulse excitations\nW10: Response to arbitrary step and pulse excitations\nW11: Response to arbitrary step and pulse excitations\nW12: Numerical evaluation of dynamic response\nW13: Numerical evaluation of dynamic response\nW14: Numerical evaluation of dynamic response (MATLAB programming)\nW15: Earthquake response of linear systems\nW16: Earthquake response of linear systems\nW17: Final Exam (Written Test)\nW18: Report submission",
    "scorePolicy": "Attendance: 15%\nMid-term Exam: 30%\nFinal Exam: 30%\nReport: 25%",
    "materials": "Dynamics of Structures – Theory and Applications to Earthquake Engineering 4th ed by Anil K. Chopra",
    "consultation": "During the semester, a LINE group of this course will be set up for free and quick discussion. If any student wants to discuss specific content in person, an advance email shall be sent to the lecturer to confirm the appointment time.",
    "remarks": "@授課語言：中文 @上課方式一、二級：實體授課。(以學校公布為原則) 三級：遠距授課 (連結網址：https://meet.google.com/tyo-wjvn-abf)@評量方式一、二級：採實體紙筆測驗三級：繳交線上報告 (每位學生分發不同題目)@重要訊息學生可透過 iClass 或研究室分機或老師電子信箱 yllo@mail.ntut.edu.tw 聯絡。",
    "foreignLanguageTextbooks": true
  }
]
