[
  {
    "name": "陳起鳳",
    "email": "cqf2@ulive.pccu.edu.tw",
    "latestUpdate": "2022-12-20 16:10:11",
    "objective": "給水與污水工程是土木與環境工程中重要的基礎工程課程。給水工程為自來水工程，從水源取水、導水、淨水到配水，包含一連串的工程技術與方法。污水工程則是將廢污水淨化處理，至符合國家放流水標準後排出的過程。兩者處理對象與目的不同，但其中淨水處理有相似的技術與方法。本課程著重在淨水工程部分，也是兩者的核心技術。而給水工程中的取水與輸配水屬於水利工程，本課程僅簡要介紹。淨水處理包含物理、化學、生物處理技術，根據廢污水特性以及處理目的可選擇不同的淨水方法，或者相互搭配使用以達到效率與成本等要求。本課程將說明各種處理技術的核心理論以及計算，使學生未來具有污水處理設計之能力。\nWater supply and wastewater treatment engineering is the core course in the civil and environmental engineering. Water supply engineering includes series technologies from water intake to allocate water to citizens. To determine the place to intake water, to transport water, to purify water and to allocate the clean water are the missions of water supply engineers. Wastewater treatment engineering is to treat wastewater to the required concentration standard. The two engineering have different subjects and different goals. However, the water purification and wastewater treatment has the similar methods, which is the core technology in the two engineering and also the core content in this course. The methods about water withdraw and transportation belong to hydraulic engineering and is briefly introduced in this course. The wastewater treatment methods can be divided to physical, chemical, and biological methods. The use of these methods to achieve legal requirement and minimum cost and high efficiency is the mission of engineers. In this course, the theorem of the treatment methods and the associated calculations will be explained, in order to equip the student to capable of designing wastewater treatment.",
    "schedule": "Week 1　緒　論 Introduction \nWeek 2　取　水 Water intake\nWeek 3　導　水 water transportation\nWeek 4-5　抽　水 pumping\nWeek 6　汙水特性與指標 water pollutants and index \nWeek 7-8　污水之物理處理 physical wastewater treatment methods\nWeek 9 期中考 midterm exam\nWeek 10-11　污水之化學處理 chemical wastewater treatment methods\nWeek 12　 混凝與膠凝  coagulation and flocculation \nWeek 13　消毒 disinfection\nWeek 14-15　污水之生物處理 biological wastewater treatment methods\nWeek 16-17　污泥處理與處置 sludge treatment and reuse\nWeek 18 期末考 final exam",
    "scorePolicy": "出席與上課表現 15%\n作業 20%\n期中考 30%\n期末考 35%",
    "materials": "由於本課程包含兩個部分，會使用以下兩本課本：\n給水工程，第 5 版 黃政賢，高立圖書\n汙水工程，第 5 版 黃政賢，高立圖書",
    "consultation": "有任何課程問題可以寫信給我：cfchen@ntut.edu.tw 或者在我的 office hours 來我辦公室找 (土木館 301)",
    "remarks": "若因疫情需調整線上上課，將採用 Teams 平台，並於課程系統告知。有任何問題可與老師聯絡：cfchen@ntut.edu.tw",
    "foreignLanguageTextbooks": false
  }
]
