[
  {
    "name": "張詠翔",
    "email": "shawnchang@ntut.edu.tw",
    "latestUpdate": "2022-12-21 12:34:35",
    "objective": "The course provides an introduction to English phonetics. We will focus on the basic acoustic and articulatory properties of English vowels and consonants and learn to transcribe these speech sounds using the International Phonetic Alphabet (IPA). This course also covers the general prosodic patterns in English, such as stress, intonation, and rhythm. Upon completion of this course, students will be able to identify their own pronunciation problems and apply this practical experience to English pronunciation teaching.",
    "schedule": "Week 1: Introduction: What is phonetics?\n              Some basic phonological terms\n              Basic anatomy of the vocal tract\nWeek 2: Vowels in English (I)\nWeek 3: Vowels in English (II)\nWeek 4: Vowels in English (III)\nWeek 5: Consonants in English (I)\n              Quiz 1 \nWeek 6: Consonants in English (II)\nWeek 7: Consonants in English (III)\nWeek 8: Consonants in English (IV)\nWeek 9 : Quiz 2 (aka. midterm) \n               Film watching \nWeek 10: Syllable structure \nWeek 11: Prosodies (I): stress \n                Quiz 3\nWeek 12: Prosodies (II): tone \n                Prosodies (III): intonation \nWeek 13: Prosodies (IV): prominence and pause\n                Prosody Workshop I: Rapid Prosody Transcription\nWeek 14: Prosodies (V): rhythm \n                Prosody Workshop II: shadowed speech\nWeek 15: Dialectal variation of English pronunciation\nWeek 16: Student presentation \nWeek 17: Student presentation \nWeek 18: Student presentation",
    "scorePolicy": "‧\tParticipation 20%: Students are expected to actively participate in classroom discussion and small group activities. Doing the assigned readings before class so as to be ready to participate in classroom discussion is also required. \n‧\tAttendance 10%: It is crucial that students attend every class session. Two points of the final grade will be taken off for each absence. After five absences, you lose all the ten points of your final grade that attendance accounts for. You will also be graded down in the participation component of the final grade if you continue to miss classes. A hard copy of the officially approved leave sheet is required if you have missed (or will miss) a class due to illness, family emergency, etc.  \n‧\tThree quizzes 30% \n‧\tFinal project 40%: The final project involves transcription and analysis of readings of two texts: the North Wind and the Sun and the Boy who Cried Wolf. Students will present their project at the end of the semester. The presentation accounts for 20%, while the write-up of the project accounts for the other 20%.",
    "materials": "Ladefoged & Johnson’s (2011). A Course in Phonetics (6th ed.).\nLane, L. (2013). Focus on Pronunciation 3 (3rd ed.).\nAdditional readings to be assigned",
    "consultation": "Office hours or by appointment",
    "remarks": "We will meet through Google Meet in case of Covid resurgence or lockdown.The Google Meet link will be posted a week before the semester begins.",
    "foreignLanguageTextbooks": true
  }
]
