[
  {
    "name": "柯俊宏",
    "email": "Maning_98@yahoo.com",
    "latestUpdate": "2022-12-15 17:19:03",
    "objective": "With the trend of population aging, industries related to health care are already developing a huge market, in which biomedical engineering plays a very important role.\n\nBiomedical engineering (Biomedical engineering) is an interdisciplinary discipline, which mainly uses various engineering knowledge and technologies to assist in biological research, and to provide information that is helpful for diagnosis or assisting diseases in medicine, treatment and Prevention.\n\nIn this broad category, we will focus on the field of medical electrical engineering, especially in laser medicine to provide information that is helpful for diagnosis or assist in the treatment and prevention of diseases.\n\nLaser is one of the three great inventions of the 20th century, and medical laser has been widely used in various medical fields. The scope covered in this course will be discussed in depth: \n1. Basic principles of laser\n2. Various applications of laser in medicine\n3. Application of laser in dentistry\n4. Advanced thesis writing in laser medicine.",
    "schedule": "1.Fundamental of medical electronics。\n2.Fundamental of electro-physiology。\n3.Introduction to human body system and Meridian system。\n------------------------------------------------------------------------------------\n2/22 Introduction to Medical Electrical Engineering\n3/1 Fundamentals of Medical Electronics\n3/8 Basic principles of laser\n3/15 Application of laser in aesthetic medicine\n3/22 Special Lectures and Essay Writing\n3/29 Application of Laser in Dentistry\n4/5 Tomb-sweeping Day holiday, one day off\n4/12 Medical Electrical Engineering Thesis Writing Guidance\n4/19 Midterm exam\n4/26 Laser machine operation and clinical demonstration\n5/3 Medical Electrical Engineering Thesis Writing Guidance\n5/10 Ultrasonic, infrared, X-ray, CT, magnetic resonance imaging principles and image processing\n5/17 Medical Electrical Engineering Thesis Writing Guidance\n5/24 Application of Laser in Dentistry\n5/31 Final paper publication\n6/7 Application of laser in oral surgery\n6/14 Final paper publication\n6/21 Final exam",
    "scorePolicy": "(1) Midterm Exam)   30 %, \n(2) Presentation)  30 %,\n(3) Final Exam)  30 %\n(4) Attendance Rate and Class Interaction)  10 %",
    "materials": "1.\tOral Laser Application\n    by Prof. Andreas Moritz",
    "consultation": "Students can ask questions in the LINE Group or email directly to me:Professor Jyuhn KeEmail: jyuhnk@gmial.comCell: 0935421518",
    "remarks": "1. It is recommended that instructors use multiple evaluation methods (such as participation in discussions, online tests or quizzes, submission of reports and assignments, adjustment of grading criteria, etc.) to evaluate students’ learning performance for semester grades. 2. Based on the pandemic classification, we will follow the rules by the school:a. Class I Warning:  courses will still be held in personb. Class III or higher Warning: courses will be held onlinec. Class II Warning: courses will be held either online or partial attendance every other week.",
    "foreignLanguageTextbooks": false
  }
]
