[
  {
    "name": "劉傳銘",
    "email": "cmliu@ntut.edu.tw",
    "latestUpdate": "2022-12-20 07:58:05",
    "objective": "資料科學是個跨領域的重要興新學科，其基本知識含括資訊、線性代數、機率與統計等，相關技術可應用在許多領域上，包含教育領域。本課程從學科整體介紹開始，討論資料科學中各主要階段的相關議題：包含資料搜尋擷取、資料整理與問題發想、數理知識回顧與討論、資料分析建模與方法、資料呈現與視覺化等。除課堂上講授與討論外，課程亦著重如何實際應用所學，將使用教育資料並以小組方式進行議題發想與分析實作的學期專題。此外，為強化健全資料視覺呈現課題，在實作專題中課程亦著重學生報告能力的培養，希望培育出全方位的資料科學人才。\nData science is an emerging interdisciplinary field that explores how to produce or create the valuable information and knowledge from large, multi-typed, or unstructured data and provides effective feedbacks to many applications, including education. The related topics include data processing and computing, data storage, statistics and probability, linear algebra, and data analysis. This course introduces the rapidly growing field, discusses the state-of-art techniques, and provides students with the fundamental related knowledge as well as the ability to use software tools. The major phases on data manipulation- collection, preparation, analytics, and presentation, in data science will be discussed. The training of this course is toward equipping students with the general mindset and the ability to solve problems practically with the learned techniques on educational data with project groups. In addition, the students also need to practice the presentation for the findings and results of the studied problem in order to equip with the ability to convey the thoughts well and demonstrate things visually. The major objective of this course is to cultivate talents in data science.",
    "schedule": "-An Overview (with introduction on educational data)\n-Mathematical Preliminaries\n-Data Munging\n-Scores and Rankings\n-Statistical Analysis\n-Visualizing Data\n-Mathematical Models\n-Linear Algebra\n-Linear and Logistic Regression\n-Distance and Network Methods\n-Machine Learning\n-Case Study: Practical Applications on Education Data\n-Project Demo",
    "scorePolicy": "Class Participation: 5%\nHomework/Report: 25％\nProject: 70% (Proposal 20% ; Final Demo 30%; Report 20%)",
    "materials": "Steven S. Skiena, The Data Science Design Manual, Springer-Verlag, 2017, ISBN-13: 978-3319554433\nReferences:\n- Cathy O'Neil and Rachel Schutt. Doing Data Science, Straight Talk From The Frontline. O'Reilly. 2014.\n- Jure Leskovek, Anand Rajaraman and Je\u000brey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press. 2014. (free online)\n- Kevin P. Murphy. Machine Learning: A Probabilistic Perspective. ISBN 0262018020. 2013.\n- Foster Provost and Tom Fawcett. Data Science for Business: What You Need to Know about Data Mining and Data-analytic Thinking. ISBN 1449361323. 2013.\n- Avrim Blum, John Hopcroft and Ravindran Kannan. Foundations of Data Science.\n(Note: this is a book currently being written by the three authors. The authors have made the first draft of their notes for the book available online. The material is intended for a modern theoretical course in computer science.)",
    "consultation": "For any inquiry, please use the following contact information:Emails: cmliu@ntut.edu.tw( school); 11107@cc.ntut.edu.tw (Microsoft Teams)Line ID: mobile.profFB: facebook.com/howard.liu.5Phone: 4251 (in school)",
    "remarks": "In case of the need for distance learning, the on-line teaching will be given during the official class hours using Microsoft Teams.",
    "foreignLanguageTextbooks": true
  }
]
