[
  {
    "name": "王聖銘",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2022-12-15 17:52:22",
    "objective": "「Forecasting isn’t prediction.」- Paul Saffo\n\nFuture Studies & Forecasting will be more and more important skill for every young generation students. What will the future look alike? What is the driving forces pushing us from current to the future? How many pace layers of future arrivals?\nIn this class, we will discuss Stanford consulting prof. Paul Saffo’s Future Studies & Forecasting methods, by – Observing current trends, future event debate, Matrices and Axes of Uncertainty, future mindset developing, etc.\n\nOverview\nFutures Research is a survey course about the methods and tools that professional futurists use to help people anticipate and influence the future. It is a core course in the Futures Studies program. It covers methods and tools used by forecasters in general as well as by professional futurists. It also covers the techniques that futurists use more than others to forecast the future, particularly creating scenarios of the future, and the techniques used by futurists and consultants alike to help people influence the future, particularly visions, strategic plans, and change management programs.\nObjectives\n\nThe student will understand and become familiar with: \n•\tthe framework approach to forecasting\n•\tcritical thinking and other approaches to challenging assumptions\n•\tleading creativity tools and approaches and how they apply to futures\n•\thow to develop and evaluate scenarios",
    "schedule": "Week 1 Introduction \n•\tBecome familiar with course objectives, expectations, and procedures\n•\tBecome familiar with the learning platform. \n•\tIntroduce yourself to your classmates. \n•\tState of the Art in Strategic Foresight\n\nUNIT 1 FRAMEWORK FORECASTING: (Weeks 2 –5) \n\nWeek 2 Environmental Scanning\n•\tUnderstand an approach to environmental scanning\n•\tPractice that approaches and assess how well each we and others are using it\n\nWeek 3 Research\n•\tUnderstand the futures forecasting process, including frameworks, monitoring, and scanning \n•\tPresent futures information in a logical order for forecasting alternative futures using the framework process \n\nWeek 4 Interviews & Questionnaires \n•\tList how people find out about other people's information, attitudes, expectations, and preferences for the future. \n•\tUnderstand the differences among those ways, including the advantages and disadvantages of each. \n•\tPractice the skills of preparing, administering, analyzing, and drawing inferences from an open-ended interview. \n•\tLearn about questionnaire design and construction \n•\tLearn about related topics, such as measurement, sampling, and the Delphi survey technique \n•\tPractice the skills of preparing, administering, analyzing, and drawing inferences from a structured questionnaire. \n\nWeek 2 Forecasting\n•\tUnderstand the nature of forecasting, its assumptions, its utility, and its difficulties\n\nUNIT 2 CHALLENGING ASSUMPTIONS: (Weeks 6 –7) \n\nWeek 6 Causal Layered Analysis\n•\tUnderstand and apply the causal layered analysis method\n•\tBecome familiar with the concept of \"depth\" in futures work\n\nWeek 7 Critical Thinking\n•\tLearn a process for investigating the support for an inference, such as a forecast \n•\tConduct a critical analysis of a forecast in the published literature \nUNIT 3 CREATIVITY: (Weeks 8 –9) \nWeek 8  Creativity Approaches\n•\tBecome acquainted with key concepts, terms, and approaches to creativity\nWeek 9 Creativity Tools\n•\tLearn a standard approach to creative problem solving\n•\tBecome familiar with a variety of creativity techniques\n•\tPractice applications of two principal creativity tools\nUNIT 4 SCENARIOS: (Weeks 10 –12) \nWeek 10  Scenario Theory\n•\tBecome acquainted with key concepts, terms, and criteria of scenarios \n\nWeek 11  Scenario Methods\n•\tCompare the strengths and weaknesses of various scenario approaches\n•\tLearn how to analyze and evaluate scenarios\n\nWeek 12 Scenario Cases \n•\tAcquire an in-depth understanding of a leading practitioners approach to scenarios\n\nUNIT 5 CONCLUSION: (Weeks 13 –15) \nWeek 13 Draft Portfolio\n•\tPrepare draft portfolio for instructor feedback\nWeek Thanksgiving Holiday\n•\tnothing assigned\nWeek 15 - 18 Final Portfolio\n•\tSubmit the final portfolio",
    "scorePolicy": "Attendance (4)\t\t10%\nMajor Assignments (2)\t20%\nMidterm report  (1).         20%\nAssignments (4) \t        20%\nFinal Portfolio\t\t\t30%",
    "materials": "•\tMicheal Ray, Creativity in Business \n•\tJerry Glenn & Ted Gordon, Futures Research Methodology V2.0, CD, Washington DC, Millennium Project\n•\tOther readings will be available online \n•\tAlso, there is a requirement to do a synopsis of one scenario book from the list below:\no\tFahey, Liam & Randall, Robert (eds.). Learning from the future: Competitive foresight scenarios. 1998.\no\tGeorgantzas, Nicholas C. & Acar, William. Scenario-driven planning. 1995.\no\tKahane, Adam. Solving tough problems: An open way of talking, listening, and creating new realities. berrett-koehler, 2004.\no\tLindgren, Mats & Bandhold, Hans. Scenario planning: The link between future and strategy. 2003.\no\tManyWorlds. Grasping the future: Comparing scenario planning to other forecasting techniques. 2001. \no\tOgilvy, Jay. Creating better futures: Scenario planning as a tool for a better tomorrow. 2002.\no\tRingland, Gill, Scenario planning: Managing for the future. 1998.\no\tRingland ,Gill. Scenarios in public policy. 2002.\no\tSchwartz, Peter. The art of the long view. 1996.\no\tVan Der Heijden, Kees. Scenarios: The art of strategic conversation. 1996.\no\tVan Der Heijden, Kees. The sixth sense: Accelerating organisational learning with scenarios. 2002.",
    "consultation": "1. Send an email to make an appointment for an online or in-person meeting.My Email: ryan5885@mail.ntut.edu.tw2. Make an appointment in class to attend a consultation session afterward.",
    "remarks": "Once the lecture needs to go online, lecture materials/assignment/course works will use google classroom as the interactive platform. Consulting times are arranged online on Monday (10:00-12:00) and Wednesday (10:00-12:00).",
    "foreignLanguageTextbooks": true
  }
]
