[
  {
    "name": "王多柏",
    "email": "tpwang@ntut.edu.tw",
    "latestUpdate": "2022-12-21 12:29:10",
    "objective": "在過去的 60 年裡，生物醫學工程學科發展已成為明確的，多樣化的，內容無所不包的領域；包括生物電現象、生物信息學、生物材料、生物力學、生物儀器、生物傳感器、生物信號處理等領域，以及生物技術、計算生物學和複雜多樣性、基因組學、醫學影像學、光學和雷射激光、輻射影像、組織工程等。\n本課程主要將適用於工程學門學生，且已完成物理、化學或生物學基礎課程為佳。此基礎在大二或大三的學生應該已可做好充分的準備。本課程將學習人體解剖學、生理學、生物物理學和生物醫學工程。整合了一系列知識，以幫助修課同學瞭解生物訊息和醫學儀器，並可以用來監測這些生物醫學現象。課程的學習主要是將這些生物醫學現象，運用其基礎於電力、壓力和流量的物理現象加以說明，並將這些生物醫學現象經由電子及工程的特殊條件和應用系統而呈現。在這種學習中，課程涵蓋了相關醫學和生物學領域、化學、物理、工程的知識和方法，期使將其成功及適當應用於多種生物醫學儀器。本課程將主要研習人體結構（解剖）及其功能系統（生理學），但這些原則同樣也可能適用於其它所有生命系統。\n經由醫學背景引導進入此領域，結合工程及材料師長的經驗及參與，將可含括主要生醫工程及組織工程領域的基礎\nOver the past sixty years, as the discipline of biomedical engineering has evolved, it has become clear that it is a diverse, seemingly all-encompassing field that includes such areas as bioelectric phenomena, bioinformatics, biomaterials, biomechanics, bioinstrumentation, biosensors, biosignal processing, biotechnology, computational biology and complexity, genomics, medical imaging, optics and lasers, radiation imaging, tissue engineering, moral and ethical issues. This course will be designed primarily for engineering students who have completed physical equations and a basic course in statics of chemistry and biology.  Students in their sophomore year or junior year should be adequately prepared for this course.  This course will be learning about human anatomy, biophysics, physiology, and biomedical engineering. It brings together a number of disciplines to help understand biomedical phenomena and the instrumentation that can be used to monitor these phenomena. It is primarily abo",
    "schedule": "與房同經老師相同",
    "scorePolicy": "與房同經老師相同",
    "materials": "與房同經老師相同",
    "consultation": "與房同經老師相同",
    "remarks": "與房同經老師相同",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "房同經",
    "email": "nathan1@ms39.hinet.net",
    "latestUpdate": "2022-12-27 18:56:16",
    "objective": "什麼是人體生物學及生物物理學？\n    人體生物學及生物物理學是一門非必修主要課程，旨在探索人體形式和功能之間的基本關係。解剖學和生理學是生命科學中兩個最基本的術語和研究領域。解剖學是指身體的內部和外部結構及其物理關係，而生理學是指研究這些結構的功能。本課程旨在定義瞭解剖學和生理學，並解釋了為什麼它們對生物醫學工程很重要。主要器官系統的解剖學和生理學將在正常和疾病狀態的背景下進行研究。學生將學習關鍵的生物過程，如中心教條，膜擴散和運輸，細胞信號傳導，氣體交換，血流，營養吸收，血液 pH 平衡以及動作電位的產生和傳播。然後，學生將應用這些知識來瞭解器官如何對維持體內平衡的各種輸入做出反應。課程將納入實踐演示，為課程中提供的資訊提供實用框架:  \n1.\t根據位置，功能，關鍵成分和解剖命名法確定主要的人體系統。  \n2.\t展示對代謝功能和每個主要器官系統的生理控制的理解。\n3.\t認識並綜合體內平衡的原理，即主要器官系統在生理上如何相互關聯以維持人類健康。\n在學期階段，學生將廣泛瞭解身體系統如何在細胞，組織和器官系統水平上發揮作用，並能夠將簡單的生理過程聯繫起來，以更好地了解社會中高度流行的疾病和對生物醫學工程重要實用框架。\n人體生物學及生物物理學的課程目標：\n1.\t人體是一個實用的結構，它由四種主要類型的數十億個較小的結構組成：細胞，組織，器官和系統。\n2.\t器官是幾種不同種類的組織，如此排列，以至於它們可以一起執行特殊功能。\n3.\t系統是一個由不同數量和種類的器官組成的組織，它們如此排列，以至於它們可以一起為身體執行複雜的功能。\n4.\t十個主要系統包括骨骼，肌肉，神經，內分泌，心血管，淋巴，呼吸，消化，泌尿和生殖系統。\n5.\t身體功能是身體系統的生理或心理功能。身體的生存取決於身體維持或恢復其內部環境的體內平衡，這是一種相對恆定的狀態。\n6.\t人類的生命過程包括組織、新陳代謝、反應性、運動、繁殖、生長、分化、呼吸、消化和排泄。所有這些過程在微調的平衡中協同工作，以維護個人的健康和維持生活。 \n7.\t生命依賴於環境中的某些物理因素，包括水，氧氣，營養物質，熱量和壓力。\n人體生物學及生物物理學課程的學習評估：基於出勤以及課堂互動，每周提供一個帶回家的研究案例以突出所涵蓋系統的人體解剖學和生理學，每周測驗以及一個期中和期末測驗。  \n人體生物學及生物物理學的課程實踐體驗 \n如果人體解剖學和生理學的想法看起來很可怕，請不要擔心。本課程將通過以平易近人且相關的格式涵蓋這些主題來減輕您可能有的任何恐懼。本課程將使您對人體所有複雜的功能和系統如何協同工作更加自信，並將您從解剖學和生理學方面學到的知識與您已經瞭解的身體聯繫起來。將此視為人體使用者指南。有些人可能會說你不能沒有它！\n本課程還將涵蓋身體的主要系統，並解釋它們是如何工作的，為什麼它們有時不起作用。此外，它還將檢查不同的疾病和紊亂，醫學的最新進展以及照顧身體的方法。課程包括現實生活中的例子和互動練習，讓你批判性地思考自己的經歷，並與課程建立聯繫。在整個課程中都使用全面綜合知識和理解，為您提供必要的學習材料，以便在您繼續接受教育或職業生涯時保留本課程及以後的內容。在本課程結束時，你將對人體的奇妙複雜性有更大的欣賞和理解。",
    "schedule": "週次\t日期\t課程內容 (Human Biology and Biophysics)\n1\t2/24\tHuman Physiology: Roles and Professional Status\n2\t3/3\tHuman Physiological Signaling and Body Homeostasis\n3\t3/10\tThe Heart and Cardiac Cycle\n4\t3/17\tCardiac Electrophysiology – Basic \n5\t3/24\tCardiac Electrophysiology – Clinical Application\n6\t3/31\tRheology of Blood and Vascular Mechanics\n7\t4/7\tHemodynamic Analysis – Cardiac Mechanics and Cardiac Pump\n8\t4/14\tHemodynamic Analysis – Blood Pressure, Flow, and Resistance\n9\t4/21\tHuman Autonomic nervous System 期中考 \n10\t4/28\tHuman Stress Response \n11\t5/5\tThe Respiratory System and Ventilator Support Systems\n12\t5/12\tNeuronal Signal Processing – Membrane Potentials\n13\t5/19\tNeuronal Signal Processing - Synapses\n14\t5/26\tHuman Motor Control\n15\t6/2\tHuman Defense Mechanism and Biocompatibility\n16\t6/9\tFunctional Tissue Engineering –Regenerative Medicine \n17\t6/16\t期末考\n18\t6/23\t端午節",
    "scorePolicy": "* 題型：問答題\n* 計分：期中考【35%】                                   \n           期末考【35%】\n           課堂作業及報告 【30%】",
    "materials": "1. Eric P Widmaier: Vander Human Physiology. (15th, 2019)\n2. John E Hall: Guyton and Hall Textbook of Medical Physiology. (14th, 2020)",
    "consultation": "Email: ftj@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
