[
  {
    "name": "林利國",
    "email": "lklin@ntut.edu.tw",
    "latestUpdate": "2023-03-03 16:56:24",
    "objective": "Knowledge Management(KM) is the most important technique of learning type business for developing knowledge economy in the 21st century. Construction and civil engineering need to conduct knowledge management due to they are complex and full with professional techniques. This course will introduce related professional techniques of construction and civil engineerings, the development technology of knowledge management and the e business, also will illustrate the conducting methods of construction knowledge management.",
    "schedule": "1. Course Introduction\n2. Introduction to Knowledge Economy and Knowledge Management\n3. Application and Development Trend of Construction Industry Information\n4. Thinking of Constructing Industrial Electronic Strategy\n5. Knowledge Sharing Lecture 1\n6. Knowledge Management of Construction Management Localization and Grouting operation in emergency repair crisis treatment 1\n7. Knowledge Management of Construction Management Localization and Grouting operation in emergency repair crisis treatment 2\n8. Construction of EPS Filling Method and Knowledge \n9. Knowledge Sharing Lecture 2\n10. Construction Disaster Crisis Management and Knowledge Management\n11. Application of Knowledge Management in Local Disaster Prevention Organizations\n12. Fire safety system for high-rise buildings Knowledge Management\n13. Fire and Disaster Prevention Knowledge Management\n14. Knowledge Management of Quality Control of Ready Mixed Concrete\n15. Knowledge Management and Business Strategy of Construction Industry\n16. Construction job Knowledge Management\n17. Application and Introduction of Knowledge Management in Construction Industry\n18. Course Summary, Final Examination Week",
    "scorePolicy": "Homework : 10-20%；\nAttending ：10-30％；\n Discussion ：20-30%\nMidterm Exam.：20-30%；\nFinal Exam.：20-40％",
    "materials": "1. Lee-kuo Lin “Construction Technology and Knowledge Management”.\n2. Handout.",
    "consultation": "1.\tQ&A in class.2.\tE mail.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
