[
  {
    "name": "鍾建屏",
    "email": "thomas6311@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-04 01:25:58",
    "objective": "本課程聚焦多國籍公司財務管理，介紹基礎的國際財務管理理論概念，以及相關財務管理的重要課題。授課內容由基礎的國際金融環境切入，循序漸進討論外匯市場與外匯理論、多國籍企業的財務管理，以及匯率風險管理等主題，同時結合豐富的理論和時事議題探討，希望使修習本課程的學生置身多國籍企業財務經理人的角色，學習運籌帷幄，制定妥善的國際財務管理決策。\nThe course emphasizes broad concepts and practices, and provides a clear conceptual framework for analyzing key financial decisions in multinational firms. This course intends to introduce theories and concepts about international financial environment, foreign exchange market, multinational financial management, and risk management of exchange rate. Through abundant theories and practical materials, students will understand how to play the role of multinational financial manager, and how to make appropriate decisions of multinational financial management. Topics include international financial markets; foreign exchange rate; the relationships among interest rates, inflation, and foreign exchange rates; management of foreign exchange risk; motives for direct foreign investment; multinational capital budgeting; country risk analysis; capital structure decision; and international cash management.",
    "schedule": "第一週  第 1 章：跨國企業與國際財務管理\n第二週  第 2 章：匯率制度\n第三週  第 3 章：國際收支與國際經濟聯結\n第四週  第 4 章：匯率與外匯市場\n第五週  第 5 章：國際平價條件與匯率預測 (I)\n第六週  第 5 章：國際平價條件與匯率預測 (I)\n第七週  第 6 章：國際平價條件與匯率預測 (II)\n第八週  第 6 章：國際平價條件與匯率預測 (II)\n第九週  期中考\n第十週  第 7 章：外匯期貨市場\n第十一週  第 7 章：外匯期貨市場\n第十二週  第 8 章：外匯選擇權市場\n第十三週  第 8 章：外匯選擇權市場\n第十四週  第 9 章：金融交換市場\n第十五週  第 11 章：多國籍企業的現金管理\n第十六週  第 12 章：國際籌資與國際金融市場\n第十七週  期末總複習\n第十八週  期末考",
    "scorePolicy": "平時出席、討論、作業 (40%)\n〔出席成績之計算：採取累計等比級數扣分法，一次不到扣總平均分數 2 分，二次不到扣總平均分數 4 分，三次不到扣總平均分數 8 分，最多扣至 40 分！〕\n期中考 (30%)\n期末考 (30%)",
    "materials": "指定教材：\n黃志典 (2021)，《國際財務管理》，第三版，台北：華泰文化事業有限公司。\n\n參考教材：\n謝劍平 (2020)，《國際財務管理：跨國企業之價值創造》，第四版，台北：智勝文化事業有限公司。\nShapiro, A. C. & Sarin, A. (2022), Foundations of Multinational Financial Management, 6th Edition, Wiley.\nIn addition to the readings, you are expected to follow current events in the financial\npress, such as The Economist and the Financial Times.",
    "consultation": "每週二 12：00～14：00 地點：科研 727",
    "remarks": "智慧金融實驗室網頁：https://www.impactio.com/laboratory/ResearchCenterofArtificialIntelligenceTheSmartFinanceLab?tab=posts",
    "foreignLanguageTextbooks": false
  }
]
