[
  {
    "name": "葉賜旭",
    "email": "ssyeh@ntut.edu.tw",
    "latestUpdate": "2022-12-21 13:18:58",
    "objective": "This course is designed to enable students to understand the kinematic analysis methods, trajectory motion technologies, dynamic analysis methods, and force control methods of manipulators and robot arms so that students can perform robotics researches and applications in future based on the learned methods and technologies. This course first introduces the possible architectures and industrial applications of various fix-based manipulators and robot arms. After students have a proper concept of robotics, this course starts to explain detailed methods and technologies including kinematic analysis, path and trajectory planning, dynamic analysis, control design and analysis, and so on.",
    "schedule": "● Introduction (Lecture Note #1)\n● Rigid Motions and Homogeneous Transformations (Lecture Note #2)\n● Forward and Inverse Kinematics (Lecture Note #3)\n● Test #1\n● Velocity Kinematics – The Jacobian (Lecture Note #4)\n● Independent Joint Control (Lecture Note #5)\n● Path and Trajectory Planning (Lecture Note #6)\n● Test #2\n● Dynamics (Lecture Note #7)\n● Multivariable Control (Lecture Note #8)\n● Force Control (Lecture Note #9)\n● Final exam",
    "scorePolicy": "Test #1: 35%\nTest #2: 35%\nFinal exam: 30%",
    "materials": "Robot Modeling and Control, M. K. Spong, S. Hutchinson, M. Vidyasagar, WILEY, 2006.\nDeltaMOOCx: Robotics (http://tech.deltamoocx.net/)",
    "consultation": "Students can email (ssyeh@ntut.edu.tw) or use the course LINE group to discuss with the teacher, or go to the teacher's office to discuss during the teacher's consultation time.",
    "remarks": "In response to the epidemic prevention regulations, the teaching method of this course during the distance learning period: ● Evaluation method: Under the premise of complying with the epidemic prevention regulations, this course still retains the possibility that students must go to school to take tests. ● Course URL: https://teams.microsoft.com/● Course consultation: email or course website.● Supplementary Note: The teacher can adjust the course content, course schedule, and the evaluation and grading policy according to the epidemic and actual teaching situation.",
    "foreignLanguageTextbooks": true
  }
]
