[
  {
    "name": "李志鴻",
    "email": "cl4e@mail.ntut.edu.tw",
    "latestUpdate": "2022-12-20 18:26:33",
    "objective": "This course covers a wide range of fundamental technologies pertinent to Industry 4.0-Intelligent production, including a brief history of the industrial revolution, artificial intelligence algorithms, technologies and application examples of the Internet of Things, cloud service systems and information security technologies, big data management, analysis, and application examples, intelligent enterprise and factory management systems and applications, automation and robotics technology and applications, etc.",
    "schedule": "Week 1 Introduction to Intelligent Production\nWeek 2 The Past and Present of Artificial Intelligence\nWeek 3 Principles of Contemporary Artificial Intelligence\nWeek 4 IoT Fundamental Technologies and Applications:\nWeek 5 Smart Factory Application Examples\nWeek 6 Cloud Service System and Information Security Technology\nWeek 7 Cloud Architecture Security Methods\nWeek 8 Big Data Capture, Storage, and Management\nWeek 9 Mid-term examination\nWeek 10 Application Examples of Big Data\nWeek 11 E-Manufacturing System Architecture\nWeek 12 Manufacturing Execution System (MES) functions and applications\nWeek 13 Analysis of the pros and cons of Manufacturing Execution System (MES)\nWeek 14 Automation and Robotics and Applications:\nWeek 15 Intelligent Control System\nWeek 16 Robot Application Case Study\nWeek 17 Machine Vision System Architecture and Working Principle\nWeek 18 Final exam",
    "scorePolicy": "Report grade: 60%\nMid-term exam: 20%\nFinal exam: 20%",
    "materials": "Teacher's notes\nMachine Learning/Tom M. Mitchell/McGraw-Hill\nDeep Learning/Ian Goodfellow, Yoshua Bengio, Aaron Courville/MIT Press (http://www.deeplearningbook.org)",
    "consultation": "Place: Room 714-2, Integrated Technology ComplexTime: TBA",
    "remarks": "Every student must join the LINE group dedicated to this course. The teacher's laboratory extension: 2092, the location: 714-2 of the Comprehensive Science Museum, the teaching assistant laboratory extension: 2080.The adjustment of the class method in response to the epidemic will be announced immediately in the LINE group dedicated to the course.",
    "foreignLanguageTextbooks": false
  }
]
