[
  {
    "name": "李鎮宇",
    "email": "G.C.Li@ntut.edu.tw",
    "latestUpdate": "2022-12-16 16:39:19",
    "objective": "The purpose of this course is try to help students prepare to operate in and contribute to the 21st century. Regardless of whether a person intends to work in a business, for the government, or in a nonprofit organization, the concepts, strategies, and techniques of effective marketing are relevant. This course is:\nProviding from fundamental concepts through the major tasks associated with marketing to the strategic role of marketing in an organization.\nBringing early attention to the global nature of marketing.\nEmphasizing the similarities as well as the differences between consumer and business marketing.\nCombining demand forecasting with its logical antecedents-segmentation, targeting, and position.\nCovering marketing research, after students have been exposed to consumer and business markets and segmentation.\nIntegrating planning, implementation, and evaluation to provide a broad strategic context after students have a grasp of what marketing entails.",
    "schedule": "Week 1: Ch. 1 - Introduction (Dr. Gordon Li)\nWeek 2: Ch. 2 - Developing Marketing Strategies and Plans (Dr. Gordon Li)\nWeek 3: Ch. 3 - Gathering Information and Forecasting Demand (Dr. Gordon Li)\nWeek 4: Ch. 4 – Conducting Marketing Research (Dr. Gordon Li)\nWeek 5: Dr. Liu\nWeek 6: Dr. Liu\nWeek 7: Dr. Liu\nWeek 8: Dr. Liu\nWeek 9: Dr. Liu\nWeek 10: Dr. Liu\nWeek 11: Dr. Liu\nWeek 12: Dr. Liu\nWeek 13: Dr. Liu\nWeek 14: Dr. Liu\nWeek 15: Dr. Liu\nWeek 16: Dr. Liu\nWeek 17: Dr. Liu\nWeek 18: Dr. Liu",
    "scorePolicy": "See the other section for grading criteria",
    "materials": "Marketing Management: 7/E, An Asian Perspective, Philip Kotler,   Kevin Lane Kelle",
    "consultation": "Email the instructor",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "劉祐綸",
    "email": "y.l.liu@ntut.edu.tw",
    "latestUpdate": "2022-12-20 11:09:07",
    "objective": "This module examines recent developments in marketing thinking and market strategy development. It focuses on the dynamic aspects of market strategy development, and the creation of customer value. A further focus throughout the module will be the discussion of contemporary marketing issues to explore and to understand the complexity of marketing activities.",
    "schedule": "Week 01: Introduction to International marketing strategy \nWeek 02: Analyse and understand the marketing environment \nWeek 03: Culture in international marketing \nWeek 04: Global trade and integration \nWeek 05: Markets and segmentation in an international context and international positioning\nWeek 06: Market research in the international environment\nWeek 07: Principles of consumer characters and international product standardization and adaption\nWeek 08: Innovation marketing strategies\nWeek 09: Service marketing models\nWeek 10: Mid-term exam week (No class)\nWeek 11: Pricing and distribution \nWeek 12: IMC and international product and brand marketing\nWeek 13: International marketing channel management and core value delivery \nWeek 14: International sales promotions and public relations\nWeek 15: International marketing planning, organising, and control\nWeek 16: Ethics issues in international marketing\nWeek 17: Revision\nWeek 18: Final exam week (No class)",
    "scorePolicy": "40% Group presentation\n60% Individual report",
    "materials": "1. Strategic marketing: creating competitive advantage - Douglas C. West, John B.\nFord, Essam Ibrahim 2015.\n\n2. International Marketing (2e) - Baack et al., SAGE Publishing, 2019",
    "consultation": "y.l.liu@ntut.edu.tw",
    "remarks": "https://meet.google.com/owb-dqhq-sxi",
    "foreignLanguageTextbooks": true
  }
]
