[
  {
    "name": "李鎮宇",
    "email": "G.C.Li@ntut.edu.tw",
    "latestUpdate": "2023-02-20 19:46:05",
    "objective": "As 3rd year course in marketing research, this course is designed to\n\n1.\tIntroduce the role, scope, process and fundamental concepts of marketing and market research\n2.\tProvide an understanding of research methodology and its implementation \n3.\tSupport the student to do a real marketing research project (using SAS Viya)\n\nThe course emphasizes an applied approach with practical applications of marketing research in management. The class will introduce the basic concepts, and support the students on an independent research project– like actual projects in the industry. The project is intended to be enjoyable but also a preparation for project-based work encountered the industry. It will also be a useful project experience for future job applications.\n\nThis course contains two parts. The first part covers fundamental knowledge of marketing research. The second part covers the application of marketing research, through the visual tools of SAS Viya.",
    "schedule": "Week\tTopic\n1\tCourse Overview\n2\tIntroduction to Marketing & Marketing Research \n3\tDefining the Marketing Research Problem; Developing an Approach; Research Design \n4\tCausal Research Design\n5\tExploratory Research, Descriptive Research Design\n6\tMeasurement & Scaling\n7\tQuestionnaire Design \n8\tSampling & Sample Size Determination\n9\tExam Week\n10\tStatistics Review \n11\tAnalysis of Variance and Covariance\n12\tCorrelation and Regression\n13\tCourse Project Presentation and Feedback\n17\tCourse Revision\n18\tExam Week",
    "scorePolicy": "Participation, Homework, Quizzes            \t        33.3 %\nProject 1            \t            \t            \t            \t33.3 %\nProject 2\t            \t            \t            \t            \t33.3 %",
    "materials": "Naresh K. Malhotra, Marketing Research: An Applied Orientation, Pearson Education, 2020.",
    "consultation": "Contact the instructor by LINE or email.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
