[
  {
    "name": "張彥元",
    "email": "yenyuanc5163@gmail.com",
    "latestUpdate": "2023-02-20 23:06:23",
    "objective": "本課程旨在帶領學生讀、理解並分析國際時事，提高學生之英文能力，透過對多元主體之解析，讓學生了解單字用法，句型結構，特殊術語和慣用俚語等，提升閱讀能力，另外配合聽力技巧學習，提升理解能力。本課程著重英文閱讀，聽力與口說能力，鼓勵學生以英文討論國際時事，發表見解，拓展對世界的認識。\nThis course intends to enhance students’ reading, speaking and listening abilities by using quality newspapers, journals, interviews and podcast. It will help students enrich their vocabulary and acquire key English expressions and sentence patterns used in different realms like politics, arts, entertainment, science & technology, sports, business and health. Students learn to read, discuss and debate global issues through diverse forms of activities. This course familiarizes students with world affairs and broadens their perspective of the world.",
    "schedule": "週次 \t日期 \t課程內容 Contents\n一、         0223        Geopolitical Issues\n二、         0302        Geopolitical Issues\n三、         0309        Geopolitical Issues\n四、         0316        Global Economy \n五、         0323        Global Economy \n六、         0330        Global Economy \n七、         0406        Technological Trend\n八、         0413        Technological Trend\n九、         0420        Midterm Exam\n十、         0427        Cultural Events\n十一         0504        Cultural Events\n十二         0511        Environmental Issues \n十三         0518        Environmental Issues \n十四         0525        Environmental Issues \n十五         0601        Energy Issues\n十六         0608        Energy Issues\n十七         0615        Review \n十八         0622        Final Exam",
    "scorePolicy": "課堂參與: 40%  (課堂筆記 10%、課堂表現 10%、作業 10%、出席 10%)\n期中考：20% (詞彙句型與聽力測驗)\n期末考：20% (詞彙句型與聽力測驗)\n主題報告：20%",
    "materials": "1. Reading and listening material on global and regional issues will be provided at the beginning of the semester. Please have printouts for note taking in the class.\n老師於開學時提供國際時事閱讀及聽力內容請同學列印，上課中作筆記。\n\n2. Students will shares global and regional issues of their concerns during the semester.\n同學於課程中分享關切的時事議題",
    "consultation": "1.10 班群或郵件 yenyuanc5163@gmail.com",
    "remarks": "以學校提供 Ms Teams 平台遠距上課請申請學校 Google 帳號本課程為學年課，第二學期為延續課程，不增加修課人數。",
    "foreignLanguageTextbooks": false
  }
]
