[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2022-12-23 13:55:38",
    "objective": "本課程旨在提升學生學術英文能力，課堂將引導學生透過不同的學術聽力訓練、閱讀學術文章、學術寫作練習、與學術口語訓練等，來增進學生於大學英語授課課堂中的課堂參與，以及整體學術能力的展現，並為未來專業職場上語言能力奠定良好基底。\nThis course is designed for undergraduate students to develop their academic English language skills for success in English-medium university coursework. This course will engage students with active participation in a variety of academic listening, reading, writing, and speaking activities that they would encounter in real-life academic university lectures and professional workplace environments.",
    "schedule": "Note: The weekly schedule is occasionally subject to change due to time constraints, unexpected disruptions, or needs of the class.  Readings and assignments should be done before that week’s class.\n\nWeek\tTopic\n1\tCourse overview\n2\tUnit 6 \n3\tUnit 6 \n4\tUnit 7 \n5\tUnit 7 \n6\tLecture skills C\n7\tLecture skills C\n8\tUnit 8 \n9\tMidterm \n10\tUnit 8 \n11\tUnit 9 \n12\tUnit 9 \n13\tLecture skills D\n14\tUnit 10 \n15\tUnit 10 \n16\tLecture skills E\n17\tFinal presentations \n18\tFinal presentations",
    "scorePolicy": "The course adopts a 100 point scale for grading. Your grade will be based on the quality of your work in the following areas. The distribution of each item may be subject to change accordingly. \n                                                           \nAssignment\tPoints\nAttendance and participation \t10%\nWeekly assignments and exercises\t20%\nMidterm, performances and projects\t50%\nFinal presentation\t20%\nTotal\t100/100%",
    "materials": "Hewings, M. (2012). Cambridge Academic English: An integrated skills course for EAP. Cambridge: Cambridge University Press. \n\nOther supplementary materials may be provided.",
    "consultation": "Please contact the instructor regarding the course via email (hichen@mail.ntut.edu.tw).",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 因應疫情遠距教學之規劃，將以 Google Meet 進行線上課程，如有課程問題請聯絡：hichen@mail.ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
