[
  {
    "name": "李泳霆",
    "email": "ytl821@gmail.com",
    "latestUpdate": "2023-02-07 17:04:06",
    "objective": "化學是富挑戰性且具教學難度之科目，使這個複雜的學科讓學生易於接受化學教育家的挑戰，特別是基礎化學。嘗試推展關鍵的化學概念，並以觀察現象為主，再討論理論模式，並用以解釋所觀測的現象是本課程的重點。希望學生實踐 \"如同一個化學家的思考方式\" 來仔細觀察，而不是跳入公式或模型中。此外，舉例證明化學在現實生活中的重要性與最新的應用及發展並以簡易明瞭的方式呈現於授課內容。\nChemistry is a fascinating and important subject that is challenging to teach and even more challenging to learn. Marking this complex subject accessible to students without distortion is challenge of the chemical educator, especially at the introductory level.\nIn this lecture I try to develop key chemical concept in the same way to show the observations first and then discuss the models that have been constructed to explain the observed behavior. I hope students will practice \"thinking like a chemist\" by carefully studying the observation to see if they can follow the thought process, rather than just jumping ahead to the equation or model that will follow.\nIn addition, to demonstrate the importance of chemistry in real life, I have incorporated throughout the book a number of applications and recent advances in essay form.",
    "schedule": "Week 1  基礎化學\nWeek 2  原子、分子與離子\nWeek 3  化學方程式與化學計量\nWeek 4  化學反應\nWeek 5  氣態\nWeek 6  熱化學\nWeek 7  離子鍵與共價鍵\nWeek 8  分子幾何結構與化學鍵結理論\nWeek 9  物質狀態，液態，固態\nweek 10 溶液\nWeek 11 反應速率\nWeek 12 化學平衡\nWeek 13 電池\nWeek 14 酸與鹼\nWeek 15 酸鹼平衡\nWeek 16 熱力學與平衡\nWeek 17 有機化學簡介\nWeek 18 高分子化學簡介",
    "scorePolicy": "隨堂測驗（２次）：３０％\n期中考：３０％\n期末考：４０％",
    "materials": "使用教材：\n1. 「普通化學」，第 10 版，D. Ebbing and Steven D. Gammon 著，高憲明 譯著。\n\n參考書目：\n1. 「General Chemistry」, D. Ebbing and Steven D. Gammon, 10th edition.\n2. 「Chemical Principles: The Quest for Insight」, Peter Atkins, Loretta Jones, Leroy Laverman, 7th edition.\n3. 「Chemical Principles」, Steven S. Zumdahl, Donald J. DeCoste, 7th edition.",
    "consultation": "email: ytl@ntut.edu.tw",
    "remarks": "以實體授課為原則；若因疫情嚴重而暫停實體上課時，將使用 Google Meet 視訊上課。",
    "foreignLanguageTextbooks": false
  }
]
