[
  {
    "name": "程聖倫",
    "email": "scheng@ntut.edu.tw",
    "latestUpdate": "2023-02-18 09:51:00",
    "objective": "The objective of this course is to prepare students to understand the current theories, practices, tools and techniques in knowledge management (KM) to deal with the challenges with the organization and management of knowledge. This course addresses contemporary issues in managing knowledge, intellectual capital and other intangible assets by discussing the fundamental concepts of knowledge and its creation, acquisition, representation, dissemination, use and re-use, the role and use of knowledge in organizations and institutions, KM systems and its application in knowledge generation and transfer, and in the representation, organization, and exchange of knowledge, knowledge codification and system development, its testing, KM tools and portals, and finally ethical, managerial and legal issues in knowledge management.",
    "schedule": "01 2/20 Course introduction & Introduction to Knowledge Management\n02 2/27 No class (228 Memorial Day)\n03 3/06 The Knowledge Management Cycle\n04 3/13 Knowledge Management Models\n05 3/20 Knowledge Capture and Codification\n06 3/27 Knowledge Sharing and Communities of Practice\n07 4/03 No class (Children's Day)\n08 4/10 Knowledge Application/*Attending the annual meeting of AERA (American Educational Research Association)\n09 4/17 Midterm Week\n10 4/24 The Role of Organizational Culture\n11 5/01 Knowledge Management Tools\n12 5/08 Knowledge Management Strategy\n13 5/15 The Value of Knowledge Management\n14 5/22 Organizational Learning and Organizational Memory\n15 5/29 The KM Team\n16 6/05 Future Challenges for KM\n17 6/12 KM Resources/Final Presentation\n18 6/19 Final week",
    "scorePolicy": "Attendance (in-class participation + weekly reflection) 20%\nMid-term presentation and report 40% \nFinal presentation and report 40%",
    "materials": "Course materials will be prepared by the instructor.\n\nOptional:\n\nDalkir, K. (2011). Knowledge management in theory and practice (2nd ed.). Sage.",
    "consultation": "The best way to reach out to me is through my email: scheng@ntut.edu.tw. I am happy to speak with you during my office hours (10AM-noon on Mon/Thu)",
    "remarks": "Google Meet will be used in case in-person classes are suspended due to the pandemic. The instructor will send an invitation link to the whole class in advance.",
    "foreignLanguageTextbooks": true
  }
]
