[
  {
    "name": "曾昭衡",
    "email": "tsengco@ntut.edu.tw",
    "latestUpdate": "2022-12-28 14:15:58",
    "objective": "循環經濟是一種與傳統線性經濟（開採 - 製造 - 丟棄）不同的產業經濟模式，循環經濟就像自然生態循環一樣，是封閉且循環的經濟系統，透過重新設計產品和商業模式，促進更好的能源與資源使用效率、消除廢棄物及避污染自然環境。內容將包括發展及應用物質流分析及循環經濟的相關技術，全球性的循環經濟議題及案例分析，不同領域的企業生態，及跨學科創造永續的解決辦法。\nA circular economy is a regenerative system in which resource input and waste, emission, and energy leakage are minimised by slowing, closing, and narrowing material and energy loops. This can be achieved through long-lasting design, maintenance, repair, reuse, remanufacturing, refurbishing, and recycling. This is contrast to a linear economy which is a 'take, make, dispose' model of production. This course, further, contributes to the optimising systems rather than components, or the notion of ‘design for fit’. As a generic notion it draws from a number of more specific approaches including cradle to cradle, biomimicry, industrial ecology, and the 'blue economy. Additional benefit to students is learning of English language as medium of instruction is in English.",
    "schedule": "I] DAY 1 –Circular Economy and Material Flow Management:\ntheoretical background and international policy issues \n\nII] Day 2 \nPlanning aspects for Zero Emission Energy Systems\n Case study: 100% Renewable Energy for Cape Verde\n\nIII] Day 3 \nTechnical and Economic Planning aspects for Integrated Resource Management Centres of biomass and municipal solid waste\nPlanning aspects for Zero Emission Energy Systems\n\nIV] Day 4 \nCircular Economy and Applied Material Flow Management: Green business opportunities and regional added value\nWrap up discussion on Community Development\nStrategies based on Zero Emission Policies \nPlanning aspects for Integrated Water Resource Management",
    "scorePolicy": "class discussion\ngroup presentation\nexam",
    "materials": "PPT",
    "consultation": "p.heck@umwelt-campus.de",
    "remarks": "北科 i 學園 http://istudy.ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
