[
  {
    "name": "莊政達",
    "email": "ctchuang@ntut.edu.tw",
    "latestUpdate": "2022-12-25 22:28:12",
    "objective": "嵌入式系統目前愈來愈普遍。它將會大大地影響我們的生活方式。可攜式裝置如智慧型手機、掌上型電腦、以及所謂的 IA 裝置如家用網路閘道器、數位視訊錄影機、和常見的遊戲機都是屬於嵌入式系統的範疇。 在本課程中，我們將會討論何謂嵌入式系統、嵌入式系統的形式、以及如何建構一個嵌入式系統。由於嵌入式系統包含硬體及軟體的議題，我們也會探討相關的主題。本課程的先修課程包含計算機組織與結構、C 程式語言、資料結構、系統程式、以及作業系統。課程主要內容如下：嵌入式系統簡介與概論、嵌入式精簡指令集結構 ARM 指令集、嵌入式計算平台、嵌入式程式設計與分析、嵌入式作業系統、系統設計技術、裝置操作網路，本課程亦包含實習與學期專題作業。\nEmbedded systems are more and more popular today. It will affect the human life greatly. Portable devices like smart phone, PDA, and MP3 player, and so-called IA devices such as home gateway, DVR, and game machine are all categorized as embedded systems. In this course, we will discuss what an embedded system is, what it looks like, and how to build an embedded device. Since an embedded system involves hardware and software issues, we will discuss the related subjects. The prerequisite courses for this class include computer organization and architecture, the C programming language, data structure, system programming, and operating system. The major topics of this course are listed as follows: Introduction and Basic Concepts, The RISC Embedded Architectures, The ARM instruction Set, The Embedded Computing Platforms, Program Design and Analysis, The Embedded Operating Systems, System Design Techniques, Device Manipulation Networks, Experimental laboratories and case study.",
    "schedule": "第 1 週 課程簡介\n第 2 週 Linux 基礎指令\n第 3 週 Linux 基礎指令\n第 4 週 Linux 設定環境變數\n第 5 週 Vim 編輯器與 Shell 命令腳本\n第 6 週 Python 語言與開發工具\t\n第 7 週 NVIDIA Jetson GPIO 硬體控制\t\n第 8 週 NVIDIA Jetson GPIO 硬體控制 \t\n第 9 週 NVIDIA Jetson I2C LCD \n第 10 週 NVIDIA Jetson I2C LCD\n第 11 週 OpenCV 套件介紹\n第 12 週 NVIDIA Jetson 視覺影像偵測\n第 13 週 NVIDIA Jetson 視覺影像偵測\n第 14 週 NVIDIA Jetson 視覺影像辨識\n第 15 週 NVIDIA Jetson 視覺影像辨識\n第 16 週 NVIDIA Jetson 深度影像應用\n第 17 週 NVIDIA Jetson 深度影像應用\n第 18 週 期末專題報告",
    "scorePolicy": "實驗報告 : 70%\n專題報告 : 30%",
    "materials": "鳥哥，鳥哥的 Linux 基礎學習訓練教材，碁峰圖書，2017。",
    "consultation": "Office Hour:Mon. 10:00-12:00Wed. 13:10-17:10(Please make an appointment first.)Email: ctchuang@ntut.edu.tw",
    "remarks": "因應疫情警戒若調整為遠距教學資訊如下：Google Meet: meet.google.com/ait-jphn-fwb 聯絡方式: ctchuang@ntut.edu.tw 課程內容：公布於 i 學園 Plus。",
    "foreignLanguageTextbooks": false
  }
]
