[
  {
    "name": "張瑋倫",
    "email": "wlchang@ntut.edu.tw",
    "latestUpdate": "2022-12-19 19:12:48",
    "objective": "This course provides an overview of AI and its role in business transformation. The purpose is to improve understanding of AI and being used in the industries. The brief technical overview of AI will be covered such as big data, data mining, machine learning, etc. The objectives are to learn how digital technologies will be applied to various business settings and how to adapt business strategy and operation in the era of digital transformation. Finally, learning how to utilize AI as the source of competitive advantage.",
    "schedule": "W1: Orientation\nW2: AI for Business Course Intro  (Is AI a General Purpose Technology?) \nW3: Intro to Big Data and AI\nW4: Understanding the use of AI in business (chap 2&3 of T2)\nW5: AI (Machine Learning) (chap 4&5 of T1)\nW6: Business Applications of Machine Learning (chap 3 of T1)\nW7: OFF\nW8: Psychology of algorithm (chap 6&7 of T1)\nW9: AI-driven strategy (chap 4 of T2)\nW10: Midterm week\nW11: Building and Investing in AI-Based Businesses (R4)\nW12: Introduction to Business Analytics (R5, R6, R7)\nW13: AI tasks, organizational structures, and business processes (chap 5 of T2)\nW14: Jobs and skills in a world of smart machines (chap 6 of T2)\nW15: Risks with AI (chap 10 of T1)\nW16: Organizational, social, and ethical implications (chap 8 of T2)\nW17: Final Presentation",
    "scorePolicy": "Final project presentation: 60%\nAttendance: 10%\nAssignments: 30%",
    "materials": "Textbook:\nT1. A Human’s Guide to Machine Intelligence by Kartik Hosanagar \nT2: The AI Advantage: How to Put the Artificial Intelligence Revolution to Work (Management on the Cutting Edge) \n\nOther supplements:\nR1.Brynjolfsson E, McAfee A. 2017. The Business of Artificial Intelligence. Harvard Business Review. Available at: https://hbr.org/cover-story/2017/07/the-business-of-artificialintelligence.\nR2.Fountaine, T., McCarthy, B., & Saleh, T. (2019). Building the AI-Powered Organization. Harvard Business Review, 97(August), 1–13. • Hagiu, A., & R3.Wright, J. (2020). When Data Creates Competitive Advantage. Harvard Business Review, 98(January–February), 94–102.\nR4.Venkat Srinivasan, “Context, Language, and Reasoning in AI: Three Key Challenges,” MIT Technology Review, October 4, 2016 (https://www.technologyreview.com/2016/10/14/156968/context-language-and-reasoning-in-ai-three-key-challenges/)\nR5.Davenport article - “Competing on Analytics” (Harvard Business Review)  R6.LaValle et al. article - “Analytics: The New Path to Value” (MIT Sloan Management Review) \nR7.Davenport and Harris article - “The Dark Side of Customer Analytics” (Harvard Business Review) \nR8. Loveman article – “Diamonds in the Data Mine” (Harvard Business Review)",
    "consultation": "Please contact via email: wlchang@ntut.edu.tw",
    "remarks": "Google Meet + Google Classroom",
    "foreignLanguageTextbooks": true
  }
]
