[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-12-17 13:37:38",
    "objective": "The data analytics including statistics and many useful management science techniques is one of the ways we can make sense of the data and use it to make more effective decisions. This course deals with some of the important quantitative methods for strategic, tactical, and operational decision making. Actually, several decision modeling techniques including management science methods as well as data analytics discussed in this course have been applied successfully in diverse practical problems of business, government, healthcare, education, and many other areas. Thus, this course will help students develop problem solving and decision-making skills using Python. So, this course focuses on information and data engineering, computational reasoning applied, and decision management to the design of practical decision support systems. It implements the use of Python to discover patterns in data. So, in this course students will learn the concepts of descriptive and inferential statistics, several efficient data mining techniques, and their uses in decision making.",
    "schedule": "Week 1 Introduction to data analysis for decision-making\nWeek 2-3 Basic statistics: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 4-5 Hypothesis testing\nWeek 6 ANOVA\nWeek 7-8 Simple linear regression\nWeek 9-11 Multiple linear regression \nWeek 12-14 Interim presentation of individual project\nWeek 15-16 Clustering analysis and classification analysis\nWeek 17-18 Final presentation of individual project and submission of final report",
    "scorePolicy": "1. Assignment: 30 %\n2. Individual or team project: 60 %\n3. Attendance: 10 %",
    "materials": "Textbooks: \n(1) Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)\n(2) Data analysis and decision making, 4th Ed. by Albright, Winston, and Zappe\nSupplementary references: \n(1) An Introduction to Statistics with Python: With Applications in the Life Sciences, Thomas Haslwanter\n(2) Statistics and Machine Learning in Python, Edouard Duchesnay",
    "consultation": "Email, MS teams",
    "remarks": "MS teams",
    "foreignLanguageTextbooks": true
  }
]
