[
  {
    "name": "吳景龍",
    "email": "michaelwu@ntub.edu.tw",
    "latestUpdate": "2022-12-19 20:05:34",
    "objective": "本課程將閱讀並討論聯合國 2030 年持續發展議程的議題，主題和做法。 藉由對全球繁榮，社會平等和環境可持續性共同藍圖的認識，學生能進一步參加全球活動，並在本地和跨域發展共同夥伴關係，以參與持續發展目標的行動。 此外，學生將能夠通過批判性閱讀和討論來強化英語能力，並為與可持續發展目標有關的更深入的交流做好準備。\nThis course will read and discuss issues, topics, and practices of the UN’s 2030 agenda for sustainable development, adopted by all UN member states. With full insights and comprehensive views of the shared blueprint for global prosperity, social equality and environmental sustainability, students are expected to participate in global activities and form partnership locally and across borders to engage in SDGs actions. In addition, students will be able to enhance their English competence through critical reading and discussion, and will be prepared for more in-depth communication pertaining to the SDGs.",
    "schedule": "＊TBA",
    "scorePolicy": "Percentile of Fnal Grades (成績配分):\n1. Midterm Exam: 20%\n2. Group Presentation in the Class or Final Exam:  20 %\n3. Attendance, Individual Tasks (Homework, Solo Presentation, or Report), and Participation in the Classroom Discussions: 40 % (Note: Five Absences Leading to Failure) \n4. English Proficiency Test: 20%\n\n備註：本課程十八周之教學內容、進度、方法及成績評量方式等，除了校定不可更改之內容外，均為預期計畫。實際之教學內容、進度、方法及成績評量方式等，會依教師實際授課狀況及同學學習成效而定，教師保留彈性調整之權力。(Adjustments are made according to instructor's actual teaching schedule and students’ classroom performance and learning outcomes.)",
    "materials": "TBA",
    "consultation": "教師聯絡方式:michaelwu@mail.ntut.edu.tw or michaelwu@ntub.edu.tw 請同學注意：如果政府或學校宣布本課程進行遠距教學，則採遠距教學的模式，以 Microsoft Teams 或是 Google Meet 作為遠距教學同步線上課程方式，老師與同學間互相之聯絡及課程公告等，請同學留意上課所使用的 ZUVIO 或是與老師的電郵 michaelwu@ntub.edu.tw 聯絡。",
    "remarks": "*Email: michaelwu@mail.ntut.edu.tw or michaelwu@ntub.edu.tw 如遇遠距教學，請同學在上課前先下載 (Zuvio 校園) app 登入帳號為：學號 @ntut.edu.tw 登入密碼為: 123 (預設)- 同學登入後可自行更改 (註：如果同學以前用過 Zuvio, 且帳號是與：學號 @ntut.edu.tw 相同，且已改過密碼者，則用改過的密碼即可) 請於本課程第一次上課時間的前一天再用此帳號密碼登入此 app，檢查同學名字是否已經匯入，如無請跟老師電郵聯絡。太早登入可能同學資料尚未匯入而查無課程。",
    "foreignLanguageTextbooks": true
  }
]
