[
  {
    "name": "彭祖乙",
    "email": "johnpeng@mail.ntut.edu.tw",
    "latestUpdate": "2023-02-09 02:54:45",
    "objective": "企業常常是網路攻擊的主要目標，這門課程主旨在教育修課學生如何成功防禦常見的網路威脅並且確保自己的金融服務安全運作。\n本課程首先提供網絡安全的總體描述，指導同學了解目前面臨網絡威脅風險的一些最重要的服務和技術。熟悉該主題後，您將根據案例研究和現實生活場景探索特定技術和威脅。隨著同學們學習模組的進展，將發現漏洞和錯誤（包括人為風險因素），從而獲得有關最新威脅的專家級視野。然後，同學們將探索有關如何實現資料和基礎架構保護的資訊。在總結模組中，同學們將獲得流程和配置的最新重大更新，以及與基於資訊技術的金融服務中的網絡安全研究和開發相關的重要細節。\n在課程最後，同學們將接觸到並對未來資訊安全的技術有初步的了解，以及如何保護未來的金融服務與相關的基礎建設。\n同學們將會學到：\n?\t了解企業所面臨之網路威脅\n?\t探索如何辨識攻擊者\n?\t呈現弱點評估、軟體測試、滲透測試\n?\t使用緩解技術與補救計畫捍衛自己的金融網路\n?\t實做加解密系統\n?\t了解人工智慧如何影響網路安全\nEnterprises have always been a target of cybercrime. This course teaches you how to successfully defend your system against common cyber threats, making sure your financial services are a step ahead in terms of security.\nThe course begins by providing an overall description of cybersecurity, guiding you through some of the most important services and technologies currently at risk from cyber threats. Once you have familiarized yourself with the topic, you will explore specific technologies and threats based on case studies and real-life scenarios. As you progress through the modules, you will discover vulnerabilities and bugs (including the human risk factor), gaining an expert-level view of the most recent threats. You'll then explore information on how you can achieve data and infrastructure protection. In the concluding modules, you will cover recent and significant updates to procedures and configurations, accompanied by important details related to cybersecurity research and deve",
    "schedule": "week 1     Cybersecurity fundamentals: overview of  why, how, what \nweek 2-3   Application and finance related cases study \nweek 4-5   Penetration and attacks: system and network vulnerability\nweek  6-7  Network Security, intrusion and prevention\nweek  8     Special topic on providing secure infrastructure \n                  for finance industry\nweek 9     Mid-term report\nweek 10-12 Authentication and authorization: from cryptography to          \n                  application flow \nweek  13    Recover model and process\nweek  14    Standard and certificate \nweek   15   Special topic on providing secure application development\n                  for finance industry\nweek   16-18  Group project presentation",
    "scorePolicy": "• Homeworks, class participation: 30%\n• Midterm report & presentation: 30%\n• Final project: 40%",
    "materials": "Important security framework studies, such as\nhttps://csrc.nist.gov/\nhttps://fidoalliance.org/",
    "consultation": "johnpeng@ntut.edu.twcourse web site will be listed onhttps://tipeng.wixsite.com/school/",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
