[
  {
    "name": "王永順",
    "email": "ntutfitness@gmail.com",
    "latestUpdate": "2022-12-23 06:51:58",
    "objective": "The class will be taught in-person. In-person sessions will include active gameplay with another student or coach. This is an introductory course teaching the fundamental skills of table tennis. It is assumed that students enrolled in the class have little or no experience in table tennis. Class will be focusing on developing the following skills: racket grip, possible racket holding angles, basic strokes, rules, scoring, strategy, etiquette, practice drills, spin, singles play.\nNot limited to a students with advance level would like to join. For those of who should notice, some advance techniques would not be included in the course.\n\nPresent the student fundamental skills and knowledge of table tennis.\nImprove each student's skills in hitting all of the basic strokes: forehand counterhit; backhand\ncounterhit(drive); backhand flick(flip); backhand block; service return, and footwork.\nIntroduce each student to the basic rules, scoring, and footwork.\nOffer each student an opportunity to apply their skill and knowledge in match play.\nMake each student aware of the primary differences in strategies for singles and doubles and provide an\nopportunity to implement this information in actual match play.\nProvide each student with information about current table tennis trends, specifically regarding local\ntable tennis programs, professional tournaments and equipment selection.\nEncourage each student to pursue table tennis as a lifetime leisure activity.",
    "schedule": "#1~4weeks \nIntroductory phase: learning fundamental skills and knowledge.\n  EX., racket holding,  techniques of forehand, backhand, server.\n\n#5~10weeks\nGameplay phase: game rules introduction and practicing.\nDuring this phase, all students are required to play with other classmates in both single and double game match to familiar processes of the play.\n\n#11~18weeks\nMatching phase: single an double game competitions.\nIn this period, all students are randomly assign to a groups for competitions. For the final grade, to 40 points in total is requires for student to pass the class.",
    "scorePolicy": "Credits for passing requires following criteria:\n\nAttendance:\n*All classes should not be missing and unnoticed absent !!!!  \nStudent with full attendance get bounce 15% !!!\n\nFundamental point: 30%\n1) 40 continuous strike for both forehand and backhand strike\n2) Able to show different styles of serve\n3) Able to control the ball landing while strike back.\n\nGame matching: 40%\n1) All students required to attend every game in random assignment.\n2) Paper test\n\nLearning codes:15%\nThis class primary for physical exercising, not for the phone playing. In that, students, should, most fully aware of cell phone creaming is not allowed and dressing with proper clothes and pants while practice.",
    "materials": "This class will be taught in person, addition introductory handout depend on the need for each student.",
    "consultation": "Instructor: Yung-Shun Wang (James)Email: ntutfitness@gmail.comLineID: jamesgretaPlease feel free to contact for further manifestation.",
    "remarks": "Google meet link: update as pandemic goes post in Line group message.",
    "foreignLanguageTextbooks": false
  }
]
