[
  {
    "name": "鄭建文",
    "email": "ondinecomposer2@hotmail.com",
    "latestUpdate": "2023-03-23 03:30:19",
    "objective": "本課程以培養學生尊重與欣賞不同族群、不同時空、不同價值觀所產生的音樂而設。藉由對音樂元素、本質的認知及介紹，欣賞各時期作曲家之代表作品，培養西方音樂的基本常識，建立音樂欣賞的專業態度。教學目標：1. 提高學生音樂欣賞的素養，充實其音樂生活的內涵，2. 激發學生對音樂的興趣，培育愛樂人口，增進社會祥和的原動力，3. 介紹古今中外音樂名家名作，啟發學生對音樂創作的認知與敬重，4. 建立學生對古典音樂、民族音樂、應用音樂及通俗音樂等不同類型音樂的正確認知與包容力，培養世界性的音樂觀。授課內容：1. 概論，2. 歌樂，3. 器樂，4. 儀式音樂，5. 舞蹈音樂，6. 戲劇音樂。\nThis course aims to cultivate students' ability to appreciate music of different ethnic groups, different time and place, different value systems. Through the introduction of basic music elements as well as the appreciation of the masterpieces of various composers, it is hoped that students will build up basic music knowledge about music and enhance professional music appreciation potentiality in music. The goals include: 1. Elevating students' capability in music appreciation 2. Inspiring students' interest in music with a view to improving our society into a harmonious world. 3. Introducing domestic and international famous composers' pieces 4. Touring of various forms of music: classical, ethnic, applied and popular music. Contents of this course include: 1.Introduction 2. Vocal music 3. Instrumental music 4. Ritual music 5. Dance music 6. Theatre music",
    "schedule": "第一週：課程導論、欣賞音樂的角度與方法 \n第二週：中世紀音樂 - 音樂織體、教會調式、大小調性、葛利果聖歌、複音聖歌\n第三週：文藝復興時期音樂 - 複音音樂、模仿對位、對位法概論；Lute Song 介紹（Green Sleeves 欣賞)；巴洛克早期 - Monterverdi（歌劇的誕生 Orfeo）\n第四週：巴洛克早期音樂 - Lully 作品（La Roi Danse 電影介紹）\n第五週：巴洛克時期音樂 - Henry Purcell (Dido und Aneas 歌劇介紹）、Bach\n第六週：巴洛克時期音樂 - Handel （Farinelli 電影介紹）\n第七週：古典時期音樂 - 功能和聲概論、Haydn, 單主題奏鳴曲\n第八週：Mozart、非原調再現的奏鳴曲式 (Amadeus 電影介紹）\n第九週：期中報告\n第十週：Beethoven、動機發展、奏鳴曲式之材料運用、\n第十一週：浪漫樂派 - Schubert、Chopin（Chopin - Desire for Love 電影介紹)\n第十二週：浪漫樂派 - Schumann、Brahms（Beloved Clara 電影介紹）\n第十三週：浪漫樂派 - Liszt（Song without End 電影介紹）, Wagner、Puccini （La Boheme 歌劇介紹） \n第十四週：印象樂派 - Debussy, Ravel\n第十五週：現代音樂 - Schoenberg, Webern, Berg、電子音樂、頻譜主義 \n第十六週：美國當代音樂劇 - 百老匯名曲賞析、變身怪醫、版本比較\n第十七週：跨界音樂作曲家、歌手、歌曲介紹 - 李泰祥、齊豫（古典、民歌）、Sara Brightmen、迪瑪希、鄭雲龍、阿云嘎 （音樂劇、古典、流行歌）Úyanga Bold、薩頂頂 （民族音樂、流行歌）。期末報告。\n第十八週：期末報告",
    "scorePolicy": "期中報告、期末報告（60%）、課堂參與（40%）\n\n報告方式：8 分鐘的音樂作品解析口頭報告與書面報告（每組至多 5 人），包含「期中前期企劃報告」，以及「期末口頭與書面報告」，期中、期末皆需需製作投影片。報告的焦點可以包含：作曲家簡介、作品靈感來源或創作背景、作品的曲式、作品風格、樂器使用、個人心得、演奏版本比較、靜態或動態之音樂視覺化呈現（例如：https://youtu.be/71hNl_skTZQ) 等。",
    "materials": "1.《音樂史與欣賞》，楊沛仁，美樂出版。\n2. A Hitory of Western Music，D.J.Grout/C.V.Palisca，Norton",
    "consultation": "透過 facebook 課程群組以及授課老師的粉絲團進行諮詢 https://www.facebook.com/chienwen2016/",
    "remarks": "遠距教學相關公告與資訊聯絡，請至下列連結：https://reurl.cc/WkNKxL 課程對應 SGDs 指標：3. 健康福址；4. 教育品質指標對應授課內容：音樂自古以來就被公認為具有安撫心靈的作用。本課程全部內容引導學生學習欣賞音樂，故有助於學生透過音樂來抒發情感、或安定心神，能提升「健康福祉」。此外，本課程引到學生聆聽並分析古典音樂，能訓練學生同時以理性與感性進行音樂賞析，可提升學生的人文素養，並陶冶身心，進而提高「教育品質」。",
    "foreignLanguageTextbooks": false
  }
]
