[
  {
    "name": "葉惠蘭",
    "email": "hlyeh@ntut.edu.tw",
    "latestUpdate": "2022-12-28 13:21:55",
    "objective": "「生活美學」是現代人依據東西方文化及各方美學的定義所推論出來的名詞，指應用於「生活」中食、衣、住、行、育、樂所體現美的內容及活動。依循相異的生活型態、社會環境，人類試圖重構生活藝術化與藝術生活化的當代美學。\n“Aesthetics of living \" will address the East-West cultural and aesthetic experience through series of questions that drive the discourse in contemporary life’s content and activities. Following the different lifestyles, social environment, human tries to reconstruct everyday life into contemporary aesthetics of living. This course aims to encourage students to think what is aesthetic of living, through the real life and spiritual life and concerned itself with the aesthetic problems in the lives of others.",
    "schedule": "2023/2 生活美學–嗅味覺美感體驗       週一 7、8 / 614\n1. 課程概述 / 思路原理 / 自介       \n2. 課堂管理﹝確認人數、選班長建群組、選總務傳印講義﹞\n   一、品飲的嗅覺味覺觸覺 / 發講義\n3.  二、審美心理要素及其培養\n       ●交作業一：我的 24 小時養生企劃\n      （搜尋相關資料：四季、24 節氣與我、個人生辰八字、地球自轉、地心\n       引力與我的身體、九種體質與我、2017 諾貝爾獎生理時鐘）\n4.  二、審美心理要素及其培養\n       ●交作業二：清大林秀豪教授等視頻觀後\n      （如：嗅覺與量子力學的 關係 ）﹝500 字以上﹞        \n5.  三、中國茶文化源流及台茶特色     \n6.  三、中國茶文化源流及台茶特色\n7.  四、六大茶類及其製成\n8.  五、茶類泡法及器用\n9.  五、六大茶類茶藝實務\n10.     A 小壺泡\n        朱泥 / 高山烏龍、紫砂 / 凍頂  \n       B 蓋碗泡                 \n11. 筆試  \n12. 六、大碗泡––微禮茶儀預備\n13. 六、茶儀「想念」身心品飲修煉實驗（●課堂交作業三）\n14. 七、「席」–說品香\n15. 七、「席」–說茶藝\n16. 八、四般閒事–從口韻身心到 Wabi Sabi       \n17. 期末個別心得分享「個人茶席（茶座茶店）體驗談」5-8 分鐘  \n18. 期末個別心得分享「個人茶席（茶座茶店）體驗談」5-8 分鐘\n    / 結算成績\n以上課程進度及單元增刪以開學第一週上課發布的內容為準據",
    "scorePolicy": "期中筆試              40%\n作業一、二、三、      30%\n出席                  10%\n期末報告              20%",
    "materials": "茶學相關資料專書",
    "consultation": "1. 課後諮詢",
    "remarks": "※當疫情嚴峻採遠距上課時注意事項：1. 期中考仍採到校實體紙筆測驗，期末報告改為線上報告 2. 遠距上課期間，實體筆試及 13 週茶儀「想念」主題執行，仍擬到校在教室舉  行，全班同學除實地品飲外，均應戴上口罩 3. 教材擬於首次上課時指定一位同學處理轉傳事宜 4. 作業統一由總務線上代收，再轉傳給老師 5. 擬將上課的 Google meet 碼公告於 i 學園與課程大綱，依上課時間表上課。※居家隔離者 ●實體課時，請觀看上課錄影（全多錄）；線上課時則一同線上參與 ●課綱中的作業一與全班同學同時交出 10% ●期中報告（取代期中筆試）1.\t品飲的嗅覺味覺觸覺認知及清大林秀豪教授視頻（「嗅覺與量子力學的關係」）心得（600–1000 字內）20%2.\t過去人類值得學習的一項生活事物﹝500 字﹞20%3.\t中國茶文化源流及台茶特色（約 1000 字）30%●期末報告（取代班級期末團體報告）  試設一茶席，並說明配置構思 20%●期中報告於第 10 週以前繳交，期末報告於 17 週以前繳交  必署班級、學號、姓名  交寄 hlyeh@mail.ntut.edu.tw●任課教師保有電詢（或視訊）後調整配分的權利",
    "foreignLanguageTextbooks": false
  }
]
