[
  {
    "name": "李禮仲",
    "email": "Lawrencelee61@hotmail.com",
    "latestUpdate": "2023-05-01 10:40:25",
    "objective": "Law is the rules for social life. Focusing on real-world cases, the course of Law and Social Life aims to help non-law students have a clear view of the Taiwanese legal system. Also, this course aims to help the students comply with the law and understand the ways in which they can secure their rights. Professors teaching this course make use of a series of judgments to make students be familiar with the legal rules. This course covers the fundamental concepts and knowledge of a number of law subjects, ranging from civil code, criminal code, administrative law, and business law to intellectual property law and procedural law.",
    "schedule": "Introduction to Law provides an overview of the law and the legal system.  This course covers \n1-3 weeks . Concept of law (concept of criminal)\n4-5 weeks  Global law/ legal system  (ciminal justice)\n6 week     . Introduction to Taiwan legal system\n7-8 weeks  Selected Specific topical laws (international law, labor law, trading law, taxation law and human right law, etc.)\n9 week guiding students to prepare the presentations presented after midterm exam\n10-18 weeks. each student has to prepare a presentation to introduce to the legal system of the country he or she comes from.",
    "scorePolicy": "class performance 40%\npresentation 60%",
    "materials": "hand-in copied materials  and legal articles designed for the class",
    "consultation": "iCampusdiscuss with instructor via e-mail at lawrencelee61@hotmail.com",
    "remarks": "* 課程對應 SDGs 指標: 15 陸域生態 * 1. In response to the development of the epidemic, please follow the information published on the school website for teaching and teaching methods this semester: (https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 2.If you have any further questions, please contact the teacher's mailbox: lawrencelee61@hotmail.com Mobile phone: 0922-001-883* The course corresponds to SDGs indicators: 16. Peace and justice system*Indicators correspond to the teaching content: criminal responsibility and criminal legal procedures in the 3rd to 5th weeks",
    "foreignLanguageTextbooks": true
  }
]
