[
  {
    "name": "王韶君",
    "email": "skwang@ntut.edu.tw",
    "latestUpdate": "2022-12-19 19:27:10",
    "objective": "本課程，擬引領修課同學們徜徉古今愛情文學作品；內容含括詩、詞、散文、小說、戲曲、視聽影像等，並以主題單元方式進行之。從中，仔細咀嚼或清澀曖昧、或清新動人、或可歌可泣、或刻骨銘心、或纏綿悱惻、或黯然銷魂的愛情文學作品；從中，與作品中所傳達的心情、心事、心聲產生共鳴，由此來發現：在塵世的繁華裡，情感的傳遞是沒有時空隔閡，是可以心心相映。\n鑑於修課同學正值青春年華、正將展翅翱翔，因此本課程除了鑑賞、品味古今愛情文學作品，並欲與吾人現實人生作一連結，由此思考愛情、婚姻、兩性、家國、社會、政治等議題，由此尋求愛情的本質與真諦。\nThe course to be taught to lead students know the love of ancient and modern literature; content encompasses poems, prose, fiction, drama, music, video works, etc., and will be conducted in a manner theme unit. From this, clear astringent taste ambiguous, fresh and moving, epic, unforgettable, deeply grieved and other types of love literature. \nIn the process, the works convey mood, thoughts, aspirations, etc. to produce spiritual resonance. Thus to discover: In dust, there is no time and space to pass emotional estrangement, is matched heart.\nAs the students is young, will start his life being so understanding of the course in addition to the love of ancient and modern literature, and our desire to make a real life connection. Thus thinking love, marriage, gender, home country, society, politics and other topics. Thus, the nature and essence of seeking love.",
    "schedule": "週次\t    日期\t  課程主題\n1\t2 月 23 日\t課程介紹\n2\t3 月 2 日\t詩歌與愛情\n3\t3 月 9 日\t從媒妁之言到自由戀愛\n4\t3 月 16 日\t愛情守則\n5\t3 月 23 日\t殘缺的愛情\n6\t3 月 30 日\t跨國籍的愛情\n7\t4 月 6 日\t戰爭與愛情\n8\t4 月 13 日\t台灣歌謠與青春夢\n9\t4 月 20 日\t期中考週\n10\t4 月 27 日\t浪漫愛與羅曼史\n11\t5 月 4 日\t性別與愛情：孽子與百合\n12\t5 月 11 日\t當代流行文化與性／別\n13\t5 月 18 日\t性／別暴力\n14\t5 月 25 日\t傳統與反傳統\n15\t6 月 1 日\t跨物種愛情\n16\t6 月 8 日\t如何「文學」，怎樣「愛情」\n17\t6 月 15 日\t期末考週",
    "scorePolicy": "1. 即席口說 30%\n2. 即席寫作 30%\n3. 期末書面報告 40%",
    "materials": "1. 梅家玲、郝譽翔主編，《小說讀本》上、下（台北：二魚文化，2015）。\n2. 席慕蓉，《無怨的青春》（台北：圓神出版社，2000）。\n3. 李維菁，《老派約會之必要》（台北：印刻，2012）。\n4. 林奕含，《房思琪的初戀樂園》（台北：游擊文化，2017）。\n5. 李奕萱，《美玲的記憶咖啡館》（台北：蓋亞，2022）。\n6. 洪愛珠，《老派少女購物路線》（台北：遠流，2021）。\n7. 陳雪，《惡女書》（台北：印刻文學，2018）。\n8. 白先勇，《寂寞的十七》（台北：遠景，1987）。\n9. 劉梓潔，《遇見》（台北：皇冠，2014）。\n10. 王家祥，《海中鬼影：鰓人》（台北：玉山社，1999）。",
    "consultation": "可於課堂上與老師和同學討論，或寫信至教師信箱諮詢：skwang@mail.ntut.edu.tw。",
    "remarks": "課程對應指標：5. 性別平等指標對應授課內容：實現性別平等及所有女性之賦權因應疫情，一俟學校通知，即刻採取遠距教學，教學軟體使用 Microsoft Teams 。教師聯絡信箱：skwang@mail.ntut.edu.tw。",
    "foreignLanguageTextbooks": false
  }
]
