[
  {
    "name": "陳建文",
    "email": "a868@ntut.edu.tw",
    "latestUpdate": "2022-12-20 15:43:16",
    "objective": "本課程重視閱讀以及課堂主動參與討論，配合每週授課進度有相當多的課堂作業與討論。會於課堂進行劇本以及攻防答辯作業，再將作業成果於課堂發表，運用於講解處理爭議相關知識的教學活動。歡迎對跨領域學習﹑創新創作﹑戲劇賞析有興趣且保持開放心態的同學修習。如不愛思考討論﹑不想作業太多或是會時常缺課的同學，請勿選課。\n\n        大學畢業後多數人會進入工作生活，成為勞工或是雇主而為社會付出貢獻。工作生活中的勞雇雙方會遭遇種種勞工問題甚至發生勞資爭議，因此需要瞭解勞工問題以及因應處理勞資爭議的相關學習準備。針對工作生活的學習準備，通識課程設計了勞動法﹑勞工問題與勞資爭議這兩門關聯課程。\n\n       勞動法課程的教學以法規制度面為主，輔以勞動法 K 歌教室磨課師教材，以及司法判決分析報告的課堂討論，協助同學瞭解職場生活的相關勞動法規知識。至於勞工問題與勞資爭議課程著重於思考勞資相處人際互動的學習，除了介紹勞工問題及勞資爭議的基本概念外，主要輔以相關實際勞資爭議案例的檢討分析，讓同學進行勞資人際互動的演練討論，過戲劇創作虛擬體會職場人情世故，由不同角度觀察思考勞動爭議的問題現象，藉此培養對於職場溝通的社會敏感度、以及解決能力。\n  \n     勞工問題與勞資爭議課程授課方法的主要特色是，以勞資爭議的司法判決，作為學生學習媒介教材，但一反傳統直接講解判決所涉相關法律規定與解決爭議相關知識的教學作法，改採以「劇本創作﹑心理調適與法律攻防」為一體多面的跨域學習模式來從事教學創新。\n \n     本課程綜合融會了文學、心 (理) 學、法學進行領跨域學習。《文學》，靠《文》感受、體會《人理》。《心學》，由《心》來分析、探究《人理》。《法學》，藉《法》來觀察、瞭解《人理》。在複雜變動的現代社會，勞資人際爭議的管理、處理、經理需要作更多元脈絡的理解。希望透過這三種圍繞的《人》（個體與群體、自我與人際）的知識專業，來多方探究、殊途同歸，探究《人理》，學會《理人》的技巧。\n\n      借用手機 APP 應用程式的比喻來說本課程平台分別自文學﹑心 (理) 學以及法學引進 APP 應用程式來提醒學生關懷自我未來的工作生活關係體會思索未來工作生活中的人情、人性、人心問題。文學的 APP 應用程式借助國語文專業，指導同學整理判決故事、改編劇本讓其在劇本創作過程中自然體會甚麼叫作「人生如戲」。心理學的 APP 應用程式，解剖分析人際爭議為難困惑﹑判斷抉擇的心理掙扎，學習應用心理學實用知識。法學的 APP 應用程式則指導同學自行準備模擬演練勞資雙方的法律攻防見識法庭訴訟勝負立見「人生如球」的對立緊張競爭氛圍。",
    "schedule": "本課程重視閱讀以及課堂主動參與討論，配合每週授課進度有相當多的指定主題閱讀報告，可以透過課前閱讀與課堂討論之交叉學習，獲得思考處理未來職場問題的能力。如不愛思考討論或是會時常缺課的同學，請勿選課。\n\n第 1 週  課程內容及上課方式說明\n第 2 週  企業與現代社會\n第 3 週  勞資關係的倫理思考 — 企業治理、企業社會責任與企業利害關係人\n第 4 週  勞資關係的民主思考 — 企業王國？企業帝國？企業民國！：企業勞資關係看待圖像的勾勒描繪\n第 5 週  職場規範的形成與建立 - 勞動法法源體系及運作原理\n第 6 週  定型化勞動契約約款的簽訂與爭議處理\n第 7 週  工作規則單方變更勞動條件的爭議處理\n第 8 週  團體協商誠信協商義務的爭議處理\n第 9 週  期中考試\n第 10 週  勞資關係勝任工作之倫理要求\n第 11 週  不能勝任工作之民主處理（一）：程序正義要求\n第 12 週  不能勝任工作之民主處理（一）：實體正義要求\n第 13 週  企業紀律要求與違紀懲戒：各種懲戒事由\n第 14 週  懲戒事由的審查思辨\n第 15 週  企業懲戒的實質正當性審查\n第 16 週  企業懲戒的程序保障問題\n第 17 週  就業歧視與不當勞動行為的救濟處理\n第 18 週  期末考試",
    "scorePolicy": "筆試（期中考。期末考）30％\n課堂報告 40％\n平常分數 30％（包括出席到課、參與討論、作業表現）",
    "materials": "1. 勞動法參考書籍及教科書:\n黃程貫，勞動法，國立空中大學，2001 年。\n黃越欽著。黃鼎佑增修，勞動法新論，翰蘆總經銷，第 5 版，2015 年 8 月 17 日。\n焦興鎧等，勞動基準法釋義：施行二十年之回顧與展望，新學林，2005 年。\n郭玲惠，勞動契約法論，三民，2011 年 9 月 1 日。\n鄭津津，職場與法律，新學林，修訂 5 版，2015 年 10 月 30 日。\n楊通軒，個別勞工法：理論與實務，五南，第 5 版，2017 年 9 月 10 日。\n楊通軒，集體勞工法：理論與實務，五南，第 5 版，2017 年 9 月 10 日。\n劉志鵬，勞動法解讀（勞資爭議致勝錦囊），元照，2000 年。\n陳金泉，勞動法一百問，三民 ，修訂 3 版，2015 年 7 月 17 日。\n2. 判決案情編劇課的相關參考資料\n楊翠、朱宥/ 主編，國文開外掛：自從看了這本課本以後，奇異果文創事業有限公司，2018 年 2 月 1 日初版。\n朱宥，只要出問題小說都能搞定，大塊文化出版股份有限公司，2017 年 4 月。\n黃榮堅，靈魂不歸法律管：給現代公民的第一堂法律思辯課，商周出版，2017 年 9 月 30 日初版 5 刷。\n吳碩禹 / 譯，克利斯多福。強森 / 著，微寫作：短小訊息的強大影響力，文案、履歷、簡報、網路社交都好用的語言策略（Microstyle: The Art of Writing Little）， 漫遊者文化出版，2012 年 8 月 1 日出版。\n梅家玲，世說新語的語言與敘事，里仁書局，2004 年 7 月 30 日初版。\n黃致凱 / 編著，李國修編導演教室，2016 年 3 月初版 5 刷。\n陳榮彬 / 譯，麗莎。客隆 / 著，大小說家如何唬了你？依據會就拐走大腦的情節製作術，2014 年 5 月初版。\n幸佳慧，親子共熬一鍋故事湯，天下文化，2016 年 8 月 29 日初版。\n王鼎鈞，作文七巧，爾雅出版有限公司 2003 年 4 月 20 日初版。\n蔡淇華，寫作吧！你值得被看見，時報文化出版企業有限公司，2016 年 6 月 20 日初版。\n張嘉驊，作文攻頂：創意、故事、邏輯與詩性的大貫通，遠見天下文化初版有份有限公司，2015 年 8 月 25 日第 1 版。\n3. 其他資料參考網站：Lawsnote:http://www.lawsnote.com/\n司法院全球資訊網司法智識庫 http://fjudkm.judicial.gov.tw/\n書狀參考範例 http://www.judicial.gov.tw/assist/assist03.asp\n裁判書查詢 http://jirs.judicial.gov.tw/FJUD/\n全國法規資料庫 http://law.moj.gov.tw/",
    "consultation": "課程諮詢管道：共同科館 5 樓 506 研究室 分機：3026",
    "remarks": "實際實施依學校網頁訊息為準：遇防疫遠距教學則改為期中報告與期末報告評量。全校遠距教學：1. 採用 GOOGLE MEET 線上教學 2. 課程 LINE 群組課程訊息溝通管道：1. 勞動法討論區 臉書社團: https://www.facebook.com/groups/3791110055254542. 勞動法課程 LINE 群組 (QR 碼提供於上述課程臉書社團)",
    "foreignLanguageTextbooks": false
  }
]
