[
  {
    "name": "陳澤興",
    "email": "tzershing.chen@ntut.edu.tw",
    "latestUpdate": "2023-03-04 14:10:12",
    "objective": "本課程使學生對燃料電池的基本原理、關鍵技術、以及商品化發展與應用過程，有所瞭解並加以分析及探討。\n燃料電池是一種電化學的發電裝置，其運作原理係利用電化學反應將燃料內之化學能直接轉換為電能，因其在能量轉換過程中並不經過熱機過程，因此能量轉換效率較高。本課程之授課綱要可分為以下幾項：\n燃料電池簡介、燃料電池之效率、質子交換膜燃料電池、磷酸燃料電池、鹼性燃料電池、直接甲醇燃料電池、固態氧化物燃料電池、燃料電池的燃料供應、燃料電池之計算實例。\nThis course enables students to fully understand the basic principles of the fuel cell, key technologies, and the commercialization of the development and the application process, and to analyze and discuss the design of fuel cell system.\nFuel cell is an electrochemical power generating device. It can directly convert the chemical energy of fuel into the electrical energy via the electrochemical reaction. Because it does not go through the process of thermal engine in the energy conversion process, and therefore a higher energy conversion efficiency. Teaching outlines of the course can be divided into the followings:\nIntroduction to fuel cell, Fuel cell efficiency, Proton exchange membrane fuel cell, Phosphoric acid fuel cell, Alkaline fuel cell, Direct methanol fuel cell, Solid oxide fuel cell, Fueling fuel cell, Calculation example of fuel cell.",
    "schedule": "第 01 週：燃料電池的歷史與原理 (燃料電池的歷史、燃料電池的原理)\n第 02 週：鹼性燃料電池 (AFC) (原理與特徵、電池組成與性能、技術開發現狀與未來)\n第 03 週：磷酸型燃料電池 (PAFC) \n          (原理與特徵、電池組成與性能、技術開發現狀與未來、小考 1)\n第 04 週：熔融碳酸鹽燃料電池 (MCFC)\n          (原理與特徵、電池組成與性能、技術開發現狀與未來)\n第 05 週：固態氧化物燃料電池 (SOFC)\n          (原理與特徵、電池組成與性能、技術開發現狀與未來)\n第 06 週：質子交換膜燃料電池 (PEMFC)\n          (原理與特徵、電池組成與性能、技術開發現狀與未來、小考 2)\n第 07 週：直接甲醇燃料電池 (DMFC)\n          (原理與特徵、電池組成與性能、技術開發現狀與未來)\n第 08 週：再生式燃料電池 (RFC)\n(原理與特徵、電池組成與性能、小考 1~2 講解) \n第 09 週：期中考\n第 10 週：燃料電池的計算與分析 (可逆電位、溫度效應、操作電壓、反應物組成)\n第 11 週：燃料電池的發電與測試 (SOFC、PEMFC)\n第 12 週：燃料電池的電能輸出 (交換式電源、開關調整器、轉換器)\n第 13 週：燃料電池之應用 Ⅰ: 家庭用 (熱電共生、不斷電系統、燃料改氫能)\n第 14 週：燃料電池之應用 Ⅱ: 公共設施用 (飯店、救災、販賣機、廚餘、汙水處理)\n第 15 週：燃料電池之應用 Ⅲ: 燃料電池公共汽車 (小考 4)\n第 16 週：燃料電池之應用 Ⅳ: 燃料電池汽車 \n第 17 週：燃料電池之應用 Ⅴ: 燃料電池機車 (小考 3~4 講解)\n第 18 週：期末考",
    "scorePolicy": "1. 出缺席狀況 (20 %) → 無故缺席扣 3% / 次 (向教務處請事病假扣 1%/ 次)\n2. 期中考        (30 %)\n3. 期末考        (30 %)\n4. 小考 4 次      (20 %)",
    "materials": "使用教材: \n個人自編之講義\n\n參考書目:\n1. 燃料電池技術、作者：電氣學會・燃料電池發電次世代技術調查專門委員\n會編、溫武義編譯 出版商：全華圖書初版一刷（年月）93 年 8 月。\n2. 燃料電池百科、作者：本間琢也監修、溫武義編譯 出版商：全華圖書 初版\n （年月）93 年 11 月\n3. 燃料電池、作者：黃鎮江編著 出版商：全華科技圖書 初版一刷\n （年月）92 年 11 月\n4. 燃料電池技術、作者：逍鋼編著  管衍德校訂 出版商：全華圖書 初版一刷\n （年月）99 年 3 月\n5. 綠色能源、作者：黃鎮江編著、出版商：全華圖書 三版二刷（年月）110 年 3 月\n6. 能源概論、作者：陳維新編著、出版商：高立圖書 十版（年月）111 年 2 月\n7. 燃料電池原理 量測與建模、作者：張寬裕編著  蕭永嘉、盧建余、張啟原斜編 \n  出版商：鼎茂圖書 一版（年月）99 年 6 月",
    "consultation": "1. 課程諮詢時間 Office hour : 綜合科館研究室：611-4 每周二 (第 A 節 : 18:30~19:20) 請同學事先跟老師預約時間 2. 開學後組成線上群組 Line group discussion: to be announced.",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 本學期課程因應疫情警戒上課方式，請依照學校網頁所公布之訊息為準：遠距上課授課及評量方式說明如下：1. 上課方式：線上會議室 Google Meet2. 課程資訊 line 群組: to be announced.3. 評量方式：期中考、期末考改採自主測驗 (take home exam) 加線上口試。",
    "foreignLanguageTextbooks": false
  }
]
