[
  {
    "name": "陳圳卿",
    "email": "cceugene@ntut.edu.tw",
    "latestUpdate": "2023-02-22 15:24:56",
    "objective": "隨著高齡化社會的來臨與國家對於身心障礙者生活福祉的重視，輔助科技相關資源與人才需求日益倍增，各類輔具產品使用已成為這些族群在醫療照護上與生活品質提升上不可或缺的一環。本門課程為「生醫輔助科技跨域微學程」之入門基礎課程，建立學生對輔助科技有基本的通盤認識，期許未來具備相關能力投入輔助創新產品研發。若未來有志投入輔助科技相關產業工作，建議微學程可由此門課程開始選修。\n由於輔助科技涵蓋醫學與工程相關領域專業知識技術的整合，故由本校與臺北醫學大學攜手合作，兩校多位教師一同共授，提供兩校各 20 位學生選修，以促進學生或教師間的交流合作，本課程上課地點除了在本校，將有部分週次於北醫校園上課。\nWith the advent of aging society and the country's emphasis on the well-being of people with physical and mental disabilities, the demand of assistive technology resources and manpower is getting increased. The use of various assistive products has become an indispensable part for these people in medical care and quality of life. Assistive technology covers and integrates expertise in medicine and engineering related fields. The aims of this course are to let students have the comprehensive understanding of the current status and future trends of assistive technology. This course is the basic course for the “Assistive Technology Interdisciplinary Program”. If students consider to involve assistive technology-related industries in the future, we encourage students to enroll this course.",
    "schedule": "1\t02/15\t課程介紹：上課模式\t彭志維老師 (北醫) 陳圳卿老師 (北科)\n2\t02/22\t期末報告說明 + 輔助科技導論簡介\t彭志維老師 (北醫)\n3\t03/01\t輔助科技新創個案討論 - 遠距上課\t邱士峰老師 (成大)\n4\t03/08\t輔助科技基本介紹 - 遠距上課\t陳適卿老師 (北醫)\n5\t03/15\t輔具基礎介紹\t林立老師 (北醫)\n6\t03/22\tATlife 臺灣輔具暨長期照護大展 (https://www.chanchao.com.tw/ATLife/ ) 彈性課程，同學需於 05/04 (四)-05/07 (日) 期間撥空一日參訪，折抵本週課程內容，當日須拍照證明於會場實際參觀，並撰寫心得報告\n7\t03/29\t行動輔具\t彭志維老師 (北醫)\n8\t04/05\t民族掃墓節放假\t\n9\t04/12\t高齡健康科技需求\t簡文山老師 (北醫)\n10\t04/19\t生物力學原理與應用\t陳肇祈老師 (北醫)\n11\t04/26\t參訪：衛福部多功能輔具資源整合推廣中心\t彭志維老師 (北醫)\n12\t05/03\t多感官回饋與實境科技及其應用\t韓秉軒老師 (北科)\n13\t05/10\t電腦視覺在醫療影像中的應用\t賴冠廷老師 (北科)\n14\t05/17\t人工智慧於生醫科技的機會 - 遠距上課\t林顯易老師 (北科)\n15\t05/24\t工業設計與產品開發 - 遠距上課\t李來春老師 (北科)\n16\t05/31\t生醫材料商品化\t方旭偉老師 (北科)\n17\t06/07\t人因工程與設計\t陳圳卿老師 (北科)\n18\t06/14\t期末考週 - 分組上台報告\t授課教師群",
    "scorePolicy": "出席率 50%\n期中個人報告與作業 20%\n期末專題分組報告 30%",
    "materials": "請參照各授課老師建議",
    "consultation": "北科：陳圳卿老師 cceugene@ntut.edu.tw 北醫：彭志維老師 cwpeng@tmu.edu.tw",
    "remarks": "上課地點：除了遠距上課與校外參訪，課程前 10 週於北醫杏春樓跨領域學院 1F i8 教室上課，後 8 週於北科上課 (教室後續確認)。課程如有異動請同學於選課後加入 LINE 群組留意相關訊息。",
    "foreignLanguageTextbooks": false
  }
]
