[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-01-12 11:20:44",
    "objective": "本課程幫助學生習得敘述、描寫、推論、議論、省思、說明等文體方面的寫作技巧，並指導學生從閱讀、圖片、日常生活事件，及課堂討論內容中取材，以加強邏輯思考和流暢寫作能力。\nThis course aims to develop and reinforce students' strengths to create unified and coherent pieces of composition in a variety of styles--narrative, descriptive,  argumentative, reflective, and expository.  Students will be guided to write in response to readings, pictures, events in their daily lives, and discussions from the class. Thought-provoking topics are used to stimulate and foster critical writing strategies. This course enables students to write and discuss logically and clearly; they also need to incorporate grammatically newly-built vocabulary into their writing.",
    "schedule": "Please see the syllabus on the first day for exact readings. This semester, there are three main sections: we will write a periodical (group project), work on resumes and cover letters, and continue with literary analysis skills in preparation for the senior project.\n\nStudents will also work on logic and identifying logical fallacies and improve their citation skills. \n\nThis class is a required course for English majors but is not suitable for non-major students.",
    "scorePolicy": "Periodical Project (with individual and group components to the grade): 25%\nResume and Cover Letter: 15%\nLiterary Analysis: 25%\nHomework, quizzes, and informal writing: 15%\nPeer Reviews and Participation: 10%\nPresentations: 10%\n\n(These categories may be modified at my discretion.)",
    "materials": "Course packet",
    "consultation": "Office hours will be on Mondays from 3:10–6:00 and on Thursdays from 3:10–4:00.",
    "remarks": "MS Teams is the best way to communicate with me, though e-mail is also okay (sharinschroeder@mail.ntut.edu.tw). When you send an MS Teams message or an e-mail, please make sure to include your English name.",
    "foreignLanguageTextbooks": true
  }
]
