[
  {
    "name": "李東明",
    "email": "tmlee@ntut.edu.tw",
    "latestUpdate": "2023-02-13 21:49:52",
    "objective": "Design is a quite multiplex domain, technical incarnation, esthetics performance and cultural symbol. And it is the union of the social, economics, technology, arts, psychology, and physiology. The course aims to structure students’ knowledge about the principles and theories of design, improve their abilities to appreciate the aesthetic sense and design works, and provide them with professional terminology. This knowledge constitutes the core which helps young practitioners to attain their artistic objectives and perform project work on a high professional level. This course is based on an overview of the modern design industry, expect to establish a panorama perspective on the subject of design thinking.\n設計是一個相當多元的領域，是技術的化身、美學的表現和文化的象徵。它是社會、經濟、技術、藝術、心理學和生理學的結合。本課程旨在構建學生對設計原理和理論的認識，提高學生對美感和設計作品的鑑賞能力，並為他們提供專業術語。這些知識構成了幫助年輕從業者實現其藝術目標並在高專業水平上執行項目工作的核心。本課程基於對現代設計行業的概述，期望建立一個關於設計思維主題的全景視角。",
    "schedule": "1\tIntroduction of design and its relationship to the world around us\n設計概論及其與我們周圍世界的關係\n2\tDesign Thinking: Design process and problem-solving\n設計思考：過程和問題解決\n3\tIn-depth exploration of Design language\n設計語彙的深度探索\n4\tIn-depth exploration of principles of design\n設計原則的深度探索\n5\tIn-depth exploration of Design elements\n設計元素的深度探索\n6\tIn-depth exploration of Images in design\n設計圖像的深度探索\n7\tPrinciples Discussion – Form Follows Function\n原則概述：形隨機能\n8\tPrinciples Overview – Less is More\n原則概述：少即是多\n9\t期中考核週 Mid-term assessment week\n10\tPrinciples Overview – Design Process\n原則概述：設計流程\n11\tPrinciples Overview – Aesthetic Bias \n原則概述：美學偏誤\n12\tPrinciples Overview – Dimensional Perception Preferences\n原則概述：知覺維度偏好\n13\tPrinciples Overview – Aesthetic Toolbox\n原則概述：美學工具箱\n14\tPrinciples Overview – Psychology and Aesthetics\n原則概述：心理學和美學\n15\tPrinciples Overview – Human Factors \n原則概述：人因\n16\tPrinciples Overview – Information Architecture\n原則概述：資訊架構\n17\tFinal Exam Week 期末考核週 (Portfolio presentation 設計提案簡報) \n18\tPrinciples Overview – Significant Design Practice \n原則概述：重要的設計實踐",
    "scorePolicy": "Usual grades: 20%\nReport absences, ask questions in class, and interact with teachers.\n平時成績：20%\n出缺席、上課提問、與老師互動討論。\nMidterm grade: 30%\nRead reports on books related to design principles and share them on stage.\n期中成績：30%\n設計原理相關書籍讀書報告，並上台分享。\nFinal grade: 50%\nAdopt the method of making reports by group. Each group chooses topics related to design principles to share on stage.\n期末成績：50%\n採分組製作報告方式。各組選擇設計原理相關主題上台分享。",
    "materials": "BBC 室內設計規則 Design.Rules.\nhttps://www.youtube.com/playlist?list=PL1aj6wt3KDH0Asy2iAp2-EEcn3m7ewdEh\nWilliam Lidwell、Kritina Holden、Jill Butler, Universal Principles of Design, Revised and Updated Edition, Massachusetts: Rockport Publishers, 2010.\n高橋佑磨、片山なつ，劉小鳳 譯，圖解設計的原理。台北：不求人文化，2017。",
    "consultation": "Contact the teacher directly, or consult with the teacher's research room in 402. 直接與老師聯繫，或 402 教師研究室洽詢。",
    "remarks": "Distance teaching adopts TEAMS software for online teaching, and is assisted by LINE groups. 遠距教學採 TEAMS 軟體線上教學，並以 LINE 群組輔助。",
    "foreignLanguageTextbooks": false
  }
]
