[{"name":"江怡君","email":"meanttobe@ntut.edu.tw","latestUpdate":"2009-09-10 12:45:07","objective":"課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。","schedule":"(教學進度可能因實際狀況有所更動)\nWeek　　Reading &amp; Writing (2 hrs)　　      Listening &amp; Speaking (1 hr)\n1　　Finding the Ideal Job　　      Offbeat Jobs\n2　　Finding the Ideal Job　　      Offbeat Jobs\n3　　Finding the Ideal Job　　      Offbeat Jobs\n4　　Country Life or City Life　　    Building a Better Community\n5　　Country Life or City Life　　    Building a Better Community\n6　　Country Life or City Life　　    Building a Better Community\n7　　Making Money　　          A Penny Saved is A Penny Earned\n8　　Making Money　　          A Penny Saved is A Penny Earned\n9　　Mid-term Campus-wide English Proficiency Test\n10　　A Different Path to Justice　　 A Penny Saved is A Penny Earned\n11　　A Different Path to Justice　　    Innocent or Guilty\n12　　A Different Path to Justice　　    Innocent or Guilty\n13　　Subway Etiquette　　             Innocent or Guilty\n14　　Subway Etiquette　　             Etiquette\n15　　Subway Etiquette　　             Etiquette\n16　　Group Projects　　             Etiquette\n17　　Final Exam (聽&amp;說)　　             Final Exam (Reading)\n18　　Final Campus-wide English Proficiency Test\n","scorePolicy":"以下說明如有任何疑義或未說明周全之處，授課教師擁有最終及惟一解釋權。\n\nAverage of Weekly Quizzes * 21% (每週小考)\nAverage of Two Projects *21% (作文和口頭報告/表演)\nAverage of Final Exams * 28% (聽說期末考和閱讀期末考成績平均)\nMid-term Campus-wide English Proficiency Test * 15% (期中會考)\nFinal Campus-wide English Proficiency Test * 15% (期末會考)\nFreedom Writer (optional)\n\n(預習和作業) Students are required to preview assigned reading and do homework. The instructor will check students’ notes and homework at irregular intervals. If a student is found to not have done the preview or homework, 20 points will be deducted from his or her quiz that week.\n\n(小考和補考) Quizzes are always administered at the beginning of the class. Late students can ask for make-up quizzes administered by the teaching assistant, but 20 points will be automatically deducted. An absent student, with or without a justifiable reason, cannot ask for a make-up quiz. Yet, for all students, one lowest quiz grade needs not to be factored into the average calculation.\n\n(作文和口頭報告/表演) Projects are based on the PRODUCTION and ALTERNATIVE SPEAKING TOPICS sections in the listening and speaking textbook. However, some sections are not suitable. Students will be notified what sections are not suitable. One project is in written form and done individually. The other is performed orally and physically and done collectively in groups. Written project can be submitted any time during the semester but no later than December 25, 2010. Otherwise, it will be given a zero automatically. With regard to the group project, students are free to decide the form and content. However, the chosen form and content should be approved by the instructor in advance. Some suggested forms for the performed project are debate, skit, etc.\n\n(小老師) Teaching assistant will be awarded 3 bonus points to his or her final grade.\n\n(作弊或抄襲) Any student caught cheating or plagiarizing in quizzes, exams, or projects will be given a zero for his or her final grade without any room of negotiation.\n","materials":"NorthStar 2 Reading and Writing\nNorthStar 2 Listening and Speaking\n","foreignLanguageTextbooks":false}]
