[{"name":"江怡君","email":"meanttobe@ntut.edu.tw","latestUpdate":"2009-09-10 12:25:59","objective":"本課程承續學生一年級的英文基礎，提供學生更多閱讀機會，並加強閱讀策略指導，以培養學生獨立閱讀、及使用適當英文表達之能力。教材以介紹英語地區文化、思想、及價值觀為主，以協助學生建立世界觀，並培養其批判思考能力。教學活動以團體討論、小組討論、段落與短文習作實施。","schedule":"(教學進度可能因實際狀況有所更動)\nWeek　　Theme\n1　　Orientation\n2　　Chap. 1 Language\n3　　”\n4　　Chap. 2 Local Culture\n5　　”\n6　　Chap. 3 Food\n7　　” \n8　　Review\n9　　Mid-term Exam \n10　　Chap. 4 Film\n11　　”\n12　　Chap. 5 Fashion\n13　　”\n14　　Chap. 6 Controversy!\n15　　”\n16　　Project Presentations\n17　　Review\n18　　Final Exam\n","scorePolicy":"以下說明如有任何疑義或未說明周全之處，授課教師擁有最終及惟一解釋權。\n\nAverage of Weekly Quizzes * 20% (每週小考)\nWritten Project *10% (約兩百字作文) \nPerformed Project * 20% (口頭報告/表演)\nMid-term * 25% (期中考)\nFinal Exam * 25% (期末考)\nFreedom Writer (optional) \n\n(預習和作業) Students are required to preview assigned reading and do homework. The instructor will check students’ notes and homework at irregular intervals. If a student is found to not have done the preview or homework, 20 points will be deducted from his or her quiz that week.\n\n(小考和補考) Quizzes are always administered at the beginning of the class. Late students can ask for make-up quizzes administered by the teaching assistant, but 20 points will be automatically deducted. An absent student, with or without a justifiable reason, cannot ask for a make-up quiz. Yet, for all students, one lowest quiz grade needs not to be factored into the average calculation.\n\n(作文和口頭報告/表演) Projects are based on the Writing and Discussion sections in the textbook. However, some sections are not suitable. Students will be notified what sections are not suitable. One project is in written form and done individually. The other is performed orally and physically and done collectively in groups. Written project can be submitted any time during the semester but no later than December 25, 2009. Otherwise, it will be given a zero automatically. With regard to the group project, students are free to decide the form and content. However, the chosen form and content should be approved by the instructor in advance. Some suggested forms for the performed projects are debate, skit, teaching demonstration, etc. \n\n(小老師) Teaching assistant will be awarded 3 bonus points to his or her final grade. \n\n(作弊和抄襲) Any student caught cheating or plagiarizing in quizzes, exams, or projects will be given a zero for his or her final grade without any room of negotiation. \n\n","materials":"Essential Reading 4 (by Amanda French)","foreignLanguageTextbooks":false}]
