[{"name":"陳雅玫","email":"ymchen@ntut.edu.tw","latestUpdate":"2009-09-16 13:27:25","objective":"The course introduces the major approaches in translation theory and lays emphasis on their application to English-Chinese translation practice. Students will be provided with a comprehensive overview of the discipline of translation studies, raising their awareness of both the diversity of possible approaches to translation and the relationships between these approaches. Through the translation and commentary essays submitted for this course, the students will learn to think critically about and be more conscious of their own translation practice.","schedule":"Week 1   course introduction\nWeek 2　　(1) overview of the discipline of translation studies\n         (2) areas in translation research\nWeek 3   linguistically oriented theories (1)\nWeek 4   linguistically oriented theories (2)\nWeek 5   functionalist approaches (1)\nWeek 6   functionalist approaches (2)\nWeek 7   discourse and register analysis\nWeek 8   discourse and register analysis\nWeek 9   meeting with the instructor on term paper topics\nWeek 10  polysystem theory\nWeek 11  descriptive translation studies\nWeek 12  culture studies : translation as rewriting\nWeek 13  culture studies : gender &amp; postcolonial approaches\nWeek 14  Chinese translation theories\nWeek 15  Chinese translation theories\nWeek 16  new directions from the new media\nWeek 17  paper presentation\nWeek 18  term paper due\n","scorePolicy":"(1) attendance &amp; participation: 15%\n(2) oral presentation: 20%\n(3) translation + commentary essays: 30%\n(4) term paper (including paper presentation and final written\npaper): 35%\n","materials":"Baker, Mona. 1992. In Other Words: A Coursebook on Translation. London: Routledge. (Chapters 2, 3 and 7)\nEven-Zohar, Itamar. 1990. The Position of Translated Literature within the Literary Polysystem. Poetics Today 11: 45-51. \nFan, Shouyi. 1999. Highlights of Translation Studies in China since the Mid-Nineteenth Century. Meta 44(1): 27-43. \nFawcett, Peter. 1997. Translation and Language: Linguistic Theories Explained. Manchester: St Jerome. (Chapter 7)\nFlotow, Luise von. 1997. Translation and Gender. Manchester: St Jerome. (Chapter 2)\nHatim, Basil and Ian Mason. 1990. Discourse and the Translator. London: Longman. (Chapter 3)\nHatim, Basil and Jeremy Munday. 2004. Translation: An advanced resource book. London: Routledge. (Units 1 and 4)\nHermans, Theo. 1999. Translation in Systems. Descriptive and Systemic Approaches Explained. Manchester: St. Jerome. (Chapters 5 and 8)\nHermans, Theo. 2004. Disciplinary Objective: Developments and Distinctions in Translation Studies. Lecture notes. Translation Research Summer School 2003. University College London. 26 June 2003.\nJakobson, Roman. 1959. On Linguistic Aspects of Translation. In On Translation, ed. Reuben Brower. Cambridge, Mass.: Harvard University Press. Reprinted in Venuti 2000. 113-118.\nJuliane, House. 2001. Translation Quality Assessment: Linguistic Description versus Social Evaluation. Meta 46(2): 243-257. \nLefevere, André. 1992. Translation, Rewriting, and the Manipulation of Literary Fame. London and New York: Routledge (Chapters 2 and 5)\nMunday, Jeremy. 2001. Introducing Translation Studies: Theories and Applications. London: Routledge. (Chapters 3,5, 6 and 7)\nMunday, Jeremy. 2008. Introducing Translation Studies: Theories and Applications. 2ed. London: Routledge. (Chapters 8 and 11)\nNewmark, Peter. 1981. Approaches to Translation. Prentice Hall. (Chapter 3) \nNida, Eugene. 1964. Principles of Correspondence. In Toward a Science of Translating, ed. Eugene Nida. Leiden: Brill. Reprinted in Venuti 2000. 126-140.\nNord, Christiane. 1997. Translating as a Purposeful Activity. Functionalist Approaches Explained. Mancherster: St. Jerome. (Chapters 2 and 4)\nReiss, Katharina. 1981. Type, Kind and Individuality of Text: Decision Making in Translation, trans. Susan Kitron. Poetics Today 2(4): 121-131. Reprinted in Venuti 2000. 160-171.\nRobinson, Douglas. 1997. Translation and Empire: Postcolonial Theories Explained, Manchester: St. Jerome Press. (Chapter 1)\nSun, Yifeng and Lei Mu. 2007. Translation Studies in China: A ‘Glocalized’ Theoretical Practice. In Translation, Globalisation and Localisation, ed. By Wang Ning and Sun Yifeng. Clevedon: Multilingual Matters. \nToury, Gideon. 1995. Descriptive Translation Studies – and Beyond, Amsterdam and Philadelphia: Benjamins.(Chapter 2)\nVermeer, Hans. 1989. Skopos and Commission in Translational Action. In Readings in Translation Theory, ed. and trans. Andrew Chesterman. Helsinki: Oy Finn Lectura Ob. 173-187. Reprinted in Venuti 2000. 221-232. \nWilliams, Jenny and Andrew Chesterman. 2002. The Map: A Beginner’s Guide to Doing Research in Translation Studies. Manchester: St. Jerome. (Chapter 1)\nXu, Yanhong. 2007. Towards Pluralistic and Interdisciplinary Approaches: A Reflection on Translation Studies in Contemporary China. In Translation, Globalisation and Localisation, ed. Wang Ning and Sun Yifeng. Clevedon: Multilingual Matters. \nZhong, Weihe. 2001. An Overview of Translation in China: Practice and Theory. Translation Journal 7(2).http://accurapid.com/journal/24china.htm (accessed 6 July 2008). \n","foreignLanguageTextbooks":false}]
