[{"name":"彭馨儀","email":"hypeng@ntut.edu.tw","latestUpdate":"2009-09-14 15:36:56","objective":"科學與技術是了解這個世界和我們自己一項強而有力的工具，而許多作家們對於這樣的情況也在他們的作品中給予各式各樣的回應。在這個課程中我們將學習到作家們如何在他們的作品中使用文學藝術技巧來詮釋與解讀科技與現代文學的相互作用；人類與大自然的關係；以及人類當前的處境。修習這門課程的學生並不需要具備對科學有嚴格的基礎訓練與知識，只要具備強烈的好奇心和求知慾。在課程的一開始我們將藉由閱讀相關作品讓大家熟悉一些重要的議題。課程的中心主題除了針對科學技術與文學的相互關係外，我們也將焦點放在分析文學作品上。我們將繼續探索文學形式與內容的關聯。同時，我們也將利用現代科技在課堂上練習文學作品的即興創作。學生們一開始分析一段正文的內容。然後他們利用這些片段重新組合成一篇新的文本。接著，在這些文本內建立新的超連結︰每當文本被閱讀時，讀者能有多種選擇來閱讀並且使正文成為一個完全新的實體。","schedule":"Week 1---Course Introduction &amp; Jean Baudrillard “The Ecstasy of Communication” of L’Autre par Lui-même\nWeek 2---Read Dianne F. Sadoff and John Kucich, “Introduction: Histories of the Present,” Jennifer Gree-Lewis, “At Home in the Nineteenth Century: Photography, Nostalgia, and the Will to Authenticity,” and Jay Clayton “Hacking the nineteenth century” of Victorian afterlife: postmodern culture rewrites the nineteenth century \nWeek 3---View Frankenstein (2004), directed by Kevin Connor\nWeek 4---Read Mary Shelley Frankenstein, Vol. 1 \nWeek 5---Frankenstein, Vol. 2\nWeek 6---Frankenstein, Vol. 3\nWeek 7---View The Matrix (1999), directed by Larry and Andy Wachowski\nWeek 8---Read Jay David Bolter and Richard Grusin, “Introduction: The Double Logic of Remediation,” “Film,” and “The Virtual Self” of Remediation: Understanding New Media\nWeek 9---View Gattaca (1997), directed by Christopher Nolan\nWeek 10—Read Aldous Huxley Brave New World\nWeek11-- Brave New World\nWeek12—Brave New World\nWeek13—Read Brave New World\nWeek 14--View Memento (2000), directed by Andrew Niccol/Minterm paper due\nWeek 15---Read Roland Barthes S/Z, “Sarrasine” \nWeek 16---S/Z, Sec. 1~47 (I~XLVII)\nWeek 17---S/Z, Sec. 48~93(XLVIII~XCIII)\nWeek 18---Presentation. Meet at 1:00 and go until we have finished. Hand in the paper of your presentation. Pizza will be served afterwards.\n","scorePolicy":"● Active participation in class discussions and demonstrations---30%\n● Midterm Paper (no longer than 3000 words)---30%\n● Class Presentation/Final Research Paper---40%\n(Each student will give one class presentation of no longer than 20 minutes on a topic to be arranged in consultation with the professor. This report will also serve as the final research paper.) \n\n","materials":"　","foreignLanguageTextbooks":false}]
