[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2009-09-13 23:57:04","objective":"作為一種智識訓練及針對當代文化與社會所進行之批判研究，後殖民研究早已在世界學術機構，尤其是在英文系裡，建立了紮實的基礎。然而，作為一種批判性的文化概念，「後殖民」一詞的定義在後殖民研究領域的學者之間，卻依然充滿爭議。「後殖民」一詞的複雜性源自於若干特定議題，譬如，當我們在探討異質性的殖民與非殖民的歷史實境時，是否可以將涵蓋性字詞「殖民」與「後殖民」視為二元對立、在時間上可明確切割的概念類別而加以支配應用？是否以往在政治上受殖民的非洲國家、澳洲、孟加拉、加拿大、加勒比海國家、印度、馬來西亞、馬爾他、紐西蘭、巴基斯坦、新加坡、南太平洋島國、斯里蘭卡、及美國，如今都可一併稱為後殖民國家？究竟後殖民是一種穩定的局面，或是隨時可能受到新帝國主義及新殖民主義威脅而改變的狀態？簡言之，何謂後殖民？在一個被廣泛稱為全球化的時代裡，後殖民研究究竟有什麼實際的功用？為了詳加探討這些問題，我們將研讀一些新近的文章，並探討文章作者在使用「後殖民」一詞時，其意義或假定的意義究竟為何？我們可能研讀的批評文章作者包括Edward W. Said、Gayatri Chakravorty Spivak、Homi K. Bhabha、Aijaz Ahmad、Anne McClintock、Vijay Mish","schedule":"Syllabus\n09/16  Introduction\n09/23  The Enlightenment (1680s-1790s): views and assumptions: Isaac Kramnick, “Introduction” (1995) ix-xxiii; Immanuel Kant (1724-1804), “What Is Enlightenment?” (1784) 1-7; Immanuel Kant, “The Difference between the Races” (1764) 637-39; Edward W. Said’s “Introduction,” Orientalism 1-13 (37p)\n09/30  Bill Ashcroft, Gareth Griffiths, and Helen Tiffin’s “Introduction,” The Empire Writes Back 1-13; Kwame Anthony Appiah’s “Is the Post- in Postmodernism the Post- in Postcolonial?” 55-71; (30p)\n10/07  Vijay Mishra and Bob Hodge’s “What is Post(-)colonialism?” 276-90; Anne McClintock’s “Postcolonialism and the Angel of Progress,” 1-17; (32p)\n10/14  Deepika Bahri’s “Once More with Feeling: What Is Postcolonialism?” 51-82; (32p)\n10/21　　Ella Shohat’s “Notes on the Post-Colonial,” 321-34; Anna Johnston and Alan Lawson’s “Settler Colonies,” 360-76 (31p)\n10/28  Chinua Achebe’s Anthills of the Savannah (1987): Ch. 1-4. (pp. 1-48)\n11/04　　Chinua Achebe’s Anthills of the Savannah (1987): Ch. 5-8 (pp. 49-109)\n11/11　　Chinua Achebe’s Anthills of the Savannah (1987): Ch. 9-12 (pp. 110-148)\n11/18  Chinua Achebe’s Anthills of the Savannah (1987): Ch. 13-16 (pp. 149-188)\n11/25  Chinua Achebe’s Anthills of the Savannah (1987): Ch. 17-18 (pp. 189-216);\n12/02  Nadine Gordimer’s July’s People (1981) (pp. 1-49)\n12/09  Nadine Gordimer’s July’s People (1981) (pp. 50-90)\n12/16  Nadine Gordimer’s July’s People (1981) (pp. 91-121)\n12/23  Nadine Gordimer’s July’s People (1981) (pp. 122-159)\n12/30  Oral presentation on your research project proposal\n01/06  Submitting revised proposals.\n01/13  Students’ proposals returned.\n","scorePolicy":"Grading Policy: Class performance: 20%; Oral Presentation: 30%; Project Proposal: 50%","materials":"Bibliography\nAchebe, Chinua. Anthills of the Savannah. New York: Anchor, 1989.\nAppiah, Kwame Anthony. “Is the Post- in Postmodernism the Post- in Postcolonial?”  Contemporary Postcolonial Theory: A Reader. Ed. Padmini Mongia. London: Arnold, 1996. 55-71.\nAshcroft, Bill, Gareth Griffiths, and Helen Tiffin. “Introduction.” The Empire Writes Back: Theory and Practice in Post-Colonial Literatures. London: Routledge, 1989. 1-13.\nBahri, Deepika. “Once More with Feeling: What Is Postcolonialism?” Ariel 26.1 (1995): 51-82.\nGordimer, Nadine. July’s People. London, Penguin.\nJohnston, Anna and Alan Lawson. “Settler Colonies.” A Companion to Postcolonial Studies. Ed. Henry Schwarz and Sangeeta Ray. Malden: Blackwell, 2000. 360-76.\nKant, Immanuel. “The Difference between the Races.” The Portable Enlightenment Reader. Ed. Isaac Kramnick. New York: Penguin, 1995. 637-39.\n___. “What Is Enlightenment?” The Portable Enlightenment Reader. Ed. Isaac Kramnick. New York: Penguin, 1995. 1-7.\nKramnick, Isaac. “Introduction.” The Portable Enlightenment Reader. Ed. Isaac Kramnick. New York: Penguin, 1995. ix-xxvi.\nMcClintock, Anne. “Postcolonialism and the Angel of Progress.” Imperial Leather: race, Gender and Sexuality in the Colonial Contest. New York: Routledge, 1995. 1-17.\nMishra, Vijay and Bob Hodge. “What is Post(-)colonialism?” Colonial Discourse and Post-Colonial Theory: A Reader. Ed. Patrick Williams and Laura Chrisman.  New York: Harvester Wheatsheaf, 1994. 276-90. [First published in Textual Practice 5.3 (1991): 399-414.]\n___. “What Was Postcolonialism?” New Literary History 36 (2005): 375-402.\nSaid, Edward W. “Introduction.” Orientalism. Harmondsworth: Penguin, 1978. 1-28. [excerpt 1-13]\nShohat, Ella. “Notes on the Post-Colonial.” Contemporary Postcolonial Theory: A Reader. 321-34.\n","foreignLanguageTextbooks":false}]
