[{"name":"葛瑞斐","email":"griffith@ntut.edu.tw","latestUpdate":"2009-10-02 00:09:40","objective":"In the West, romance has often seemed to win less acclaim than other genres, a strange younger sister to the celebrated classical forms, not quite as sublime as epic tragedy, not as beautiful as lyric, not as provocative as comedy.  Yet it has nonetheless endured as a popular form into the 21st century.  Evolving since the Middle Ages to become less a genre in its own right than a transcendent mode of writing and of thought which invades, combines, and reshapes the other traditional genres, romance’s protean nature has made it an omnipresent and influential force in modern Western culture.  This course will trace the development of romance as a genre and as a philosophical and interpretive mode from the Middle Ages to the present, as we ask how it has changed and why it has persisted throughout Western history, becoming essential to our understanding of thought and of character in the modern West.\n\n\n","schedule":"Week 1　　9/15　　Intro:  Genre Studies\n　　　　　　　　Romance as Genre and Mode\nWeek 2　　9/22　　Sir Orpheo\n　　　　　　Student reports:  critical article on genre studies (I)\nWeek 3　　9/29　　Student reports:  critical article on genre studies (II)　　\nWeek 4　　10/6　　Gawain and the Green Knight\nWeek 5　　10/13　　　　(continued)\nWeek 6　　10/20　　　　(continued)　　　　\nWeek 7　　10/27　　  Spenser, Fairie Queen BK II　　　　\nWeek 8　　11/3　　　　(continued)　　\nWeek 9　　11/10　　MIDTERM\nWeek 10　　11/17　　Shakespeare, A Winter’s Tale　　\nWeek 11　　11/24　　　　(continued)\nWeek 12　　12/1　　　　(continued)　　　　\nWeek 13　　12/8　　Cervantes, Don Quixote (excerpts)\nWeek 14　　12/15  　　　　(continued)\nWeek 15　　12/22　　Romantic Poetry　　\nWeek 16　　12/29　　　　(continued)\nWeek 17　　1/4　　Discussion of final projects\n\n","scorePolicy":"Grades\nMidterm　　33.3%\nFinal 33.3%\nClass Work/Weekly Participation 33.3%\n\nAttendance:   a combination of 4 absences or late days  =  -10 points from course grade\n\n\n","materials":"　","foreignLanguageTextbooks":false}]
