[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2009-09-10 17:05:23","objective":"本課程旨在探討英語與漢語在結構與功能上的主要異同，涵蓋語意、語音、音韻、詞法、句法、語用與社會文化等特徵，同時類比與對比這兩個語言使用何種語言策略達到溝通的目的。本課程之本質在訓練學生往後如何解決語言對比分析的問題，在學期結束時，學生需要針對英語與漢語某一特定語言現象獨立完成對比分析。\nThis course aims at investigating the major structural and functional differences and similarities of Chinese and English. The differences and similarities identified include semantic, phonetic, phonological, morphological, syntactic, pragmatic, and sociocultural features. We will also compare and contrast linguistic strategies the two languages employ to achieve communicative purposes. This course is exploratory in itself, directed toward providing students with keys to tackling linguistic issues they may encounter in their future careers. Students will be required to present an ultimate Chinese-English contrastive analysis in a certain aspect at the end of this course.","schedule":"Week 1: Course Introduction\nYeh, Chun-Chun. 2004. The relationship of cohesion and coherence: a contrastive study of English and Chinese. Journal of Language and Linguistics 3.2: 243-260.\nTang, Chen-Hsin and Grace Qiao Zhang. 2009. A contrastive study of compliment responses among Australian English and Mandarin Chinese speakers. Journal of Pragmatics 41: 325-345.\n\nWeek 2: Historical background\nChen, Fred Jyun-gwang. 2006. Contrastive research and crosslinguistic influence: Some implications for teaching Chinese and English as a second language. Taipei: Crane.\n\nWeek 3: Adjectives\nLongman 7.1\nLi et al. Ch 2.1.1 (Non-Action Verbs)\nLi et al. Ch 3.2.2 (Non-Action Verbs)\nHuang, Shi-Zhe. 2006. Property theory, adjectives, and modification in Chinese. Journal of East Asian Linguist 15: 343-369.\nParadis, Carita. 2001. Adjectives and boundedness. Cognitive Linguistics 12.1: 47-65.\nPaul, Waltraud. 2005. Adjectival modification in Mandarin Chinese and related issues. Linguistics 43.4: 757-793.\n\nWeek 4: Passive Voice\nBirner, Betty.\nLongman 6.4\nLi and Thompson. Ch 16\nLi et al. Ch 2.6; Ch 8.3.2\nBaratta, Alexander M. Revealing stance through passive voice. Journal of Pragmatics 41: 1406-1421.\nSeino, Tomoaki and Shin Tanaka. 2006. The “passive” voice in Japanese and German: argument reduction versus argument extension. Linguistics 44.2: 319-342.\nTang, Sze-wing. 2001. A complementation approach to Chinese passives and its consequences. Linguistics 39.2: 257-295.\nTing, Jen. 1998. Deriving the Bei-construction in Mandarin Chinese. Journal of East Asian Linguistics 7: 319-354.\n\nWeek 5: Negation\nLongman Ch 3.8\nLi and Thompson. Ch 12 \nLi et al. Ch 3.6\nLee, Peppina Po-lun and Pan Haihua. 2001. The Chinese negation marker bu and its association with focus. Linguistics 39.4: 703-731.\nLin, Jo-wang. 2003. Aspectual selection and negation in Mandarin Chinese. Linguistics 41.3: 425-459.\nWang, Yu-fang et al. 2007. From informational to emotive use: meiyou as a discourse marker in Taiwan Mandarin conversation. Discourse Studies 9: 677-701.\n\nWeek 6: Interrogatives\nLi and Thompson. Ch 18\nLi et al. 2.2\nGasde, Horst-Dieter. 2004. Yes/no questions and A-not-A questions in Chinese revisited. Linguistics 42.2: 293-326.\nLi, Yen-hui Audrey. 1992. Indefinite wh- in Mandarin Chinese. Journal of East Asian Linguistics 1: 125-155.\nLin, Jo-wang. 1992. The syntax of zenmeyang ‘how’ and weishenme ‘why’ in Mandarin Chinese. Journal of East Asian Linguistics 1: 293-331.\nMcCawley, James D. 1994. Remarks on the syntax of Mandarin yes-no questions. Journal of East Asian Linguistics 3: 179-194.\nSchaffar, Wolfram and Launsun Chen. 2001. Yes-no questions in Mandarin and the theory of focus. Linguistics 39.5: 837-870.\n\nWeek 7: Group Presentations: Gender\nMondorf, Britta. 2002. Gender differences in English syntax. Journal of English Linguistics 30.2: 158-180.\nNamai, Kenichi. 2000. Gender features in English. Linguistics 38.4: 771-779.\n\nWeek 8: Modification (Relative clauses)\nLongman Ch 8.7 (Postmodification)\n曹逢甫。1993。漢語及英語的關係子句：形式及功用的對比研究。應用語言學的探討，108-131。\nFeist, Jim. 2009. Premodifier order in English nominal phrases: A semantic account. Cognitive Linguistics 20.2: 301-340.\nFox, Barbara A. and Sandra A. Thompson. 1990. A discourse explanation of the grammar of relative clauses in English conversation. Language 66.2: 297-316.\nFox, Barbara A. and Sandra A. Thompson. 2007. Relative clauses in English conversation. Studies in Language 31.2: 293-326.\nGibson, Edward et al. 2005. Reading relative clauses in English. Cognitive Linguistics 16.2: 313-353.\nLoock, Rudy. 2007. Appositive relative clauses and their functions in discourse. Journal of Pragmatics 39: 336-362.\nRijkhoff, Jan. 2008. Descriptive and discourse-referential modifiers in a layered model of the noun phrases. Linguistics 46.4: 789-829.\nTao, Hongyin and Michael J. MacCarthy. 2001. Understanding non-restrictive whic","scorePolicy":"Exercises 20%\nOral presentations 30%\nDiscussion and class participation 20%\nFinal report 30%","materials":"Biber, Douglas et al. 2000. Longman grammar of spoken and written English. London: Longman.\nLi, Charles N. and Sandra A. Thompson. 1971. Mandarin Chinese: A functional reference grammar. Taipei: Crane.\nLi, Y. C. et al. 1989. Mandarin Chinese: A practical reference grammar for students and teachers. 2 volumes. Taipei: Crane.\nJournal/Book articles","foreignLanguageTextbooks":false}]
