[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2009-09-29 12:07:10","objective":"Circumnavigate your mind!  Assassinate time!  In a single blinding flash five-thousand years of human culture comes down to a limitless now. What are you going to do about it?  Jump ship just when things are getting interesting?  Why not join us on a voyage over the edge of the ocean to the place where chimeras first see the sun’s light?  Or how about flapping your arms and taking flight?  Consider yourself invited on a unique, experiential journey!  No longer will you be standing outside of literature, on the sidewalk of both slim and fat chances (you can take your choice!), weighty suitcase of criticism in hand, looking on forlornly as if through the window of a very expensive department store.  This course offers a unique opportunity to experience literature from the inside, to participate in writing as a professional writer or critic does, directly tapping into language through a mysterious fusion of inner and outer, subjective with objective, the nonsensical, whimsical and dreamlike with the factual, the actual, the real.  For the purposes of this course, we will broaden our definition of creative writing from its major genres, poetry and fiction, to include emergent cross-disciplinary forms such as creative non-fiction, performance art and autobiographically-based critical writing.","schedule":"September 17　　INTRODUCTION:  Writing as Event:  Performance Works by Tribal Cultures.  ASSIGNMENT: Carefully reread the tribal performance works we have examined, and, based on these, in no more than five sentences describe a performance work of your own.  Read poem/letter/dream sequence by Diana Saenz creatively, autobiographically or critically or by some as yet unnamed admixture of these elements.\n\nSeptember 24　　Futurist Performance and the Variety Theatre.  FILM SHORTS,  ASSIGNMENT: Respond/create/open mind to create new fields of possibilities.\n\nOctober 1　　Black Mountain School and Chance Operations:  Poems and music by John Cage.  Chance operations from the most ancient times until Dada pried open the secret rocking horse of the shamans.\n\nOctober 15　　THE THIRD MIND:  Chance operations in the novels of William S, Burroughs.  Selections from Stein.  ASSIGNMENT: Respond/create/open mind to create new fields of language networks\n\nOctober 22　　THE WOR(L(D UNREAD: SILENCE OR SOMETHIG MORE?  ASSIGNMENT:  read Thomas Disch’s selection; respond/create/open mind to create new fields of possibilities through employment absolutely empty with no audience or intent in mind other than that which one can conjure for oneself out of the VOID.\n\nOctober 29　　WHERE DO YOU ENTER INTO ALL OF THIS?:  USING AUTOBIOGRAPHY AS THE (TRANS)FORMATION OF HISTORY:  ASSIGNMENT: Read James Cone’s “God of the Oppressed” and respond/create with images (which needn’t be sequential or chronological) which comment on a certain recurrent theme in your life.  If are unaware of recurrent themes running through your life, this assignment should shock you into greater awareness.\n\n　　MIDTERM WRITING ASSIGNNMENT DUE!!!\n\nNovember 5　　ENTERING INTO WRITING FROM OUTSIDE THE DOMINENT LANGUAGEENVIRONMENT:  ASSIGNMENT: Read G.I. Gurdjieff’s “The Awakening of Thought.”  Respond/create new cliché’s, ways of saying things as you write about the process of writing as it exists not just for yourself (as for example in  Dische’s “Squirrel Cage) and what it means to put language into the world. Is it possible to avoid yourself?  Does the world ever disappear behind you?  Use the malformations of syntax, vocabulary, spelling, etc., resulting (for some more than others) from the fact that you are writing this in a language that is not your native tongue.  For once I implore you to allow yourself to make as many formal mistakes as possible.\n\nNovember 12　　THE PHENOMENOLOGICAL APPROACH?  ASSIGNMENT: Read Helene Cixous “Reading in Painting” and respond/create/open new fields of possibilities by attempting on your own to examine a work of art (whether it be literary, visual, plastic or conceptual) considering not only your observations but tracing down how these observations have been shaped by an often oppressive culture, by autobiographical experiences, or by your study of the subject under observation or by other subjects (however distantly) related to it.  What does the subject remind you of and why does it remind you of that.  More important still, how has the chain of associations which form your experience of the object come into being, and what relationship do they bear to the to the world beyond your computer screen?\n\nNovember 19　　THE POEM ON THE PAGE:  ASSIGNMENT: Respond/create/open new fields of possibilities based on selection “Dream Poems and Lie Poems from Swaziland ) from Koch anthology.\n\nNovember 26　　THE POEM ON THE PAGE:  ASSIGNMENT: Respond/create/open new fields of possibilities based on Frank O’Hara’s “A True Account of Talking to the Sun on Fire Island,” perhaps following editor Koch’s suggestions; perhaps taking of in an entirely new direction.  \n\nDecember 3　　THE POEM ON THE PAGE:  ASSIGNMENT: Respond/create/open new fields of possibilities based on poem by John Ashbery.\n\nFINAL PAPER DUE!!!\n\n\nDecember 10　　TEXT AND PERFORMANCE I:  ASSIGNMENT: Respond/create/ create new fields of possibilities.based on works  by Dylan Thomas, Leslie Scalapino and Kathy Acker.\n\nDecembe","scorePolicy":"20% Homework Assignments\n20% Midterm\n20% Collaborative Performance Work\n40% Final","materials":"Poetry: Diana Saenz. Frank O’Hara, Kenneth Koch, the Students of St, Mary’s Secondary School in Swaziland. John Ashbery, Gertrude Stein\n\nFiction/Creative Non-Fiction: James Cone, Thomas Disch, Helene Cixous, G. I. Gurdjieff,  William S. Burroughs, Kathy Acker and others\n\nPerformance Texts (and Site-Specific Works): Cecilia Vicuña, Samuel Beckett, Jerome Rothenberg, John Cage, Futurist Texts, Dylan Thomas, Leslie Scalapino\n","foreignLanguageTextbooks":false}]
