[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2009-08-29 17:23:42","objective":"一、教學目標：\n（一）本課程是提供所有博士生共同參與研究討論的優質園地。\n（二）由師生共同進行設計專題報告、專題演講、研究小組討論、論文相關文獻心得報告與討論，相互腦力激盪與學習，致力發展群己研究潛能。\n（三）學習如何回顧文獻及評論，協助博士生設計研究理論與實務之精進，提供專業互動與提升學生設計涵養。\n二、課程教學內容：\n（一）討論設計研究所需相關文獻回顧與評論之意義、方法與演練。\n（二）結合課程發展與行動研究，課程本身就是設計專題討論之發展積累與延伸，以討論設計的學理、典範、型態、方法、科技發展、美學、產業實務經驗與研究心得…等主題。\n（三）以行動研究的方式來研究設計專題，由教師和博士生對自己專題實踐的活動進行循環不斷的自我反思和系統研究，透過尋找問題、制定解決問題計劃方案、執行計劃和反省回饋，以改善及提升研究能力。教師與博士生就是實際執行設計專題課程發展的主角，參與者從設計專題討論研究過程中獲得專業自主與成長。\n（四）教師與博士生就是實際執行設計專題課程發展的主角，參與者從設計專題討論研究過程中獲得專業自主與成長。\n（五）行動研究教學的幾種意義：\n1.Action Research is a research designed to yield practical results that are immediately applicable to a specific situation or problem.(Noffke, 1997)\n2.Action Research is a form of practitioner research that can be used to help you improve your professional practices in many different types of workplaces. Practitioner research simply means that the research is done by individuals themselves into their own practices.(McNiff, Lomax, and Whitehead, 1996)\n3.Action Research can have purely academic outcomes (reports published in an academic journal) and may provide the basis for rich and profound theorizing and basic knowledge production, but its primary purpose is as a practical tool for solving problem experienced by people in their professional, community or private lives.(Stringer, 1996)\n","schedule":"（一）專題報告\n1.人數：全部博士生參與。\n2.專題範圍：以最近5年內與論文相關之SCI、SSCI、EI、A＆HCI、TSSCI（如2008年通過之相關名單：戶外遊憩研究、地理學報、住宅學報、建築學報、都市與計劃、運輸計劃季刊、運輸學刊、台灣土地研究、歐美研究、藝術教育研究…）或該領域經審查後出版之學術性期刊文章或相關博士論文或自己的研究心得及論文。\n3.語文：中英文皆可，並請準備演講或報告摘要給同學參考。\n4.時間：每人報告20-30分鐘，10-15分鐘討論。\n5.作業繳交：報告人於報告後之下星期上課前以E-mail繳交專題報告與討論後心得。\n6.順序安排：上第一節課時說明可能之安排、博士生參與意見，或以抽籤決定。\n（二）邀請學者專家專題演講\n1.原則上第一個小時至一點五小時前為正式演講。\n2.其餘時間自由發問及討論。\n3.作業繳交：演講後之下星期上課前以E-mail繳交專題演講與討論後心得報告。\n4.順序安排：上第一節課時說明可能之安排情形並聽取博士生意見。\n（三）注意事項\n1.報告需有主題，並注意內容之安排。\n2.使用MS PowerPoint輔助工具為原則。\n3.PP檔之設計宜注意顏色之協調性、文字及圖與表的處理。\n4.如需借用學院之notebook及單槍液晶投影機，請先向學院辦公室洽借。\n","scorePolicy":"（一）課堂報告（30%）：就各人所選的文獻專題、論文或專題研究報告。\n（二）上課互動情形（30%）：閱讀相關參考文獻、上課聽講、參與課堂討論應答。\n（三）作業繳交（40%）：報告人於報告後繳交之專題報告與心得，及演講後之專題演講與心得報告。\n","materials":"隨研討主題提供參考書目","foreignLanguageTextbooks":false}]
