[{"name":"楊安石","email":"asyang@ntut.edu.tw","latestUpdate":"2009-08-25 11:33:26","objective":"本課程主要目標為將數學方法應用在工程問題，課程內容有常微分方程，線性代數，向量微積分，及偏微分方程式等之簡介，訓練同學數學應用於工程計算及研究，進而訓練學生具備分析工程系統之數學建模能力。\n其課程大綱為:\n單元主題1：First-Order Differential Equations;Linear Differential Equations of Second and Higher Order\n單元主題2：Series Solutions: Power Series Method\n單元主題3：Laplace Transforms\n單元主題4：Matrices, Eigenvalues, Eigenvectors\n單元主題5：Vector Differential Calculus\n單元主題6：Vector Integral Calculus\n單元主題7：Fourier Series\n單元主題8：Partial Differential Equations\n","schedule":"1) Reviews;Basic Concepts and Ideas; Geometrical Meaning of y’=f(x, y);Separable Differential Eq\n2) Modeling: Separable Eq.;Homogenous Linear Eq. of 2nd  Order with Constant Coefficients; Euler-Cauchy Eq.;\n3) Non-homogenous Equations; Solution by Undetermined Coefficients\n4) Higher Order Homogenous Linear Eq. with Constant Coefficients;\nNonhomogeous Linear ODEs\n5) Power Series Method; Theory of the Power Series Method\n6) Legendre’s Equation; Legendre Polynomials Pn(x)\n7) Laplace Transform; Transformations of Derivatives and Integrals Diff. Eq\n8) Unit Step Function; Differentiation and Integration of Laplace Transforms; Convolution. Integral Eq.\n9) 期中考\n10) Matrices, Vectors, Matrix Multiplication;Linear Systems of Eqs.; Gauss Elimination;Rank of a Matrix; Linear Independence; Vector Space\n11) Solutions of Linear System; Determinants; Cramer’s Rule; Inverse of a Matrix\n12) Eigenvalues, Eigenvectors; Some Applications of Eigenvalue Problems; Symmetric, Skew-Symmetric, and Orthogonal Matrices\n13) Curves; Tangents, Arc Length; Inner &amp; Vector Product; Gradient of a Scalar Field; Directional Derivative; Divergence of a Vector Field; Curl of a Vector Field\n14) Line Integrals; Vector and Scalar Functions and Fields; Derivatives; Double Integrals; Surface Integrals\n15) Triple Integrals; Divergence Theorem of Gauss; Fourier Series; Functions of Any Period p=2L\n16) Even and Odd Functions; Fourier Integrals &amp; Fourier Transform\n17) Basic Concepts of PDE; Separation of Variables; Similarity Methods\n18) 期末考\n","scorePolicy":"1) 平時成績20%(含上課表現、出席率)\n2) 期中成績40%\n3) 期末成績40%","materials":"Advanced Engineering Mathematics (9th Edition, John Wiley)\nAuthors: Erwin Kreyszig\n","foreignLanguageTextbooks":false}]
