[{"name":"張素薰","email":"shchang@ntut.edu.tw","latestUpdate":"2009-09-25 10:21:01","objective":"本課程旨在培養學生熟悉日常生活英語會話及以正常速度聽講之能力。課程內容取材自學生周遭所熟悉事務, 藉由媒體傳播素材來訓練學生經常聽講之能力，並在課堂中研討其內容以達到運用之目的。","schedule":"Multimedia English Listening and Speaking\n\nObjective:\n\nThis course is designed to familiarize students with daily spoken English as well as listening and speaking skills. The content includes a wide variety of authentic multimedia materials-printed audio and video texts. This gives students an opportunity for both recognition of different speaking styles and an in-depth, culture-rich understanding of the topics from multiple perspectives. Real-life situations are rehearsed in the classroom, with role-plays, situational activities, excerpts from newspapers and magazines and interviews with real people. Speaking practices based on day-to-day language are emphasized in class.\n\nBasic Doctrines:\n\n1.　　Expose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\n2.　　The films and magazines of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\n3.　　Language capability and performance are equally stressed and developed.\n4.　　Students’ active participation is essentially required.\n5.　　Individual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\n\nAssessment:\n\n1.　　Weekly tests and Attendance (20 points maximum deduction). 80%\n2.　　Oral reports and presentations. 20%\n\n\n\n4 e1 Syllabus, 2009, First Semester\nWeek　　CNN ( No. 96)　　Language Skills\n1　　Introduction　　Introduction\n2　　Storm season; Storm warning　　Finding Faults\n3　　Man on the moon; Is it inflation or deflation　　Your Talk\n4　　Green screens; Texting traumas　　Self-examination\n5　　Work on the wild side; Heavenly hotel　　Impromptu Delivery\n6　　Healing a broken heart; The seed of a controversy　　Outline Delivery\n7　　Playing it safe; Celluloid prophet　　Manuscript Delivery\n8　　　　Memorized Delivery\n9　　Mid-Term　　Mid-Term\n10　　　　The Voice\n11　　　　The Voice\n12　　　　Clarity\n13　　　　Self-Evaluation\n14　　　　Word Choice\n15　　　　Word Meaning\n16　　　　\n17　　Review　　\n18　　Final examination　　Final examination\n\n\n","scorePolicy":"1. Attendance. 20%\n2. Weekly tests, assignmets, reports. 80%","materials":"　","foreignLanguageTextbooks":false}]
