[{"name":"廖文義","email":"wiliao@ntut.edu.tw","latestUpdate":"2009-09-08 23:19:58","objective":"This course covers the determination of basic properties and behaviors of common materials in civil engineering construction, such as cement, aggregate, concrete and steel rebar.","schedule":"Week 1　　Introduction of Course.\nWeek 2　　Test for Density of Hydraulic Cement.\nWeek 3 　　Test for Normal Consistency of Hydraulic Cement.\nTensile Strength Test of Hydraulic Cement Mortar (specimen fabrication)\nWeek 4 　　Test for Flow of Hydraulic Cement Mortars by Flow Table.\nCompressive Strength Test of Mortar (specimen fabrication).\nTensile strength test (for 7 days age mortar-specimen)\nWeek 5 　　Test for Specific Gravity and Absorption of Coarse and Fine\nAggregates.\nTensile strength test (for 14 days age mortar-specimen).\nCompressive strength test (for 7 days age mortar-specimen)\nWeek 6 　　--- \nWeek 7 　　Test for Sieve Analysis of Coarse and Fine Aggregates\nCompressive strength test (for 14 days age mortar-specimen).\nWeek 8 　　Test for Unit Weight and Voids in Aggregate.\nTensile strength test (for 28 days age mortar-specimen)\nWeek 9　　Compressive strength test (for 28 days age mortar-specimen).\nWeek 10　　Test for Compressive Strength of Cylindrical Concrete Specimen (10x20cm specimens fabrication and Slump Test)\nWeek 11　　Test for Flexural Strength of Concrete Beam (specimen fabrication).\nCompressive Strength Test of Cylindrical Concrete Specimen (7 days age)\nWeek 12　　Compressive Strength Test of Cylindrical Concrete Specimen (14 days age).\nWeek 13　　Effect of W/C ratio on the compressive strength. \nWeek 14　　Compressive Strength Test of Cylindrical Concrete Specimen (28 days age)\nWeek 15　　Flexural Strength Test of Concrete Beam \nWeek 16　　Permeability Test of Cement Concrete\nWeek 17　　Tensile Strength Test of Steel Rebar\nWeek 18 　　Final Discussion\n","scorePolicy":"Lab. Report 60% \nAttendance 40% \n","materials":"1、Specification of China National Standard (in Chinese)\n2、S. lqbal Ali, 1995 “Civil Engineering Materials and their testing” Alpha Science International Ltd., UK. \n","foreignLanguageTextbooks":false}]
