[{"name":"郭慧鈴","email":"phoebe-Kuo@yahoo.com","latestUpdate":"2009-09-04 12:03:15","objective":"產業環境隨著社會經濟活動的頻繁而愈趨複雜。尤其是車輛工程產業，面臨到自政府機關、環保團體、社區團體的壓力，希望該產業的營運能確實達到維持生態環境的永續性。現今產業的營運，不僅要考量國內各個環境層面，也需顧及國際整體環境。目前環境議題整合產業管理決策規劃，對於相關產業更是一大挑戰。本課程主要希望學生透過產業個案的研討去(1)確認問題、分析情況、進而從產業環境著手問題的解決方向(2)評估、規劃與執行產業管理決策。確保產業營運與環境的永續共生。","schedule":"Session 1―9/17\n課程介紹―Course information and related issues\n環境主題探討—Environmental Threats\nSession 2―09/24  環境主題探討—Environmental Threats\nSession 3―10/01  環境主題探討—Environmental Threats\nSession 4―10/08\n環境管理―Environmental Management: A Framework for Business Policy\n管理主題探討—財務分析 Financial Analysis\nSession 5―10/15\n環境主題探討—Environmental Externality &amp; Law\n環境管理架構―BE Framework\nSession 6―10/22\n環境管理架構―BE Framework\n環境主題探討―車輛工程相關產業與環境科技研發趨勢\nSession 7―10/29  個案導讀\nSession 8―11/05  個案報告\nSession 9―11/12  個案導讀\nSession 10―11/19 個案報告\nSession 11―11/26 個案導讀\nSession 12―12/03 個案報告\nSession 13―12/10 Field Trip\nSession 14―12/17 個案導讀\nSession 15―12/24 個案報告\nSession 16―12/31 個案導讀\nSession 17―1/07  個案報告\nSession 18―1/14  Final Report","scorePolicy":"【1】You must come to class and you will be expected to consistently study the assigned material in preparation for the class meeting, and share your knowledge, questions, and arguments with the class.  It will not be possible to do well in the course without preparation and participation.\n【2】Your grade for the course will depend on three parts of your participation and your progress:\n★★There is one Final Report carrying 25 percent of the grade.\n★★Class participation, presentation and reports are another 50 percent of the grade.  For each presentation grading will be based on the following criteria with even percentage points:\n●Analytical ability\n●Organization skill\n●Research effort\n●Models formation and interpretation\n(You are required to apply the three-model\n―Business and the Environment\n―Environmental Strategies\n―Components of Environmental Strategy)\n●Body language\nYou need to e-mail me your presentation materials, before midnight of Wednesday which is one day before your presentation day, for records to get the complete grade assigned. If delay without permission requested in advance, you will be deducting 10 percent of the individual case grade.\n★★Finally, attendance counts 10 percent and extra performance counts another 15 percent of the grade.  If you did not come to the class, you will need to submit two-full-page written statement in Chinese or English for that particular class case and e-mail me before the coming Monday.  If delay without permission requested in advance, you will be deducting 5 percent of the total grade.  However, well preparation and fully participation for each class is required and encouraged.\n★★★You always welcome for questions and suggestions★★★\n","materials":"★Required textbook★\nReinhardt, F.L. and Vietor, R.H.K., 1996. Business Management and the Natural Environment: Cases and Text, South-Western College Publishing, Cincinnati, Ohio.\nIn addition to the text, extra handout will be distributed in class.\n★Reference textbook★\nReinhardt, F.L., 2000. Down to Earth: Applying Business Principles to Environmental Management, Harvard Business School Publishing, Cambridge, MA.\n","foreignLanguageTextbooks":false}]
