[{"name":"朱雨其","email":"ycchu@sun.epa.gov.tw","latestUpdate":"2009-07-26 18:00:50","objective":"As the first introductory course for databases, this course is designed to give students a solid foundation in practical database design and implementation. The course provides in-depth coverage of database design, demonstrating that the key to successful database implementation is in proper design of databases to fit within a larger strategic view of the data environment. With a strong hands-on component that includes real-world examples and exercises, this course will help students develop database design skills that have valuable and meaningful application in the real world.\nThis course will cover the fundamentals of using and implementing relational database management systems. Firstly, from the user perspective  (i.e., how to use a database system), the course will discuss conceptual data modeling, the relational and other data models,  database schema design, relational algebra, and the SQL query language. Secondly, from the system perspective (i.e., how to design and implement a database system).   In addition, we will introduce some of recent trends and technologies regarding data management such as data warehousing, semi-structured data and XML, as well as the issues of data mining.\n資料庫系統在現今資訊系統環境中扮演極為重要的角色，已成為資料儲存、管理、及運用上不可或缺的工具。本課程將分別從資料庫系統的使用者及系統建置二個面向，探討有關資料庫系統相關的基礎知識。大體來說，本課程將著重在資料庫管理系統，特別是關聯式資料庫管理系統的學理及實務，內容涵括：資料模型概念及E-R Model、關聯式模型及其運算、SQL語言，及資料庫系統之邏輯設計與實體設計。我們也將探討關聯式資料庫系統的檔案結構及索引方法、綱目正規化等課題。同時，針對新近興起的資料管理趨勢與技術，例如：資料倉儲、XML資料格式，及資料探勘技術等也將在本課程作初步介紹。\n","schedule":"第一週　2009-09-16　　Introduction to the Course and Chapter 1 Database Systems\n第二週　2009-09-23　　Chapter 2. Data Models\n第三週　2009-09-30　　Chapter 3. The Relational Database Model\n第四週　2009-10-7　　Chapter 4. ER Modeling (I)\n第五週　2009-10-14　　Chapter 4. ER Modeling (II) and Chapter 5. Normalizations (I)\n第六週　2009-10-21　　Chapter 5. Normalizations (II)\n第七週　2009-10-28　　Chapter 6. Advanced Data Modeling\n第八週　2009-11-04　　Supplements: Relational Algebras\n第九週　2009-11-11　　Midterm Exam.\n第十週　2009-11-18　　Chapter 7. SQL (I)\n第十一週　2009-11-25　　Chapter 7. SQL (II)\n第十二週　2009-12-02　　Chapter 8. Advanced SQL (I)\n第十三週　2009-12-09　　Chapter 8. Advanced SQL (II)\n第十四週　2009-12-16　　Chapter 9. Database Design\n第十五週　2009-12-23　　Chapter 10. Transaction Management and concurrency control\n第十六週　2009-12-30　　Chapter 13. Business Intelligence and data warehouse\n第十七週　2010-01-06　　Chapter 14.and Chapter 15 （摘要講解）\n第十八週　2010-01-13　　Final Exam.\n","scorePolicy":"Midterm Exam: 30%\nFinal Exam:  30%\nQuizzes, Assignments and In-class Response: 40%\nBoth examinations are cumulative and given in a varied format. An in-class review will be held prior to each examination.\nQuizzes are announced one week in advance and may vary from three to five questions that may be in any format.","materials":"教科書：\nDatabase Systems: Design, Implementation, and Management, 8th Edition (2009)  by Peter Rob and Carlos Coronel,（歐亞代理）\n參考書：\nA First Course in Database Systems, 3rd Edition (2008),  by Jeffrey D. Ullman and Jennifer Widom, Prentice Hall.（全華代理）\n","foreignLanguageTextbooks":false}]
