[{"name":"林永崇","email":"lin88@ms1.hinet.net","latestUpdate":"2009-09-20 19:14:26","objective":"倫理學是動態的，是隨社會環境的變遷而演化出來的結果。本課程雖然是概論的課名，但不會只採用靜態的方式介紹倫理學的基本主張，而是結合當前科技文化的衝擊以具體討論倫理觀念。因而課程都以當前的熱門議題為起始，其中發現倫理爭議，並進行道德思考與問題解決。\n當今的科技發展無疑地挑戰了傳統社會中的倫理思維，這種表現主要在生物基因科技、網路資訊科技、環境工程科技等面向，而這些成就隨全球化資本主義的擴張，幾乎與各種的商業活動緊密結合。然而，邁向二十一世紀的我們卻猛然驚覺人類生存的危機背後的殺手就是科技高度的成就，這種矛盾表現在人類不斷追求改善生存環境，卻同時在破壞唯一賴以生存的綠色地球。\n「沒有包含環境倫理的思維，就不能算是倫理學。」生態哲學家紛紛反思傳統倫理思想的不足，從「非人類中心論」、「動物解放」、「生命中心論」、「生態中心論」，乃至「整體論」等運動構成了倫理變遷的內涵。本課程即以此思想脈絡下，讓學員了解科技發展與倫理變遷的具體運動，內化成自己人文素養的內涵，並體會到拯救地球運動與人類的思想變遷密不可分。","schedule":"周次　　內容說明\n一　　課程目標、教材與教學要求\n二　　科技發展的總體檢視(1)：工業革命至二次大戰之間\n三　　科技發展的總體檢視(2)：二次大戰後至二十一世紀初\n四　　生物基因科技及其問題：人類可以扮演上帝的角色，但應該嗎？\n五　　網路資訊科技及其問題：程式碼可以取代規範嗎？\n六　　環境工程科技及其問題：科學主義的疑慮──解鈴仍需繫鈴人？\n七　　科技發展與全球化運動：擴張性的資本主義是助紂為虐的幫兇？\n八　　永續發展──環境與商業的交集：綠色全球宣言\n九　　期中考\n十　　人類中心論與非人類中心論：解除人類魔咒的開始\n十一　　動物解放與生命中心論：「人之異於禽獸幾希」的迷思\n十二　　生態中心論與整體論：地球與人類互為生命共同體\n十三　　環境倫理與規範倫理：沒有環境倫理，就不是規範倫理\n十四　　永續價值作為倫理學的拱心石：綠色永續的價值是超越人類的核心價值\n十五　　永續發展與個案分析(1)──個案蒐集成果與報告\n十六　　永續發展與個案分析(2)──個案蒐集成果與報告\n十七　　問題與回顧\n十八　　期末考\n","scorePolicy":"1、平時互動 30%──出席率、上課討論、網站討論留言\n2、期中作業 40% ──科技與倫理的個案蒐集、整理與分析，並擇優口頭報告\n3、期末筆試 30%──理論與個案的瞭解，以簡答及申論題的方式評量之","materials":"1. 王瑞香譯。1996。《環境倫理學》。台北：國立編譯館。\n2. 何畫瑰譯。1999。《科技倫理》。台北：韋伯文化事業。\n3. 鄧伯宸譯。2005。《綠色全球宣言》。台北：立緒文化。\n4. 范昱峰譯。2000。《德性起源：人性私利與美善的演化》。台北：時報文化。\n5. 趙淑妙譯。1999。《自私的基因：我們都是基因的俘虜？》。台北：天下文化。\n6. 宋昭儀譯。2000。《惡魔的科學》。台北：新雨。\n7. 蕭美惠譯。1999。《透明社會：個人隱私VS.資訊自由》。台北：先覺。\n8. 楊通進譯。2005。《大自然的權利：環境倫理學史》。青島：青島出版社。\n9. 袁中新主編。2000。《環境倫理與科學》。台北：巨流。\n10. Pojman, Louis P. 2000. Global Environmental Ethics. Mountain View, CA: Mayfield Publishing Company.\n11. Guerrier, Yvonne, Nicholas Alexander, Jonathan Chase, and Martin O’brien. 1995. Values and the Environment: A Social Science Perspective. New York: John Wiley &amp; Sons.\n12. Norton, Simon D. 2007. The natural environment as a salient stakeholder: non-anthropocentrism, ecosystem stability and the financial markets. Business Ethics: A European Review 16 (4): 387-402.\n13. Laszlo, Chris. 2003. The Sustainable Company: How to Create Lasting Value Through Social and Environmental Performance. Washington DC: Island Press.\n14. Harris, John, ed. 2001. Bioethics. New York: Oxford University Press.\n15. Koehn, Daryl. 1994. The Ground of Professional Ethics. Landon and New York: Routledge  (esp. chapter 8 &amp; 9).\n16. 網路自編講義 http://lin88.myweb.hinet.net/\n","foreignLanguageTextbooks":false}]
