[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2009-09-18 14:21:15","objective":"網路環境具有互動性,虛擬經驗等,因此消費行為有別於傳統環境之下,本課程首先探討傳統市場與電子市場之經濟分析,接著探討網路消費者行為理論，虛擬社群,虛擬經驗,網路廣告與互動品質.互動行銷技術, 顧客服務管理, 顧客關係層次,交易成本理論,網路行銷企業模式,互動技術顧客關係.","schedule":"週次     日期     上課內容     教科書章次 \n1     2/20     課程介紹     \n2     2/27     知識管理概論：知識管理概論、知識經濟之管理作為     T3\n3     3/6      知識管理概論：知識的創造、知識的共享     T4\n4     3/13     知識管理概論：知識管理與資訊科技     T5\n5     3/20     行銷資訊變革       P1：Marketing and the changing information environment: implications for strategy, structure, and marketing mix , in Deshpande (2001)T1\n6     3/27     市場導向           P2：Market orientation: the construct, research propositions, and managerial implications, in Deshpande (1999)T1\n7     4/3      市場導向與績效     P3：the effect of market orientation on business profitability, in Deshpande (1999)T1\n8     4/10     市場導向與組織學習 P4：Market oriented is not enough: build a learning organization, Deshpande (1999)T1\n9     4/17     個案討論           兒童用品知識平台研發計畫第一季報告  知識平台需求\n10     4/24    行銷資訊處理       P5：Marketing information process and organizational learning, Sinkula(1994), Journal of Marketing, 35-45.\n11     5/1     行銷資訊蒐集       P6：Intelligence generation and superior customer value.Slater and Narver(2000), Journal of Academy of Marketing Science, 28(1),120-127.\n12     5/8     行銷知識管理       P7: Understanding Firms' Customer Satisfaction Information Usage, Journal of Marketing, July 2005.\n13     5/15    停課\n14     5/22    行銷知識管理       P8：Market intelligence dissemination across functional boundaries, in Deshpande (2001)T2\n15     5/29    行銷知識管理       P9: The Role of Relational Information Processes and Technology Use in Customer Relationship Management, Journal of Marketing, oct 2005.\n16     6/5     行銷知識管理應用   P10: Five types of customer knowledge management, and how smart companies use to creat value, Gibbert M, M. Leibold, and G. Probst(2002), European Management Journal, 20(5),459-469\n17     6/12    行銷知識管理應用   P11 Customer Knowledge Development: Antecedents and Impact on New Product Performance. By: Joshi, Ashwin W.; Sharma, Sanjay. Journal of Marketing, Oct2004, Vol. 68 Issue 4, p47, 13p, 3 charts, 1 diagram; (AN 14341242)\n18     6/19    行銷知識管理應用   個案討論 P12: Case study: Volvo Cars  兒童用品知識平台研發計畫期中報告  知識平台需求\n","scorePolicy":"Grading: \nPaper Presentation 30%, \nClass Discussion 30%, \nTerm paper 40%.","materials":"Text Book:\nT1:Deshpande, Rohit (Ed.) (2001), Using Market Knowledge, Sage Publication.\nT2:Deshpande, Rohit (Ed.) (1999), Developing A Market Orientation, Sage Publication.\nT3:知識管理, 洪育忠譯，華泰出版社2004\nT4:楊子江，王美音譯(1997)創新求勝,遠流出版社\nT5:李淑華譯(2001),知識共享型組織,商周出版社","foreignLanguageTextbooks":false}]
