[
  {
    "name": "陳弘哲",
    "email": "pgo600@gmail.com",
    "latestUpdate": "2022-02-15 00:03:26",
    "objective": "本課程的目標是教導有志從事化工群教學工作的學生，使其能熟悉化工群課程綱要，準備分析及運用教材，練習教案的編製與運用，練習靈活運用教學法，教學技術，熟知學校常規，設計與指定作業以及練習教學評鑑與學習評量，使從參與行動中接觸各種實際經驗，以便畢業後能須利適應教學情境。 \n本課程擬培養之核心能力與指標：1-1 具備教育專業知識並掌握重要教育議題之能力。1-2 具備領域 / 學科知識及相關教學知能。2-1 具備課程與教學設計能力。2-2 具備善用教學策略進行有效教學之能力。2-3 具備運用適切方法進行學習評量之能力。3-1 具備發揮班級經營效能營造支持性學習環境之能力。5-1 具備致力教師專業成長之能力。(&lt;a href='http://tec.ntut.edu.tw/ezfiles/18/1018/img/2659/156470978.pdf'&gt; 各項指標內容請點連結詳閱了解 & lt;/a&gt;)\nThe object of this course is to lead the students to know how to be a good instructor with good instructional methods and skills learned from this course. For achieving this goal, this course presents the students with basic theories of instructions, makes them study from demonstration in high school and among themselves, directs them to practices the making of inst4ucting plans. After finishing this course, the students should have learned how to make sure of the standard of the subjects they are going to teach; how to prepare, analyze and skillfully use the teaching material, how to make and skillfully use the instructing plans, how to actively use instructing methods and skills, how to will know and use the school or class rules, how to design and assign exercise, how to evaluate instruction and learning. As a result, they must become good teachers in the future.",
    "schedule": "01    課程簡介，報告注意事項\n02    教學實習模式中實習教師的角色與任務\n03    校外參訪【上網填報教學實習調查表】\n04    教學演示（一）\n05    運動會\n06    教學演示（二）\n07    清明節\n08    校外教學實習見習 ------ 觀摩\n09    校外教學實習見習 ------ 觀摩\n10    校外教學實務之一 ------ 教學活動設計\n11    校外教學實務之二 ------ 試教\n12    校外教學分享與討論、教學演示（三）\n13    教學演示（四）\n14    教學競賽與觀摩 (暫訂_依師培中心排訂後再調整)\n15    教學演示（五）\n16    教學演示（六）\n17    綜合討論\n18    期末考試",
    "scorePolicy": "1. 平時成績：20%（課堂表現、討論發言、出席表現、參訪報告)\n2. 期中成績：20%（校外教學實習報告）\n3. 學習歷程檔案：35%\n(1) 教學活動設計：20%\n(2) 教材編製 (含媒體)：15%\n4. 教學演示、建議報告成績：25%",
    "materials": "1. 方炳林（民 81）教學原理。台北：教育文物出版社。\n2. 林寶山（民 92）實用教學原理與技巧。台北：五南。\n3. 黃政傑（民 87）教學原理。台北：師大書苑。\n4. 林進材（民 93）。教學原理。台北：五南圖書出版公司。\n5. 周春美（2010），教材教法與教學實習， 天空數位圖書。\n6. 王財印、吳百祿、周新富（民 93）。 教學原理。台北：心理出版社。\n7. 楊俊鴻。素養導向課程與教學：理論與實踐 (2 版) 台北：台灣高等教育出版社。\n8. 郭至和（2020)。素養導向課程的規劃與實施，台北：五南圖書出版公司。\n9. 黃瑞菘（2018）。核心素養導向課程設計，台北：五南圖書出版公司。\n10. 林永豐主編。邁向素養導向的課程教學改革，台北：五南圖書出版公司。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. 尚未修習教育基礎課程 1 門、教育方法學課程 2 門、及教材教法課程者，不能修習本課程。\n2. 如有加退選或課程問題請寄 email 給老師 (tch3025@goo.tyai.tyc.edu.tw)。\n3. 因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。若無法實體上課， \n   預計使用 Google Meet 於原定上課時間遠距上課，細節將再另行公布。</div></b></b>"
  }
]
