[
  {
    "name": "黃少妤",
    "email": "phsophia@gmail.com",
    "latestUpdate": "2022-02-16 12:32:12",
    "objective": "由於九零年代後，城市急速擴張與超越領域性 (de-terrorization) 的連結等新興狀態萌生，基礎設施 (infrastructure) 的定義逐漸開始難以精確認定，而身為城市興衰論述的經常主體，基礎設施自身的論述與再定義卻在空間學門中成為那缺落的一塊。\n\n基於此，本課程期望透過幾項特定學門角度，提供一個對於基礎設施為研究主題的論述框架，進而連結建築學門與相關空間學門間對於當代全球城市論述中之縫隙，能在跨學門田野研究中提出他種可能性 (alternatives)。 本課程將以兩種方項進行基礎設施當代性的 \"實踐\"; 部分課程內容將邀請德國杜賓根大學台灣研究中心，以空間社會學角度提供授課交流。另一部分將透過雙邊學生，以共同主題進行台北與德國城市的實際田野調查並以比較分析的方式進行合作討論。課程架構則以建築學與空間社會學為主軸剖析，分為五個部分：全球城市與多尺度論述，當代基礎設施與建築 / 地景對話，社會基礎設施的物質性與再生產，看不見的基礎設施與田野調查為總結。預計學生能透過不同學門角度的切入、於不同文化背景學生間合作討論、多種教學方式的引導，培養基礎辯證思考之能力並進一步對當代都市基礎設施的空間性研究之興趣。\nIn the contemporary word, especially in globalized cities, infrastructure is hard to define for many reasons and at some points infrastructure is also often invisible to its users.\n\nThis class will therefore seek to rethink the subject of infrastructure from particular perspectives which frame the structure of this module. We then proposed a join-class with Taiwan study centre at University of T?bingen, Germany for wider debates and teaching possibilities as well. There will be two academic discourses-Architecture and sociology involved and formed into five sessions which can be seen in course syllabus. In so doing, it will focus on firstly by reading theory; secondly, by examining specific case studies that illustrates how these theories manifests themselves; and thirdly, by considering how these infrastructures may be changing the understanding of contemporary globalized cities and reproducing urban networks in different fields and countries.",
    "schedule": "1. 02.022   Course Introduction- Current Debates on the study of Infrastructure\nSession: The context of Infrastructure  \n2. 03.01  Landscape as Infrastructure\n3. 03.08  Architecture as Infrastructure\n4. 03.15  Visiting Speaker 01 - Mr.Po-wei Lai [Regeneration, Reframing, Recast]\n5. 03.22  Emerging Infrastructure\n6. 03.29  Open City and Infrastructural Lives\n7. 04.05  Easter Holiday \n8. 04.12  Visiting Speaker 02- Dr.Stefan Tkac [Cases study on hydropower stations in TW]\n9. 04.19  Reading week (mid-term)\nSession: The Development of Social Urban Infrastructure \nSocial Infrastructure\n10. 04.26 New Public Space01 (Dr. Huang)\n11. 05.03 New Public Space02 (Dr.Yu)\nNetwork and Informal Infrastructure\n12. 05.10 Mobility and Network Infrastructure01 (Dr. Huang)\n13. 05.17 Mobility and Network Infrastructure02 (Dr.Yu)\n14. 05.24 Migration and Cityscape01 (Dr. Huang)\n15. 05.31 Periphery and Cityscape02 (Dr.Yu)\nSession: Final Review \n16. 06.07 Essay Draft and Round-table Discussion\n17. 06.14  Writing-up Week\n18. 06.21  Oral Presentation [Essay submission]",
    "scorePolicy": "Essay 40%\nOral Presentation 30%\nAssignments 10\nAttendance 20%",
    "materials": "Waldheim, Charles (2006). The landscape urbanism reader. New York: Princeton Architectural Press. \nGraham, Stephen (2001). Splintering Urbanism: Networked Infrastructures, Technological Mobilites and the Urban Condition. London; New York: Routledge. \nBurdett, Richard and Deyan Sudjic et al. (2010). The endless city, 2nd, London: Phaidon. \nGuggenheim, Michael and Ola Soderstrom (eds.) (2010). Re-shaping cities: how global mobility transforms architecture and urban form. London; New York: Routledge. \nGomez-Ibanez, J. A. (2006). Regulating Infrastructure: Monopoly, Contracts, and Discretion. Harvard University Press.\nMarkard, J. (2011). Transformation of Infrastructures: Sector Characteristics and Implications for Fundamental Change. Journal of Infrastructure Systems.\n\nBerger, Alan. 2006. Drosscape: Wasting Land in Urban America. New York: Princeton Architectural Press.\nEasterling, Keller. 2014. Extrastatecraft: The Power of Infrastructure Space. London; New York: Verso.\nKrzysztof Iniewski; Carl McCrosky; Daniel Minoli. 2008. NETWORK INFRASTRUCTURE AND ARCHITECTURE. Hoboken, N.J: Wiley-Interscience.\nLarry Ray. 2007. Globalization and Everyday Life. 1st ed. Taylor &amp; Francis.\nMarco Graber, Thomas Pulver, ed. 2009. Spatial Sequences and Urban Infrastructure: Graber Pulver at ETH Zurich. Bilingual edition. Scheidegger and Spiess.\nMasanori Hamada, ed. 2014. Critical Urban Infrastructure Handbook. CRC Press.\nMIT Center for Advanced Urbanism. 2016. Scaling Infrastructure. edited by Sonja Beeck; Meredith Baber. New York : Princeton Architectural Press.\nRobertson, Susan. 2007. “Visions of Urban Mobility: The Westway, London, England.” Cultural Geographies 14(47).\nScott Lloyd, Katrina Stoll, ed. 2011. Infrastructure as Architecture: Designing Composite Networks. Jovis .\nStephen Graham, Colin McFarlane, ed. 2014. Infrastructural Lives: Urban Infrastructure in Context. Abingdon : Routledge.\nTimothy Moss; Simon Marvin; Simon Guy, ed. 2016. Urban Infrastructure in Transition: Networks, Buildings and Plans. Routledge.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n※「三級」(含) 以上警戒：課程全採遠距授課。\n※「二級」警戒授課方式說明如下：\n●上課方式：遠距上課 https://moe-tw4.webex.com/meet/shaoyuhuang\n●評量方式：線上報告與繳交電子檔案 email: shaoyuhuang@mail.ntut.edu.tw</div></b></b>"
  }
]
