[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2022-02-20 22:45:32",
    "objective": "The Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.\nThis course is for  IEECUS international students.This semester we're going to read some articles and analyze to the structure and purpose of  it.",
    "schedule": "W1 Introduction\nW2 Reading and practice\nW3 analyze the structure of articles\nW4 A news\nW5 news and interview\nW6 Practical \nW7 Practical \nW8 Presentation\nW9 midterm exam\nW10 letter and daily\nW11 Songs and Lyric\nW12 Jokes and meme\nW13 Official Document \nW14 Novels\nW15 Practical\nW16 Practical\nW17 Presentation\nW18 final exam",
    "scorePolicy": "Attendance 10%\nDiscussion  10%\nHomework  20%\nMidterm exam 30%\nFinal exam 30%",
    "materials": "handout\npowerpoint\n1. 今周刊\n2.newspapers",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Differentiated assessment\nIf the CECC announces that the nationwide Level 3 alert for COVID-19,  we would study from home via google meet. The link is : \nhttps://meet.google.com/jwy-scbt-uov\n2.Or email me : sweetprettylover@gmail.com</div></b></b>"
  }
]
