[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2022-02-17 13:09:09",
    "objective": "Feedback control is an interdisciplinary field in that control is applied to systems in every conceivable area of engineering.  Consequently, control is an active field of research and hence there is a steady influx of new concepts, ideas, and techniques.  Some of these elements develop to the point where they join the list of things every control engineer must know.  This is the course where students, especially EE majors, begin to acquire both traditional and modern topics in the field of control systems.  The core material covered in this course is to provide ample motivation, insight, and understanding in classical control.\n\nThe goals of the course can be summarized as below:\n　　Master design as well as analysis techniques.  Find good feedback control design with clear understanding.  Moreover, seeing them used.\n　　Learn to solve problems by constructing effective algorithms in computer languages like Matlab and Simulink.\n\nThe course is presented in a standard format of lectures, readings, and problem sets.  In addition to a midterm and a final examination, there will be a number of homework  quizzes equally spaced over the term, all in-class.  The quiz questions are based on assigned problem sets in the textbook.  All quizzes/examinations will be closed book. \n\n\nRemarks 備註：\n　　Course lectures are offered in Chinese. 本課程為中文授課，惟教科書、講義、試題皆以英語呈現。\n　　Textbook should be purchased asap as it is a very good reference for study in robotics. 教科書應儘快購買。\n　　Course lecture notes can only be downloaded via iStudy website and are protected under the Intellectual Property law.  Lecture notes are NOT freely distributed. 課程講義可於 iStudy 網站下載，請尊重智慧財產權，不可散布課程相關檔案及文件。\n　　All announcements will be made via iStudy website. Class group via Line will be established in the first class. 所有課程相關訊息將公告於北科 i 學園 +、並於第一週上課時成立課程 Line 群組。",
    "schedule": "Tentative schedule 暫定課程進度\n\n1　　02/24　　簡介 Introduction to control systems\n2　　03/03　　拉普拉斯轉換 Laplace transforms &amp; Introduction to Matlab/Simulink\n3　　03/10　　動態模型 Dynamic models &amp; Introduction to Matlab/Simulink\n4　　03/17　　系統建模圖 System modeling diagrams\n5　　03/24　　基本控制方程式 Basic equations of control\n6　　03/31　　時域規格 Time-domain specifications\n7　　04/07　　零點與額外極點的效應 Effects of zeros and additional poles\n8　　04/14　　多項式輸入的穩態誤差控制 Control of steady-state error to polynomial inputs\n9　　04/21　　期中考 Midterm examination\n10　　04/28　　PID 控制 PID control\n11　　05/05　　穩定性 Stability\n12　　05/12　　根軌跡設計方法 (1/3) Root-locus design method  (1/3)\n13　　05/19　　根軌跡設計方法 (2/3) Root-locus design method (2/3)\n14　　05/26　　根軌跡設計方法 (3/3) Root-locus design method (3/3)\n15　　06/02　　頻率響應設計方法 (1/3) Frequency-responses design method (1/3)\n16　　06/09　　頻率響應設計方法 (2/3) Frequency-responses design method (2/3)\n17　　06/16　　頻率響應設計方法 (3/3) Frequency-responses design method (3/3)\n18　　06/23　　期末考 Final examination\n\nPS: The contents and order of lectures will be adjusted according to actual needs 上述授課內容及順序將因應實際狀況調整",
    "scorePolicy": "The final grade will be a weighted average of class participation 10%, homework quizzes 25%, midterms 30%, and final 35%.",
    "materials": "TEXTBOOK:　　Feedback Control of Dynamic Systems, Eighth Edition,\nPearson Education, Inc.\nby Gene F. Franklin, J. David Powell, and Abbas Emami-Naeini\n總代理：滄海圖書公司 Tel: 04-2708-8787\n\nREFERENCES: Automatic Control Systems by B. C. Kuo\nControl Systems by M. Gopal\nModern Control Systems by R. C. Dorf",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">If remote classes 若線上授課\nGoogle Meet https://meet.google.com/nap-ncsj-ond\niStudy https://istudy.ntut.edu.tw/\n\nProfessor Wen-Chung Chang 張文中教授，wchang@ntut.edu.tw\nTA: Li-Wei Chen 陳立維 t110318165@ntut.edu.tw</div></b></b>"
  }
]
