[
  {
    "name": "狄雅南",
    "email": "ardilahayu@ntut.edu.tw",
    "latestUpdate": "2022-01-31 10:58:00",
    "objective": "Unit Operation will be divided into three chapters:  Introduction to Engineering Principles and Units (Ch. 1), Principles of Momentum Transfer and Overall Balances (Ch. 2), and Principles of Momentum Transfer and Applications (Ch. 3).",
    "schedule": "1st week: Introduction conservation momentum, mass, and energy\n2nd week: Introduction to Engineering Principles and Units (Ch. 1)\n3rd week: Conservation of Mass and Material Balances\n4th week: Conservation of Energy and Heat Balances\n5th week: Exercise and Review\n6th week: Principles of Momentum Transfer and Overall Balances (Ch. 2)\n7th week: General Molecular Transport Equation for Momentum, Heat, and Mass Transfer\n8th week: Overall Mass Balance and Continuity Equation, Exercise\n9th week: Overall Energy Balance and Momentum Balance\n10th week: Midterm Exam\n11th week: Shell Momentum Balance and Velocity Profile in Laminar Flow\n12th week: Design Equations for Laminar and Turbulent Flows in Pipes\n13th week: Principles of Momentum Transfer and Applications (Ch. 3)\n14th week: Pumps and Gas-Moving Equipment\n15th week: Non-Newtonian Fluids\n16th week: Differential Equations of Continuity\n17th week: Review and problems exercise\n18th week: Final exam/Group presentations",
    "scorePolicy": "Mid-term　　        　　　　                                35 %\nFinal Exam/group presentations 　　                45 %\nHomework, Classroom participants (Q&amp;A)　　20 %",
    "materials": "1.　　Geankoplis, C. J., Transport Processes and Unit Operations, 4th Ed., Allyn and Bacon series in engineering, Boston, Massachusetts (1978).\n2.　　McCabe, W. L., Smith, J. C., Harriott, P., Unit Operations of Chemical Engineering, 7th Ed., McGraw-Hill.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Students can ask any time through the i-Plus system or offline discussions at Chemical Engineering-411. This course will use English.\n\n*Online course will be offered depend on pandemic situation.</div></b></b>"
  }
]
