[
  {
    "name": "陳起鳳",
    "email": "cqf2@ulive.pccu.edu.tw",
    "latestUpdate": "2022-02-10 12:29:01",
    "objective": "環境科學為跨領域學習，涵蓋地球上生物與非生物科學，以及人類與環境之間的互動關係。人類生活在地球環境中，利用各種自然資源滿足生活所需，實有必要對環境之生物與非生物都有一定的認識，才能在與環境的互動中，友善並永續的持續下去。本課程為概論課，主要在於對於環境各樣部分的認識，但更重要的是在這些認識中，認知如何珍賞並珍惜這些資源。本課程涵蓋內容包含：生態系統、地球科學、水資源、能源資源、糧食資源、環境倫理、環境正義等。\nEnvironmental Science is an interdisciplinary learning, including the knowledge about the biological and non-biological science on the earth and the interactions between human beings and the environment. Human live in the earth environment and use all the natural resources to meet their living needs. Therefore, the basic knowledge about the earth and the resources on it are necessary. With the correct knowledge, the interactions between human and the environment are able to sustain peacefully. This course is a beginning and is aimed to learn the all components about the earth. Moreover, to precious and to conserve the nature is the most important message in this course. The contents of this course include ecosystem, earth science, water resources, energy, food resources, environmental ethics, and environmental justices.",
    "schedule": "第一單元：Environmental problems, their causes, and sustainability\n第二單元：Biodiversity, species interactions, and population control\n第三單元：The human population and urbanization\n第四單元：Sustaining biodiversity: the species approach\n第五單元：Sustaining biodiversity: the ecosystem approach\n期中考\n第六單元：Food, soil, and pest management\n第七單元：Water resources and water pollution\n第八單元：Energy\n第九單元：Environmental economics, politics, and worldviews\n期末考",
    "scorePolicy": "出席與上課表現 15%\n隨堂考 (每章節預習) 30%\n期中考 25%\n期末考 30%",
    "materials": "textbook: \nMiller, G.T., and Spoolman, S.E. 2015. Environmental Science.15th edition.  BROOKS/COLE CENGAGE Learning.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 若因疫情需調整線上上課，將採用 Teams 平台，並於課程系統告知。\n有任何問題可與老師聯絡：cfchen@ntut.edu.tw</div></b></b>"
  }
]
