[
  {
    "name": "王佩淳",
    "email": "t5749005@ntut.org.tw",
    "latestUpdate": "2022-02-17 14:44:52",
    "objective": "本課程之目的是以作業研究 (OR) 為理論背景，探討如何運用數學規劃方法求解工程與管理相關的決策問題。課程內容主要是詳細介紹線性規劃中各種方法的概念、模型的建構以及問題求解，透過這些數理邏輯解析的相關訓練強化學生對問題解決的能力。並且，輔以應用案例解析以培養學生理論與應用並重的能力。另外，介紹最佳化計算軟體來求解數學模式並輔助說明所得數據之意涵。\nThis course will cover briefly the basics of different area of Operations Research such as: Linear programming, Goal programming, Transportation models and its variants, etc. Also, the course will introduce some tools that help in problem solving and decision making.",
    "schedule": "W1 Introduction to Management Science\nW2 Modeling with Linear programming\nW3 Linear Programming: Sensitivity Analysis and Interpretation of Solution\nW4 Linear Programming Applications in Marketing, Finance, and Operations Management\nW5 Linear Programming Applications in Marketing, Finance, and Operations Management\nW6 Nonlinear Optimization Models\nW7 Distribution and Network Models: assignment problem\nW8 Distribution and Network Models: shortest route\nW9 Midterm exam\nW10 Goal programming\nW11 Multi-objective decision-making method\nW12 Integer linear programming with application\nW13 Advanced Linear Programming Applications: Data Envelopment Analysis and Game theory\nW14 Solution algorithm for integer programming\nW15 Decision analysis\nW16 Decision analysis with probability\nW17 Decision analysis with application\nW18 Final exam",
    "scorePolicy": "Homework: 25%\nMidterm: 30%\nFinal: 30%\nDiscussion: 15%",
    "materials": "1.　　David, R. Anderson, Dennis, J. Sweeney, Thomas A. Williams and Kipp Martin, An Introduction to Management Science: Quantitative Approaches to Decision Making, 14e, 2016, South-Western. \n2.　　Hamdy A. Taha, Operations Research- an introduction, 10e, 2017, PEARSON.\n3.　　Optimization Modeling with Lingo, 1999, LINDO System INC.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. 課程教材及其他資料與課程訊息將透過北科 i 學園 + 公布。\n2. 同學如有加退選簽核或課程問題請 email: t5749005@ntut.org.tw，信件標題 [管理科學]_班級_姓名。\n3. 因應疫情可能會調整授課內容、授課方式、評分項目與配分。如果無法實體上課，預定使用 Teams 與 Zuvio 於原定上課時間遠距上課，細節再另行公布。</div></b></b>"
  }
]
