[
  {
    "name": "鍾建屏",
    "email": "thomas6311@mail.ntut.edu.tw",
    "latestUpdate": "2022-02-16 11:47:14",
    "objective": "A well-functioning financial system is a basic necessity for a well-functioning economy. The critical importance of the financial system leads society to both support the growth of the system and to protect and control the system through legislation and regulation. The course gives the introduction to financial markets. The main topics of the course are portfolio selection, equilibrium asset pricing, arbitrage, fixed income securities, and derivatives. Students should understand the many trade-offs involved in balancing those objectives.\nIn addition, this course also introduces the international financial markets (i.e. money market, bond market, stock market, mortgage market, foreign exchange market, investment banks, commercial banks…etc). The objectives of this course are to develop a fundamental understanding of (i) how financial markets work; (ii) how financial systems affect people and daily life.",
    "schedule": "Week　　Course Content and Schedule\n01　　Introduction\n02　　Determinants of Interest Rates (Part 1.)\n03　　Determinants of Interest Rates (Part 2.)\n04　　Interest Rates and Security Valuation (Part 1.)\n05　　Interest Rates and Security Valuation (Part 2.)\n06　　The Federal Reserve System, Monetary Policy, and Interest Rates\n07　　Money Markets (Part 1.)\n08　　Money Markets (Part 2.)\n09　　Mid-term Exam\n10　　Bond Markets (Part 1.)\n11　　Bond Markets (Part 2.)\n12　　Mortgage Markets\n13　　Stock Markets (Part 1.)\n14　　Stock Markets (Part 2.)\n15　　Foreign Exchange Markets (Part 1.)\n16　　Foreign Exchange Markets (Part 2.)\n17　　Derivative Securities Markets\n18　　Final Exam",
    "scorePolicy": "Your grade will be determined by three components:\nClass Participation and Homework Assignments 40%\nMid-term Exam 30%\nFinal Exam 30%",
    "materials": "Text Book\nFinancial Markets and Institutions 8th Edition (International Edition, 2021)\nAuthor: Anthony Saunders (Author), Marcia Cornett (Author), Otgo Erhemjamts\nRecommended Reading: The Economist, a weekly international news magazine.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Classroom Dynamics\n\nClass attendance is valuable. You should try your best to come to every lecture.</div></b></b>"
  }
]
