[
  {
    "name": "林祐正",
    "email": "yclin@ntut.edu.tw",
    "latestUpdate": "2022-02-16 06:39:22",
    "objective": "This course will provide students with the computational fundamental skills necessary to plan and schedule the entire construction process and familiarize them with computer project management software packages. Students will learn to mix and match available resources in the most efficient combinations to complete projects on time and within budget. Furthermore,\nthe student may utilize computational programming to efficiently plan and execute municipal infrastructure programs and support contractors’ decisions on high risk and constrained projects.",
    "schedule": "1. Computer-based Project Management in Construction\n2. The application of Construction Computer-based Project Management\n3. Information Management Technology\n4. The application of Visual Basic Application in Excel\n5. Construction Management System - Introduction (P6 and Project 2003)\n6. Web-based Construction Management System \n7. The application of Database in Construction Management\n8. The application of BIM in Construction Management\n9. Construction Simulation and automation \n10. Special Topics in Construction Management Information",
    "scorePolicy": "1. Attendance and class participation (10%)\n2. Homework (20%)\n3. Mid project presentation (10%) and Mid project report (20%)\n4. Final project presentation (10%) and final project report (30%)",
    "materials": "1. Related journal papers.",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. The course will adopt distance learning based on the status of pandemic situation and use Google Meet for distance learning.\n2. The information to access Google Meet will be noticed and shared by course Line.</div></b></b>"
  }
]
