[
  {
    "name": "柯文娟",
    "email": "wjk966575@gmail.com",
    "latestUpdate": "2022-02-18 01:26:08",
    "objective": "課程旨在帶領學生於全球化多元的商業環境下，思維倫理在複雜的企業決策過程中所扮演之重要角色。引導學生認識企業倫理的內涵，並透過自編教材、教科書內容與個案探討，啟發學生對相關主題的興趣，體認企業倫理確實於日常生活中頻繁出現，而不僅為形而上的哲學觀。本課程擬藉由課堂的情境移轉，培養具有企業倫理的企業經理人。\n本課程的目的將藉由五個面向了解企業倫理的本質，分別為：從全球化角度認知社會可接受的商業行為，將待人和善深植於良好的企業中，企業形象再造，強化職業倫理以及投資於可持續發展和有社會責任的公司。本課程亦教導學生瞭解今日快速變化工商界，符合企業倫理的公司治理原則與方式。課程的教導將朝下列五個方向進行：（1）廠商的社會責任（如：產品綠化與環境保護），（2）消費者的保護（如：產品的安全性），（3）員工的權益（如：職業健康），（4）員工對公司的責任（如：利益衝突），（5）雇主與員工關係（如：性別平等）。\nThe objective of this course is to appreciate the essential of Business Ethics through five main faucets: recognizing socially acceptable business conduct from the global perspectives, embedding good business in treating people nice and fair, reengineering corporate image, enhancing professional ethics, and investing in sustainable and socially responsible corporations. This course also discusses with the students the corporate governance that follows business ethics in today's changing business society. Five major categories will be covered: (1) Corporate Social Responsibility (e.g., Green product and environmental protection), (2) Consumer protection (e.g., Product safety), (3) Employee's rights and benefits (e.g., Occupational health), (4) Responsibility of employee to the firms (e.g., Conflict of interest), and (5) Employer-employee relations (e.g., Gender equity).",
    "schedule": "本課程係以緒論、社會、企業內外部、個人層次對照授課單元加以設計，課程進度規劃如後。\n週次　　日期　　單元名稱　　主要授課內容　　討論個案\n1　　2022/02/25　　企業倫理之概念與趨勢　　企業之概演進與研究趨勢　　\n2　　2022/03/04　　企業倫理議題分析　　企業倫理學釋義；為什麼要研究企業倫理？解決道德議題。　　美國禮來公司用藥安全、濱南工業區發展之爭。\n3　　2022/03/11　　商業中的倫理議題　　倫理議題與社會契約；倫理議題的分類。　　基改食品的危害、幾個倫理困境。\n4　　2022/03/18　　利害關係人管理　　企業該向誰負責？評估利害關係人的步驟與工具；利害關係人的對應策略。　　公平交易咖啡豆的道德採購、巧克力背後的血淚。\n5　　2022/03/25　　企業公民責任　　企業社會責任；企業發展與社會回應；社會企業；\n支持企業責任的全球合作。　　默克藥廠的美迪善計畫、通用汽車的召回事件、聯合國全球盟約。\n6　　2022/04/01　　消費者的權益　　消費者意識；消費者基本權利與義務。產品品質的確保；廣告宣傳的倫理議題。　　台灣的食品安全問題、度假村代銷公司的銷售。\n7　　2022/04/08　　永續發展的生態環境之創造　　企業帶給生態環境的問題；西方生態的道德觀；國際社會的環保政策介紹。　　日月光 K7 廠環境污染問題、頁岩氣應該開發嗎？\n8　　2022/04/15　　社區參與　　企業參與公益慈善活動的理由；參與公益的種類與形式。　　勝利加油站。\n9　　2022/04/22　　學生期中報告（期中考週）\n10　　2022/04/29　　公益行銷　　議題與形式的創新；慎選合作伙伴。　　Bing 與 Yahoo! 的檢索行銷。\n11　　2022/05/06　　企業倫理制度建設　　建立企業的倫理哲學；建立企業倫理的管理措施；建立道德審計制度；建立內部揭發機制；中國企業倫理建設介紹。　　企業的食品安全問題、毒膠囊事件探討。\n12　　2022/05/13　　管理者的倫理素養　　管理者的道德困境；管理者的道德類型；建立管理者的倫理意識。　　美國羅賓斯醫療：有問題的避孕器、金融倫理的探討。\n13　　2022/05/20　　員工道德培養　　企業道德的規範；企業道德的來源；建立道德價值觀的人力資源管理。　　人品比人才重要、可口可樂員工盜賣秘方。\n14　　2022/05/27　　員工權益　　員工權益；就業歧視；建置友善安全的就業環境。　　美國辦公室文化：脫褲子原則、療養院損害員工權益的問題。\n15　　2022/06/03（端午節，順延 1 週）　　道德哲學　　目的論：重視行動後果；義務論：基於原因而非結果；\n相對主義者角度。　　豐田的汽車召回事件、東京電力公司核電站事件。\n16　　2022/06/10　　經濟的倫理觀　　經濟理論的爭議與道德觀；企業的倫理成本。　　墨西哥漏油事件。\n17　　2022/06/17　　法律的倫理觀　　倫理道德與法律的關係；法律形成的各個階段。　　江蘇昆山工廠爆炸事件。\n18　　2022/06/24　　學生期末報告（期末考週）",
    "scorePolicy": "一、平時成績：以出席率及參與率為評分標準，佔 20%。\n二、期中成績：以分組報告為標準，佔 40%。\n三、期末成績：以分組報告為標準，佔 40%。",
    "materials": "余坤東，2008，企業倫理，台北：前程出版社。\n吳成豐，2010，企業倫理的實踐，台北：前程出版社。\n孫震，2009，企業倫理與企業社會責任，台北市：天下文化。\n陳勁甫、許金田著，2021，企業倫理：內外部管理觀點與個案，台北市：信義文化基金會。\n黃俊英，1979，企業與社會，台北市：中華民國管理科學學會。\n楊政學譯，2016，企業倫理：倫理決策訂定與案例，台北市：華泰文化（指定教科書之二的中文版本，可選購）。\n廖勇凱，2016，企業倫理學：全球化與本土化，台北市：智勝文化（指定教科書之一，請儘可能購買）。\n蕭新煌等策劃，1990，企業倫理的重建，台北市：中華民國管理科學學會。\nFraedrich J., Ferrell, O.C., and Ferrell L., 2019, Ethics: Ethical Decision Making For Business (12th Edition). SOUTH-WESTERN, Cengage Learning. （指定教科書之二，請自由購買）",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 教學方式\n一、教師講授：講授企業倫理之理論內涵。\n二、個案討論：課堂除搭配實例講授外，尚鼓勵同學踴躍提出意見，藉以引導並培養學生的反思能力。\n三、分組討論：由學生分組口頭報告。\n\n＊因應疫情變化，必要時將改採遠距教學，網址為：https://meet.google.com/qvn-tfit-mcy，亦實施課堂點名。\n＊學生加退選簽核及諮詢課程問題管道：\nLINE ID: 0911261211</div></b></b>"
  }
]
