[
  {
    "name": "李來春",
    "email": "f10666@ntut.edu.tw",
    "latestUpdate": "2022-01-06 12:18:00",
    "objective": "本課程之目標在於介紹使用者經驗設計之理論與應用。藉由本課程的學習，學生能習得互動設計過程中所需要之關鍵概念 - 以使用者經驗為中心之設計。課程以人 - 機 - 境之架構為基礎進行相關知識之講授，並透過案例之研討、方法之操作以及設計實務之進行了解其應用。課程內容包含人物誌、使用者經驗與需求、互動環境、使用者研究以及認知心理基礎等。教學將以課堂講授、個案研討以及方法操作以及設計執行等方式進行，並以作業繳交以及分組討論與發表為評量方式。\nThis course is focused on introducing the theories and application of User Experience Design (UXD). In this course, students can understand the key element, UX, of interactive design. This course is set up under the structure of Human-Machine-Scenario theory, and executed through case studies, method simulation and design practice. The contents include personas, user experience and requirements, interactive scenario, user research and cognitive psychology. The course is preceded by means of lecturing, case studies, and design practice. Students are evaluated by design work, group discussion and presentation.",
    "schedule": "W1 What are UX and UX design\nW2 The Wheel: UX Processes, Lifecycles, Methods, and Techniques\nW3 Usage research data elicitation and analysis, National Palace Museum visit\nW4 UX design requirements: User stories and requirements  \nW5 The nature of UX design, Taipei Main Station observation and record\nW6 Generative design: Ideation, sketching, and critiquing\nW7 Holiday \nW8 Prototyping, National Taiwan Museum visit \nW9 Mid-term report: User experience design project1\nW10  UX evaluation methods and techniques\nW11  Visiting Longtan Branch Taoyuan Public Library Teng Yu-hsien Music Memorial Hall (Scheduled on Saturday)\nW12  Empirical UX evaluation: UX goals, metrics, and targets\nW13  Empirical UX evaluation: Preparation, data collection methods and techniques, Discovery center of Taipei visit \nW14  Connecting agile UX with Agile software development\nW15  Affordances in UX design, YODEX 2022 visit\nW16  The interaction cycle\nW17  UX design guidelines\nW18  Final term-group report: User experience design project2",
    "scorePolicy": "Attendance 20%\n Mid-term report 35%\nFinal term-group report 45%",
    "materials": "The UX Book: Agile UX Design for a Quality User Experience\nRex Hartson and Pardha S. Pyla  | 14 December 2018",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Nil</div></b></b>"
  }
]
