[
  {
    "name": "吳欣怡",
    "email": "cinewu@mail.ntut.edu.tw",
    "latestUpdate": "2022-01-23 22:34:45",
    "objective": "本課程是動態影像的進階課程，不以歷史性發展為課程目的，旨在探究各類影像涉及的感官經驗以及所屬的文化意義，包含藝術電影、紀錄片、實驗電影與數位影像等，進而說明以動態經驗為基礎的混合現象，其涉及的美學、文化、技術與當代性。閱讀文本涵蓋電影、媒體與視覺文化評論。\nThis advanced moving images course aims to exam sensory experiences and cultural significances of various cinematic forms from art cinema, documentaries, and experimental images to the digital turn of VR films and beyond. However, the goal of the course is not to be a historical survey but instead an investigation of this hybrid moment and its relationship to aesthetics, culture, technology, and modernity. Readings cover topics in film theory, media theory, and visual cultural critical theory.",
    "schedule": "主題一：影像上的物質性 Materiality on Screen \n第 01 週：課程介紹\n第 02 週\n（閱讀）：Sobchack, Vivian. 2004. ‘The Expanded Gaze in Contracted Space: Happenstance, Hazard, and the Fleshes of the World,” Carnal Thoughts: Embodiment and Moving Image Culture. CA: University of California Press. pp. 85-108.\n（影片）：Krzystof Kieslowki, Dekalog I (1988)\n第 03 週\n（閱讀）：Morgan, David. 2012. ‘Vision and Embodiment,” The Embodied Eye: Religious Visual Culture and the Social Life of Feeling. CA: University of California Press. pp. 3-28.\n（閱讀）：Morgan, David. 2005. ‘The Violence of Seeing: Idolatry and Iconoclasm,” The Sacred Gaze: Religious Visual Culture in Theory and Practice. CA: University of California Press. pp. 3-28.\n（閱讀）：胡台麗. 1991. “民族誌電影之投影：兼述台灣人類學影像實驗，” 《中央研究院民族學研究所集刊》台北：中央研究院。（71）頁 183-208。\n（影片）：胡台麗，排灣族五年祭神祖靈之歸來（1984）\n第 04 週\n（閱讀）：Sheibani, Khatereh. 2006. “Kiarostami and the Aesthetics of Modern Persian Poetry,” Iranian Studies. Vol. 39, No. 4, pp. 509-537.\n（閱讀）：Meyer, Brigit. 2015. “Media and the Senses in the Making of Religious Experience: an Introduction,” Material Religion: The Journal of Objects, Art and Belief. 2008. Vol. 4 (2) pp.124-134.\n（影片）：Abbas Kiarostami，Where Is the Friend’s Home?（1987）\n第 05 週\n（閱讀）：劉苑如。2019。＜孤獨的必要：《刺客聶隱娘》中的色彩語言與宗教意識＞，《媒介宗教：音樂、影像、物與新媒體》。台北：臺大出版中心，頁 111-150。\n（閱讀）：Brown, Nick。2000。＜《戲夢人生》：侯孝賢的景色詩學＞，唐維敏譯。《戲戀人生：侯孝賢電影研究》，林文琪、沈曉茵、李振亞編。台北：麥田，頁 216-218。\n（影片）：侯孝賢，刺客聶隱娘（2015）\n\n主題二：影像上的感官與具身化經驗 Sensorium on Screen and Embodiment\n第 06 週\n（閱讀）：A. Jones, Caroline. 2006. ‘The Mediated Sensorium,” Sensorium: Embodied Experience, Technology, and Contemporary Art . Edited by Caroline A. Jones. MA: MIT Press. pp. 3-28. \n第 07 週\n（閱讀）：Sobchack, Vivian. 2004. ‘The Passion of the Material: Toward a Phenomenology of Interobjectivity,” Carnal Thoughts: Embodiment and Moving Image Culture. CA: University of California Press. pp. 286-318.\n（閱讀）：Shaviro, Steven. 1993. ‘A Note on Bresson,” The Cinematic Body”. MN: The University of Minnesota Press. pp. 241-254. \n（影片）：Robert Bresson，Diary of a Country Priest（1951）\n第 08 週\n（閱讀）：沈曉茵。2020。＜果肉的美好：東西電影中的飲食呈現＞，《光影羅曼史：台港電影的藝術與歷史》。桃園：中央大學出版中心，頁 253-264。\n（影片）：李安，飲食男女（1994）；王家衛，花樣年華（2000）\n第 09 週：期中報告\n\n主題三：數位轉向與電影的「結束」？The Digital Turn and the ‘End’ of Cinema?\n第 10 週：\n（閱讀）：Manovich, Lev. 2001. “Digital Cinema and the History of the Moving Image,” The Language of New Media. MA: MIT Press. pp.293-308.\n（影片）：Martin Scorsese，Hugo（2011）\n第 11 週：\n（閱讀）：Friedberg, 2010. “The End of Cinema: Multimedia and Technological Change” \n第 12 週：\n（閱讀）：Belton. 2002. “Digital Cinema: A False Revolution”\n（影片）：Selected VR films\n\n主題四：全景影像實踐\n第 13 週：全景相機使用與說明\n第 14 週：VR 設備使用與說明\n第 15 週：指導討論\n第 16 週：指導討論\n第 17 週：期末創作與評圖、期末個人小論文繳交\n\n第 18 週：回饋",
    "scorePolicy": "・　　出席、課程參與（10%）\n・　　個人報告（20%）\n・　　期中報告（20%）：字數 1000 字。\n・　　期末創作（20%）。\n・　　期末小論（30%）：字數 1000 字。",
    "materials": "教師自編講義",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，依照學校網頁所公布之訊息為準：\n(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)\n※「一級」警戒：實體授課。\n※「三級」(含) 以上警戒：課程全採遠距授課。\n※「二級」警戒授課方式：以實體授課為優先，若有異動將於 Zuvio 公告，本課程於 Zuvio 的課程代號：83086925</div></b></b>"
  }
]
