[
  {
    "name": "余盛延",
    "email": "syyu@ntut.edu.tw",
    "latestUpdate": "2022-02-18 03:54:07",
    "objective": "為什麼要閱讀或研究莎士比亞？Catherine Belsey 回答道：是為了莎翁的獨特性。如她所言：「莎士比亞不僅是英語世界上流社會文化的精華，亦為其整體文化的精髓。」因為莎劇的辭彙，迄今仍通用於英語世界，並已融入日常生活之結構中。這現象不僅發生在現在的英國，自莎翁的時代開始，莎翁的語彙在全世界就從未停止流通過。何況，莎翁震撼人心的詩歌和劇場藝術，無人出其右的人性掌握，以及非凡的人生哲學思維與洞見，向來受到世人的珍愛。如世人常謂：莎士比亞的語言可觸發我們的想像力，為我們在人生的各個層面 (包括職業層面) 提升溝通效率。為了這些重要的理由，本課程將引導學生欣賞莎士比亞的若干劇作。\nWhy Shakespeare? Catherine Belsey answers that it is because of his singularity. As she observes, \"Shakespeare is part and parcel of English-speaking culture, and not only high culture.\" For \"phrases from the plays are still current, woven into the fabric of everyday life\" in Britain now and have, in fact, been circulated in the world since the early modern era. Besides, Shakespeare has been cherished for his powerful poetry and stagecraft, his nonpareil grasp of human nature, and his remarkable philosophical insights into life. As people often observe, Shakespeare may trigger our imagination with his language and promote effective communication in every aspect of our life, including that of our careers. For these important reasons, this course aims to guide students to appreciate Shakespeare by focusing on a number of his plays.",
    "schedule": "02/21-22  General Introduction \n\n02/28-03/01  The Winter’s Tale \n\n03/07-08  The Winter’s Tale\n\n03/14-15  The Winter’s Tale\n\n03/21-22  The Winter’s Tale\n\n03/28-29  The Winter’s Tale\n\n04/04-05  Holidays\n\n04/11-12  Hamlet\n\n04/18-19  Hamlet\n\n04/25-26  Hamlet\n\n05/02-03  Hamlet\n\n05/09-10  Hamlet\n\n05/16-17  Hamlet\n\n05/23-24  All’s Well That Ends Well\n\n05/30-31  All’s Well That Ends Well\n\n06/06-07  All’s Well That Ends Well\n\n06/13-14  All’s Well That Ends Well\n\n06/20-21  Review",
    "scorePolicy": "Attendance and Quizzes: 20%; oral presentation: 30%; position paper: 50%",
    "materials": "The Winter’s Tale. 3rd Series. Ed. John Pitcher. London: Arden, 2010.\nHamlet. 2nd Series. Ed. Harold Jenkins. London and New York: Methuen, 1982.\nAll’s Well That Ends Well. Ed. Russell Fraser. Cambridge: Cambridge UP, 1985. Rpt. 1989, 1996, 1998.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. 若學校因應疫情規定遠距教學，則使用下面平台上課: https://meet.google.com/fkt-jfam-ppi\n\n2. 我的聯絡方式（E-mail）：syyu@ntut.edu.tw</div></b></b>"
  }
]
