[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2022-02-19 11:25:19",
    "objective": "This course will teach the use of English in the field of mechanical and electrical engineering through the reading of relevant literature. All areas of English proficiency (listening, speaking, writing, reading) will be considered.",
    "schedule": "Week　　Content\n1　　Introduction\n2　　Holiday (no class)\n3　　Class\n4　　Class\n5　　Class\n6　　Class\n7　　Holiday (no class)\n8　　Class\n9　　Mid-term week (consultation session)\n10　　Class\n11　　Class\n12　　Class\n13　　Class\n14　　Class\n15　　Class\n16　　Exam\n17　　Class\n18　　Consultation session",
    "scorePolicy": "Speaking　　                                        20%\nSchool Mid-term　　　　　　　　20%\nWriting assignment*　　　　　　　　10%　　　　\nExam**                                       40%\nAttendance and participation　　　　10%\n\n* Late submission of writing assignment(s) will only be accepted upon presentation of approval for leave for the due date of such assignment(s) from the university system.\n**At the lecturer’s sole discretion, a make-up exam may be granted upon presentation of approval for leave from the university system no later than 5 days after the date of exam. The format of the make-up exam will be determined by the lecturer.\n\nYou will automatically fail the course with 8 or more unexcused absences. You may get an excused absence only upon presentation of an approval for leave from the university system.",
    "materials": "Mechanical Engineering (Career Paths), Express Publishing, Tung Hua Book Co. Ltd.\nElectrical Engineering (Career Paths), Express Publishing, Tung Hua Book Co. Ltd",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">If the classes are conducted online, please use the following link to access the virtual classroom: https://meet.google.com/okv-wpxs-iiu.</div></b></b>"
  }
]
