[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2022-01-06 23:25:25",
    "objective": "本課程旨在提升學生學術英文能力，課堂將引導學生透過不同的學術聽力訓練、閱讀學術文章、學術寫作練習、與學術口語訓練等，來增進學生於大學英語授課課堂中的課堂參與，以及整體學術能力的展現，並為未來專業職場上語言能力奠定良好基底。\nThis course is designed for undergraduate students to develop their academic English language skills for success in English-medium university coursework. This course will engage students with active participation in a variety of academic listening, reading, writing, and speaking activities that they would encounter in real-life academic university lectures and professional workplace environments.",
    "schedule": "Note: The weekly schedule is occasionally subject to change due to time constraints, unexpected disruptions, or needs of the class.  Readings and online conferences should be done before that week’s class.\n\nA detailed syllabus will be distributed on the first day of class.\nWeek 1. Course overview \nWeek 2. Academic listening \nWeek 3. Note taking &amp; listening strategy\nWeek 4. Academic reading\nWeek 5. Reading annotation &amp; reading strategy\nWeek 6. Academic vocabulary\nWeek 7. Holiday\nWeek 8. Academic writing\nWeek 9. Mid-term\nWeek 10. Synthesizing, paraphrasing, and summarizing  \nWeek 11. Writing a report\nWeek 12. Academic speaking\nWeek 13. Participation in lectures\nWeek 14. Group discussion \nWeek 15. Academic presentation\nWeek 16. Handling the question and answer session\nWeek 17. Final presentations  \nWeek 18. Final presentations",
    "scorePolicy": "Attendance &amp; Presentation 20%\nOral &amp; written assignments 60%\nFinal presentation 20%\n\nNote:\nAttendance is mandatory for all sessions. The course is a workshop class that includes in-class and out-of-class writing/discussion and peer group work. Therefore, students should not be late and should not miss classes. \n\nAny class work missed as a result of tardiness or absence is the student’s responsibility to make up. Each absence above the allowed number (two) will result in a 3-point deduction from a student’s final grade if that student remains in the course. If you have a legitimate conflict or an extreme emergency, discuss it with your instructor.\n\nStudents are expected to complete all of the assigned readings and homework assignments prior to class and fully participate in class discussions and activities. Equally important, they need to actively interact with their peers and proactively offer feedback on their peers’ presentations and performance in simulated business events to help one another identify and in turn address the areas for further improvement. \n\nRequirements for Writing Assignments\n\n•　　Late work will not be accepted without penalty unless students make arrangements for an extension before the due date. Assignments are due at the beginning of the class period when it’s due. Late work will lose 3 points for each calendar day it is late. \n•　　Please turn in all assignments, even if you believe they are poorly done. You will gain no points if no assignment has been submitted.  \n•　　Plagiarism is not allowed in this course. Students who plagiarize will receive a zero for the course.",
    "materials": "Supplementary materials will be provided.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"></div></b></b>"
  }
]
