[
  {
    "name": "黃光廷",
    "email": "alexkthuang@gmail.com",
    "latestUpdate": "2022-02-10 15:56:04",
    "objective": "This course aims to introduce students to key theoretical and methodological approaches in urban design. The main content will be delivered through a series of case study discussion and project-based research practice. In specific, the case study is to review and identify key factors shaping the physical environment of cities; while through independent research projects, students are expected to engage in a step-by-step process of on-site observation and computational analysis, examining how the factors are interacting with each other.\n\nNote: Competency in the basic use of computer is required. In class, the instructor will provide tutorials about how to use the computational analysis tool (Space Syntax).\n\nOffice Hour: Tuesday 16:00-17:00",
    "schedule": "1. Defining the City\n2. Evolving Urban Form\n3. Alternative Visions of Good City\n4. Transformative Practice of Urban Design\n5. Methods of Spatial Analysis I\n6. Methods of Spatial Analysis II \n7. Case Study Seminar I\n8. Case Study Seminar II\n9. Mid-term Presentation\n10. Methods of Computational Analysis I\n11. Methods of Computational Analysis II\n12. City in the Age of Globalization\n13. Limits and Biases of Contemporary Urban Design\n14. Sustainable City\n15. Pin-up Critique I\n16. Pin-up Critique II\n17. Final Presentation I\n18. Final Presentation II",
    "scorePolicy": "10% Attendance\n20% Participation\n30% In-class Presentation\n40% Research Project (Presentation/Report)",
    "materials": "Rybczynski, Witold. (2010). Makeshift Metropolis: Ideas about Cities. New York: Scribner.\nKaijima, M., Kuroda J. and Tsukamoto Y. (2001). Made in Tokyo. Tokyo: Kajima Institute Publishing Co.\nAl-Sayed, K. (2014). Space Syntax Methodology. London: Bartlett School of Architecture, UCL.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">If being influenced by covid-19  pandemic, the class will be held virtually via Google Meet with the link provided later here. Any inquiry can be sent directly to the instructor through kthuang@ntut.edu.tw</div></b></b>"
  }
]
