[
  {
    "name": "曾華鈺",
    "email": "say0916760232@yahoo.com.tw",
    "latestUpdate": "2022-02-15 11:05:17",
    "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "第一週一 、課程介紹\n第二週一、低手傳球準備動作介紹二、對空低手傳手練習\n第三週一、低手傳接球練習 二發球動作介紹與練習\n第四週一、高手對空傳球介紹二、高手對空傳球練習三、高低手傳球結合練習\n第五週一、高低手傳球結合練習二、發球動作練習\n第六週一、發球練習二、發球、接發球練習三、攻擊步伐練習\n第七週一、攻擊步伐練習二、攻擊動作練習\n第八週 期中考測驗 \n第九週一、肩上發球練習二、攻擊動作練習\n第十週一、肩上發球練習二、攻擊動作練習\n第十一週一、肩上發球練習二、攻擊動作練習\n第十二週一、攔網與防守訓練\n第十三週一、攔網與防守訓練\n第十四週一、第一第二時間搭配攻擊二、肩上發球練習\n第十五週 分組比賽訓練\n第十六週 分組比賽訓練\n第十七週 期末考測驗\n第十八週 補考",
    "scorePolicy": "一、出勤成績 60%\n二、術科成績 40%\n (一) 期中測驗 15%、(二) 期末測驗 25%",
    "materials": "一、排球教學指引 林竹茂 尤東柏 黃德壽 健行文化出版事業股限公司\n二、排球運動學研究 林竹茂 編著\n三、排球規則 2016~2021 中華民國排球協會印製",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1、曾華鈺老師 e-mail 同學如有加退選簽核或課程問題請 email::say0916760232@hotmail.com\n2、建立 Line 群組:://line.me/ti/g/zNe0qnabOA （完成選課後，請同學先加入 LINE 上課群組）</div></b></b>"
  }
]
