[
  {
    "name": "徐志翔",
    "email": "Jerrycarry.tw@gmail.com",
    "latestUpdate": "2022-02-14 19:22:15",
    "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。\n一、講授健康管理與終身運動觀念，讓學生從中學習參與，學習更多元化。\n二、為提升健康體適能之實務課程，以自身的參與體驗來達到健康促進與疾病預防，了解健康適能觀念及方法。\n三、透過體適能以及健康與運動相關之影片欣賞，讓學生瞭解運動對生理 (身體) 的影響，養成喜好運動的習慣。\n四、利用體適能教室之器材操作，增進心肺與肌肉適能，並期能正確設計適合自己的心肺、肌力與體能計畫。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "週次               課程內容                              \n第  一  週    課程導論與介紹               \n第  二  週    健身運動基礎概念     \n第  三  週    阻力訓練概念            \n第  四  週    阻力訓練體驗         \n第  五  週    阻力訓練評估      \n第  六  週    阻力訓練計畫            \n第  七  週    有氧訓練概念           \n第  八  週    有氧訓練強度         \n第  九  週    期中考週                   \n第  十  週     有氧訓練評估          \n第十一週     有氧訓練計畫      \n第十二週     間歇訓練                      \n第十三週     循環訓練     \n第十四週     Cross Fit                 \n第十五週     端午節\n第十六週     期末考 - 有氧運動                 \n第十七週     期末考 - 阻力訓練     \n第十八週     補考週",
    "scorePolicy": "一、出勤成績：40%（包含遠距教學出席點名）\n** 曠課第一次扣 2 分、第 2 次扣 4 分、第 3 次扣 8 分…，以此類推。\n   請假扣分為曠課的 1/2，公、喪請附證明不扣分。\n   遲到、早退及服裝不整次數列入請假扣分之計算。\n   請假請依照學校手續至系統請假，以系統上紀錄為準。\n\n二、課堂參與及課程活動 30%（包含遠距教學的活動內容）\n** 課程學習單：依據學習單完成度計算。\n** 課程活動：未依課程活動進行課程以及非必要性使用手機依情節扣分。\n\n三、期末術科測驗：30% （遠距教學時改以其他方式進行）\n** 最大肌力測驗\n** 有氧運動強度測驗",
    "materials": "1. 卓俊辰 校閱（2012）。運動處方。臺北市：華格納企業有限公司。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 教師聯繫方式 (來訊時請說明修課時間)：\n    1.Teams 訊息\n    2.FB 粉絲專頁：翔哥的體育課（https://reurl.cc/l5V9WQ）\n\n課程補充資料將透過 Teams 與 FB 粉專公佈，請同學確認 Teams 課程。\n\n若因學校公佈無法進行實體課程時，將改以 Teams 進行遠距教學，詳細方式另行公佈。</div></b></b>"
  }
]
