[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-01-24 14:24:03",
    "objective": "統計數據分析是一種利用數據對遇到問題進行適當推測的藝術 (有時是最好)，本課程是一門以微積分為基礎的統計學分析的入門課程，旨在幫助學生學習描述性和推論性的統計程序，以及在不同領域中使用有用的數據分析。在回顧描述性統計和一些必要的概率分佈後，我們將討論區間估計、點估計、假說檢定方差分析、線性回歸分析、因子設計、聚類分析的基本概念、分類和支持向量機，並伴隨著實踐和理論練習。因此這些技能將為學生提供一個基礎，培養學生獨自進行分析和有效評估他人統計分析結果的能力。\n‘Statistical data analytics’ is the art of using data to make appropriate (sometimes, best!) conjectures about problems encountered. This course is a calculus-based introduction to statistics and data analytics, and so designed to help students learn the introductory descriptive and inferential statistical procedures, and useful data analytics that are used in diverse areas. After a review of descriptive statistics and some necessary probability distributions, we will discuss interval and point estimation, hypothesis tests, ANOVA, linear regression analysis, factorial designs, and basic concept of classification and cluster analysis accompanying practical and theoretical exercises. Consequently, these skills will provide the student with a basis to conduct their own such analyzes and to evaluate critically others’ uses of statistical analysis results.",
    "schedule": "Week 1 Introduction to probability distribution, sampling distribution, and estimation\nWeek 2 Introduction to R, visualization (graphics) using R, and statistical inferences and simple linear regression analysis using R \nWeek 3 Decision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\nWeek 4 Decision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\nWeek 5 Decision making for two samples – Inference on the means of two populations, paired t-test\nWeek 6 Decision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\nWeek 7 Simple linear regression – Part I\nWeek 8 Simple linear regression – Part II\nWeek 9 Midterm exam (Take-home or in-class, 1 Cheat Sheet, Calculator)\nWeek 10 Multiple linear regression – Part I\nWeek 11 Multiple linear regression – Part II\nWeek 12 Other aspects of multiple linear regression analysis\nWeek 13 Linear regression analysis using R\nWeek 14 Time series analysis\nWeek 15 Classification analysis\nWeek 16 Clustering analysis\nWeek 17 Time series, classification, and clustering analysis using R\nWeek 18 Final exam (Take-home or in-class, 1 Cheat sheet, Calculator)",
    "scorePolicy": "1. Midterm Exam: 30% \n2. Final Exam: 30% \n3. Assignments: 35%\n4. Attendance: 5%\n5. Team project: Extra 20%",
    "materials": "(1) Using R for Introductory Statistics (1st Ed., Chapman &amp; Hall/CRC Press) by John Verzani (ISBN: 0-203-49989-1)\n(2) Introductory Statistics with R (2nd Ed., Springer) by Peter Dalgaard (ISBN: 978-0-387-79053-4)\n(3) Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. The online course platform is MS teams.\n2. The announcement will be informed via email.\n3. The way to reach the instructor is email.</div></b></b>"
  }
]
