[
  {
    "name": "邱垂昱",
    "email": "cychiu@ntut.edu.tw",
    "latestUpdate": "2022-02-18 17:58:16",
    "objective": "Artificial intelligence (AI) is a research field that studies how to realize the intelligent human behaviors on a computer. The ultimate goal of AI is to make a computer that can learn, plan, and solve problems autonomously. \nThe main purpose of this course is to allow students understanding what the AI is, current theories and applications of AI.\nThe main topics of this course include: \nUninformed and informed Search Methods\nLocal Search Methods\nGame Playing\nNeural Networks\nReasoning under Uncertainty\nArtificial Intelligence applications in Engineering.\nArtificial Intelligence applications in Management.",
    "schedule": "##Week 1-3\nIntroduction to Artificial Intelligence\n\nUninformed Search Methods – searching a state space graph, problem representation in terms of states, goal test, operators, state-space graph search formulation, expanding a node, frontier list, partial solution path, solution path, search tree, breadth-first search, depth-first search, chronological backtracking, uniform-cost search, iterative-deepening search, bidirectional search, completeness, optimality, admissibility, time and space complexity, detecting repeated states, explored list. \n\nInformed Search Methods – Understand heuristic functions, evaluation functions, best-first search, greedy best-first search, beam search, algorithm A, algorithm A*, admissible heuristic. \n(paper discussion and representation of Artificial Intelligence applications in engineering and management)\n\n\n##Week 4-7\nLocal Search Methods – Local search problem formulation, operators, neighborhood, move set, hill-climbing algorithm, local optima problem, hill-climbing with random restarts, stochastic hill-climbing (simulated annealing) algorithm, escaping local optima, Boltzman’s equation, cooling schedule, genetic algorithms, particle swarm optimization. \n\nGame Playing –game playing as search, search tree, branching factor, minimax algorithm, alpha-beta pruning algorithm, best case and worst case of alpha-beta vs. minimax, iterative-deepening with alpha-beta. \n(paper discussion and representation of Artificial Intelligence applications in engineering and management)\n\n\n##Week 8-9\nMid-term report &amp; presentation\n\n\n##Week 10-12\nNeural Networks –input units, output units, weight space, multi-layer feed-forward networks, hidden units, sigmoid function, back-propagation algorithm, deep learning. \n(paper discussion and representation of Artificial Intelligence applications in engineering and management)\n\n\n##Week 13-15\nReasoning under Uncertainty – Random variable, conditional probability, posterior probability, product rule, chain rule, Bayes’s rule, conditionalized version of Bayes’s rule, naïve Bayes classifier, Bayesian networks.\nFuzzy set theory, Fuzzy operations, Fuzzy control\n(paper discussion and representation of Artificial Intelligence applications in engineering and management)\n\n\n##Week 16-18\nFinal project workshop and presentation",
    "scorePolicy": "• Homeworks, paper study and discussion, class participation: 40%\n• Midterm report &amp; presentation: 30%\n• Final project: 30%",
    "materials": "Reference textbook: \nArtificial Intelligence: A Modern Approach, Russell, Stuart J.; Norvig, Peter\nArtificial Intelligence: A Guide to Intelligent Systems, 3/e, Michael Negnevitsky\nOpen access journal papers",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">In case of distance learning, please find the information at https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\nCourse information will be released on the NTUT i-school plus platform.</div></b></b>"
  }
]
