[
  {
    "name": "許益瑞",
    "email": "ijuihsu@ntut.edu.tw",
    "latestUpdate": "2022-02-17 21:29:04",
    "objective": "X 光已經成為材料結構鑑定上一項很有用的技術。這門課將介紹如何應用 X 光粉末繞射與吸收光譜於材料結構鑑定，以及數據分析。本課程將以 Matlab 與 GSASII 軟體教導學生進行數據分析。\nX-ray has become a powerful technique on the characterization of material structures. The course will teach how to apply the x-ray diffraction and absorption on structural characterization and even analysis. In the x-ray diffraction part, we will teach the fundamental scattering theory, space group, and basic crystallography. For polycrystalline materials, the Rietveld refinement will be used for powder x-ray diffraction data analysis. For soft mater like polymers, the XRD in combination with molecular modeling will be used to analysis the experimental XRD pattern. In the x-ray absorption part, the EXAFS data analysis method will be used to understand the local environment and bond length between absorbing metal and coordinated ligands.  Matlab and GSASII will be used for data analysis.",
    "schedule": "week 1   Introduction to basic scattering theory(I) \nweek 2   Introduction to basic scattering theory(II)\nweek 3   Solid State (I) : crystallography\nweek 4   Solid State (II) : symmetry\nweek 5   Solid State (III) : x-ray diffraction theory(I)\nweek 6   Solid State (IV) : x-ray diffraction theory(II)\nweek 7   Powder X-ray data analysis (I)\nweek 8   Powder X-ray data analysis (II)\nweek 9   Structure Visualization and Molecular Building\nweek 10  Molecular Modeling and XRD analysis on polymer\nweek 11  Small angle x-ray scattering\nweek 12  X-ray absorption Spectroscopy (I) : XANES\nweek 13  X-ray absorption Spectroscopy (II) : EXAFS\nweek 14  EXAFS data analysis \nweek 15  Practical (I)\nweek 16  Practical (II)\nweek 17  Practical (III)\nweek 18  Practical (IV)",
    "scorePolicy": "Miterm  30%\nFinal  70%",
    "materials": "1. C. Giacovazzo, H. L. Monaco, D. Viterbo, F. Scordari, G. Gilli, G. Zanotti, M. Catti, Fundamentals of Crystallography, IUCr, Oxford Science Publications, 1992. \n2. Leonid V. Azaroff, Elements of X-ray Crystallography\n3. Anthony R. West, Basic Solid State Chemistry, John Willey &amp; Sons, Singapore, 1991. \n4. M. F. C. Ladd and R. A. Palmer, Structure Determination by X-ray Crystallography, 2nd ed., 1985. \n5. Jan Drenth, Principle of Protein X-ray Crystallography, Springer, 1994.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">n case the pendemic of COVID-19, the lecture will be changed to online Google meet. The link address is as following, X 光材料分析\n2 月 22 日 (星期二)・16:10-18:00 and 18:30-19:20\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/diz-futp-kno</div></b></b>"
  }
]
