[
  {
    "name": "楊麗祝",
    "email": "yanglichu@gmail.com",
    "latestUpdate": "2022-01-29 20:46:10",
    "objective": "古蹟是人類歷史發展過程中所留下來的具體構造物，它是歷史的見證，也是文化的軌跡。在台灣發展史上從早期的原住民社會到漢人移民大量進入台灣，及十七世紀後歷經不同政權的統治，每個時期均留下不少的古蹟，這些古蹟是文化發展的具體證據，是了解台灣歷史與文化的最佳途徑，而透過古蹟的探索可進一步增進傳統的建築、藝術、民俗、文物等各方面的知識，使學生從中體會先民來台的艱辛與其生活的智慧，培育其珍視先民文物史蹟的情懷。\nHistorical sites are the concrete structures, left behind by the historical development of human beings. They are genuine witnesses of history and the cultural tracks as well. In the history of Taiwan, quite a few historical sites built in different phases remain existent: from the early aboriginal society via the big migration of the Hans to the various periods of sovereignty since 17th century. The sites turn out to be important evidence of cultural growth, the easiest access to the understanding of Taiwanese history and culture. A thorough explore into the historical sites helps a lot to broaden our knowledge in the conventional architectures, arts, folklore and cultural objects. This course also helps us to realize the hardships of life our forefathers encounter and the wisdom they acquire, in the hope to grow a better sense to treasure the past culture and the objects available to them.",
    "schedule": "第一講   序論  古蹟、文化遺址與歷史\n第二講   從考古遺址看台灣的史前時代\n第三講   大航海時代的史事與史蹟\n         荷蘭人在台灣留下什麼？\n         海上孤軍／明鄭時代的史事與史蹟\n第四講   漢人移民與移墾社會  清代篇\n         寺廟與民間信仰\n         城與砲台／清廷對台政策的變革\n第五講   太陽旗下的台灣\n　　     從官署建築看殖民統治\n             百年交通演進史與交通史蹟\n第六講   人權遺址面面觀  從日治到戰後\n              校外參訪  台灣新文化運動紀念館\n              黑暗遺址與文化觀光\n第七講   走讀歷史  古蹟保存的意義與困境\n         他山之石  全球文化遺產的保存與推廣",
    "scorePolicy": "平時 40% 期中成績 30% 期末成績 30%\n評量方式：\n依疫情隨時調整，目前計劃期中考暨期末考採實體紙筆測驗；平時成績採書面報告與口頭報告并行。",
    "materials": "周婉窕：台灣歷史圖說／少年台灣史（聯經 / 玉山社，1997/2019）\n李乾朗：古蹟入門（增訂版）（遠流，2018）\n鄭麗玲，楊麗祝：百年風華北科校史（台北科技大學，2011）\n李乾朗：台灣古建築圖解事典（遠流，2003）\n夏鑄九等：文化資產、古蹟保存與社區參與論文集（文建會，1996）\n林重耀：林安泰古厝拆遷計劃（台北，詹氏，1991）\n漢寶德：物象與心境：中國的園林（台北，幼獅，1990）\n葉乃齊：古蹟保存論述的形成－光復後台灣的古蹟保存運動（1989）\n林會承：台灣傳統建築手冊（台北，藝術家，1987）\n洪文雄：古蹟保存序說（台北，明文，1987）\n漢寶德：古蹟的維護（台北，文建會，1984）\n李乾朗：台灣近代建築（台北，雄獅，1980）\n莊芳榮：古蹟的管理與維謢（台北，學生，1983）",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">※「二級」警戒授課方式說明如下：\n1. 同學如有加退選簽核或課程問題請 email: lcyang@ntut.edu.tw\n2. 課程資料公布於北科 i 學園／Teams。\n3. 因應疫情可能會調整授課內容、授課方式、評分項目與配分。如果無法實體上課，預定使用 Teams 於原定上課時間遠距上課，細節再另行公布。</div></b></b>"
  }
]
