[
  {
    "name": "郭若妤",
    "email": "jyk@ntut.edu.tw",
    "latestUpdate": "2022-02-16 21:09:52",
    "objective": "Data is everywhere. As the physical and digital worlds have become intertwined, more and more design decisions are expected to be supported by data analytics. Hence, this course aims to build your data literacy skills as a designer. The course will begin by introducing the need for personalized products and services to create a better user experience. This concerns not only the cognitive but also affective aspects. The insights obtained from the data can then be translated to determine product/service/system requirements. Students will spend the majority of the class time on research-oriented projects.\nUpon completing this course, you will be able to:\n1. Distinguish the difference between mass production and personalization \n2. Gain a better understanding of how data science can be incorporated into the design process \n3. Describe the characteristics and forms of data generated by different sources such as humans, machines, or environments \n4. Apply suitable tools/software to interpreT small- or large-scale dataset\n5. Understand the key principles in the ethical use of data in the design process",
    "schedule": "Week　　Topics\n1　　Course objective, structure, syllabus, and grading\n2　　Introduction: Why design with data　　\n3　　The diversity of data for digital and physical products　　\n4　　Individual presentation: Case studies in ambient intelligence　　\n5　　PART I: Getting data (Tools and methods for data collection)　　\n6　　Discussion: The size and quality of a dataset　　\n7　　University holiday \n8　　Interim report submission: Research questions　　\n9　　PART II: Turning data into understanding　　\n10　　Discussion: Analytical tools and statistical methods　　\n11　　Discussion: Eye tracking technique 　　\n12　　Ethical use of data, privacy and security\n13　　Discussion: Emotion detection model\n14　　Discussion: Risk prediction model　　\n15　　YODEX young designers' exhibition\n16　　Discussion: Data visualization insights\n17　　Discussion: Reflecting on the design framework　　\n18　　Final report submission",
    "scorePolicy": "Attitude: Punctuality &amp; Initiative (10%), Independence (10%)\nResearch project capability: Execution &amp; Analysis (15%), Innovation (15%)\nFinal report: 50%",
    "materials": "King, R., Churchill, E. F., &amp; Tan, C. (2017). Designing with data: Improving the user experience with A/B testing. O'Reilly Media, Inc.\nSauro, J., &amp; Lewis, J. R. (2016). Quantifying the user experience: Practical statistics for user research. Morgan Kaufmann.\nHolmqvist, K., Nyström, M., Andersson, R., Dewhurst, R., Jarodzka, H., &amp; Van de Weijer, J. (2011). Eye tracking: A comprehensive guide to methods and measures. OUP Oxford.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Note: Remote learning through Microsoft Teams may be implemented in response to the uncertain situation of the COVID-19 pandemic. For all course-related enquiries, please contact jyk@ntut.edu.tw, thank you.</div></b></b>"
  }
]
