[
  {
    "name": "林碧雲",
    "email": "py23373@ntut.edu.tw",
    "latestUpdate": "2022-02-18 21:52:14",
    "objective": "創業者在新創事業時，須考慮消費者對新創事業產品 (新創產品) 之瞭解及接受程度。如果能在創業之初對消費者進行新創產品之消費者行為調查，可使新創事業在成立之初即找出目標顧客群，並分析出目標顧客的消費偏好，例如：對新創產品的品質要求、功能偏好、購買可能金額、消費通路類別等，創業者可依所瞭解目標顧客的消費偏好，規劃適當的行銷方案，而提高創業成功的機會。\nEntrepreneurs should consider consumers’ understanding and acceptance of new products (innovative products) in their new ventures. If a start-up company conducts consumer behavior survey in the beginning, the new business is able to identify the target customer base from the start, and analyze the target consumer preferences, including quality requirements, functional preferences, amount of possible purchase, types of consumer access. By understanding target consumer preferences, entrepreneurs can plan appropriate marketing programs, and improve business opportunities for success.",
    "schedule": "第 1-2 週  課程及參考資料概述\n第 3 週  消費者行為概論\n第 4-5 週  消費行為的經濟學理論\n第 6-7 週  行為經濟學的基本概念\n第 8 週  影響消費者行為的內在因素\n第 9 週  期中考\n第 10-11 週  影響消費者行為的外部因素\n第 12-13 週  消費者的購買決策\n第 14-15 週  消費者創新與網路消費行為\n第 16-17 週  影響消費者行為的行銷策略\n第 18 週  期末考\n＊教師將視同學學習情況調整進度與內容",
    "scorePolicy": "平時成績 (出勤及參與討論)：40% \n期中考：30% \n期末考：30%",
    "materials": "1. Solomon, Michael R., Consumer Behavior：Buying, Having, and Being. Boston: Pearson Education, 2020, 13th edition, global edition.\n2. Mothersbaugh, David L., Hawkins, Del I., Kleiser, Susan Bardi, Consumer Behavior: Building Marketing.  McGraw Hill Education, 2020, 14th edition.\n3. 林建煌著，消費者行為。台北市：華泰文化事業股份有限公司，2022，第 7 版。\n4. 汪志堅編著，消費者行為。新北市：全華圖書股份有限公司，2018，6 版。\n5. Thaler, Richard H., Misbehaving : the making of behavioral economics. New York: W.W. Norton &amp; Company, 2015. 中文譯本，不當行為：行為經濟學之父教你更聰明的思考、理財、看世界，劉怡女譯。台北市：先覺出版股份有限公司，2016。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 若因疫情無法進行實體授課，將改採遠距上課：\n★課程講義及預錄的教學影片皆先置於「北科 i 學園 PLUS」https://istudy.ntut.edu.tw/learn/index.php 「消費者行為」課程內。上課時開啟老師的錄影檔，聽取老師的講授，並於「線上討論室」內同步討論。\n★考試及課程相關資訊將即時公布於上址下之「課程公告」。如有問題請聯繫老師信箱 py23373@mail.ntut.edu.tw</div></b></b>"
  }
]
