[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2012-09-12 11:53:15","objective":"本課程以提升學生英文能力，至全民英檢中級以上的程度為目標。教學內容以加強學生日常生活中，如：購物、旅遊、定餐等用語之溝通、運用、表達及閱讀寫作等能力為主。\n1. 94學年度起之大學部入學新生擬修習「英文實務」課程說明：學生修習「英文實務」課程，必須參加全民英檢中級初試， 其中「聽力 測驗」及「閱讀測驗」兩項成績合計達80分以上，始得修習此課程，修課學生請持「全民英檢中級初試成績單正本及影本至」教務處註冊組登錄。）\n2. 為考量同學因個人生涯規劃，若參加「全民英檢」以外的英語檢定考試，例如適用於全球職場英文能力統一標準之TOEIC測驗及教育部所規定採計之其他英檢考試等。其考試成績如對應符合CEF B1級（全民英檢中級）以上者，免修英文實務。","schedule":"Week 1-2 Orientation / Intro Activity\nWeek 3-5 Unit 1 / GEPT Test Bank \nWeek 6-8 Unit 2 / GEPT Test Bank\nWeek 9 Midterm\nWeek 10-12 Unit 3 / GEPT Test Bank\nWeek 13-15 Unit 4 / GEPT Test Bank\nWeek 16-18 Unit 5 / GEPT Test Bank\nWeek 19 Final Exam\n(Syllabus is subject to necessary modification.)","scorePolicy":"Course Requirements:\n(1)　　Attendance: Students are required to attend the class as scheduled. \ni.　　Each unexcused absence will result in 10% semester grade deduction. \nii.　　At the sole discretion of the instructor, some absence penalties may be waived with valid proof and just cause. No Penalty waiver request will only be accepted in two weeks of the date of absence. Students forfeit the right of contention after that. It is important to know that only ONE- time penalty waiver will be granted to any student.  \niii.　　Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Two times of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.\n(2)　　Notes-taking: Students are required to take class notes, including vocabulary/phrases used in conversations, instructor’s lectures notes and other supplementary materials. Notes will have to be submitted two times, respectively midterm week and the final.\n(3)　　Quizzes and Tests: Unit quizzes/tests will be given in class sessions if found necessary. \nGrading: Semester grades will be determined by a point system (X out of 100 total points). Students will be evaluated by the following components. \n(1)　　Attendance 30%\n(2)　　Class Notes 20%\n(3)　　Quizzes/Activities 10%\n(4)　　Midterm/Final Exam 40% (including two university English proficiency tests)","materials":"GEPT Test Bank","foreignLanguageTextbooks":false}]
