[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2012-09-17 14:22:12","objective":"We will begin our study with an overview of theatre itself.  What is theatre?  What are its origins and functions within Western culture?  We will identify genres within the theatre and study the formal choices characteristic of each genre and within given historical periods.  We will study the fundamental characteristics of dramatic form including plot, character, action, and setting, as well as the conventions of dramatic genres, specifically tragedy, comedy, and tragicomedy.  We will then turn our attention to the basic repertoire of the actor, the combinations of voice, movement, characterization and emotional shading which help enact the playwright’s vision.  As an adjunct to this, we will look at the basics of theatre: blocking, costuming, make-up, set design and tips on memorization and the efficient use of rehearsal time.  Our major undertaking will be the production of one full-length or several shorter plays by a well-respected playwright.  Each student will be responsible for bringing about the enactment of drama chosen by the class under my guidance.  The course may be a bit of a challenge, but it is a great opportunity for you to create living art of masterpiece quality and to discover the difference between writing done purely as a mode of elementary communication, or for mere entertainment, and writing that is open-ended, provocative, dynamic, haunting, and relentless in its dis/solving of the puzzle of the Real.","schedule":"COURSE SCHEDULE\n\nSeptember 18　　INTRODUCTION: Theatrical period, style, genre.  Discussion of possible plays.  View film, pt. I.  HOMEWORK:  Memorize Hamlet’s speech, “Speak the speech I pray thee…”\n\nSeptember 25　　Choose play.  Basics of characterization: voice, movement.  Trying out new ideas.  Begin selecting roles.  View film, pt. 2.  ASSIGNMENT:  Memorize short scene\n\nOctober 2　　Practice short scene.  Provisionally select roles.  View film, pt. 3.  ASSIGNMENT:  Prepare for short performance.\n\nOctober 9　　Performance Revue.  ASSIGNMENT:  Begin memorizing lines, Act One, Scene One (or as appropriate)\n\nOctober 16　　Introduction to blocking; ass’t director makes crew assignments. ASSIGNMENT:  Continue memorizing lines; work on voice3 charcterization.\n\nOctober 23　　Blocking; begin assembling materials for sets, costumes, etc. ASSIGNMENT:  Continue memorizing lines, work on movement characterization.\n\nOctober 30　　Blocking with lines memorized Act One\n\nNovember 6　　Blocking with lines memorized Act Two\n\nNovember 13　　 Blocking with lines memorized Act Three\n\nNovember 16　　Set construction and costuming supervised by ass’t director + individual singers work with musician(s)\n\nNovember 20　　Scene Rehearsal with sets and costumes supervised by ass’t director + individual singers work with musician(s)\n\nNovember 27　　Rehearsal  (Mandatory for all students)\n\nDecember 4　　Rehearsal  (Mandatory of all students)\n\nDecember 11　　Rehearsal  (Mandatory of all students)\n\nDecember 18　　Dress Rehearsal/Informal Presentation for English Corner Students  (ABSOLUTELY mandatory of all students)\n\nDecember 25　　Final Presentation  (ABSOLUTELY mandatory of all students)","scorePolicy":"GRADING\n¼  memorization and blocking　　\n¼  rehearsal\n¼  taking an active role in work you have selected or that has been selected for you by the Assistant Director (e.g.designing and constructing or selecting set, costumes and/or props)　　\n¼  performance","materials":"TEXTS\nClass Hand-out\n\nFILM\nRhinoceros by Eugene Ionesco \n\nSTUDENT RESPONSIBILITIES\n1)  Participation.  A substantial portion of your final grade is based on your participation in the class.  This is calculated not only according to your engagement in class discussions and rehearsals, but upon your willingness to participate whole-heartedly (in the realization of our selected theatrical work before the public.\n\n2)  Attendance.  Frequent attendance is mandatory.  After your first two absences, each subsequent unexcused absence will cause your final grade to be reduced by ten grade points.  If you are absent, it is your responsibility to not fall behind in memorization of lines and rehearsal of dialogue.  It is also important to be professional, that is, ON TIME, and to let me know if you've come in tardy after class ON THE DAY THAT YOU ARE LATE.  Two tardies = one absence.\n\n3) Outside the Classroom.  Of necessity all students must be prepared to work on particular aspects of the play outside of our scheduled class meeting time.  The Assistant Director will try to arrange people’s schedules so that everyone’s workload is roughly equal.  Some may end up working harder than others.  Their’s is the greatest glory, the highest grade and the fullest educational experience.  Such, as they say, is show biz.","foreignLanguageTextbooks":false}]
