[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2012-09-20 23:10:40","objective":"In this course, we will address several questions: Is there such a thing as the fantastic genre? Why are debates over the use of the fantastic in literature so controversial? What is at stake for authors when they write in the fantastic mode, and what is at stake for critics when they judge these writers’ work? \n\nHistorically, authors have consistently used fantastic elements within poetry, song, and prose fiction. The imagination and the speculative have been a key part of philosophy, official histories, and theology. Not until the 20th century, however, has there been a “fantasy” section in the bookstore. In this course, we will take a historical approach, examining how and why the fantastic has been used in Western (and predominately British) literature. We will look at some early examples of the fantastic (such as Beowulf), examine the flowering of the fantastic during the 19th century, and explore how authors’ have used the fantastic in twentieth and twenty-first century literature.  \n\nIn addition to our course readings, students will also choose a particular literary fantasy to read individually, making a presentation on this work and writing their final course paper either on this work or on one of the other works we have studied in the course.","schedule":"This schedule is simplified. Obtain original from the instructor.\n\nWeek 1　　The History of Fantasy\nFrom Beowulf, Life of St. Edmund, from Malory, Shakespeare, Perrault, Chesterton, Lang, etc. \n\nWeek 2 The Supernatural in our World\n\nWeek 3 Position paper (300–500 words) \n\nWeek 4 National Day. No Class.\n\nWeek 5 Coleridge—from Biographia Literaria, Rime of the Ancient Mariner\n\nWeek 6 Metamorphosis (Kafka) \n\nWeek 7 Position paper (300–500 words)\n　　\nWeek 8 “The Water-babies” (Kingsley)\n\nWeek 9 Position paper (300–500 words)\n　　\nWeek 10　　Other Worlds “On Science Fiction” (Lewis)\n\nWeek 11　　“On Three Ways of Writing for Children” (Lewis)\n\nWeek 12 “On Fairy Stories” (Tolkien)  \n\nWeek 13 From Beowulf \n\nWeek 14 Ghost Stories - A Christmas Carol (Dickens)\n\nWeek 15 Read The Turn of the Screw (James) Ch. 1–11 \n\nWeek 16 From The Brothers Karamazov (Dostoevsky) \n\nWeek 17 Your reports on your literary fantasy of choice. Peer Review of Final Paper.\n\nWeek 18 Final Paper Due","scorePolicy":"Students will be assessed in four main areas: (1) the quality of their participation in class discussions, (2) their responses on in-class writing, quizzes, and position papers (3) their presentation on a particular literary fantasy, (4) their final course paper.  \n\nDiscussion Participation, Effort in Leading Discussion, and Reading Notebook Quality: 15%\nQuizzes and In-Class Writing: 10%\nPosition Papers: 25%\nPresentation: 10%\nFinal Paper: 40%","materials":"Harry Potter and the Philosopher’s Stone\nFrankenstein\nThrough the Looking-Glass and What Alice Found There\nThe Voyage of the Dawn Treader\nThe Hobbit\nA Christmas Carol\nThe Turn of the Screw","foreignLanguageTextbooks":false}]
