[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2012-09-14 17:22:17","objective":"本課程整合心理學、社會學、 決策行為學等理論，介紹消費者的產品購買思維，以及產品消費行為，並討論企業如何應用消費 者行為分析的各項研究發現與理論，以提高行銷規劃與市場活動 效能。課程內容包括：1.消費購買的行為模式。2.消費行為的心理學與社會學基礎。3.消費者認知過程與心理發展。4.社會互動關係與購買行為。5.產品涉入對消費行為的影響。6.情境因素對消費行為的影響。7.態度的形成與改變。8.消費者行為分析在行銷管理的應用。學生修習本課程之後，將對行銷規劃之主要變數，如產品設計、零售企劃、廣告促銷、定價策略等，有一扎實的行為科學方面的理論基礎。","schedule":"次　　主題\nText Book　　內容與個案\n1(9/14)　　課程介紹\n2(9/21)　　消費者行為概論　　Ch1-2\n3(9/28)　　網際網路環境下消費者行為概論　　P1:Hoffman, D.L. and T. Novak (1996), \"Marketing in Hypermedia Computer-Mediated Environments: Conceptual Foundations,\" Journal of Marketing, 60 (July), 50-68.\n4(10/5)　　Ch3-ch4消費者決策與購前行為　　哈佛商學院HBS Case1: IKEA\n1.請分析採購家俱的消費者行為,通常消費者會有哪些困難?\n2.家俱業者提供哪些服務來解決困難?\n3.分析美國的家俱市場\n4.IKEA提供給消費者什麼價值?商業模式為何?\n5.IKEA如何在美國拓展市場?\n5(10/12)　　Ch5-6 消費者購買與購後行為　　哈佛商學院HBS Case2: Starkbucks\n1.請解釋StarBucks在1990年成功的因素?在這段期間他所提供的顧客價值與品牌形象為何?\n2.為何StarBucks滿意度下滑?\n3.2002年的StarBucks與1990年的StarBucks有何不同?\n4.StarBucks應該要投資$40Million的labor提升方案嗎?\n6(10/19)　　Ch7 消費者人格　　哈佛商學院HBS Case3: Tivo in 2000\n1. Analyze the situation from the consumer's standpoint. What is TiVo? What factors facilitate its adoption? What factors make adoption difficult? Who is TiVo best suited for?\n2. Now adopt the standpoint of the networks, the advertisers, and the cable/satellite\ncompanies: what do they want TiVo to be? Thinking about the competition: What are Microsoft’s potential strengths and weaknesses in this market?\n3. How would you describe and characterize TiVo’s action plan as given at the end of the case? How do you evaluate the planned communication campaign? Does your situation analysis suggest an alternative plan?\n7(10/26)　　Ch8 消費者動機　　哈佛商學院HBS: Case4: Sony-Eyetoy\n1. Is EyeToy an important product for Sony? What role does EyeToy play within Sony Computer Entertainment Europe’s (SCEE) strategic objectives?\n2. Although sales figures for EyeToy Play have been impressive, those for EyeToy Groove have been disappointing. What are reasons for Play’s phenomenal success -- and Groove’s failure to emulate Play’s performance?\n3. If you were Phil Harrison, would you continue to invest in the development and marketing of EyeToy software? If so, how much? Why?\n4. What EyeToy software should Sony focus on in the coming years? Which of the concepts currently in the pipeline is the most attractive? More generally, what is the ideal EyeToy development pipeline? Why?\n5. What is the appropriate marketing strategy for EyeToy products? Specifically, how should Sony advertise, price, and bundle its new products? Why?\n8(11/2)　　Ch9 消費者態度\n哈佛商學院HBS: Case5:Omnitel Pronto Italia\n1.　　What was Omnitel’s competitive advantage when the service was launched in December 1995?\n2.　　Why did the launch not perform to expectations?\n3.　　What are the economics of LIBERO?\n4.　　Why is the churn rate so high for many European countries?\n5.　　Do you expect the churn rate to increase or decrease with the launch of LIBERO?\n6.　　What do you learn from customer research? What do you learn from the results of the Conjoint Analysis presented in Exhibits 5 to 8?\n7.　　Will LIBERO lead to a price war? If yes, what could Omnitel do to avoid one?\n8.　　If you were Fabrizio Bono, what changes would you make to LIBERO and why?\n9(11/9)　　Ch13群體與個人影響　　Case1-5  review\n行銷巴菲特競賽11/15截止\n10(11/16)　　Ch14 進行接觸　　哈佛商學院HBS: Case6:Learning from LeapFrog\nQ1. LeapFrog’s business models: LeapFrog pursues two separate industry sectors, (consumer toys and educational technology) so it actually might described as having two distinct business models. How does the company balance these two models, and what challenges arise for the young firm in addressing them both?\nQ2. LeapFrog’s educational model: what is the relationship between the company’s educational approach and its business models? How has its educational approach influenced the company’s success in the markets it serves?\n11(11/23)　　Ch15 opinion　　哈佛商學院HBS: Case7:Wyndham International\nQ1. What is the value of a brand in the lodging industry?\nQ2. Does the Wyndham ByRequest initiative create competitive advantage? If so, is the advantage it creates significant?","scorePolicy":"12(11/30)　　Ch16 memory　　哈佛商學院HBS: Case8: Colgate?Palmolive Precision Toothbrush\n1. What changes are occurring in the toothbrush category? Assess Colgate?Palmolive’s competitive\nposition.\n2. How is the toothbrush market segmented? Compare consumer behavior for toothbrushes and\ntoothpaste.\n3. What are the arguments for launching precision as (a) a niche product and (b) a mainstream brand?\n4. What recommendations would you make to Steinberg? \n13(12/7)　　Ch11culture　　哈佛商學院HBS Case9: Submarino.com\n1. 分析 Submarino的business model and strategy.\n2.與amazon.com 比較business model 以及model evolution.\n3.submarino 對股東有何價值?\n4.對 CEO 有何建議?特別是business model?\n14(12/14)　　體驗價值　　P2: Cho, Chang-Hoan (1999), “How Advertising Works on the WWW: Modified Elaboration Likelihood Model,” Journal of Current Issues and Research in Advertising, 21 (1), Spring, 33-50.\n15(12/21)　　Business model　　哈佛商學院HBS Case 10: Aqualisa Quartz: Simply a Better Shower\nQ1: What is the Quartz value proposition to plumbers? To consumers?\nQ2. Why is the Quartz shower not selling?\nQ3. Aqualisa spent three years and €5.8 million developing the Quartz. Was the product worth the investment? Is Quartz a niche product or a mainstream product?\nQ4. Aqualisa currently has three brands: Aqualisa, Gainsborough, and ShowerMax. What is the rationale behind this multiple brand strategy? Does it make sense?\nQ5. What should Rawlinson do to generate sales momentum for the Quartz product? Should he change his marketing strategy to target consumers directly, target the DIY market, or target developers? Should he lower the price of the Quartz? Or should he do something different altogether?\n16(12/28)　　網路社群　　P3:Joon Koh and Young-Gul Kim(2003) \nSense of Virtual Community: A Conceptual\nFramework and Empirical Validation , International Journal of Electronic Commerce / Winter vol. 8, No. 2, pp. 75–93.\n17(1/4)　　　　Case 6-10 review\n18(1/11)　　　　Term project due\n\n\n個案討論(40%)  個案心得報告(30%) 期末報告(30%)","materials":"一、教材:\n課本:\nBlackwell, R. D., Miniard, P. W., and Engel, J. F. Consumer Behavior, 10th ed,白滌清編譯,華泰出版社, 02-2162-1217.\n哈佛商學院HBS Case(須購買版權)\nPaper(學校資料庫下載)\n二、評分方式:\n個案討論(40%)  個案心得報告(30%) 期末報告(30%)\nPaper 3篇心得:每篇至少一頁(上課時會討論)\n個案討論: 共10個，所有同學需繳交10個心得(哈佛商學院HBS個案)報告，於當天上課時繳交\n本課以個案討論為主，講課或文選討論為輔。上課前必須準備好當天要討論之個案與文選。學生須準備篇個案，須於上課前繳交一頁個案問題與答案之書面資料。\n上課規則如下：\n1:10—2:10 相關教材補充說明\n2:10—2:40 休息時間與小組討論(分5組,每組上課時抄兩個個案筆記)\n2:40—4:00  80分鐘個案討論(請準時入座)\n哈佛商學院HBS case\n1.IKEA\n2.Starbucks\n3.Tivo in 2000\n4.Sony EyeToy\n5.Omnitel Pronto Italia\n6.Learning from LeapFrog\n7.Wyndham International\n8.Colgate precision\n9. Submarino.com\n10. Aqualisa Quartz\nTerm Project:","foreignLanguageTextbooks":false}]
