[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2012-06-02 15:06:08","objective":"當今動畫市場已朝多元發展，網路遊戲中的動畫創作深獲電腦族的喜好，本課程旨在講授動畫的企劃與設計，以及其製作原理與應用。透過對網路、動畫、遊戲、及其他數位媒體的討論，使同學了解動畫的設計製作流程、腳本撰寫、軟體應用等。本課程內容包含分析動畫角色表現技法，動畫創作的原理與軟體自我的應用，並以各類動畫範例觀摩，分析企劃，劇本，鏡頭運鏡，最後將創意具體化，建立獨立製片的能力。\nThis hands-on animation course is intended for studentswho would like to improve their sense of observation, timing, and motion through the real art of animation to create strong believable animation pieces. A good understanding of motion is an important foundation for using computers and technology to their full potential for the creation of animation. This class also emphasizes artistic and aesthetic creativity, intending to push the boundaries of the imagination and to familiarize students with storytelling, acting, character development and dramatic structure. Some time will be spent on screening international animated for inspiration and to learn a variety of styles and techniques.\n\nLectures will be accompanied by simple step-by-step exercises on paper in weight, speed, and timing as well as improvisation exercises.\n\nIn this class, students will learn:\n\nThe importance of the bouncing ball to obtain weight\nSpacing and timing\nAnticipation/action/reaction\nWhat squash and stretch does to animation\nThe importance of exaggeration (or interpretation) of reality to communicate an idea\nThe importance of sound to convey an idea and improve animation\nCharacter development\nHow to build believable walk cycles with personality\nDramatic structure\n\nDuring the second half of the semester, there will be group presentations of topics related to animation, as well as group development of an animation. This should be a small project with a small story line. Since animation is time consuming, it is not advisable to attempt to create a piece that is too long or too complex. Instead, students should concentrate on projects that are still challenging but can be nonetheless done successfully.\n\nStudents are encouraged to keep an open mind of creative experimentation to fully appreciate this class.","schedule":"Week 1-3\nIntroduction and case studies of Animation.\nWeek 3-7\nIntroduction and practice of  Computer Software for Animation.\nWeek 8-9\nScenario Design\nWeek 10-11 \nDrama Structure\nWeek 12-14\nCharacter Development\nWeek 15-17\nFinal Project Production","scorePolicy":"Quality of work and understanding of the exercises (20%)\nAttendance (10%)\nParticipation (10%)\nPresentation of Animation Topic (25%)\nFinal Project Animation (35%)","materials":"　","foreignLanguageTextbooks":false}]
