[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2012-09-05 10:50:07","objective":"本課程講授如何使用Westlaw International資料庫進行IP研究。主要的專利資料庫的檢索方式也會展示。在每堂課前，學生必須要閱讀教材。課堂參與是必須的。其他資訊請見英文課程摘要。","schedule":"Module 1: Introduction of the American Legal Research Methodology.\nModule 2: Introduction of the Westlaw database.\nModule 3: Project-based learning.\n\nClass 1 Introduction, American Legal System: \n-- Law Library of Congress, Legal Research Methodology, http://memory.loc.gov/ammem/awhhtml/awlaw3/legal.html \n-- JAMES C. DUFF, THE FEDERAL COURT SYSTEM IN THE UNITED STATES, (Administrative Office of the U.S. Courts 3d ed. 2010), available at http://www.uscourts.gov/uscourts/FederalCourts/Publications/English.pdf.\n-- Bench trial v. Jury Trial - FED. R. CIV. P. 38, 39. (Federal Rules of Civil Procedure, available at http://www.uscourts.gov/uscourts/RulesAndPolicies/rules/2010%20Rules/Civil%20Procedure.pdf.)\n\nClass 2 Reading Skills for Court Decisions: Global-Tech Appliances, Inc. v. SEB S.A., 131 S.Ct. 2060 (2011); 陳秉訓（2011年10月）, ”A Methodology of Analyzing American Patent Law Cases for Non-American-trained Lawyers,” 2011專業英語文國際學術研討會暨工作坊，弘光科技大學應用英語系主辦，2011年10月27-29日，台中市。\n\nClass 3 Introduction of the Westlaw International: Key numbers, ALR, CJS, American Jurisprudence, and other databases; Discussion about the Final Term Paper: Apple v. Samsung regarding the trade dress issue. Read the Apple's trial brief, 2012 WL 3204607.\n\nClass 4 Research Practice; Katherine Guerin, International Contracts and Terminology: An Annotated Research Guide for the U.S. Practitioner, 29 Int’l J. Legal Info. 575 (2001).\n\nClasses 5-16 Independent Research Project.\n\nClass 16 Final Term Paper Due.\nClass 17 Oral Argument I\nClass 18 Oral Argument II","scorePolicy":"This course does not have the all-pass policy. At least one student may be failed unless the class performs well in general. You might be failed if you do not study hard.\n\nHW: 35%; Term Paper: 40%; OA I: 10%; OA II: 10%; Participation: 5%.","materials":"Materials are primarily from Westlaw.\nStudents are required to do a English examination.\nIf your English is not good, honestly, your grade is expected to be lower than the average.","foreignLanguageTextbooks":false}]
