[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2012-09-17 13:12:31","objective":"城市是有機體，是文明的象徵，更是文化薈萃的結點，因此城市的文化內涵、生活百態、環境紋理、經濟發展、社會互動與城市治理及發展規劃息息相關。經由實證研究得知城市轉型是是國家現代化過程中的必然現象與必須面對的問題，亦即如何由傳統社會走向現代化社會、從農業社會走向資訊化社會、從封閉型社會走向開放型社會的變遷和文化發展的挑戰。這些挑戰與城市文化內涵、產業經濟空間規劃及都市治理模式息息相關。\n先進國家常以創意城市作為城市再生與轉型的契機，藉由城市再生的整體創意與創新策略，將產業創新與文化創意作為環境再造、產業再結構、治理機制調適、公共設施服務與社會活力的內涵，藉以振興產業及強化競爭力。本課程以產業創新及城市創意為主軸，內容將包括研究創意城市的理論與實務，如定義、特徵、條件、構成、指標、類型、評估的基礎認識，進而探討與產業創新、城市發展規劃的關連，並參考國內外案例，研析其優缺點及自省我們的境況與條件，最後經由課程互動，研討可供我們借鏡的可能方向與作法。","schedule":"1.課程介紹\n2.城市發展、城市規劃、創意城市與公共利益\n3.城市問題與創意對策\n4.城市變遷、轉型與蛻變\n5.城市創意的基礎與動能\n6.創意城市新指標\n7.城市生活與文化\n8.吸引朝氣蓬勃的創造力到城市\n9.激勵社區營造成為更有創意的城市\n10.應仿效其他城市的什麼\n11.什麼創意城市計畫？全市性或以社區為基礎\n12.成為創意城市的成功關鍵因素\n13.成為創意城市的障礙是什麼\n14.目前可以明確進行的創意計畫為何\n15.打造創意城市之經濟發展角色\n16.採取什麼步驟成為國際認知的創意城市\n17.促進技術、文化、社會和族群環境的正向發展\n18.如何保護城市的自然與人為文化遺產","scorePolicy":"1.上課互動情形：閱讀主要的參考文獻、參與課堂討論\n2.課堂報告：就各人所選的主題進行文獻閱讀或專題研究與課堂報告","materials":"Dunnett, N. &amp; Kingsbury, N. (2008). Planting Green Roofs and Living Walls, London: Timber.\nFlorida, R. (2002). The Rise of the Creative Class: And How It’s Transforming Work, Leisure, Community and Everyday Life. New York: Basic Books.\nFlorida, R., &amp; Tinagli, I. (2004). Europe in the Creative Age. Retrieved September 15, 2012, from http://www.demos.co.uk/files/EuropeintheCreativeAge2004.pdf\nHospers, G. J. (2003). Creative Cities in Europe Urban Competitiveness in the Knowledge Economy. Intereconomics, 38(5): 260-269.\nJacobs, J. (1984). Cities and the Wealth of Nations. New York: Random Houses.\nLandry, C. (2004). Riding the Rapids: Urban Life in an Age of Complexity, London: Earthscan《掌握先機：複雜年代的都市生活》\nLandry, C. (2006). The Art of City Making, London: Earthscan《城市建設的藝術》\nLandry, C. (2008). The Creative City: A Toolkit for Urban Innovators (2nd Edition). London: Earthscan；楊幼蘭譯，創意城市, (2008)，台北：馬可孛羅。\nSee or hear some of Charles Landry's talks: (http://www.charleslandry.com/index.php?l=hear)\nSnedcof, H. R. (1985). Cultural facilities in mixed-use development, Washington, D.C: Urban Land Institute；劉麗卿、蔡國棟譯，(1996)，都市文化空間之整體營造--複合使用計畫中的文化設施，台北：創興。\nUffelen, C. v., (2011). Façade Greenery: Contemporary Landscaping, Newcastle Upon Tyne: Braun；扈喜林譯，(2011)，當代景觀：立面綠化設計，江蘇人民。\nUN-Habitat, (2004). Globalization and Urban Culture 20042005 Report, London: Earthscan.\nUN-Habitat, (2008). HARMONIOUS CITIES: State of the World’s Cities 2008/2009, London: Earthscan.\nUnited Nations Educational, Scientific and Cultural Organization (2012). Creative Cities Network, Retrieved September 15, 2012, from http://www.unesco.org/new/en/culture/themes/creativity/creative-industries/creative-cities-network\nWood, P. &amp; Landry, C. (2007). The Intercultural City: Planning for Diversity Advantage, London: Earthscan《跨文化城市：多元文化的優勢》\n內政部城鄉發展分署，(2012)，都市計畫規劃作業手冊，台北：內政部城鄉發展分署。\n吳志強主編，(2009)，上海世博會可持續規劃設計，北京：中國建築工業。\n林憲德，(2010)，綠色魔法學校，台北：新自然主義。\n陳冠位，（2002），城市競爭優勢評量系統之研究，博士論文，國立成功大學都市計畫研究所，台南市。\n彭光輝，(2011)，城鄉轉型與創新發展，城市發展研究，18(12)。\n黃世孟，(2000)，小地方，好場所，台北：建築情報。\n廖桂賢，(2009)，好城市，怎樣都要住下來：讓你健康有魅力的城市設計，台北：野人文化。","foreignLanguageTextbooks":false}]
