[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2012-09-18 18:57:38","objective":"課程旨在以跨領域的思考方法，融合文學與批判理論，探討特定主題如何在作品中呈現，思考在不同文化背景和歷史脈絡中的意義，以訓練學生運用和整合在其他學科，甚至其他學術領域學到的能力：諸如藝術和文學風格，社會和哲學思潮等。透過對文本（文學、電影、和其他藝術領域）的細讀和理論的思考和運用，學生可進一步應用跨領域專題研究的方法。可能的專題包括：文學與復仇文化、文學與音樂、電影中的愛與慾、文學與哲學等。","schedule":"The topic to be offered in 101.1: Literature and Revenge (文學與復仇文化)\n\nVirtually all art works (great or minor, classic or popular, literary or non-literary) are fascinated by revenge. It seems that the logic of human interactions is dominated by the logic of vengeance (eg. 9/11, or the killing of an unfaithful lover). This course analyses how revenge is represented in cultural productions including literature, film and various art works across the history of civilization, from Greek tragedies to contemporary films, from European tradition to the modern Asian. This course investigates to what extent is revenge natural, instead of being culturally produced. Related issues including the concept of justice, the sense of guilt, law, time, gender, identity, anger, and violence will be examined by referring to different theoretical frameworks, including Nietzsche, Freud, Lacan, Foucault, Derrida.\n\nCourse Outline: \n\n1. Introduction: Literature and Revenge\n- Revenge as ‘a dish best served cold’ (Borges’ ‘Emma Zunz’)\n- Woman’s revenge (hot)\n- Revenge and justice (Kieslowski’s ‘A Short Film about Killing’)\n- Theorizing Revenge: Nietzsche’s Thus Spoke Zarathustra \n\n2-3. Sophocles’ ‘Oedipus the King’ \nNietzsche’s The Birth of Tragedy \n\n4. Shakespeare’s Twelfth Night\n\n5-6. Woman’s revenge \nGentileschi’s paintings Judith Slaying Holofernes and Judith and her Maidservant\nD.H. Lawrence’s ‘Tickets, Please’ \nEuripides’ Bacchae\n\n7. Shakespeare’s Hamlet\n\n8. Thomas Middleton’s The Revenger’s Tragedy\n\n9. Mid-term test\n\n10. Thomas Kyd’s Spanish Tragedy \n\n11. Revenge and Justice: Heinrich von Kleist's Michael Kohlhaas \n\n12-13. Dickens’ Great Expectations \n\n14. Revenge and Law: Kafka’s ‘Before the Law’\n\n15. Presentation week. No class\n\n16. Revenge and Identity: JSA: Joint Security Area (2000) or Oldboy (2003) (dir. Park Chan-wook)\n\n17. Revenge, Psychoanalysis, and Post-colonialism: Hidden (2005) (dir. Michael Haneke)\n\n18. Final essay due","scorePolicy":"Tutorial 　　　　　　　　10%\nPresentation 　　　　　　　　20%\nMid-term test　　　　　　　　30%\nFinal Essay　　　　　　　　40%","materials":"Bibliography:\n\nPrimary Texts:\n\nBorges, Jorge Luis. ‘Emma Zunz’ in Collected Fictions. Trans. Andrew Hurley. Harmondsworth: Penguin, 1998\n_______________. ‘Death and the Compass’ in Collected Fictions. Trans. Andrew Hurley. Harmondsworth: Penguin, 1998\nBrontë, Emily. Wuthering Heights. Ed. Ian Jack. Oxford: Oxford University Press, 1988.\nDickens, Charles. Great Expectations. Ed. Angus Calder. Harmondsworth: Penguin, 1985\nEuripides. Bacchae in The Bacchae and other Plays. Trans. Philip Vellacott. Harmondsworth: Penguin, 1973\nFreud, Sigmund. ‘Criminals from the Sense of Guilt’ in Penguin Freud 14: Art and Literature. Trans. James Strachey et al. Harmondsworth: Penguin, 1985\nLawrence, D.H. ‘Tickets, Please’ in England, My England. Harmondsworth: Penguin, 1966\nMiddleton, Thomas. The Revenger’s Tragedy. Ed. Brian Gibbons. New York: W.W. Norton, 1967\nNietzsche, Friedrich. The Birth of Tragedy. Trans. Walter Kaufmann. New York: Vintage, 1967\n________________. ‘Thus Spoke Zarathustra’ in The Portable Nietzsche. Ed. &amp; trans. Walter Kaufmann. Harmondsworth: Penguin, 1976\nPoe, Edgar Allan. ‘The Purloined Letter’ in The Purloined Poe. Ed. John P. Muller and William J. Richardson. Baltimore: The Johns Hopkins University Press, 1988.\nShakespeare, William. Hamlet (Arden Shakespeare: Second Series). Ed. Harold Jenkins. London: Arden, 1982\nVon Kleist, Heinrich. ‘Michael Kohlhaas’ in The Marquise of O and Other Stories. Trans. David Luke et al. Harmondsworth: Penguin, 1978\n\nFilms:\nJSA: Joint Security Area (2000). Dir. Park Chan-wook\nOldboy (2003). Dir. Park Chan-wook\nHidden (2005). Dir. Michael Haneke\n\nPaintings:\nGentileschi, Artemesia. Judith Slaying Holofernes. Oil on canvas 199 x 162 cm. Florence: Galleria degli Uffizi, 1614-20\n __________________. Judith and her Maidservant. Oil on canvas 114cm x 93.5cm Florence: Palazzo Pitti, 1613-14\n\nReference: (to be expanded)\n\nKerrigan, John. Revenge Tragedy: Aeschylus to Armageddon. Oxford: Clarendon Press, 1996","foreignLanguageTextbooks":false}]
