[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2012-09-17 14:27:41","objective":"Beginning with the classical science in the Age of Enlightenment onward, science-based literature has played an important role in the development of both science and literature.  Just as scientific knowledge began to be a necessary component of literature, very often the fictive universes of the literary artist, seemingly fantastic or impossible at the time of their inception, were later realized as scientific possibilities.  Beginning with the utopian narratives of More, Bacon and Swift, and early scientific endeavors of Lucretius, Newton and Goethe this course will follow the tandem progress of science and literature through early exponents such as Poe and Jules Verne to contemporary science-fiction writers such as Douglas Adams, Ursula K. LeGuin, Philip K. Dick and J. G. Ballard.  We will also examine the current state of scientific writing per se through an examination of works of contemporary popular science by Stephen Hawking, Richard Dawkins, David Deutsch and Rupert Sheldrake.  Students will gain skills in reading in, though and about science in both its literary and technical aspects.","schedule":"COURSE SCHEDULE\n\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nSeptember 19　　Introduction: Science and Thought.  READ: Tesla, Poe.  ASSIGNMENT:  Journal Entry (JE) #1: Articulating your comments/questions OR responding creatively to one of both of the authors.\n\nSeptember 26　　The Automata.  READ Frankenstein, Pt. 1  + selection from Agrippa.  ASSIGNMENT: JE #2:  Psychoanalytic character sketch of Victor von Frankenstein; how does he compare with Tesla?\n\nOctober 3　　MIND &amp; MATTER?:  Discuss Frankenstein, Tesla, Poe.  FRANKENSTEIN, Part Two + selection from Paracelsus.  ASSIGNMENT: JE #3  Who was/is Mesmer?  What theory did he publish?  What was controversial about the idea?  How did his theory come to be held in scientific disregard?  TEN BONUS POINT QUESTION:  How was Mesmer’s theory of “Animal Magnetism” conflated with the experiments of Galvani to produce a working model for hypnosis?  \n\nOctober 10 　　 HYPNOSIS DEMONSTRATION.  ASSIGNMENT: JE #4 Finish Frankenstein.  ASSIGNMENT: JE #4.  Free association, weaving images/ ideas/feelings about the story of the Frankenstein story in its entirety.  What would it feel like to be the monster?  How does/might Dr. Frankenstein justify his actions?  (Maybe in some way or another you resemble one or the other, or both.)  BONUS TEN POINT QUESTION:  Draw a connection, or chain of connections, perhaps, but not necessarily, chronologically)  between all the scientific and philosophical notions we have been encountering.\n\n\nOctober 17　　Questions and comments.  Draft Preliminary Midterm Paper (BRING TO CLASS WITH ONE EXTRA COPY)\n\nOctober 24　　DISCUSS PRELIMINARY MIDTERM PAPER ASSIGNMENT:  DRAFT FINAL MIDTERM PAPER (with three extra copies)\n\nOctober 31　　PEER EVALUATION OF MIDTERM PAPER (with three extra copies)\n\nNovember 7　　MIDTERM PAPER DUE  ASSIGNMENT: JE #3\n\nNovember 14　　Synthesizing your research findings\n\nNovember 21　　ASSIGNMENT: JE#4  \n\nNovember 28　　Speculation and Enlargement.  Prepare for Group Presentations.\n \nDecember 5　　Group Presentations \n　　　　\nDecember 12　　Group Presentations\n\nDecember 19　　Group Presentations.   Assignment:  Begin Writing Final Draft\n\nDecember 26　　DISCUSSION OF FINAL DRAFT\n\nJanuary 2　　DRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\n\nJanuary 9　　DRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE\n\n\nCOURSE SCHEDULE\n\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nSeptember 17　　Introduction  ASSIGNMENT:  \n\nSeptember 24　　Discussion of.  \n\nOctober 1　　ASSIGNMENT: JE #2\n\nOctober 8 　　 \n\nOctober 15　　\n\nOctober 22　　\n\nOctober 29　　\n\nNovember 5　　\n\nNovember 12　　\n\nNovember 19　　  \n\nNovember 26　　\n \nDecember 3　　 \n　　　　\nDecember 10　　\n\nDecember 24　　\n\nDecember 31　　HOLIDAY\n\nJanuary 7　　\n\nJanuary 9","scorePolicy":"STUDENT RESPONSIBILITIES\n\n1) Peer Evaluation.  A significant portion of the class will be given over to peer evaluation of essays.  The purpose of this is at least threefold:  1) to offer student writers criticism from peers, so that they may improve their work; 2) to cause each class member to articulate his or her critical concerns; and 3) to encourage the formation of a community of writers.  For peer evaluation you must be prepared to make multiple copies of your written work for other students in the class, AND YOU MUST BRING YOUR WORK AND THREE COPIES IN TO CLASS ON THE DAY THEY ARE DUE.  All peer evaluation activities--not only your having your paper evaluated, but also your active, cheerful participation in the critique of essays by your fellow classmates—are absolutely mandatory and count towards participation points in the class that cannot be made up.\n\n2)  Journals.  Students must keep a journal on an ongoing basis containing responses to the works they are examining and share these writings with the rest of the class.  The essays that you write will be drawn from these journal entries.  To receive full credit, you must bring your journal entry to class with one additional copy (for the instructor) and read it aloud on the day that it is due.  I will not accept late or e-mailed journal entries or writing assignments.\n\n3) Presentations.  Students will give three oral presentations alone in concert with two or three classmates.  Preparation of these presentations will lead to development and refinement of your final essay topic, and will provide a meaningful context for discussion in the class.\n\n4)  Attendance.  Frequent attendance is mandatory.  After your first absence, each subsequent unexcused absence will cause your final grade to be reduced by five points.  If you are absent, it is your responsibility to find out the substance of class discussions and to make up homework.  \n\n5)  Anyone caught plagiarizing will receive a failing grade in the course.  All outside sources that you use in the production of your papers must be properly attributed using the MLA format.\n\n\nGRADING\n\n25%　　Midterm Paper\n25%　　Journal Writing\n25%　　Final Paper\n25%　　Participation and Presentation","materials":"SCHEDULE OF FORMAL (GRADED) WRITING ASSIGNMENTS\n\nMIDTERM PAPER:  PRELIMINARY RESEARCH\n\nYou have been given a text about which you probably know little or nothing.  Now you must take on the role of researcher/detective.  What is this text?  From whence does it come (that is, what was the name of location when it was written, and. if that has changed, what is the name of that location now)?  Who (that is, what individual or group) wrote it?  What is the original language in which it was written?  When was it written?  Why?  What role does it play in the larger cultural tradition from which it derives?  Draw upon outside sources as appropriate, but also upon your own (phenomenological) experience of the text as you have recorded in your journal.  Your finished paper should be between three to five pages in length.\n\nIMPORTANT:  YOU MUST ATTRIBUTE AND DOCUMENT EVERY SOURCE YOU USE IN THE PROPER MLA FORMAT AND INCLUDE A “WORKS CITED” PAGE AT THE END.\n\nDraft (+ 3 extra copies) Due:  OCTOBER 13\n\nFinal Draft Due: NOVEMBER 3\n\n\n\nFINAL PAPER:  SYNTHESIZING AND EVALUATING PRIMARY AND SECONDARY SOURCES\n\nExplore the primary and secondary texts you have discovered throughout the course of your investigation in relation to an original, provocative and illuminating thesis idea all your own.  How did you arrive at your thesis idea?  What source texts are most responsible for guiding you to it?  Look back at and, if appropriate, incorporate your previous journal entries and formal writing assignments.  Include also a narrative description of your research endeavors.  WHAT HAVE YOU LEARNED, DISCOVERED, UNCOVERED, DISCOVERED ABOUT YOUR PRIMARY TEXT, ABOUT THE PHYSICAL, ARTISTIC, SOCIAL AND INTELLECTUAL WORLD FROM WHICH IT SPRANG AND WHICH SUSTAINS IT—AND, MOST IMPORTANTLY, ABOUT YOURSELF???\n\nIMPORTANT:  YOU MUST ATTRIBUTE AND DOCUMENT EVERY SOURCE YOU USE IN THE PROPER MLA FORMAT AND INCLUDE A “WORKS CITED” PAGE AT THE END.\n\nDraft (+ 3 extra copies) Due:  December 22\n\nFinal Draft Due: January 5","foreignLanguageTextbooks":false}]
