[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2012-09-17 13:12:48","objective":"目前全世界超過一半以上的人口生活在城市，人數仍快速增加中，相伴而來的環境、經濟、社會與治理問題將如何處理？因此城市轉型是城市要繼續成長的必要過程，許多案例顯示創意城市是城市轉型的典範，可以作為城市轉型與再生的契機。創意城市是近年來先進國家鼓勵領導者、產業、市民從己身城市內思考、規劃、發揮創意與實現城市創新的觀念，以激發城市找到自身的發展潛能，結合當地文化資產及地方特色，經由城市發展規劃提升創意經濟及城市的競爭力。本課程以文化創意、產業創新及城市規劃為主軸，包括研究創意城市定義、特徵、條件、構成、指標、類型、評估的基礎，進而探討與文化創意、產業創新、城市發展規劃的關連，並參考國內外城市的創新與再生案例，他們是如何在城市議題上思考、規劃與執行富有創意的行動，又如何將行動運用於城市規劃。課程經由互動分析創意城市與城市規劃的關連及作法，討論可供借鏡的發展策略與方案。","schedule":"1.課程介紹\n2.創意城市定義與特徵、類型、評估的基礎\n3.創意城市條件、構成與指標\n4.城市發展、城市規劃與創意城市\n5.城市問題與創意對策\n6.城市變遷、轉型與蛻變\n5.城市創意的基礎與動能\n6.創意城市新指標\n7.城市生活與文化\n8.創意城市市與文化創意、產業創新、城市發展規劃的關連\n9.社區營造與創意城市\n10.創意城市的國內外案例\n11.全球化下的創意城市發展\n12.成為創意城市的成功關鍵因素\n13.成為創意城市的障礙是什麼\n14.目前可以明確進行的創意計畫\n15.打造創意城市之經濟發展角色\n16.採取什麼步驟成為國際認知的創意城市\n17.促進技術、文化、社會和族群環境的正向發展\n18.保護城市的自然與人為文化遺產","scorePolicy":"1.上課互動情形：閱讀主要的參考文獻、參與課堂討論\n2.課堂報告：就各人所選的主題進行文獻閱讀或專題研究與課堂報告","materials":"Dunnett, N. &amp; Kingsbury, N. (2008). Planting Green Roofs and Living Walls, London: Timber.\nFlorida, R. (2002). The Rise of the Creative Class: And How It’s Transforming Work, Leisure, Community and Everyday Life. New York: Basic Books.\nFlorida, R., &amp; Tinagli, I. (2004). Europe in the Creative Age. Retrieved September 15, 2012, from http://www.demos.co.uk/files/EuropeintheCreativeAge2004.pdf\nHospers, G. J. (2003). Creative Cities in Europe Urban Competitiveness in the Knowledge Economy. Intereconomics, 38(5): 260-269.\nJacobs, J. (1984). Cities and the Wealth of Nations. New York: Random Houses.\nLandry, C. (2004). Riding the Rapids: Urban Life in an Age of Complexity, London: Earthscan《掌握先機：複雜年代的都市生活》\nLandry, C. (2006). The Art of City Making, London: Earthscan《城市建設的藝術》\nLandry, C. (2008). The Creative City: A Toolkit for Urban Innovators (2nd Edition). London: Earthscan；楊幼蘭譯，創意城市, (2008)，台北：馬可孛羅。\nSee or hear some of Charles Landry's talks: (http://www.charleslandry.com/index.php?l=hear)\nSnedcof, H. R. (1985). Cultural facilities in mixed-use development, Washington, D.C: Urban Land Institute；劉麗卿、蔡國棟譯，(1996)，都市文化空間之整體營造--複合使用計畫中的文化設施，台北：創興。\nUffelen, C. v., (2011). Façade Greenery: Contemporary Landscaping, Newcastle Upon Tyne: Braun；扈喜林譯，(2011)，當代景觀：立面綠化設計，江蘇人民。\nUN-Habitat, (2004). Globalization and Urban Culture 20042005 Report, London: Earthscan.\nUN-Habitat, (2008). HARMONIOUS CITIES: State of the World’s Cities 2008/2009, London: Earthscan.\nUnited Nations Educational, Scientific and Cultural Organization (2012). Creative Cities Network, Retrieved September 15, 2012, from http://www.unesco.org/new/en/culture/themes/creativity/creative-industries/creative-cities-network\nWood, P. &amp; Landry, C. (2007). The Intercultural City: Planning for Diversity Advantage, London: Earthscan《跨文化城市：多元文化的優勢》\n內政部城鄉發展分署，(2012)，都市計畫規劃作業手冊，台北：內政部城鄉發展分署。\n吳志強主編，(2009)，上海世博會可持續規劃設計，北京：中國建築工業。\n林憲德，(2010)，綠色魔法學校，台北：新自然主義。\n陳冠位，（2002），城市競爭優勢評量系統之研究，博士論文，國立成功大學都市計畫研究所，台南市。\n彭光輝，(2011)，城鄉轉型與創新發展，城市發展研究，18(12)。\n黃世孟，(2000)，小地方，好場所，台北：建築情報。\n廖桂賢，(2009)，好城市，怎樣都要住下來：讓你健康有魅力的城市設計，台北：野人文化。","foreignLanguageTextbooks":false}]
