[{"name":"黃恩宇","email":"kant1202@ms16.hinet.net","latestUpdate":"2012-09-15 21:38:57","objective":"How do we study architecture without architects? How do we study towns, villages or hamlets without planners? How do we analyze their numerous and complicated patterns and structures? These questions can only be answered in the field of Human Settlements and Vernacular Architecture. Since the 1960s, a variety of issues regarding the protection of our cultural heritage in the process of planning for the future, the balance between development and conservation, and the establishment of a sustainable environment in which new and old can coexist in harmony have received growing attention of urban planners, architects and researchers. Consequently, they have been gradually conscious of the importance of studying the human settlements and vernacular architecture found all over the world that may reveal the universal and timeless meaning of the built environment of human beings. \n\nThis course will teach students how to conduct inter-regional and inter-cultural research on the worldwide human settlements and vernacular architecture from a comparative perspective as based on the paradigm of the built environment as a representation of realities. Various examples of human settlements and vernacular architecture will be analyzed not only according to the natural factors (e.g. climate, landscape, material and tectonics) but also according to the mental constructs of the external environment (e.g. the “Axis Mundi &amp; Cosmic Cross”, the “Including &amp; Excluding Structures” and the “Holy &amp; Unholy Zones”). Such an analysis will enable students to understand the intrinsic values of human settlements and vernacular architecture that should be embodied in the establishment of a sustainable built environment for human beings.","schedule":"Timetable\n\n19 Sept  \nIntroduction \n\n26 Sept  \nThe Scope of Human Settlements and Vernacular Architecture\n\n03 Oct  \nParadigm – The Built Environment as a Representation of Realities\n\n10 Oct  \nDay Off (National Day) \n\n17 Oct  \nField Study \n\n24 Oct \nThe Anthropomorphic, the Physiomorphic and the Sociomorphic Traditions of Worldwide Architectural Representations\n\n31 Oct  \nThe ‘Axis Mundi &amp; Cosmic Cross’ Theme of Worldwide Architectural Representations\n\n07 Nov  \nThe ‘Including &amp; Excluding Structures’ Theme of Worldwide Architectural Representations \n\n14 Nov  \nThe ‘Holy &amp; Unholy Zones’ Theme of Worldwide Architectural Representations \n\n21 Nov  \nSettlements and Vernacular Dwellings in Taiwan \n\n28 Nov  \nField Study \n\n05 Dec  \nTraditional Architectural Theories – Chinese Feng-Shui and Indian Vastu-Shastra as Examples \n\n12 Dec  \nThe Configuration of Built Spaces\n\n19 Dec  \nThe Orientation of Built Spaces\n\n26 Dec  \nThe Spatial Hierarchy of Built Spaces \n\n02 Jan  \nField Study \n\n09 Jan  \nFinal Presentations by Students \n\n16 Jan  \nFinal Presentations by Students","scorePolicy":"Assessment\n\n1. Classroom Performance 30% \n2. Presentation during the semester 30% \n3. Final Presentation 40%","materials":"Reading List\n\nPaul Oliver (2006). Built to Meet Needs: Cultural Issues in Vernacular Architecture. Architectural Press.\n◎ Why Study Vernacular Architecture? (1978), pp. 3-16 \n◎ The Importance of the Study of Vernacular Architecture (1993), pp. 17-26\n◎ Problems of Definition and Praxis (1999), pp. 27-43 \n◎ Cultural Traits and Environmental Contexts: Problems of Cultural Specificity and Cross-cultural Comparability (1999), pp. 55-68\n\nPaul Oliver (2007). Dwellings: The Vernacular House Worldwide. Phaidon Press.\n◎ Introduction, pp. 7-19\n◎ Spatial Relations, pp. 150-167\n◎ House and Cosmos, pp. 168-189 \n\nPaul Oliver (1997). Encyclopedia of Vernacular Architecture of the World. Routledge.\n\nJohn May (2000). Buildings without Architects: A Global Guide to Everyday Architecture. Rizzoli. \n\nMircea Eliade (1987). The Sacred and The Profane: The Nature of Religion. Harcourt Brace Jovanovich.\n◎ Chapter I: Sacred Space and Making the World Sacred, pp. 20-65 \n\nR. D. Dripps (1997). The First House: Myth, Paradigm, and the Task of Architecture. The MIT Press. \n◎ The Origin of Dwelling, pp. 3-18\n◎ The Structure of Paradigms, pp. 47-62 \n\nNorman Crowe (1997). Nature and the Idea of a Man-made World: An Investigation into the Evolutionary Roots of From and Order in the Built Environment. The MIT Press.\n◎ The Idea of a Man-made World, pp. 3-27\n◎ Geometry and the Primacy of Dwelling, pp. 29-69\n◎ Nature and the Sense of Place, pp. 71- 91\n\nAart Mekking (2009). The Global Built Environment as a Representation of Realities: Why and How Architecture Should be Subject of Worldwide Comparison. Pallas Publications (Amsterdam University Press).\n◎ Aart Mekking. The Architectural Representation of Reality: The Built Environment as the Materialization of a Mental Construct, pp. 23-49\n◎ En-Yu Huang. The Architectural Representation of Taboo: Toilet Taboos as Guardians of Old Taiwanese Representations of Family Life, pp. 141-171\n\nDana Arnold (2002). Reading Architectural History. New York: Routledge. \n◎ A Class Performance: Social Histories of Architecture, pp. 127-142\n◎ Life in the English Country House, pp. 141-163","foreignLanguageTextbooks":false}]
