[
  {
    "name": "王正豪",
    "email": "jhwang@ntut.edu.tw",
    "latestUpdate": "2022-09-07 15:35:28",
    "objective": "Web search engine has become one of the necessary tools in modern lives. This course aims at investigating how to index large amount of text documents and search what users need in an effective way. We will introduce the basic concepts of information retrieval, characteristics of documents and languages, various retrieval models, evaluation of retrieval results, indexing and searching, text classification, text clustering, and Web search. In addition to texts, we will also introduce some applications of multimedia retrieval.",
    "schedule": "1. Indexing (3 wks)\n2. Basic text modeling and evaluation (2-3 wks)\n3. Query processing and advanced models (2-3 wks)\n4. Machine learning in IR (2-3 wk)\n5. Web search (2-3 wks)\n6. Advanced topics: CLIR, IE, social Web, ... (2 wks)\n7. Term project presentation (2-3 wks)",
    "scorePolicy": "Homework assignments and programming exercises: ~40%\nMid-term exam: ~25-30%\nTerm project and presentation: ~30-35%",
    "materials": "- Textbook:\n. Christopher D. Manning, Prabhakar Raghavan and Hinrich Schuetze, Introduction to Information Retrieval, Cambridge University Press. 2008. (available online at: https://www.informationretrieval.org/)\n- References:\n. Ricardo Baeza-Yates and Berthier Ribeiro-Neto, Modern Information Retrieval: the concepts and technology behind search, 2nd ed. Addison-Wesley, 2011.\n. Bruce Croft, Donald Metzler, and Trevor Strohman, Search Engines: Information Retrieval in Practice, Addison-Wesley, 2010.\n. Stefan Buettcher, Charles L.A. Clarke, and Gordon V. Cormack, Information Retrieval: Implementing and Evaluating Search Engines, MIT Press, 2010.\nPrerequisite:\n. Basic knowledge of data structures and algorithms\n. Programming experience is necessary for homeworks & projects\n- The latest information will be available soon at: https://myweb.ntut.edu.tw/~jhwang/IR/",
    "consultation": "The teacher can be reached via e-mail or messages in Microsoft Teams.The TA will help you join the course group in Facebookwhere you can also ask questions about the homeworks and exams.",
    "remarks": "All course sessions will be recorded and put on iSchool+ afterwards, along with all course materials, homework announcements and submissions.To prepare for further impacts of COVID-19 pandemic, the following channels will be set up:1. Microsoft Teams: you will be automatically added to the team for your enrolled courses in Teams (@cc.ntut.edu.tw), just in case the course will be made online.All course materials will also be put there.2. Facebook: we will set up a group for the course in Facebookwhere you can also ask questions about the homeworks and exams.",
    "foreignLanguageTextbooks": true
  }
]
