[
  {
    "name": "莊澤光",
    "email": "s2300072ray@gmail.com",
    "latestUpdate": "2022-05-26 09:58:04",
    "objective": "本課程作為高年級生的必修課程，旨在拓廣學生們對於設計的眼界，理解當代產業中的職涯脈絡與發展方向，藉以提供學子們更多元寬廣的未來發展道路。\n  課程將透過邀請的業師講座、授課教師的講述課程以及學生的搭配研究報告交叉運行，藉以達到更多元的互動與回饋。\n針對以美學設計與科技運用混合為主題的互動設計系，本學期專題將邀請數位業界專精的講者，分享在數位程式與各自領域中的不同應用。在廣泛的演講範疇中，都仍涉及到了空間、程式、創意美學等幾項核心課題，可作為學生發展核心技能的借鏡。\n  授課部分為能與專題講座配合，將保有其內容與進度上的彈性。課程評量將以學生報告、小組討論與呈現為主要評分方式，除增加課堂的互動與趣味性，也增加學生對此主題的認知深度。\n(本課程為求語言講述的深度，仍將以中文講述為主，中英文簡報為輔。)\n\nThe major goal of this class aims to give students general understanding about how the digital technologies affecting different design industries, such as architectural design, interior design and urban planning, etc. So that to think the future possibilities of interaction techniques to be applied in different industries and careers. \nThis class would be organized into three different parts: invited lecturer talks, class lectures and class discussion. \nThe first part: Invited lecturer talks has a very wide range of topics, included paper crafts, conceptual design, VFX and parametric design, however all of them are stick with the major issue of interaction design, technology and space.\nStudent will be asked to participate the class discussions， presentations and give reports in the end of semester. Students’ learning outcome must be showed in this report and will be the critical criteria of semester grading.",
    "schedule": "週 次　　授課內容要項\n1~2　　 課程介紹、進度安排、評分標準說明 /　　分組與選取小老師。\n3~4　　 主題介紹\n5　　 專題講座_1\n6　　 期中研究報告\n7　　 期中研究報告\n8　　 專題講座_2 \n9~10 主題介紹\n11　　 專題講座_3\n12　　 專題講座_4\n13　　 專題講座_5\n14　　 主題介紹\n15　　 專題講座_6\n16　　 期末作業輔導。\n17　　 期末作業完成：報告。\n18　　 期末作業完成：報告。\n\n(註：以上進度視實際上課情況與外聘講者時間保有調整彈性)",
    "scorePolicy": "01: 出席率與課堂參與表現  30%\n02: 期中報告表現 30%\n03: 期末報告表現 40%",
    "materials": "講師提供之簡報與教材。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 教學社團連結: https://www.facebook.com/groups/905820036686037\n遠距教學連結: https://meet.google.com/nci-mvvh-uax\n教學錄影連結: https://www.youtube.com/playlist?list=PLnzIQI36zUIm1Xi4BP0Y4mqHFH6meVFd6</div>"
  }
]
