[
  {
    "name": "陳錦文",
    "email": "cwchen@mail.ntut.edu.tw",
    "latestUpdate": "2022-05-27 00:17:30",
    "objective": "本課程主要說明各種紡織材料之組成和成形、基本性質、各種加工與應用。主要簡介紡織科技所包含之原料與製程、製品和評估，同時訓練學生了解基本的紡織辭彙。課程包含兩個部分。一、討論各種纖維之化學組成、合成與成形之理論，同時針對纖維之性質、纖維改質與組成、合成、成形間之關係與影響因素及檢測加以講授。 二、說明纖維之形態與微觀及巨觀結構、纖維長度分佈與斷面、密度、吸水性與膨潤性、機械性質、光學性質、熱性質，黏彈性質，及電氣性質等物理性質。\nThis course mainly explains the composition and formation, basic properties, various processing and application of various textile materials. It mainly introduces the raw materials and processes, products, and evaluations in textile technology and trains students to understand basic textile vocabulary. The course consists of two parts. 1. Discuss the chemical composition, synthesis, and forming theories of various fibers, and at the same time teach the properties of fibers, fiber modification and composition, the relationship between synthesis and forming, and influencing factors and testing. 2. Explain the fiber morphology, micro and macrostructure, fiber length distribution, and cross-section. Furthermore, the physical properties include density, water absorption and swelling, mechanical properties, optical properties, thermal properties, viscoelastic properties, electrical properties, and other physical properties.",
    "schedule": "Week 1-2: Fiber Classification and Development (纖維分類與發展)\nWeek 3-4: Fiber Structure (纖維結構)　\nWeek 5-6: Fiber Morphology (纖維形態)　　\nWeek 7: Fiber Absorption and Mechanical Properties (纖維吸濕及力學性質)　\nWeek 8: Fiber thermal, light, and electronic Properties (纖維熱、光及電學性質)\nWeek 9: Midterm exam　\nWeek 10-11: Fiber Surface Characteristics (纖維表面特性)　\nWeek 12-13: Fiber Post-processing (纖維後加工性)　\nWeek 14-15: Fiber Identification and Analysis (纖維的鑑定分析)\nWeek 16: Fabric Structure and Basic Texture (織物結構與基本組織)　\nWeek 17: Fabric Physical Property (織物物理特性)\nWeek 18: Final exam",
    "scorePolicy": "1.\t期中考 / Midterm: 45%\n2.\t期末考 / Final exam: 45% \n3.\t出席 Attend: 10%",
    "materials": "1. 紡織材料學，第 2 版，作者： 于偉東，出版社：中國紡織出版社，2018\n2. 紡織物理，第 2 版，作者： 于偉東及儲才元，出版社：東華大學出版社，2009\n3. Physical Properties of Textile Fibres, 4th Edition, J. W. S. Hearle, W E Morton (https://www.elsevier.com/books/physical-properties-of-textile-fibres/hearle/978-1-84569-220-9)\n4. The Chemistry of Textile Fibres: 2nd Edition, Robert R Mather, Roger H Wardman (https://pubs.rsc.org/en/content/ebook/978-1-78262-023-5)",
    "consultation": "請同學可以寫 email 或校內分機給老師進行課程諮詢",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
