[
  {
    "name": "洪祖全",
    "email": "tchung@ntut.edu.tw",
    "latestUpdate": "2022-05-25 17:09:55",
    "objective": "Basic concepts, thermodynamic properties, 1st and 2nd law of thermodynamics, Carnot cycle, Brayton cycle, Rankine cycle, Performance improvement of the cycles.",
    "schedule": "授課進度及大綱:\n1. Basic concept: Overall picture of thermodynamics and energy; Introduction of the systems, cycles, processes, states, and properties, the knowledge of pressure, work, heat, unit conversion.\n2. Properties: Extensive and intensive properties; physical and thermodynamic properties; total energy and various types of energy;\n3-4. Equilibrium diagram: Saturated curve of pure substance from experiments, its relation with steam Table; Table method practice; determination of the state location.\n5. More practice of the Table method for determining the properties.\n6. Equilibrium diagram: Reasons to assume its ideal gas; Table method practice; concept of u = u (T).\n7. More practice and understanding to the ideal gas; incompressible materials. \n8-10. Conservation of Mass and Energy\n11-12. 2nd law of thermaodynamics and entropy\n13. Carnot cycle\n14. Conversions among T-v, p-v, and T-s diagrams.\n15-16. Brayton cycle and improvement\n17-18. Rankine cycle and improvement",
    "scorePolicy": "About 2 mid-terms and 1 final examinations: Date will be determined according to the progress of the lecture.\nYour final points will be completely dependent of what you can show yourself in the examinations and special performance in the class. Homework will be assigned but you do not have to hand in. They will be the candidate problems in the examinations. You can freely handin your homework and would be helpful in your grade.",
    "materials": "1. 教科書：”Thermodynamics” – by William Z. Black and James G. Hartley\n2. 教材：備有講義成冊供學生拷貝\n3. 自製 e 化影片\n4. 參考教材：”Engineering Thermodynamics” – by Moran and Shapiro.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 洪祖全老師的手機：0918806957。\n疫情期間的上課調整方式，會隨時更新。\n\n屆時將建立 Line 群組，邀請修課的同學加入，以便方便聯繫，並隨時更新有關的消息或異動。</div>"
  }
]
