[
  {
    "name": "陳錦文",
    "email": "cwchen@mail.ntut.edu.tw",
    "latestUpdate": "2022-05-27 00:02:11",
    "objective": "本課程主要是教授紡織上的基本概念，對於整體紡織從原料到成紗、織布、染色、整理加工及成衣與行銷貿易等皆有普遍性認識，以建立未來學習紡織專業知識的良好基礎。上學期其主要內容為討論紡織原料的種類與製造方法及各種纖維之特性及適用性，其中包括天然纖維諸如棉、毛、絲、麻等，以及人造纖維諸如再生纖維（嫘縈），半合成纖維（醋酸纖維）與合成纖維（尼龍、聚酯、聚丙烯晴、聚烯烴及其他工業用纖維等）。有關上述纖維之化學性質與物理特性皆在課程中詳加說明介紹，並針對纖維物性之差異性從微細構造方面予以簡單闡述解說，以建立將來相關課程之基礎。\nThis course mainly teaches the basic concepts of textiles for a general understanding of the overall textile from raw materials to yarn, weaving, dyeing, finishing, clothing and marketing trade, etc., to establish the future of learning professional textile knowledge. The main content of the last semester was to discuss the types and manufacturing methods of textile materials and the characteristics and applicability of various fibers, including natural fibers such as cotton, wool, silk, hemp, etc., and man-made fibers such as regenerated fibers (rayon), semi-synthetic fiber (acetate fiber) and synthetic fibers (nylon, polyester, polyacrylonitrile, polyolefin, and other industrial fibers, etc.). The chemical properties and physical properties of the fibers mentioned above are explained in detail in the course. The differences in the fibers' physical properties are briefly described in terms of the microstructure to establish future related studies.",
    "schedule": "Week 1: Introduction to Textile Materials (紡織材料概論)\nWeek 2-3: Fiber Spinning and Characteristic (纖維紡絲與特性)\nWeek 3-4: Fiber Processing Technology (纖維加工技術)\nWeek 5-6: Natural Fiber (天然纖維)\nWeek 7-8: Regenerated Fiber (再生纖維)\nWeek 9: Midterm exam\nWeek 10-11 Semi-synthetic Fiber (半合成纖維)\nWeek 12-13 Synthetic Fiber (合成纖維)　\nWeek 14-15 High-performance Fiber (高性能纖維)\nWeek 16-17 Functional Fiber (機能性纖維)\nWeek 18: Final exam",
    "scorePolicy": "1.\t期中考 / Midterm: 40%\n2.\t期末考 / Final exam: 50% \n3.\t出席 / Attend: 10%",
    "materials": "1、\tManmade Fibers: Their Origin and Development, Raymond B. Seymour and Roger S. Porter, Elsevier applied Science, 1993\n2、\t紡織材料學，第 2 版，作者： 于偉東，出版社：中國紡織出版社，2018\n3、\t紡織品入門手冊，第 4 版，作者： 紡織所編輯群，出版社：紡織產業綜合研究所，2014",
    "consultation": "請同學可以寫 email 或校內分機給老師進行課程諮詢",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
