[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2022-08-24 16:24:13",
    "objective": "This course aims to enhance students’ speaking skills with a particular focus on listening comprehension, critical analysis of certain issues, organization of ideas, and lucid delivery of a speech. The course is designed thematically and divided into 7 teaching sections. Each section contains two weeks. In the first week, we will approach a specific issue by watching an introductory video clip, doing listening exercises and understanding key terms. And then students will be divided into groups to discuss and present their opinions regarding the issue. In the second week, we will further explore the issue by watching selected scenes from a relevant film. Each group will be asked to answer critical questions by analyzing the scenes, formulate and organize their ideas, and deliver a short speech at the end of the class.",
    "schedule": "* 請留意本課程時間會改為周四下午 89 節 (16:10-18:00)\n\nWeek 1: Introduction\n\nUnit 1: Moral dilemma\nWeek 2: Listening comprehension and discussion: the trolley problem\nWeek 3: Film analysis and presentation: Scent of a Woman (1992)\n\nUnit 2: What counts as a hero?\nWeek 4: Listening and comprehension: tragic hero\nWeek 5: Film analysis and presentation: The Dark Knight (2008)\n\nUnit 3: Individuality vs. collectivity\nWeek 6: Listening and comprehension: collectivism and Individualism\nWeek 7: Film analysis and presentation: A Few Good Men (1992)\n\nWeek 8: Film viewing: “The Crocodile’s Dilemma” from Season 1 of Fargo (2014)\nWeek 9: Mid-term group presentation\n\nUnit 4: Religion and morality\nWeek 10: Listening and comprehension: the divine command theory\nWeek 11: Film analysis and presentation: The Devil’s Advocate (1997)\n\nUnit 5: Humor and offense\nWeek 12: Listening comprehension and discussion: the Will Smith incident\nWeek 13: Film analysis and presentation: “Stunning and Brave” from South Park\n\nUnit 6: Cultural appropriation\nWeek 14: Listening comprehension and discussion: cultural appropriation\nWeek 15: Film analysis and discussion: Pocahontas (1995)\n\nUnit 7: Gender and sexuality\nWeek 16: Listening comprehension and discussion: The problems of the Disney Princesses\nWeek 17: Film analysis and presentation: “Tweek x Craig” from South Park\n\nWeek 18: Final group presentation",
    "scorePolicy": "Attendance and participation: 40%\nWeekly in-class exercises and discussion\n\nMid-term presentation: 30%\n3-4 students in each group\nWeek 8: film viewing and critical questions\nWeek 9: a presentation that answers the critical question with analysis of the film (20-25 minutes)\nWith PPT slides (includes references and a list of work distribution)\n\nFinal presentation: 30%\nIn Week 18\nEach group chooses a topic relevant to the 7 issues discussed in this semester\nA illustration of your critical opinions of the issue\nWith examples from cultural products (films, TV drama, pop music, commercials, novels, comic books, etc.)\nWith PPT slides (includes references and a list of work distribution)",
    "materials": "All materials will be provided by the instructor.",
    "consultation": "Office: 共同科館 409email: kpchen@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
