[
  {
    "name": "\n  李雅婷",
    "email": "ting881165@ntut.edu.tw",
    "latestUpdate": "2022-08-29 11:12:37",
    "objective": "「全民國防教育法」自民國 95 年 2 月開始施行，以國際情勢、國防政策、全民國防、防衛動員、國防科技五大主軸作為全民國防教育的課程規畫。「國際情勢」單元，主要論述區域安全與兩岸情勢發展，培育學生宏觀的國際視野；更進一步說明在全球化浪潮下，國際重要的安全議題及我國的因應之道。「國防政策」單元，在論述我國國防政策內涵及大陸政策的發展，使學生認識當前國防政策施政方針，增進國防安全知識；並介紹我國國家安全法制與危機管理機制，藉此體認國家安全的重要性，加強全民國防意識。「全民國防」單元，主要論述國家意識及全民防衛的概念、內涵與重要性，並介紹國防與經濟、文化、心理的關聯，讓學生理解國防事務其實與生活息息相關，加強全民國防意識，增進對國家的認同。「防衛動員」單元，在探討全民防衛動員的意義與功能，說明全民防衛動員對國家安全的重要性；並介紹青年服勤動員內涵，讓學生體會自己在全民防衛動員體系中所扮演的角色，進而涵養愛國意識，深化全民國防共識。「國防科技」單元，主要使學生了解武器系統概況，並認識國防科技發展與我國國防產業現況，引發對國防科技的興趣，進而認同國防、支持國防。\nIn order to meet the requirement of Act of All-Out Defense Education that put into action in February 2006, the curriculum of All-Out Defense Education Military Training planned by Ministry of Education is divided into five sections: International Situations, National Defense Policies, Civil Defense, Defense Mobilization, and Military Technology. In International Situations, the object is to cultivate students’ broader international perspectives through discussing Asian-Pacific regional security and the development of cross-strait relation. In Civil Defense, the object is to make students aware that national defense affairs are closely related to their daily life. In Defense Mobilization, the object is to let students recognize their roles in all-out defense mobilization system. In Defense Technology, the main object is to let students overview the development of weapon systems, and understand the current development of the nation’s defense technology and defense industry.",
    "schedule": "1/18　　課程設計說明\n※品德教育融入全民國防教育課程【北科好生活 - 校規一二三】\n防衛動員疏散演練 (配合 921 國家防災日演練)\n1. 災防整備\n2. 疏散演練\n2/18　　防衛動員疏散演練 (配合 921 國家防災日演練)\n1. 災防整備\n2. 疏散演練\n分組作業：緊急避難包\n3/18　　1. 防衛動員的基本概念\n1-1 全民防衛動員法制基礎與範疇\n1-2 動員的內涵\n4/18　　1. 防衛動員的基本概念\n1-3 動員的功能與特性\n5/18　　2. 防衛動員與全民國防\n2-1 我國戰略構想\n2-2 防衛動員的具體作法\n6/18　　2. 防衛動員與全民國防\n2-2 防衛動員的具體作法\n7/18　　3. 其餘各國動員制度參照\n3-1 瑞士\n8/18　　3. 其餘各國動員制度參照\n3-2 以色列\n9/18　　※期中考\n10/18　　4. 防衛動員與災害防救\n4-1 我國災害應變機制\n4-2 災害應變知識及技能\n11/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 尋找避難所\n12/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 了解所處環境災難潛勢狀況\n13/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 風災及水災\n14/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 地震及溺水\n15/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 火災\n16/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 交通安全\n17/18　　4. 防衛動員與災害防救\n4-2 災害應變知識及技能 - 緊急避難包\n18/18　　※期末考",
    "scorePolicy": "一、期中考：30 %\n二、期末考：30 %\n三、課堂報告：40 %",
    "materials": "沈明室 (2017)。全民國防教育軍事訓練－防衛動員。臺北：幼獅文化。\n國防部 (2021)。中國民國 110 年國防報告書。臺北：國防部。\n國防部 (2019)。中國民國 108 年國防報告書。臺北：國防部。\n國防部 (2017)。中國民國 106 年國防報告書。臺北：國防部。\n王經緯 (2018)。各國兵役制度之比較研究。\n全民防衛動員署 https://aodm.mnd.gov.tw/front/front.aspx?menu=050&amp;mCate=050\n全民國防教育網 https://aode.mnd.gov.tw/\n全民國防教育學科中心 http://ad.pymhs.tyc.edu.tw/http://203.72.33.38/\n全國法規資料庫 https://law.moj.gov.tw/Index.aspx",
    "foreignLanguageTextbooks": false,
    "remarks": "軍訓室"
  }
]
