[
  {
    "name": "曹筱玥",
    "email": "sytsau@ntut.edu.tw",
    "latestUpdate": "2022-06-08 19:29:00",
    "objective": "本課程之目標在於介紹人機介面設計過程中所需了解之相關專業知識，配合設計實務的操作，使學生能充分了解使用者介面設計的流程以及相關的應用，始其具有能進行人機使用者介面實務製作的能力。課程內容包含介面設計概念模式、介面使用性、人機介面設計程序、使用者需求、介面原型設計、介面設計原則以及使用者測試等。教學將以課堂講授、個案研討以及實作等方式進行，並以報告繳交與課堂發表及作品為評量依據。\nThis course is focused on introducing the knowledge for human-computer interaction (HCI) design, accompanying with design practice. This will allow students to understand the process of user interface design and related application, so as to be capable of practical interface design. The contents include conceptual model, interface usability, HCI process, user requirements, interface prototyping, principles of interface design and user testing. The course is preceded by means of lecturing, case study and practical work, and evaluated by students' reports, oral presentation and design work",
    "schedule": "Week　　Content\n1　　　　Course introduction 課程介紹\n2~10　　Course by Prof. Tsao\n10　　        Human computer system, input/output, control and display design 人機系統概念、顯示控制介面之設計\n11　　　　HCI theory, human cognition and mental model 人機介面設計基礎理論、認知與心智模型\n12　　　　HCI paper study and report 介面設計研究論文研讀報告\n13　　　　Usability engineering 使用性研究、網頁使用性\n14　　　　Task analysis, information architecture, GUI 任務分析、資訊架構、GUI 設計與研究\n15　　　　HCI, usability study project proposal 人機介面、使用性測試專題研究提案\n16　　　　Progress discussion 進度討論\n17　　　　HCI, usability study project presentation 人機介面、使用性測試專題研究發表\n18　　　　Course summary and report submission 課程總結 / 報告繳交",
    "scorePolicy": "Paper study and report 20%, Final project 30%",
    "materials": "Jenny Preece, 1994, Human-Computer Interaction, Pearson: London.\nJakob Nielsen, 1993, Usability Engineering. Morgan Kaufmann: San Francisco.\nLouis Rosenfeld, Peter Morville, Jorge Arango, 1998, Information Architecture. O'Reilly Media Inc: Sebastopol.\nMark Sanders, Ernest McCormick, 1986, Human Factors In Engineering and Design. McGraw-Hill Education.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If the physical class is suspended due to the COVID-19, the Google Meet will be used.\nGoogle Meet URL will be announced at “北科 i 學園 \"\nIf you have any questions, please contact sytsau@ntut.edu.tw</div>"
  }
]
