[
  {
    "name": "陳生明",
    "email": "smchen@ntut.edu.tw",
    "latestUpdate": "2022-06-01 10:45:23",
    "objective": "配合化學及生物學課程之進展，教導學生學習各項基本實驗操作及儀器設備之技巧，進行各項實驗課程，如 COD 的測定，氮莫耳體積之測定，錯合物之生成，氧化還原滴定，蒸汽壓，測量溶解度，反應速率，化學平衡，耐綸 - 6,6 之製備，蛋白質標準定量法，微生物生長曲線測量及微生物序列稀釋，DNA 複製連鎖反應，質體分離及輿圖鑑定以訓練學生養成手腦並用的務實科學素養。\nFollowing the progress of the course of chemistry biology,introduce chemical engineering students to learn basically operations and techniques for several kinds of devices. Scheduling laboratory experiments include the determination of COD, the determination of molar nitrogen volume, the synthesis of complex, the determination of redox titration, vapor pressure, the determination the solubility, rates of chemical reactions, chemical equilibrium, and the preparation of Nylon-6, 6, Bradford Analysis of Protein Quantification, Bacteria Growth curve measurement and Serial Dilution, DNA Polymerase Chain Reactions, Plasmid isolation and restrictions. This course is designed to train students how to use their brain and hands simultaneously and to settle down their science concepts.",
    "schedule": "週 次\t日 期\t實 驗 進 度\n一\t09/13~09/17\t開學打掃、實驗室規則、安全教育講習\n二\t09/20~09/24\t中秋節 (放假一次)\n三\t09/27~10/01\t實驗室規則及安全教育講習\n四\t10/04~10/08\t實驗一 秒表反應測定反應速率\n五\t10/11~10/15\t國慶日 (停課一次)\n六\t10/18~10/22\t實驗二 溶解度之測定及離子強度對溶解度之影響\n七\t10/25~10/29\t實驗三 維生素 C 之含量分析\n八\t11/01~11/05\t實驗四 電腦虛擬實驗 (二) 陽離子分析\n九\t11/08~11/12\t期中考 (停課一次)\n十\t11/15~11/19\t實驗五 錯化合物之合成\n十一 11/22~11/26\t實驗六 化學平衡\n十二 11/29~12/03\t實驗七 酵母細胞固定化\n十三 12/06~12/10\t實驗八 微生物生長曲線及微生物序列分析\n十四 12/13~12/17\t實驗九 質體分離及輿圖鑑定\n十五 12/20~12/24\t實驗十 DNA 聚合鏈鎖反應與電泳分析\n十六 12/27~12/31\t元旦 (停課一次)\n十七 01/03~01/07\t實驗室器材整理及打掃\n十八 01/10~01/14\t期末考",
    "scorePolicy": "1、期末考佔 25%。    2、平常表現佔 40%。   3、報告佔 35%。  \n4、遲到每一次扣平常表現分數 5 分。  5、每次曠課扣平常表現分數 10 分。 \n6. 每次發言加平常表現分數 1 分。",
    "materials": "普通化學實驗 (含生物實驗)",
    "consultation": "老師分機 #2552, 老師辦公室：國百館 404",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
