[
  {
    "name": "\n  李旻璁　教師諮商時間(Office Hours) ",
    "email": "mtlee@ntut.edu.tw",
    "latestUpdate": "2022-08-10 11:20:14",
    "objective": "[ Information -- Line/Google Meet/Youtube ]\n(1) Please join the class Line Openchat:\nhttps://line.me/ti/g2/kq2WPTcDitojTp8D9h-_RCf0iYvj2KOexlDk_A?utm_source=invitation&amp;utm_medium=link_copy&amp;utm_campaign=default\n(2) For online course broadcasting, please use the following link:\nhttps://meet.google.com/dno-kpxx-wjg\n(3) Any recorded video can be found in the Youtube Playlist:\nhttps://youtube.com/playlist?list=PL8heLgO8UqyMUJtJYOOOymEMHDbZsOxSZ\n\n[Notice] \nThis is an EMI course, meaning 100% in English. I'll only ecture in English, only respond to questions asked in English, and only grade hw&amp;exam written in English.\n\n[Syllabus]\nIn short, this course teaches students how to code. The course introduces the fundamentals of computer programming. Students will learn the basic components of computer language and the algorithms for coding. \n\nThe goal is to help students feel confident in mapping scientific problems into computational framework, designing mathematical algorithms, and writing and debugging programs for specific tasks. We will use gfortran compiler on Ubuntu to learn Fortran – the language which has a long relation with scientific computing in Chemical Engineering.",
    "schedule": "(01) Class introduction, basic knowledge in computater programming\n(02) Linux Basic bash commands in Ubuntu\n(03) Vim editor and program compilers\n(04) the structure of the program, compile and execute a program\n(05) I/O\n(06) Math operators and functions\n(07) Do loop\n(08) If and logic control\n(09) array\n(10) file\n(11) subroutine and module\n(12) Numerical methods\n(12) Numerical methods\n(13) Numerical methods\n(13-18) Course project and Python",
    "scorePolicy": "# Class participation (60%, based on Rubrics)\nPlease bring a piece of A4-sized paper to the class. You will need to answer pop questions during the class. This \"learning sheet\" is used to evaluate the class attendance and participation.\n# Final exam (40%, closed book) \nIt will be held in the 17th or the 18th week.",
    "materials": "The learning materials will be available online.",
    "foreignLanguageTextbooks": false,
    "remarks": "Please use your school Microsoft account for delivering any class work.\nPlease send to 11966@cc.ntut.edu.tw\nPlease use formal format for email title and the name of the attachement."
  }
]
