[
  {
    "name": "杜敏誠",
    "email": "mtu@ntut.edu.tw",
    "latestUpdate": "2022-05-28 14:07:41",
    "objective": "In this course, not only professional fields of civil engineering including structural engineering, geotechnical engineering, construction management, ecological engineering and disaster prevention, water resources and hydraulic engineering, and spatial information are introduced, but also environmental, ecological, societal, and cultural issues are emphasized. The most important point is focused on the relationship between civil engineering and environment such that students who take this course can understand environment, appreciate ecology, and pursue sustainable development when they are engaged in civil engineering construction in future. In addition, training of team works and ability to think, design, and carry out a plan by hand are emphasized. Students can plan, design, fabricate, and test a structural model using available material, equipment, and computer-aid software based on knowledge learned from fundamental civil engineering courses.",
    "schedule": "The following schedule is tentative.\n* Hands-on section:\nWeek 1-9 Bridge construction\nWeek 10-15 Building construction\n* Lecture section:\nWeek 1-2 Introductions\nWeek 3 Introduction to civil engineering\nWeek 4 Sustainable development\nWeek 5 Structural engineering \nWeek 6 Bridge engineering\nWeek 7 Geotechnical engineering\nWeek 8 Water resources engineering\nWeek 9 Transportation engineering\nWeek 10 Construction management\nWeek 11 Geographic Information System\nWeek 12 Ecological engineering\nWeek 13 Land development\nWeek 14 Global climate change\nWeek 15-16 Presentations",
    "scorePolicy": "Following percentages are tentative.\n20% Hands-on project (bridge construction)\n15% Hands-on project (building construction)\n15% Presentation\n20% Final exam\n15% Class participation\n15% Attendance",
    "materials": "Materials compiled by the instructor",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >This is an EMI (English as Media of Instruction) class.\nUnder pandemic lockdowns, the class will be hosted on Gather. The link will be announced in class. Students need to find venue and time to work together on hands-on projects.</div>"
  }
]
