[
  {
    "name": "\n  張素薰",
    "email": "shchang@ntut.edu.tw",
    "latestUpdate": "2022-08-01 16:42:03",
    "objective": "本課程利用新聞教材加強英語字彙能力及聽力技巧，　　內容採用電台、報紙、電視的時事、深度報導和全球議題以增強學生英語知識。同時，學生亦可獲得各種有用的聽力技巧以加強英語聽力。\nThis course is designed to increase vocabulary power and develop listening skills in English through up-to-date news. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided to enrich the student's English knowledge. Effective listening skills are reinforced to enhance the student's listening comprehension.",
    "schedule": "Journalistic English &amp; Listening Training\nI.　　Introduction:\nThis course is designed to fortify English listening and speaking abilities by exploring different aspects of the contemporary themes in which vocabulary build-up and its application to relevant topics are emphasized. Current events, in-depth reports as well as global issues from radio, newspapers and T.V are provided. \nII.　　Basic Doctrines:\n1. Expose students to cosmopolitan themes that are up-to-date, sophisticated and varied in tone, with a view to stimulating students more profoundly and to accelerating their retaining and using in the target language.\n2. The films of contextually rich—cultural background and competent knowledge-related to the corresponding themes are provided to integrate the skills of the target language.\n3. Language capability and performance are equally stressed and developed.\n4. Students’ active participation is essentially required.\n5. Individual reflection is perceived by pair and group works, out-of-class assignments for review and research, oral reports and specific presentations.\n\nSyllabus for 4E1 Multimedia English Listening and Speaking,\n2022 (1) 一一一學年度第一學期\nGroup A\nWeek　　Modern Family　　FTVN News　　Language Skills\n1 (9/12)　　Introduction\n2 (9/19)　　Pilot (1)\n1. Claw machine arcades boom amid COVID, in sign of sluggish economy (2022/06/10)　　\n3 (9/26)　　The Bicycle Thief (2)　　2.　　Convenience store vans bring vital services to Taiwan’s more remote communities (2022/05/23)　　Finding Faults\n4 (10/3)　　Come Fly with Me (3)　　3.　　Expert shares ways to cut power bills as Taiwan’s electricity use hits monthly high (2022/06/23)　　Your Talk\n5 (10/10)　　Double Tenth Holiday\n6 (10/17)　　The Incident (4)\n4.　　Taiwanese volunteers deliver medical supply donations to Ukraine (2022/05/18)　　Radio Commercial, 1.5-2ms, group work\n7 (10/24)　　Coal Digger (5)\n5.　　500 days after COVID recovery, immunity drops to 30%: study (2022/06/20)　　The Importance of Nonverbal Communication\n\n8 (10/31)　　School Anniversary \n9 (11/7)　　PowerPoint Presentation concerning sale products, 2-2.5ms per person\n10 (11/14)　　Run for Your Wife (6) 　　6.　　Monkeypox patients first develop rash in mouth: doctor (2022/06/27)　　Self-examination\n11 (11/21)　　En Garde (7)\n7.　　Shortage of silicon chips, COVID and Ukraine spur new car shortage, secondhand boom (2022/05/12)　　Outline Delivery\n12 (11/28)　　Great Expectations (8)　　8.　　TSMC expects 30% revenue growth in 2022 despite global uncertainties (2022/06/08)　　Accent Presentation, 4-5ms, group work \n13 (12/5)　　Fizbo (9)\n9.　　Private universities fear closures as student population hits historic low (2022/06/27)　　Manuscript Delivery\n14 (12/12)　　Undeck the Halls (10) 　　10.　　Taipei schools offer daycares as kids switch to distance learning (2022/05/23)　　The Voice\n15 (12/19)　　Up All Night (11) \n11.　　Rules must change to protect wildlife from water sports: Liuqiu officials (2022/06/23)　　Dubbing, 3-4ms, group work\n16 (12/26)　　Group PowerPoint Presentation concerning world issues, 10-12 minutes\n17 (1/2)　　Founding Day\n18 (1/9)　　Group Meeting + Final Report",
    "scorePolicy": "III.　　Assessment:\n1.　　Weekly tests and Attendance 80%\n2.　　Oral reports and presentations. 20%\nIII. Evaluation for Home Quarantine: \n1. Weekly Test (individual test, 60%, group activities, 40%) 80%\n2. Presentations and Final Report. 20%\nIV.　　The way to get into contact with the teacher:\n1.　　Teacher’s e-mail: shchang@ntut.edu.tw",
    "materials": "handouts compiled by the teacher",
    "foreignLanguageTextbooks": false,
    "remarks": "email: shchang@ntut.edu.tw"
  }
]
