[
  {
    "name": "余盛延",
    "email": "syyu@ntut.edu.tw",
    "latestUpdate": "2022-06-05 15:27:26",
    "objective": "當代英美流行小說，例如：帶珍珠耳環的少女，時空旅人之妻，姊姊的守護者，暮光之城系列等等，主題推陳出新，內容扣人心弦，有的反應當前的文化議題，有的表現出創新的文學想像，在在都激發著同學們閱讀原文小說的興趣。又由於小說的書寫語言為當今英語世界所使用，沒有年代隔閡，所以原文流行小說也是優良的英語學習材料。在字彙，片語，句型，段落及文章結構，到故事情節發展與深入探討主題的每個層面上，都提供了豐富的素材，供同學們學習觀摩。因此，本課程將挑選不同類型之時下英美流行小說四本，每月一本，規劃進度，在課堂上進行導讀與討論，並加強字彙，句型，與文章結構上的分析，幫助同學們在英語書寫，閱讀技巧，跨文化了解與思辨能力上，獲得最大的進步！\nContemporary popular novels originally written in English, such as the Girl with a Pearl Earring, the Time Traveler's Wife, and the Twilight, have a strong appeal to readers worldwide, but non-native English speakers often enjoy these works in translated versions or film adaptations.  To encourage our students to read these popular English novels in the original language, the instructor will choose four novels of various subject matters and use them as effective teaching materials in the classroom. The objectives are (1) to enrich students' cultural background knowledge of the English speaking world today, (2) to cultivate students' life-long reading habit of keeping up contemporary materials, and (3) to strengthen their critical thinking as well as language skills, especially reading and writing, through line-by-line close readings in the context and guided discussions on the narrative structures of the whole fiction.",
    "schedule": "09/12-13\tIntroduction\n\n09/19-20\tA Wild Sheep Chase \n\n09/26-27\tA Wild Sheep Chase \n\n10/03-04\tA Wild Sheep Chase \n\n10/10-11\tA Wild Sheep Chase \n\n10/17-18\tA Wild Sheep Chase \n\n10/24-25\tA Wild Sheep Chase \n\n10/31\n11/01\tA Wild Sheep Chase \n\n11/07-08\tA Wild Sheep Chase \n\n11/14-15\tDance Dance Dance  \n\n11/21-22\tDance Dance Dance \n\n11/28-29\tDance Dance Dance \n\n12/05-06\tDance Dance Dance\n\n12/12-13\tDance Dance Dance \n\n12/19-20\tDance Dance Dance \n\n12/26-27\tDance Dance Dance \n\n01/02-03\tFinal Exam\n\n01/09-10\tReview and Discussion",
    "scorePolicy": "Grading policy: attendance and quizzes: 20%; oral presentation: 30%; final examination: 50%.",
    "materials": "A Wild Sheep Chase (1982, 1989) and Dance Dance Dance (1988, 1994).",
    "consultation": "R804 Office Hours: Mon. 2:10-3:00 p.m., Tue 1:10-3:00 p.m., and Wed. 4:10-5:00 p.m.https://meet.google.com/fkt-jfam-ppiEmail: syyu@ntut.edu.tw",
    "remarks": "本學期原則採實體授課方式；因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 1. 若學校因應疫情規定遠距教學，則使用下面平台上課: https://meet.google.com/fkt-jfam-ppi2. 我的聯絡方式（E-mail）：syyu@ntut.edu.tw",
    "foreignLanguageTextbooks": true
  }
]
