[
  {
    "name": "\n  溫淑姿",
    "email": "sophiawensophiawen@yahoo.com.tw",
    "latestUpdate": "2022-09-14 11:47:02",
    "objective": "課程以研討西洋美學與藝術概論為宗旨，並藉由藝術品、鑑賞與審美三項元素深入了解這二個學門之間的互輔關係。課程介紹除了專業知識的取得，也包含了美的認知。藝術品是創作者以審美的方式呈現社會生活與個人心靈活動的成果；如果藝術鑒賞是一種審美享受，那麼藝術鑒賞可被視為一種藝術再創造活動。這其中的美學除了創作者的審美活動、形象性、情感、想象、虛擬以及物質符號性，也包括鑑賞者的本質、個體性、藝術鑒賞的體驗性與直感性。藉由這些項目的探討並認識西洋美學與藝術。\nHuman beings are animals of the story. As long as there are people, there will be stories. As soon as a child sat on his mother's lap, the story is his way of understanding the world. Human civilization for thousands of years circulated tirelessly through the accumulated stories. From both the East and the West, the Plato and China's \"Book of Poetry\", even the Analects of Confucius, Zhuangzi, mythology, Buddhism, or the Greek philosophy of \"Dialogue\" all recorded with the form of stories. The influence of the story not only became the rule of history and an important tool of social and moral teachings, they also became the anti-mainstream values expressions. The story even forms meanings in personal investigations. Moreover, in today's information society, story is no longer the power of writers and artists, the story has become the skills of leadership and charisma, and the power of the plot has become the key to the construction of marking brands.",
    "schedule": "1.　　開場\n2.　　古藝術溯源：文藝復興\n3.　　古藝術溯源：古希臘羅馬\n4.     古藝術溯源：古埃及與遠古\n5.　　現代性與印象主義\n6.     印象主義之後與象徵主義\n7.     表現主義與野獸主義\n8.     立體主義及其延伸\n9.     未來主義與結構主義\n10.   抽象藝術及其相關\n11.   達達主義及其相關\n12.   超現實主義及其他\n13.   抽象表現主義及其相關\n14    美國戰後藝術\n15    歐洲戰後藝術   \n16    藝術講座\n17    期末報告\n18    期末報告",
    "scorePolicy": "1 個人作業：圖畫週記、課堂參與，20%\n2 個人期末考試。 30%\n3 小組作業：每周預習複習。 10%\n4 小組期末報告：報告計畫定期追蹤及期末報告，口頭與撰文。 30%",
    "materials": "一、主要課本\n1.  藝術的故事，宮布利希著， 雨云譯。台北市：聯經，2008。  \n2.  現代藝術的故事， Norbert Lynton 著， 楊松譯，台北市：聯經，2003。\n二、參考書籍\n1.  東京藝大美術館長教你西洋美術鑑賞術：無痛進入名畫世界的美學養成，秋元雄史著，羅淑慧譯，台北市：方舟文化， 2019。\n2.  現代藝術的故事：這個作品，為什麼這麼貴？岡波茲 (Gompertz, Will), 著；陳怡錚，譯，臺北市：大是文化，2019。\n3.  看懂設計，你要懂的現代藝術，岡波茲 (Gompertz, Will); Gompertz, Will.; 陳怡錚譯，臺北市：大是文化，2013。",
    "foreignLanguageTextbooks": false,
    "remarks": "課程洽詢課堂中進行"
  }
]
