[
  {
    "name": "李來春",
    "email": "f10666@ntut.edu.tw",
    "latestUpdate": "2022-06-08 12:10:15",
    "objective": "The course aims to develop broad understanding on interaction design for students, based on theory and practice course structure. Course topics include essential factors of interactive system, interaction design theory and practice, methods and techniques, technical support and application. Course also incorporates case studies, company visits and exhibitions relevant to interaction design to enhance the understanding of integrating theory and practice.",
    "schedule": "W1 Introduction to the course \nW2 First principles of interaction design-user experience\nW3 First principles of interaction design-user experience\nW4 Interaction design VS Human-computer interface – Dialogue with computer  \nW5 Human factors of human-computer interface\nW6 Human-computer interface usability\nW7 Human-computer interface user experience design\nW8 Interaction design VS Exhibition technology - Interactive exhibition of the infinite charm of technology \nW9 Mid-term report\nW10  Analysis and Research on Applied Exhibition Design\nW11  Analysis of performance design\nW12  Interactive application analysis\nW13  Application of super exhibition design\nW14  Interaction design VS Digital learning- The future trend of interactive learning\nW15  Digital learning under the evolution of interactive technology\nW16  Interactive digital learning techniques and tools\nW17  Application cases of interactive digital learning\nW18  Final term-group report",
    "scorePolicy": "Attendance 25%\nMid-term report 35%\nFinal term-group report 40%",
    "materials": "Lai-chung Lee, Hsiao-yue Tsao, Chun-Ching Chen (2018), Introduction to Interaction Design, Taipei: Chuan Hwa Book Co., Ltd.",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >In response to the changes of the epidemic, this course will adopt the distance teaching of Google Meet. The relevant link will also be placed in the Taipei Tech I Academy.</div>"
  }
]
