[
  {
    "name": "\n  朴維鎮 ",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-08-17 14:54:01",
    "objective": "Statistical design of experiments is a wide subject that treats a large number of methods for planning experimental investigations in a manner that ensures statistically valid conclusions. This course introduces students to concepts and techniques of classical and applied experimental design and covers the statistical design of experiments for systematically examining how a system functions. Topics covered will include: introduction to fundamentals and principles of experiments, blocking designs, completely randomized designs (CRD), randomized completely block designs (RCBD), full factorial designs with two levels, fractional designs with two levels, Latin square designs, 3-leval designs (CCD, BBD, Cuboidal designs), response surface methodologies, nested and split-plot designs, and optimal design theories.",
    "schedule": "Week 1 Introduction to fundamentals of engineering statistics and principles of experimentation\nWeek 2 Simple comparative experiments: One-way ANOVA\nWeek 3 Simple comparative experiments: CRD (Completely randomized design)\nWeek 4 RCBDs (Randomized complete block designs)\nWeek 5 Factorial designs and 2-level factorial designs\nWeek 6 2-level fractional factorial design and resolution – Part I\nWeek 7 2-level fractional factorial design and resolution – Part II\nWeek 8 3-level (fractional) factorial designs and multi-factor designs – Part I \nWeek 9 3-level (fractional) factorial designs and multi-factor designs – Part II\nWeek 10 Fitting regression model: Estimation, diagnostics and prediction – Part I \nWeek 11 Fitting regression model: Estimation, diagnostics and prediction – Part II \nWeek 12 Part II Midterm exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 13 Random effects models – Part I\nWeek 14 Random effects models – Part II\nWeek 15 Response surface methodology and process optimization (including EVOP &amp; Simplex EVOP) – Part I\nWeek 16 Response surface methodology and process optimization (including EVOP &amp; Simplex EVOP) – Part II\nWeek 17 Box-Cox transformation and GLM (Generalized linear model), Taguchi method\nWeek 18 Final exam (In-Class, 1 Cheat sheet, Calculator)",
    "scorePolicy": "Exam: 30 %\nAssignment: 15 %\nIndividual project: 50%\nAttendance: 5 %",
    "materials": "Montgomery, D. C. (2017), Design and Analysis of Experiments, 9th Ed., Wiley. \nSupplementary references: Will be noticed if necessary.\nAdditional materials will be covered from other texts and/or from recent literature.",
    "foreignLanguageTextbooks": true,
    "remarks": "Email or i-school system."
  }
]
