[
  {
    "name": "羅元隆",
    "email": "yllo@ntut.edu.tw",
    "latestUpdate": "2022-09-17 17:15:20",
    "objective": "This course aims at providing a learning opportunity to use MATLAB programs to solve statistical analysis problems. MATLAB is one of the common mathematic analysis software and a very popular language in data mining. Its multidisciplinary platform function and built-in orders for statistic calculation and drawings can literally be powerful for statistics learning. In this semester, the schedule includes basic MATLAB practices, engineering statistics, associate practice examples, problems involving extreme value analysis, and problems involving reliability analysis.\nThe goal of this course is to teach students how to use the open source software R for statistical analysis. R is currently the most commonly used free, open source, and cross-platform statistical software. It has many statistical functions, graphing tools, and its own programming language. Because of its many potential applications, the familiarity of this software could help students in the pursue of their chosen career paths, whether in industries or academic researches. This course will cover the various aspect of R, including installation, operation, data analysis, and program development. An entry-level statistical course is required before taking this course.",
    "schedule": "W1：Basic MATLAB practice\nW2：Basic MATLAB practice\nW3：Roles of Probability and Statistics in Engineering\nW4：Fundamentals of Probability Models\nW5：Analytical Models of Random Phenomena\nW6：Analytical Models of Random Phenomena\nW7：Functions of Random Variables\nW8：Functions of Random Variables\nW9：Mid-term Examination\nW10：Computer-Based Numerical and Simulation Methods\nW11：Computer-Based Numerical and Simulation Methods\nW12：Statistical Inferences from Observation Data\nW13：Statistical Inferences from Observation Data\nW14：Determination of Probability Distribution Models\t\nW15：Determination of Probability Distribution Models\t\nW16：Problems Involving Extreme Value Analysis\nW17：Problems Involving Reliability Analysis\t\t\t\t\nW18：Final Examination",
    "scorePolicy": "Attendance: 15%\nClass Performance: 15%\nMid-term Exam: 25%\nFinal Exam: 25%\nReport: 20%",
    "materials": "Probability Concepts in Engineering Emphasis on Application to Civil and \nEnvironmental Engineering, Alfredo H-S. Ang and Wilson H. Tang, John \nWiley & Sons, Inc., 2007, 2nd Edition.",
    "consultation": "The timetable from 1 to 2 PM every Monday and Tuesday is the consultation time. If necessary, the timetable from 1 to 3 PM every Wednesday can also be reserved. Please write a mail to yllo@mail.ntut.edu.tw in advance to make the appointment.",
    "remarks": "Due to Covid-19, this course will possibly be given in remote lecturing because of the requirement from the university. If so, the online meeting interface of Google Meet will be adopted and the real-time recording will be uploaded to the Taipei Tech i-Campus website. The class quizzes will be replaced with assignments. The mid-term and the final written examinations will be given in class conventionally. However, this is also adjustable depending on the Covid-19 situation. If necessary, a Line based online group will be setup for flexible discussion activities for students.",
    "foreignLanguageTextbooks": true
  }
]
