[
  {
    "name": "\n  呂良賜",
    "email": "normanlu@ntut.edu.tw",
    "latestUpdate": "2022-06-20 16:57:53",
    "objective": "The course content mainly introduces various physical methods used in the research process of inorganic chemistry. First, the basic principles of spectroscopy are introduced. The various spectroscopic techniques applied to inorganic chemistry and solid materials will then be discussed in more depth. Including: various absorption spectroscopy, nuclear magnetic resonance spectroscopy, electron paramagnetic resonance spectroscopy, X-ray absorption spectroscopy and X-ray diffraction and other commonly used analytical techniques in chemistry are also included in the course discussion. The content includes chemical bonds, molecular vibrations, electronic spectra of transition metal compounds, atomic cluster compounds and crystal structures.",
    "schedule": "Chapter 1 Atomic Structure and Periodic System of Elements (Week 1)\nChapter 2 Molecular Structure and Intermolecular Forces (Week 2, Week 3)\nChapter 3 Crystal Structure (Week 3, Week 4)\nChapter 4 Coordination Compounds (Week 5, Week 6)\nChapter 5 Organometallic Compounds and Metal Cluster Compounds (Week 7, Week 8)\n(Ninth week - midterm exam)\nChapter 6 Non-Aqueous Solutions Chemistry (Week 10, Week 11)\nChapter 7 Hydrogen and Noble Gases (Week 11, Week 12)\nChapter 8 Alkali Metals and Alkaline Earth Metals (Weeks 12, 13)\nChapter 9 Main Group Elements (p-Block) and Even Compounds (Week 14)\nChapter 10 Transition elements (d-block, ds-block) and their compounds (Week 15)\nChapter 11 Inner Transition Elements (Block F) (Week 16)\nChapter 12 Bioinorganic Chemistry (Week 17)\n(Week 18 - Final Exam)",
    "scorePolicy": "grading：\nMid-term  30%\nattendance &amp; others 30%\nFinal  40%",
    "materials": "Textbook:Introduction to modern\nInorganic Chemistry,5th edition\nAuthor:Mackay Henderson\nPublishing company: Stanley Thomas",
    "foreignLanguageTextbooks": true,
    "remarks": "Fri 1:30-2:30 pm"
  }
]
