[
  {
    "name": "\n  嚴佳茹 ",
    "email": "janiceyen@ntut.edu.tw",
    "latestUpdate": "2022-09-01 21:56:35",
    "objective": "This course is composed of independent study and group exercises with proctored weekly lectures that will cover the technical requirements of the Taiwan Green Building Green Building Rating System, EEWH. Additionally, this course will focus on providing an overview of the knowledge required for taking the EEWH Accreditation. The course will provide students with an understanding of how EEWH is being used throughout the design and construction industries to define various levels of sustainable project design and a credit-by-credit review of the Rating System.",
    "schedule": "W1: Course Introduction\nW2: Agenda of global climate change and sustainability\nW3: Trends between International and domestics of Sustainable Architecture Design (EEWH system)\nW4~W7: Ecology category (Indicators of Biodiversity, Greenery and Water content of the site)\nW8~9: Mid-term Assignment and Oral presentation \nW10~W12: Energy Saving(Indicators of Daily Energy Conservation(prerequisite))\nW13~W14: Waste Reduction category (Indicators of CO2Emission Reduction, Construction Waste \nW15~W16: Health category (Indicators of Indoor Environment, Water Conservation (prerequisite), Sewage and waste disposal facility improvement)\nW17&amp;W18: Final Assignment and Oral presentation",
    "scorePolicy": "Participation (include attendance, discussion) 40%\nMidterm Assignment and Oral presentation 30%\nFinal term Assignment and Oral presentation 30%\n\nRequired prerequisites course:\nArchitecture Physics and Architecture Environmental Control System",
    "materials": "．Green Building Evaluation Manual Basic Version, 2022, ABRI\n．Cai Renhui，2013，Taipei Tech ECO Campus, ISBN 978-957-43-0789-0\n．Michael Bauer, Peter Mösle and Michael Schwarz ,2010,Green Building – Guidebook for Sustainable Architecture, Springer Heidelberg Dordrecht London New York ,ISBN 978-3-642-00634-0\n．7group, Bill Reed, S. Rick Fedrizzi, 2009, The Integrative Design Guide to Green Building: Redefining the Practice of Sustainability, John Wiley &amp; Sons, Inc., Hoboken, New Jersey",
    "foreignLanguageTextbooks": true,
    "remarks": "extension # 2935\noffice Room No.165\nEmail: janiceyen@ntut.edu.tw\nOffice hour / Wednesday from 9am to 1pm"
  }
]
