[
  {
    "name": "黃少妤",
    "email": "phsophia@gmail.com",
    "latestUpdate": "2022-09-12 23:45:51",
    "objective": "Since the mid-twentieth century, there is evidence of a substantial shift in the center of debates within architecture and its relationship with other academic disciplines, particularly cultural studies and philosophy. It, however, was a reciprocal process. Not only are architects and architectural theorists becoming close to ideas of cultural theory, but significant numbers of cultural theorists, philosophers and sociologists are to be found highly engaged with questions of architecture and the built environment. However, it has been recently found that architects and students of architecture may struggle to deeply navigate those thinkers' work, resulting in unexpected distances and hazes between disciplines. Therefore, there are two intentions for forming this module. Firstly, it attempts to introduce architecture to a broader cultural context and to consider how debates from cultural theory might begin to inform a discussion about architecture (Leach 1997). Secondly, it tries to locate architectural thinking in the body of significant work of cultural studies, which helps decode terms and provide a clear pathway to critical thinkers (Sharr 2007). This module is structured by some selected cultural figures whose writings have profoundly impacted architectural designers and critics in distinctive ways. Followingly, the very question of what architecture's definition will be reconsidered with more vibrant and plentiful contents.",
    "schedule": "W1: Introduction of the module- architecture and cultural theory \nW2: Henri Lefebvre 01 (theory and narrative)\nW3: Henri Lefebvre 02 (architecture)   \nW4: Henri Lefebvre 03 (city and action)\nW5: Jacques Derrida 01 (theory and narrative)\nW6: Jacques Derrida 02 (architecture)  \nW7: Jacques Derrida 03 (architecture+) \nW8: Guest speaker 01 \nW9: Reading week \nW10: Homi K. Bhabha 01 (theory and narrative)  \nW11: Homi K. Bhabha 02 (city and architecture)\nW12: Guest speaker 02   \nW13: Paul Virilio 01 (theory and narrative)\nW14: Paul Virilio 02 (architecture)  \nW15: Paul Virilio 03 (city)\nW16: Essay topic discussion \nW17: Issue debates and roundtable discussion  \nW18: Final report submission",
    "scorePolicy": "> Final essay report (50%): \nEach student gives a summary presentation and a 2000-1500 words essay to answer some specific critical questions based on the selected philosopher.\n\n>Topic report (30%): \nAn oral presentation: to demonstrate the understanding of the theory that has been introduced in one of the classes.\n  \n>Class attendance (20%):\nThe excused absence with advance notice is acceptable.\n(PG students two times only, UG students four times only)\nThe layout of the final report must meet the basic academic requirements, and the final report should include the title, keywords, related visual information and other items which will be provided in more detail in the class.",
    "materials": "Armitage, John. 2015. Virilio for Architects. London: Routledge.\nBallantyne, Andrew. 2007. Deleuze & Guattari for Architects. 2007. London: Routledge.\nColeman, Nathaniel. 2014. Lefebvre for Architects. London; New York: Routledge.\nCoyne, Richard. 2011. Derrida for Architects. London: Routledge.\nCrysler, Greig, Stephen Cairns, and Hilde Heynen, eds. 2012. The SAGE Handbook of Architectural Theory. London: SAGE.\nHernandez, Felipe. 2010. Bhabha for Architects. London: Routledge.\nLeach, Neil, ed. 1997. Rethinking Architecture: A Reader in Cultural Theory. New York: Routledge.\nRendell, Jane, ed. 2008. Critical Architecture. London: Routledge.",
    "consultation": "以下方式諮詢 Email: shaoyuhuang@mail.ntut.edu.tw 學校分機：#2932 老師諮詢辦公時間",
    "remarks": "> 學生分兩組；一組學生以遠距上課一組學生實體上課，每週對調。有特殊需求者可以遠距上課為主。課程錄影將視需求以適當方式提供學生於非課堂時間學習 > 建立學生常使用的網絡社團，即時更新課堂資訊與確保問題交流 > 評量方式：線上報告與繳交電子檔案 > 上課網址：https://moe-tw4.webex.com/meet/shaoyuhuang",
    "foreignLanguageTextbooks": true
  }
]
