[
  {
    "name": "蔡榮發",
    "email": "jftsai@ntut.edu.tw",
    "latestUpdate": "2022-06-06 10:16:55",
    "objective": "The purpose of this course is to discuss how to use quantitative management decision-making models to analyze various management problems. The methods for solving the decision-making models include: linear programming, integer programming, nonlinear programming, hierarchical analysis process and network process etc. The course content is mainly based on case illustrations such that students can understand how the theory is combined with practical problems. Therefore, various practical application problems in engineering and management will be used to explain the models. Optimization software and decision-making tools will be used to solve the problems and assist in explaining the management implications of the obtained data, and perform model cost-benefit analysis.",
    "schedule": "W1 Introduction to quantitative management decision-making models\nW2 Linear programming: application problems solved with Lingo\nW3 Linear programming: application problems solved with Lingo\nW4 Linear programming: application problems solved with Lingo\nW5 Linear programming: application problems solved with Lingo\nW6 Simplex method\nW7 Duality and sensitivity analysis (Homework 1 due)\nW8 Goal programming \nW9 Integer linear programming: application problems\nW10 Integer linear programming: application problems \nW11 Integer linear programming: application problems \nW12 Midterm exam \nW13 Decision analysis \nW14 Decision analysis (Homework 2 due)\nW15 Game theory with application problems\nW16 Presentation &amp; paper discussion\nW17 Presentation &amp; paper discussion \nW18 Presentation &amp; paper discussion",
    "scorePolicy": "Homework: 15% \nMidterm: 35%\nPaper presentation: 35%(Papers selected from Journal: INFOR, MS, OR, EJOR, C&amp;OR…)\nPresent situation: 15% (No more than three absences)",
    "materials": "Textbook:\nHamdy A. Taha, Operations Research- an introduction, 2017, 10th Edition, Prentice Hall.\nReferences:\n1、Optimization Modeling with Lingo, 2001, LINDO System INC.\n2、Wayne L. Winston, Operations Research- Applications and Algorithms, 2004, Thomson.\n3、Selected journal papers.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If Taipei Tech announces distance learning, the course will be conducted by: \nOnline course platform: WEBEX.\nCourse materials: Taipei Tech iStudy.\nAnnouncement via: Email, LINE.\nContact instructor:Email: jftsai@ntut.edu.tw</div>"
  }
]
