[
  {
    "name": "\n  李鎮宇　教師諮商時間(Office Hours) ",
    "email": "G.C.Li@ntut.edu.tw",
    "latestUpdate": "2022-09-14 21:56:48",
    "objective": "This course introduces the methods essential to business research. The first focus is on research methods, particularly applied quantitative statistical analysis—interpreting results, as well as applying them to actual data. Students should become informed consumers of statistics—to be able to understand and assess the quality of statistical methods in the papers they read, and to use those methods in their research. The second focus is on research design and data collection methods, which will be essential to master’s dissertation, and practical business roles (such as consultant or market researcher). Students will participate in a project in which they have the chance to collect and analyze their data.\n\nThe course is on fundamentals, up to multiple regression, so we will not have time to discuss more advanced statistical techniques. However, you should leave this class with a solid foundation for further education on these topics.",
    "schedule": "1 9/16 Understanding Research\n2 9/23 Dealing with practical issues\n3 9/30 Research paradigm &amp; designs\n4 10/7 Literature review\n5 10/14 Research proposal\n6 10/21 Qualitative analysis\n7 10/28 Statistics Review 1(Numerical summaries, Contingency, Confidence intervals, significance testing)\n8 11/4 Statistics Review 2(Comparing 2 groups, association between categorical variables)\n9 11/11 Exam Week\n10 11/18 Regression Analysis (Correlation, multiple regression, mediation, moderation, logistic regression)\n11 11/25 Experimental Research\n12 12/2 Collecting data for statistical analysis\n13 12/9 Questionnaire design\n14 12/16 Writing your dissertation or thesis\n15 12/23 Data collection in class\n16 12/30 Publishing your research\n17 1/6 Group Presentations – 15%\n18 1/13 Exam Week",
    "scorePolicy": "40% Participation, homework, quizzes\n20% Midterm Report\n5% Assignment 1: Research question\n5% Assignment 2: Questionnaire design\n15% Topline findings presentation\n15% Report final\n100% Total",
    "materials": "“Business Research: A Practical Guide for Students”  5th Edition\nAuthors: Jill Collins, Roger Hussey",
    "foreignLanguageTextbooks": true,
    "remarks": "Email the instructor"
  }
]
