[
  {
    "name": "\n  呂怜樺　教師諮商時間(Office Hours) ",
    "email": "lhlu@ntut.edu.tw",
    "latestUpdate": "2022-06-23 10:47:47",
    "objective": "The goal of this course is to survey the major theoretical perspectives in organizational theory (OT). More specifically, we introduce the foundation questions of the strategy field and focus on the strategy ‘content” research in this class. The major purpose of this class is to expose students to samples of contemporary strategy content research and to point out some access points to the broader universe of thought on each topic. In other words, we will start from the fundamentals in order to have a solid understanding of the theoretical approach. This elaboration will be followed by a more in-depth exploration of the empirical articles assigned for each week, and how this contributes to organization theory. Finally, we will move on to the assessment and critique of the theoretical view. One or two students will be assigned to lead each week’s discussion.",
    "schedule": "Week 1: Introduction the perspective of Organization Theory(0914)\nWeek 2: Session 1: Introduction: Research Design and Approaches of Strategic management (0921)\nWeek 3: Organization Design (0928) \nWeek 4: Why we need theory (1005)  \nWeek 5: Session 3: Industry and competitive strategy (Transaction Cost Theory) (1012)\nWeek 6: Session 4: Firm as a System of Incentives (Agency Theory) (1019)\nWeek 7: Session 5: Strategic Assets and Resources within a firm (Resource-Based View (RBV) (1026)\nWeek 8: TEJ Database Introduction (1102) \nWee 9: Mid-Term Project (1109)\nWeek 10: Session 6: The Knowledge Base of a Firm (Knowledge-Based View (KBV)(1116)\nWeek 11: Session 7: Acquire Outside Supporting (Resource Dependent Theory (RDT)(1123)\nWeek 12: Session 8: Network Organizations (Network Theory)(1130)\nWeek 13: Session 9: Evolution Theory (Evolution Theory)(1207)\nWeek 14: Session 10: Institutional Theory (1214)\nWeek 15: Session 11: Performance Feedback as Mechanism (Behavior Theory of Firm (Search Behavior) (1221)\nWeek 16: Session 11: Technological Innovation (1228)\nWeek 17: Session 12: Technological Innovation (0104)\nWeek 18: Final Exam (0111)",
    "scorePolicy": "Leading Discussion (20% of grade)\nClass Preparation and Participation (30% of grade) \nIndividual Paper and Presentation (50% of grade)",
    "materials": "paper assignment",
    "foreignLanguageTextbooks": false,
    "remarks": "1.lhlu@ntut.edu.tw\n2. 02-27712171#3425"
  }
]
