[
  {
    "name": "李鎮宇",
    "email": "G.C.Li@ntut.edu.tw",
    "latestUpdate": "2022-06-02 22:56:06",
    "objective": "This course introduces the methods essential to business research. The first focus is on research methods, particularly applied quantitative statistical analysis—interpreting results, as well as applying them to actual data. Students should become informed consumers of statistics—to be able to understand and assess the quality of statistical methods in the papers they read, and to use those methods in their research. The second focus is on research design and data collection methods, which will be essential to master’s dissertation, and practical business roles (such as consultant or market researcher). Students will participate in a project in which they have the chance to collect and analyze their data.\n\nThe course is on fundamentals, up to multiple regression, so we will not have time to discuss more advanced statistical techniques. However, you should leave this class with a solid foundation for further education on these topics.",
    "schedule": "1. Introduction to Research Methods\n2. Literature Review\n3. Research Proposal\n4. Qualitative and Quantitative Research\n5. Basic Data Analysis\n6. Statistical Inference, Significance Tests\n7. Comparing Two Groups, Association Between Categorical Variables\n8. Regression Analysis, Multiple Regression, ANOVA, Logistic Regression\n9. Midterm Week\n10. Research Design 1\n11. Research Design 2\n12. Questionnaire Design 1\n13. Questionnaire Design 2\n14. In Class Data Collection \n15. In Class Data Workshop\n16. Topline Presentation (group ppt)\n17. Topline Presentation (group ppt) \n18. Exam Week",
    "scorePolicy": "20% Participation, homework, quizzes\n30% Midterm Report\n5% Assignment 1: Research question\n5% Assignment 2: Questionnaire design\n20% Topline Presentation\n20% Final Project Report\n100% Total",
    "materials": "Business Research: A Practical Guide by Jill Collis &amp; Roger Hussey 5th Ed\nhttps://www.bloomsburyonlineresources.com/business-research",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >We will follow the university's regulations. Online link will be provided in case of virtual classroom.</div>"
  }
]
