[
  {
    "name": "\n  王正豪　教師諮商時間(Office Hours) ",
    "email": "jhwang@ntut.edu.tw",
    "latestUpdate": "2022-09-08 11:18:36",
    "objective": "Web search engine has become one of the necessary tools in modern lives. This course aims at investigating how to index large amount of text documents and search what users need in an effective way. We will introduce the basic concepts of information retrieval, characteristics of documents and languages, various retrieval models, evaluation of retrieval results, indexing and searching, text classification, text clustering, and Web search. In addition to texts, we will also introduce some applications of multimedia retrieval.",
    "schedule": "Indexing (3 wks)\nBasic text modeling and evaluation (2-3 wks)\nQuery processing and advanced models (2-3 wks)\nMachine learning in IR (2-3 wk)\nWeb search (2-3 wks)\nAdvanced topics: CLIR, IE, social Web, ... (2 wks)\nTerm project presentation (3 wks)",
    "scorePolicy": "Homework assignments and programming exercises: ~40%\nMid-term exam: ~25-30%\nTerm project and presentation: ~30-35%",
    "materials": "- Textbook:\n. Christopher D. Manning, Prabhakar Raghavan and Hinrich Schuetze, Introduction to Information Retrieval, Cambridge University Press. 2008. (available online at: https://www.informationretrieval.org/)\n- References:\n. Ricardo Baeza-Yates and Berthier Ribeiro-Neto, Modern Information Retrieval: the concepts and technology behind search, 2nd ed. Addison-Wesley, 2011.\n. Bruce Croft, Donald Metzler, and Trevor Strohman, Search Engines: Information Retrieval in Practice, Addison-Wesley, 2010.\n. Stefan Buettcher, Charles L.A. Clarke, and Gordon V. Cormack, Information Retrieval: Implementing and Evaluating Search Engines, MIT Press, 2010.\nPrerequisite:\n. Basic knowledge of data structures and algorithms\n. Programming experience is necessary for homeworks &amp; projects\n- The latest information will be available soon at: https://myweb.ntut.edu.tw/~jhwang/IR/",
    "foreignLanguageTextbooks": true,
    "remarks": "The teacher can be reached via e-mail or messages in Microsoft Teams.\nThe TA will help you join the course group in Facebook\nwhere you can also ask questions about the homeworks and exams."
  }
]
