[
  {
    "name": "\n  林榮禾　教師諮商時間(Office Hours) ",
    "email": "rhlin@ntut.edu.tw",
    "latestUpdate": "2022-09-13 10:53:18",
    "objective": "Innovation Management course focuses on the particular interest to those\nstudents who are considering development of an innovative business opportunity or innovation management skills. This course not only discusses the basics toolkits for every innovator needs, but also provides the practice workshop of systematic innovation. Major topics include how to identifying the opportunity and problem; discover the new ideas; develop the solution; demonstrate the innovation; and the TRIZ works. Many of the examples will also be discussed in their entrepreneurial approaches to innovation.\nObjective: To develop an understanding of innovation toolkits and systematic innovation\napproach to help students making better understanding in innovation management and equipping with the innovation skills needed to pursue a viable career option.",
    "schedule": "Week Date Contents/Topic\n1 Introduction to Innovation Management\n2 Define the Opportunity\n3 Define the Opportunity\n4 Workshop\n5 Define the Problem\n6 Define the Problem\n7 Discover the new ideas;\n8 Discover the new ideas;\n9 Discover the new ideas;\n10 Midterm Exam &amp; Project Proposal\n11 TRIZ-1\n12 TRIZ-2\n13 TRIZ-3\n14 TRIZ-4\n15 TRIZ-5\n16 Workshop\n17 Term Project Presentation\n18 Term Project Presentation",
    "scorePolicy": "Description of Course Details:\n1. Homework and Assignments: 30 %\n2. Quizzes: 10 %\n3. Attendance  20 %\n4. Midterm Project Proposal 5 %\n5. Term Project: 35%",
    "materials": "1. Mam, D.L., “Hands-On Systematic Innovation,” 3 edition, Thomson Higher\nEducation, 2006.\n2. Silverstein, D., Samuel P., and Decarlo, N., “The Innovator's Toolkit: 50+\nTechniques for Predictable and Sustainable Organic Growth,” 2nd edition, John\nWiley &amp; Sons, 2012.\n3. Strategic Management of Technological Innovation, 4th Edition, M.S. Schilling, McGraw-Hill, 2012.",
    "foreignLanguageTextbooks": true,
    "remarks": "Course consultation arrangement:\n 1. Course consultation time can be reserved by email in advance, or\n 2. Consult at the research room 1126 of Hongyu Science and Technology Building on Thursday from 5 to 7."
  }
]
