[
  {
    "name": "\n  陳匡正 ",
    "email": "kchen34@gmail.com",
    "latestUpdate": "2022-05-31 00:20:16",
    "objective": "本課程講授如何使用 Westlaw International 資料庫進行 IP 研究。主要的專利資料庫的檢索方式也會展示。在每堂課前，學生必須要閱讀教材。課堂參與是必須的。其他資訊請見英文課程摘要。\nThis course is intended to expose students to various research skills for studying IP issues. Primarily, this course teaches how to use the Westlaw International database to do IP research. The framework of the database is based on the legal research methodology applied to American law. So, the basic knowledge of the American legal research methodology will be introduced. In addition, this course will demonstrate major patent databases to students. Students will be assgined to one research project. Students are required to study reading materials before each class. Class participation is also required.",
    "schedule": "第一週 (111/9/12~111/9/17) Introduction; Introduction of the U.S. Judicial System (I)\n第二週 (111/9/19~111/9/24) Introduction; Introduction of the U.S. Judicial System (II)  \n第三週 (111/9/26~111/10/1) Introduction of the U.S. Judicial System (III)\n第四週 (111/10/3~111/10/8) Westlaw Legal Database Training\n第五週 (111/10/10~111/10/15) Introduction of the U.S. Judicial System (IV); Hand in the Case Brief (I)\n第六週 (111/10/17~111/10/22) Introduction of the U.S. Judicial System (V)\n第七週 (111/10/24~111/10/29) Introduction of the U.S. Judicial System (VI)\n第八週 (111/10/31~111/11/5) Introduction of the U.S. Judicial System (VII)\n第九週 (111/11/7~111/11/12) Introduction of the U.S. Judicial System (VIII); Hand in the Case Brief (II)\n第十週 (111/11/14~111/11/19) Introduction of the “Bluebook: A Uniform System of Citation” (I)\n第十一週 (111/11/21~111/11/26) Introduction of the “Bluebook: A Uniform System of Citation” (II)\n第十二週 (111/11/28~111/12/3) Introduction of the “Bluebook: A Uniform System of Citation” (III)\n第十三週 (111/12/5~111/12/10) Introduction of the “Bluebook: A Uniform System of Citation” (IV)\n第十四週 (111/12/12~111/12/17) Introduction of the “Bluebook: A Uniform System of Citation” (V)\n第十五週 (111/12/19~111/12/24) Introduction of the “Bluebook: A Uniform System of Citation” (VI)\n第十六週 (111/12/26~111/12/31) Final Week/A Week's Classes Suspension\n第十七週 (112/1/2~112/1/7) Introduction of the “Bluebook: A Uniform System of Citation” (VII); Hand in the Case Brief (III)\n第十八週 (112/1/9~112/1/14) Winter Vacation",
    "scorePolicy": "1. 平時課後作業 80%\n2. 上課出席 20%",
    "materials": "1. McKinney, Ann Ruth &amp; Childs, Scott, Legal Research: A Practical Guide and Self-Instructional Workbook (Thomson/West, 5th ed. 2008).\n2. McKinney, Ann Ruth, Childs, Scott, Flanary-Smith, Amy, Legal Research Online: A Supplement to Accompany McKinney and Childs' Legal Research, Fifth Ed (Thomson/West, 5th ed. 2008).\n3. The Bluebook: A Uniform System of Citation (The Harvard Law Review Association, 20th ed. 2015).",
    "foreignLanguageTextbooks": true,
    "remarks": "1. 授課教師 E-mail：kcschen@mail.ntut.edu.tw;\n2. 本課程 Line 群組："
  }
]
