[
  {
    "name": "\n  朴維鎮　教師諮商時間(Office Hours) ",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-06-08 14:00:13",
    "objective": "The aim of this course is to learn how to make decisions as well as solve many practical problems through efficient decision-making skills and data engineering techniques. Specifically, in this course, we will discuss basic probability theory and its use as a basis for inferential statistics, discuss efficient decision-making techniques, and develop ability in the use of available software (e.g., R) for decision-making analysis. By the end of the course, you will understand the decision-making process, be able to use decision analysis techniques, and make better (sometimes best!) decisions systematically.",
    "schedule": "Week 1 Introduction to data analysis for decision-making\nWeek 2 Basic statistics Part I: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 3 Basic statistics Part II: Random variables, mean, median, standard deviation, variance, correlation, covariance \nWeek 4 Basic statistics Part III: Hypothesis tests\nWeek 5 Basic statistics Part IV: Hypothesis tests\nWeek 6 Simple linear regression – Part I\nWeek 7 Simple linear regression – Part II\nWeek 8 Simple linear regression – Part III\nWeek 9 Interim presentation of individual project and submission of interim report\nWeek 10 Multiple linear regression – Part I\nWeek 11 Multiple linear regression – Part II\nWeek 12 Multiple linear regression – Part III\nWeek 13 Paper discussion – Part I\nWeek 14 Paper discussion – Part II\nWeek 15 Paper discussion – Part III\nWeek 16 Presentation I\nWeek 17 Presentation II\nWeek 18 Presentation III",
    "scorePolicy": "1. Attendance: 10 %\n2. Assignment : 30 %\n3. Presentation: 60 %",
    "materials": "(1) Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)\n(2) Using R for Introductory Statistics (1st Ed., Chapman &amp; Hall/CRC Press) by John Verzani (ISBN: 0-203-49989-1)\n(3) Introductory Statistics with R (2nd Ed., Springer) by Peter Dalgaard (ISBN: 978-0-387-79053-4)",
    "foreignLanguageTextbooks": true,
    "remarks": "Email or i-school system."
  }
]
