[
  {
    "name": "\n  王聖銘　教師諮商時間(Office Hours) ",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2022-06-06 12:29:52",
    "objective": "This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of interaction design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the profession of interaction design. Therefore, one of the aims of this course is to construct multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate on an interactive media design project. It may execute interaction design by working with the form of the case study or design creation.",
    "schedule": "Design studio helps to develop student’s research abilities to identify problems, envision current and future needs, and provide validated solutions to these problems and needs through interaction design.\n\nWeek 01-03  Introduction\nWeek 04-09  Problem 1\nWeek 10-18  Problem 2",
    "scorePolicy": "Participation &amp; Final Project",
    "materials": "Kim Erwin, Communicating the New, Methods to Shape and Accelerate Innovation, John Wiley and Sons, Inc. 2014",
    "foreignLanguageTextbooks": true,
    "remarks": "1. Use the course social platform for a quick consultation. \n2. Send an email for a setup time slot for consultation during or not during the announced office hours. email: ryan5885@mail.ntut.edu.tw"
  },
  {
    "name": "\n  陳圳卿　教師諮商時間(Office Hours) ",
    "email": "cceugene@ntut.edu.tw",
    "latestUpdate": "2022-06-05 10:34:10",
    "objective": "This course aims to explore the fields of interaction design, interactive media, and interactive art. With workshops, panel discussions, case studies and design practices, students are expected to learn research, analysis and prototyping skills. The aim of this course is to integrate different disciplines ranging from computer science, mechatronics, architectural design, industrial design, graphic design, and art, so as to foster the professional of interaction design. Therefore, one of the aims of this course is to provide a multidisciplinary learning environment that encourages students to collaborate to explore an innovative application of interaction design.",
    "schedule": "Week 1-6 Exploration, collaboration &amp; group project\nWeek 7-18 Individual research/project development",
    "scorePolicy": "Participation &amp; Final Project",
    "materials": "NA",
    "foreignLanguageTextbooks": true,
    "remarks": "cceugene@ntut.edu.tw"
  },
  {
    "name": "\n  韓秉軒　教師諮商時間(Office Hours) ",
    "email": "robert19881004@gmail.com",
    "latestUpdate": "2022-05-26 17:45:52",
    "objective": "This course aims to explore the fields of interaction design, interactive media, and interactive art. With workshops, panel discussions, case studies and design practices, students are expected to learn research, analysis and prototyping skills. The aim of this course is to integrate different disciplines ranging from computer science, mechatronics, architectural design, industrial design, graphic design, and art, so as to foster the professional of interaction design. Therefore, one of the aims of this course is to provide a multidisciplinary learning environment that encourages students to collaborate to explore an innovative application of interaction design.",
    "schedule": "Week 1-6 Exploration, collaboration &amp; group project\nWeek 7-18 Individual research/project development",
    "scorePolicy": "Participation &amp; Final Project",
    "materials": "None",
    "foreignLanguageTextbooks": false,
    "remarks": "MS Teams"
  }
]
