[
  {
    "name": "\n  朴維鎮　教師諮商時間(Office Hours) ",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-08-17 14:54:39",
    "objective": "The objective of this course is to introduce students to core ideas of probability and statistics, and also to provide an understanding on statistical concepts to include measurements of location and dispersion, probability, probability distributions, sampling, estimation, hypothesis testing, correlation analysis, and simple and multiple linear regression. Consequently, these skills will provide the student with a basis to conduct their own such analyzes and to evaluate critically others’ uses of statistics.",
    "schedule": "Week 1 Introduction to statistics, data Summary, and presentation\nWeek 2 Probability, Bayesian theorem, correlation\nWeek 3 Random variables and probability distributions – Random variables, probability\nWeek 4 Random variables and probability distributions – Continuous random variables\nWeek 5 Random variables and probability distributions – Discrete random variables\nWeek 6 Decision making for a single sample – Estimation, hypothesis testing\nWeek 7 Decision making for a single sample – Inference on the mean of a population\nWeek 8 Quiz, independent Study\nWeek 9 Midterm exam (In-class, 1 Cheat Sheet, Calculator)\nWeek 10 Decision making for a single sample – Inference on the variance of a normal population\nWeek 11 Decision making for a single sample – Inference on a population proportion, goodness of fit test\nWeek 12 Decision making for two samples – Inference on the means of two populations (Part I)\nWeek 13 Decision making for two samples – Inference on the means of two populations (Part II)\nWeek 14 Decision making for two samples – Paired t-test, inference on the ratio of variances of two normal populations\nWeek 15 Decision making for two samples – Inference on two population proportions\nWeek 16 Building Empirical Models – Simple Linear Regression\nWeek 17 Quiz, independent Study\nWeek 18 Final exam",
    "scorePolicy": "Midterm Exam: 30 %\nFinal Exam: 30 %\nQuiz: 35 %\nAttendance: 5%",
    "materials": "Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)",
    "foreignLanguageTextbooks": true,
    "remarks": "Email or i-school system."
  }
]
