[
  {
    "name": "吳可久",
    "email": "kochiuwu@ntut.edu.tw",
    "latestUpdate": "2022-06-09 13:22:44",
    "objective": "本課程之目標在於從科學哲學層次、研究方法層次、與實際操作層次探討設計研究的本質，內容包括界定設計研究問題、選用適當的量化或質性研究方法與特定工具、研究結果詮釋、案例解析、以及論文寫作等，俾使同學具備研究之基礎觀念以及進行創作或理論論文寫作之能力。研究方法一強調量化研究，課程內容包含研究的基本概念、文獻探討、研究問題、研究變項、研究假設、研究設計、資料蒐集與分析、研究工具、研究樣本、研究倫理與研究論文撰寫等。教學以課堂講授與論文研討與發表為主要方式，並以隨堂測驗、報告與分組討論與發表為評量依據。\nThe aims of this course are to explore the nature of design research at the three various levels of scientific philosophy, research methods, and pr92tical execution. The contents involve the introduction of defining the design problems, selecting the quantitative or qualitative research methods and specific instruments, interpretation of research results, case studies, as well as writing a thesis. This research methods one focus on quantitative research that content details includes fundamental concept of research, literature review, research problem, research variables, research hypothesis, research design, data collection and analysis, research instruments, research samples, research ethics and writing up. The te92hing methods include lectures, paper discussion and presentation based on the course assessment of assigned project, panel discussion and individual/group presentation.",
    "schedule": "1.　　解釋行為\n2.　　研究想法\n3.　　檢視科學文獻\n4.　　選擇研究設計\n5.　　數據蒐集\n6.　　系統性觀察\n7.　　受試者擇定\n8.　　非實驗研究\n9.　　期中報告\n10.　　深度訪談 / 焦點團體\n11.　　SWOT 決策\n12.　　調查研究\n13.　　描述統計\n14.　　推論統計\n15.　　多變項設計與分析\n16.　　因素分析\n17.　　報告研究結果參考文獻\n18.　　期末報告",
    "scorePolicy": "每次上課點名 未到三次 將予以慎重考慮\n期中、期末二次報告",
    "materials": "教師講義",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 上課時間為原定排課時間、上課方式採用遠距上課、學生不須到校上課、上課地點為學生各自上網且安靜處所、教材提供方式為上課前利用 LINE 分享\n上課網址\nhttps:/meet.google.com/puh-vkbn-wrh</div>"
  }
]
