[
  {
    "name": "黃雅雯",
    "email": "Yw1002.huang@msa.hinet.net",
    "latestUpdate": "2022-06-01 16:24:15",
    "objective": "國文，是運用本國語言文字，蘊釀於欣賞文藝作品，充實文化內涵，增進思維能力與人文素養的一門課程。\n本課程分為大一上學期 2 學分，大一下學期 2 學分。大一上學期的授課內容，以文學名篇為範圍；希望藉此擴建學生深入品味文學趣味的能力，鍛鍊靈活的語文敏感度，默契文學創意，甚而嘗試創作。大一下學期的授課內容，以思想名篇為範圍；希望藉此啟發學生透轍分析各家學說思想，漫步哲人的宇宙天地，跟隨哲人的心路歷程，進而念茲在茲，從容內化，共饗取之不盡用之不竭的先驗與風範。\n\"Chinese\" is the course where we make full use of our native languages to enjoy literary works, to enrich our cultural taste, to develop our thinking and even to elevate human cultivation.\n\nThis four-credit course is set for the freshman students: with 2 credits in each of the two semesters of the school year. In the first semester, the course covers important articles in literature, in the hope for the student learners to cultivate better ability to taste literary works when they have more vivid sense on the language. With fuller knowledge on what literature is about, they are expected to try creative writings. For the second semester, the course is mainly focused on the writings on thoughts. It is our expectation that throughout the reading and analysis of various great schools of philosophy, the student learners are given the opportunity to explore the huge minds of philosophers, who will thus be imitated and followed. Through the internalization, the students might benefit themse",
    "schedule": "第一週    09.12   課程介紹\n第二週    09.19   晚明小品與生活文化\n第三週    09.26   中國飲食文化的發展\n第四週    10.03   唐宋文人的飲食書寫：以蘇東坡為例\n第五週    10.10   國慶日放假一天\n第五週    10.11   國文會考\n第六週    10.17   陸樹聲〈苦竹記〉\n第七週    10.24   徐渭《煎茶七類》\n第八週    10.31   校慶慶祝大會暨園遊會補假\n第九週    11.07   文震亨《長物志・蔬果》\n第十週    11.14   創作主題企劃提案報告\n第十一週  11.21   謝肇淛《五雜俎》選讀\n第十二週  11.28   高濂《遵生八箋・飲饌服食箋》\n第十三週  12.05   袁宏道〈觴政〉\n第十四週  12.12   張岱《陶庵夢憶》選讀\n第十五週  12.19   李漁《閒情偶寄・飲饌部》選讀\n第十六週  12.26   期末考試：「晚明小品與生活文化」成果發表會\n第十七週  01.02   開國紀念日遇例假補假\n第十八週  01.09   期末考試：「晚明小品與生活文化」成果發表會",
    "scorePolicy": "期中考試：百分之十\n期末考試：百分之二十\n作業（二篇作文）：百分之四十\n課堂分組報告（書面＋口頭）：百分之二十\n綜合考評（包含出席、學習態度）：百分之十",
    "materials": "龔鵬程《晚明思潮》台北：佛光人文社會學院\n曹淑娟《晚明性靈小品研究》台北：文津出版社\n吳承學《晚明小品研究》南京：江蘇古籍出版社\n尹恭弘《小品高潮與晚明文化》北京：華文出版社\n逯耀東《出門訪古早》台北：東大圖書公司",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若受疫情影響，無法到學校實體上課，國文課程教學方式將調整如下：\n1. 國文課程使用 MS teams 同步教學系統進行遠距教學。\n2.MS teams 登入帳號：學號 @cc.ntut.edu.tw 登入密碼：校園入口網站密碼\n3. 課程相關訊息，公告於北科 i 學園課程公告與檔案教材版，請同學隨時上網瀏覽。</div>"
  }
]
