[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2022-06-02 17:10:42",
    "objective": "This Robotics and Automation Applications (RAA) course is offered only for limited undergraduate students with programming experience. RAA focuses on projects in the areas of optical inspection, mobile robots, manipulators, visual servoing, and automation. 機器人與自動化應用 (RAA) 適合大學生修習，因設備因素修課人數有限，須具備程式能力。課程專題聚焦於光學檢測、移動式機器人、機械手臂、視覺伺服與自動化。",
    "schedule": "Tentative schedule 暫定課程進度\n週次 Week\t單元主題 Topic\n1\t課程介紹\nCourse Introduction\n2\t影像處理實驗：灰階分類，膨脹與侵蝕處理\nImage Processing: Gray-level Classification, Dilation, and Erosion Operations\n3\t影像處理實驗：斷開與閉合處理\nImage Processing: Opening and Closing Operations \n4\t光學檢測實驗\nOptical Inspection \n5\tPTZ 攝影機視覺控制實驗\nVision-Based Control of PTZ Camera\n6\t移動式機器人運動學與避障\nMobile Robot Kinematics and Obstacle Avoidance\n7\t移動式機器人之車載視覺控制實驗 I\nMobile Robot Control with Onboard Vision I\n8\t移動式機器人之車載視覺控制實驗 II\nMobile Robot Control with Onboard Vision II\n9\t機械手臂模擬實驗：基本操作\nManipulator Control Simulation: Basic Operations\n10\t機械手臂模擬實驗：物體拾取與放置\nManipulator Control Simulation: Object Picking and Placing\n11\t機械手臂控制實驗：物體拾取與放置 I\nManipulator Control Experiment: Object Picking and Placing I\n12\t機械手臂控制實驗：物體拾取與放置 II\nManipulator Control Experiment: Object Picking and Placing II\n13\t期末專題提案及論文簡報 I\nFinal Project Proposals and Paper Presentations I\n14\t期末專題提案及論文簡報 II\nFinal Project Proposals and Paper Presentations II\n15\t期末專題提案及論文簡報 III\nFinal Project Proposals and Paper Presentations III\n16\t期末專題提案及論文簡報 IV\nFinal Project Proposals and Paper Presentations IV\n17\t期末專題報告及展示\nFinal Project Demonstrations and Presentations\n18\t期末專題報告繳交 Final Project Reports Due\n\nPS: The contents and order of lectures and presentations will be adjusted according to actual needs 上述授課與報告內容及順序將因應實際狀況調整",
    "scorePolicy": "The final grade will be a weighted average of attendance 10%, homework 10%, class projects 50%, final project proposal and paper presentation 10%, and final project 20%. 學期成績權重比例：出席 10%，作業 10%，課程專題 50%，期末專題提案及論文簡報 10 %，期末專題 20%。",
    "materials": "Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company. \nRobotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke Publication Year: 2013 | ISBN 3642201431 | 1st Edition",
    "consultation": "Contact Professor ot TA via emails announced in iStudy. 請參考北科 i 學園 +(iStudy) 公告，以 email 聯絡授課教授或助教。",
    "remarks": "Response to government epidemic alert, course lecture and presentations will be offered online via Microsoft Teams at class hours and recorded lectures are available in iStudy.  Please refer to Taipei Tech's iStudy for details about this course. 疫情警戒期間將透過 Microsoft Teams 線上授課及報告，授課錄影請登入北科 i 學園 +，細節請參照北科 i 學園 + 課程公告。",
    "foreignLanguageTextbooks": true
  }
]
