[
  {
    "name": "\n  曹筱玥",
    "email": "sytsau@ntut.edu.tw",
    "latestUpdate": "2022-06-06 14:18:34",
    "objective": "本課程旨在探討如何整合科技於文化創意產業，透過案例教學，幫助學生結合有效率的資訊科技工具於人文藝術，以發展文化創意產業，並創造高附加價值的效益。當今產、官、學、研都強調跨域整合的重要性，文創與互動科技的結合，能為文化創意作加值，並注入新生命、新體驗，因此，文創遇到科技後，所激盪出的火花與創意，已逐漸受到產、學界的青睞。本課程將探討文化創意的發展脈絡、文創的底蘊與其應用面、互動科技的應用，透過文獻研讀、案例分析等方式，瞭解國外最新研究與趨勢，討論文創與科技的創新應用可行性，引領文化創意產業轉型，規劃未來文創與科技整合的新契機。\nThe course intends to explore about how to integrate the technology into the cultural and creative Industries. Through case study, it will help students to combine efficient information technology tools in the field of arts and humanities, and also facilitate the development of cultural and creative industries, and create high value-added benefits for these industries. Today's industry, government, academia, research has emphasized the importance of cross-discipline consolidation. It means that cultural creation and interactive technology combined with value-added as a bonus for the cultural creation, and implant new life, new experiences. Therefore, when the cultural creation encounter technology, which bring out the spark and creativity, has gradually been favored both with industry  and academia. This course will explore the cultural creative context, cultural inside information and its application, the interactive technology application by using the method of literature review, cas",
    "schedule": "週　　   內    容\n一　　   課程概述\n二　　   專案報告 or 設計選擇（分組）\n三       19:00 專題演講：互動式廣告創作與產品設計（天工開物 林慧修總經理）\n四        倫敦設計節 + 專題研究方向討論 (A4 一張)\n五        專題演講：頑石文創 程湘如總監演講\n六        專題報告 + 人物專訪報告\n七        設計師工作室 參觀\n八        期中報告\n九        文博會參訪\n十        藝術家工作室 參觀\n十一     福華沙龍\n十二     設計師工作室 參觀\n十三     專題報告 + 人物專訪報告\n十四     松山文創園區 參訪\n十五     專題研究發表\n十六     專題研究撰寫\n十七     專題研究撰寫\n十八     繳交期末報告",
    "scorePolicy": "30％出席，20％每週作業，50％專題報告",
    "materials": "1.Robert Atkins 著、黃麗絹譯（1996）、《藝術開講》、台北：藝術家出版社。\n2. 文化創意產業實務全書，台北：商周出版。\n3. 創意亞洲現場，官振萱，台北：天下出版。",
    "foreignLanguageTextbooks": false,
    "remarks": "https://ixd.ntut.edu.tw/p/406-1089-89584,r1713.php?Lang=zh-tw"
  }
]
