[
  {
    "name": "王聖銘",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2022-06-06 13:21:56",
    "objective": "本課程聚焦於未來智慧互動城市發展的理論、方法、技術應用與案例分析。在智慧城市中，民眾透過主動、被動、自主和社群平台進行交流和合作，以實現不同的生活目標。學生將獲得有關智慧互動城市領域主要研究主題和實驗實踐的知識，培養她 / 他在建設智慧互動城市方面的技能。課程內容主要將從互動和設計的角度介紹和討論不同的範例，例如普適計算、環境智能、增強和虛擬現實、環境智能、可適化人機介面、操作性介面、物聯網、智慧家居、社會規範、及空間感知… 等的應用情境與案例分析。與課程中，也將帶入不同的社會挑戰，並於學生分組專題，透過跨領域共作的模式，提出未來互動設計應用與智慧城市的方案。本課程將分為理論部分和實踐部分。理論部分涵蓋了開發和評估智慧互動系統的理論架構和方法，以及其實踐與應用方法。理論部分的部分內容將透過分組專題，同時學習理論的內容及其應用實踐的實務。\nThe main theme of the course is theories, methods, technologies and case studies for the development of future smart interactive cities where humans and proactive, reactive, autonomous and social platform communicate and cooperate to reach goals. The student will acquire knowledge about main research themes and experimental practices in the field of smart interactive cities as well as develop her/his skills in constructing smart interactive cities. Different paradigms will be introduced and discussed, primarily from an interaction and design perspective such as ubiquitous computing, ambient intelligence, augmented and virtual reality, intelligent and adaptive user interfaces, tangible interfaces, persuasive technology, decision-support systems, Internet of Things, smart homes, social norms, and spatial awareness. Different societal challenges will also be addressed through cross-disciplinary collaboration in student projects. The course is divided into theoretical parts and practical parts. Course topic response reports, a midterm project proposal report, and a 4000 words final project report should be submitted in this course.",
    "schedule": "Unit One: Image of the City (Kevin Lynch)\n\nUnit Two: A Pattern language (Christopher Alexander, Sara Ishikawa, Murray Silverstein)\n\nUnit Three: Form follow Function or Function follow Form?\n\nUnit Four: What is a Smart City? How \"Smart\" a city can be?\n\nUnit Five: Space Syntax Analysis of a City.\n\nUnit Six: Human-Centered City with Human Behavior Observation.\n\nUnit Seven: City with Sensors and Network Technology.\n\nUnit Eight: City with Big Data and Computing Technology.\n\nUnit Nine: City Intelligence for planning, management, and decision making.",
    "scorePolicy": "1. Attend all class sessions. (10%)\n2. Actively engage in class discussions.\n3. Submit a written assignment: During the semester, you are responsible for writing four 500-750 word reflection that responds to the course section topics and \npresentation. You must include an analysis of the topic (not simply summarizing the talk), including questions you may have or future areas of research that you would like to be involved with. (30%)\n4. Design and complete an independent research project throughout the semester, such as providing a detailed case study of a smart city; conducting informational interviews with a smart city practitioner or researcher; or producing a literature review exploring aspects of the smart city. Prepare a midterm paper describing your research topic and proposal. (20%)\n5. Write a 4,000-word paper (in Chinese or English,15 pages, double-spaced) and give a brief presentation about your research project to the class. (40%)",
    "materials": "TBA",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >Once the lecture needs to go online, lecture materials/assignments/course works will use google classroom as the interactive platform.</div>"
  }
]
