[
  {
    "name": "張裕煦",
    "email": "yhchang@ntut.edu.tw",
    "latestUpdate": "2022-05-26 15:46:45",
    "objective": "It's an EMI (English as a medium of instruction) course. \n\"Microsoft Teams\" will be used as the software for the distance teaching once the Level 3 alert announced. Microsoft has authorized Taipei Tech staffs and students to use TEAMS. Please register this software following the Taipei Tech instruction.\n\nThis course focuses on the synthesis and characterization of nanomaterials, including gas-phase and solution-phase reactions. The core contents of the course are:\n(1) Various solution-phase synthesis of nanopowders, hollow nanospheres and nanowires\n(2) Synthesis of nanotubes and nanowires by gas-phase reaction\n(3) Nano-Imprint Lithography\n(4) Nanomaterials analysis technology",
    "schedule": "1.\tIntroduction to Nanomaterials Synthesis\n2-3\tSolid-State Reactions\n4-5\tFormation of Solids from the Gas Phase I\n6-7\tFormation of Solids from the Gas Phase II\n8-9\tFormation of Solids from Solutions and Melts\n10\tMidterm\n11\tPhysical Chemistry of Solid Surfaces\n12    Zero-Dimensional Nanostructures: Nanoparticles\n13-14One-Dimensional Nanostructures: Nanowires & Nanorods\n15-16Two-Dimensional Nanostructures: Thin Films\n17\tSpecial Nanomaterials\n18    Final\n5/19\tPresentation I\n5/26\tPresentation II\n6/2\tPresentation III\n6/9\tPresentation IV\n6/16\tFinal",
    "scorePolicy": "The final grade will be determined by:\nmidterm 45 % + final 45 % + 10% attendance",
    "materials": "1.Synthesis of Inorganic Materials, 4th edition; Ulrich Schubert and Nicola Husing  \nWiley-VCH; 2019\n\n2. Nanostructures and Nanomaterials: Synthesis, Properties, and Applications, 2nd Edition; Guozhong Cao and Ying Wang \nImperial College Press; 2011\n\n3. Journals: Nano Letters, Small, Advanced Materials, Advanced Functional Materials, Nature Materials, Journal of Physical Chemistry C",
    "consultation": "contact prof. Chang directly or via email",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
