[
  {
    "name": "\n  陳盈棻",
    "email": "yingfenchen@ntut.edu.tw",
    "latestUpdate": "2022-06-08 11:55:02",
    "objective": "The scholarship of “Medium and Environment” was first explored by Marshall McLuhan in the 1960s with a series of academic and practical works. However, this field was not gaining much attention until the past decade when technology has brought novel challenges and scholars in film and media have been shifting their focuses to this aspect. Because of these, the studies of medium and environment has recently been an emerging field that intends to examine the phenomena intertwining the two aspects through interdisciplinary approach. Based on this background, this course will introduce cutting-edge scholarships of medium and environment studies to the traditional field of urban cultural studies, pursuing effective perspectives to unfold today’s critical urban issues, for instance globalization in digital era, carnival and creative industry, smart city, Netflix economy (Harvey, 2020), and so forth. Student will be expected to learn how to bridge theories and practices, to develop critical thinking, and to learn corresponding methodologies.",
    "schedule": "Week 01　　Introduction\nWeek 02　　Media and Medium/Methodological Discussion: Keywords\nWeek 03 Built Environment and Ecology\nWeek 04　　Representational Space and the Third Space\nWeek 05　　Methodological Discussion: Literature Review\nWeek 06　　Globalization in a Digital Age\nWeek 07　　Elemental Media and Infrastructure/Methodological Discussion: Interview Outline\nWeek 08　　Cybernetics and System\nWeek 09　　Methodological Discussion: Text and Visual Analysis\nWeek 10　　Computer Architecture \nWeek 11　　Smart City/Methodological Discussion: Interview Transcript Analysis \nWeek 12　　The Unbuilt\nWeek 13　　Methodological Discussion: Interview Transcript Analysis/Mapping\nWeek 14　　Ambience\nWeek 15　　The Virtual Window or Screen\nWeek 16　　Discussion: Mapping\nWeek 17　　Virtual City, Virtual Sphere, Lockdown Urbanism, Netflix Economy\nWeek 18　　Final Presentation: Personal Portfolio of Research Keyword",
    "scorePolicy": "15% Literature Review\n15% Interview and Transcripts \n15% Text and Visual Analysis \n15% Mapping\n25% Final Presentation and Portfolio \n15% Participation",
    "materials": "Mitchell, W.J.T. and Hansen, Mark ed. (2010) “Image” and “Time and Space” in Critical Terms for Media Studies, U. of Chicago Press. \nMcLuhan, Marshall (1964) “The Medium is the Message”; “Medium Hot and Cold” in Understanding Media: The Extension of Man. Cambridge: MIT Press, 7-31.\nInga Pollmann (2013) “Invisible Worlds, Visible: Uexküll’s Umwelt, Film, and Film Theory.” In Critical Inquiry 39:4, 777-816.\nMorton, Timothy (2009) “Introduction” and “Imagining Ecology without Nature” in Ecology Without Nature: Rethinking Environmental Aesthetics. Cambridge: Harvard University Press.\nChakrabarty, Dipesh (2009) “The Climate of History: Four Theses.” Critical Inquiry 35, 197-222.\nKrause, Linda and Petro, Patrice Ed. (2003) Global Cities: Cinema, Architecture, and Urbanism in a Digital Age. Putgers U. Press. \nPeter Sloterdijk (2013) In the World Interior of Capital: For a Philosophical Theory of Globalization. Trans. Wieland Hoban. Cambridge: Polity.\nPeters, John (2015) “Introduction” and “Understanding Media” in Marvelous Clouds: Toward an Elemental Philosophy of Media. Chicago, IL: U of Chicago Press.\nSomaini, Antonio (2016) “Walter Benjamin’s Media Theory: The Medium and the Apparat” Grey Room 62, 6-41.\nW.J.T. Mitchell and Mark Hansen eds. (2010) “Cybernetics” and “Systems” in Critical Terms for Media Studies, U. of Chicago Press.\nLuhmann, Niklas (2000) “Perception and Communication: The Reproduction of Forms” in Art as a Social System. Trans. Eva Knodt. Stanford. Stanford U Press.\nMartin, Reinhold (2003) The Organizational Complex: Architecture, Media, and Corporate Space. Cambridge, MA: MIT Press.\nAlexander, C. (1965) A City is Not a Tree. Architectural Forum, Vol 122, No 1, pp 58-62.\nKomninos, Nicos (2008) “An Intelligent Global World is Emerging,” “Intelligent Cities: The Emergence of the Concepts” and “Building Blocks of Intelligent Cities: Architecture of Layers and Functions” in Intelligent Cities and Globalisation of Innovation Networks. Routledge. \nLubell, Sam and Goldin, Greg (2013) Never Built Los Angeles. Metropolis Books.\nBurden, Ernest (1999) Visionary Architecture: Unbuilt Works of the Imagination. McGraw-Hill Professional.\nShanken, Andrew M. (2009) “Introduction: Planning the Postwar Architect” and “The Culture of Planning: The Rhetoric and Imagery of Home from Anticipation” in 194X: Architecture, Planning, and Consumer Culture on the American Home Front. U. of Minnesota Press. \nRoquet, Paul (2016) Ambient Media: Japanese Atmospheres of Self. Minneapolis: U of Minnesota Press.\nCasetti, Francesco (2015) “Relocation” and “Display” in The Lumière Galaxy: Seven Key Words for the Cinema to Come. New York: Columbia University Press.\nFriedberg, Anne (2006) “Introduction” in The Virtual Window: From Alberti to Microsoft. The MIT Press. \nDoerr, N. M. and Occhi, D. J. ed. (2019) The Augmented Reality of Pokémon Go: Chronotopes, Moral Panic, and Other Complexities. Lexington Books.\n王志弘（2009）多重的辯證 -- 列斐伏爾空間生產概念三元組演繹與引申。地理學報；55 期，1-24。\nSoja, Edward 著，王志弘等譯（2004），《第三空間─航向洛杉磯以及其他真實與想像地方的旅程》，台北：桂冠。",
    "foreignLanguageTextbooks": true,
    "remarks": "Instructor：CHEN, Ying-Fen 陳盈棻\nEmail: yingfenchen@ntut.edu.tw \nOffice Hours: 設計館 351-2, by appointment"
  }
]
