[
  {
    "name": "\n  王聖銘　Office Hours ",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2022-06-06 22:58:18",
    "objective": "The main theme of the course is theories, methods, technologies, and case studies for the development of future smart interactive cities where humans and proactive, reactive, autonomous, and social platforms communicate and cooperate to reach goals. The student will acquire knowledge about main research themes and experimental practices in the field of smart interactive cities as well as develop her/his skills in constructing smart interactive cities. Different paradigms will be introduced and discussed, primarily from an interaction and design perspective such as ubiquitous computing, ambient intelligence, augmented and virtual reality, intelligent and adaptive user interfaces, tangible interfaces, persuasive technology, decision-support systems, Internet of Things, smart homes, social norms, and spatial awareness. Different societal challenges will also be addressed through cross-disciplinary collaboration in student projects. The course is divided into theoretical parts and practical parts. Course topic response reports, a midterm project proposal report, and a 4000 words final project report should be submitted in this course.",
    "schedule": "Unit One: Image of the City (Kevin Lynch)\n\nUnit Two: A Pattern language (Christopher Alexander, Sara Ishikawa, Murray Silverstein)\n\nUnit Three: Form follow Function or Function follow Form?\n\nUnit Four: What is a Smart City? How \"Smart\" a city can be?\n\nUnit Five: Space Syntax Analysis of a City.\n\nUnit Six: Human-Centered City with Human Behavior Observation.\n\nUnit Seven: City with Sensors and Network Technology.\n\nUnit Eight: City with Big Data and Computing Technology.\n\nUnit Nine: City Intelligence for planning, management, and decision making.",
    "scorePolicy": "1. Attend all class sessions. (10%)\n2. Actively engage in class discussions.\n3. Submit a written assignment: During the semester, you are responsible for writing four 500-750 word reflection that responds to the course section topics and \npresentation. You must include an analysis of the topic (not simply summarizing the talk), including questions you may have or future areas of research that you would like to be involved with. (30%)\n4. Design and complete an independent research project throughout the semester, such as providing a detailed case study of a smart city; conducting informational interviews with a smart city practitioner or researcher; or producing a literature review exploring aspects of the smart city. Prepare a midterm paper describing your research topic and proposal. (20%)\n5. Write a 4,000-word paper (in Chinese or English,15 pages, double-spaced) and give a brief presentation about your research project to the class. (40%)",
    "materials": "TBA",
    "foreignLanguageTextbooks": true,
    "remarks": "1. Use the course social platform for a quick consultation. \n2. Send an email for a setup time slot for consultation during or not during the announced office hours. email: ryan5885@mail.ntut.edu.tw"
  }
]
