[
  {
    "name": "\n  陳盈棻 ",
    "email": "yingfenchen@ntut.edu.tw",
    "latestUpdate": "2022-11-15 12:19:14",
    "objective": "The scholarship of “Medium and Environment” was first explored by Marshall McLuhan in the 1960s with a series of academic and practical works. However, this field was not gaining much attention until the past decade when technology has brought novel challenges. Scholars in both urban studies and media studies have been shifting their focuses to this aspect. Because of this, the studies of medium and environment has recently been an emerging field that intends to examine the phenomena intertwining the two aspects through interdisciplinary approach. Based on this background, this course will introduce cutting-edge scholarships of medium and environment studies to the traditional field of urban cultural studies, pursuing effective perspectives to unfold today’s critical urban issues, for instance globalization in digital era, the popularity of carnival and creative industries, smart and resilient city, Netflix economy/urbanism (Harvey, 2020), and so forth. Student will be expected to learn how to bridge theories and practices, to develop ability of critical thinking, and to learn corresponding methodologies.",
    "schedule": "Week 01　　Introduction: Cultural Medium and Urban Design/Assignment Introduction: Keywords\nWeek 02　　Medium and Media/Assignment Introduction: Literature Review\nWeek 03  Representational Space and the Third Space\nWeek 04　　Globalization in a Digital Age\nWeek 05　　Assignment Discussion 1_Literature Review/Assignment Introduction: Text and Visual Analysis\nWeek 06　　Material Culture\nWeek 07　　Creative Class\nWeek 08　　Assignment Discussion 2_Text and Visual Analysis/Assignment Introduction: Interview and Transcripts\nWeek 09　　Carnival Urbanism\nWeek 10　　Intelligent City \nWeek 11　　Elemental Media and Infrastructure \nWeek 12　　Assignment Discussion 3_Interview and Transcripts/Assignment Introduction: Participatory Observation and Mapping\nWeek 13　　The Unbuilt\nWeek 14　　Conference Break or Invited Lecture\nWeek 15　　Assignment Discussion 4_Participatory Observation and Mapping/Assignment Introduction: Keywords and Wikipedia Entry\nWeek 16　　Virtual Sphere, Lockdown Urbanism, Netflix Economy\nWeek 17　　Final Presentation\nWeek 18　　Final Week: Entry/Essay Submission",
    "scorePolicy": "15% Literature Review\n15% Interview and Transcripts \n15% Text and Visual Analysis \n15% Mapping\n10% Final Presentation\n15% Essay/Entry \n15% Participation",
    "materials": "Alexander, C. (1965) A City is Not a Tree. Architectural Forum, Vol 122, No 1, pp 58-62.\nCasetti, F. (2015) The Lumière Galaxy: Seven Key Words for the Cinema to Come. New York: Columbia University Press.\nCastell, M. (2001, 2002) “Space of Flows, Space o Places: Materials for a Theory of Urbanism in the Information Age” in The City Reader 5th Edition (2011). Routledge. \nCharles B. (2002) “Interviewing, power/knowledge, and social inequality,” in Handbook of Interview Research: Context and Method, ed. Gubrium, J. and Holstein, J. (Thousand Oaks: Sage, 2002), 911-922.\nDant, T. (2005) Materiality and Society. Open University Press. \nDoerr, N. M. and Occhi, D. J. ed. (2019 The Augmented Reality of Pokémon Go: Chronotopes, Moral Panic, and Other Complexities. Lexington Books.\nFlorida, R. (2002) “The Creative Class” in in The City Reader 5th Edition (2011). Routledge. \nFlorida, R., Adler, P. &amp; Mellander, C. (2017) The city as innovation machine, Regional Studies, 51:1, 86-96\nFoucault, M. (1994) The Order of Things: An Archaeology of Human Sciences. Vintage. \nGraff, G. and Birkenstein, C. (2018) They Say I Say: The Moves That Matter in Academic Writing (4 Ed.). W. W. NORTON &amp; COMPANY, INC.\nHarvey, D. (1989) From Managerialism to Entrepreneurialism: The Transformation in Urban Governance in Late Capitalism. Geografiska Annaler. 71 B (1): 3-17. \nHarvey, D. (2003) Paris, Capital of Modernity. Routledge. \nGubrium, J. and Holstein,J. (2002) “From the Individual Interview to the Interview Society,” in Handbook of Interview Research: Context and Method, ed. Gubrium, J. and Holstein, J. (Thousand Oaks: Sage, 2002), 3-32.\nKomninos, N. (2008 Intelligent Cities and Globalisation of Innovation Networks. Routledge. \nKrause, L. and Petro, P. Ed. (2003) Global Cities: Cinema, Architecture, and Urbanism in a Digital Age. Putgers U. Press. \nLow S., Simpson T., Scheld S. (2019) The Toolkit for the Ethnographic Study of Space. CUNY Public Space Research Group. \nLubell, S. and Goldin, G. (2013) “Missed Opportunities: Los Angeles” in Never Built Los Angeles. Metropolis Books.\nLynch, K. (1960) “The City Image and its Elements” in in The City Reader 5th Edition (2011). Routledge.  \nMcLuhan, M. (1964) Understanding Media: The Extension of Man. Cambridge: MIT Press.\nMitchell, W.J.T. and Hansen, Mark ed. (2010) “Image” in Critical Terms for Media Studies, U. of Chicago Press.\nPeters, J. (2015) Marvelous Clouds: Toward an Elemental Philosophy of Media. Chicago, IL: U of Chicago Press.\nPrentice, R. and Andersen, V. (2003) Festival as creative destination. Annals of Tourism Research. 30 (1): 7-30. Elsevier. \nShanken, A. M. (2009) 194X: Architecture, Planning, and Consumer Culture on the American Home Front. U. of Minnesota Press. \nSoja, E. (1996) Thirdspace: Journey to Los Angeles and Other Real-And-Imaged Places. Blaclwell Publishing. \nSomaini, A. (2016) “Walter Benjamin’s Media Theory: The Medium and the Apparat” Grey Room 62, 6-41.\nTsing, A. L. (2017) The Mushroom at the End of the World: On the Possibility of Life in Capitalist Ruins. Princeton University Press. \nWilliams, R. (1985) Keywords: A Vocabulary of Culture and Society [1976]. Oxford U. Press.\nZhang, Q. et al. (2022) Uneven development and tourism gentrification in the metropolitan fringe: A case study of Wuzhen Xizha in Zhejiang Province, China. Cities. Elsevier. \n王志弘（2009）多重的辯證 -- 列斐伏爾空間生產概念三元組演繹與引申。地理學報；55 期，1-24",
    "foreignLanguageTextbooks": true,
    "remarks": "Instructor：CHEN, Ying-Fen 陳盈棻\nEmail: yingfenchen@ntut.edu.tw \nOffice Hours: 設計館 351-2, by appointment"
  }
]
