[
  {
    "name": "汪家昌",
    "email": "jcw@ntut.edu.tw",
    "latestUpdate": "2022-10-25 11:46:01",
    "objective": "積層製造 (3D 列印) 加工原理、積層製造系統分類、加工參數與加工結果分析，製程設備研究，快速模具技術研究，積層製造與快速模具實習，專題研究與討論。\n\nThis course includes the principle of additive manufacturing process, classifications, process parameters, and the systems. The application of additive manufacturing will also introduce together with practice works. Two mini projects need to complete during this semester.",
    "schedule": "週次\t講授內容概要\n1\tThe Development of Additive Manufacturing Systems\n2\tClassification of AM (Laser, Nozzle)\n3\tPhoto-Polymerization Fabrication Process/ Basic knowledge of photo-polymerization\n4\tSLA-Solid Imaging; SLP, EDART; SGC; Others\n5\tNozzle type Polymerization Fabrication Process/ Basic knowledge of liner polymer Thermal Plastic polymerization\n6\tThermal jet, MM, FDM\n7\tPowder Fabrication Process/ Basic knowledge of metallurgy\n8\tSLS, EOS, 3DP, LENS\n9\tAlternative Fabrication Process/ Basic knowledge of cutting\nLOM, SDM\n10\tMid-exam\n11\tMicro RP, 3D Micro Fabrication (Micro-Stereolithography: LCD, DLP, Dynamic Photo Mask)\n12,13\tRapid Tooling and Rapid Manufacturing\n14\tApplications (Industrial, Medical, Potential)\n15-18\tmini projects",
    "scorePolicy": "平時表現 30%\n期中考   30%\n期末報告 40%\n\nDiligence: 30%\nMidterm exam: 30%\nTwo reports: 40%",
    "materials": "提供投影片教材 (PDF) OHP material in PDF format can be download from ischool.ntut.edu.tw\nAdditive Manufacturing Technologies (3D Printing, Rapid Prototyping, and Direct Digital Manufacturing) ISBN 978-1-4939-2112-6",
    "consultation": "Students are free to send me emails or ask questions in the LINE group.",
    "remarks": "All students need to join the LINE group which will be announced in the first week and also gives the link information on i-school. If the taught course has to be online, it will use Google meet.10/12, it was announced in the lecture on 10/5. Professor Jiang will help to continue the class and TA will help. As told in the lecture, 10/12 will guide you in learning how to operate the two types of 3d printers.11/16, it was announced in the lecture on 10/16 that the TA will help you in learning how to operate the two types of 3d printers. The further arrangement will be discussed on 10/16 in the class.",
    "foreignLanguageTextbooks": false
  }
]
