[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2022-06-02 17:07:20",
    "objective": "Modern control theory mainly focuses on linear system analysis and design.  This is the course where students from a variety of backgrounds begin to acquire the mathematical tools used in research literature involving linear systems.  The core material covered in this course is the theory of time-varying linear systems, in both continuous-time and discrete-time, with frequent specialization to the time invariant case.",
    "schedule": "Tentative schedule 暫定課程進度\n週次 Week　　單元主題 Topic\n1　　課程介紹\nCourse Introduction\n2　　線性代數\nBackground linear algebra\n3　　系統的數學描述\nMathematical descriptions of systems\n4　　線性化\nLinearization\n5　　狀態空間方程的解\nState-space solutions\n6　　論文報告 I\nPaper presentations I\n7　　系統實現\nSystem realizations\n8　　線性非時變系統的穩定度\nStability of LTI systems\n9　　期中考試\nMidterm exam\n10　　Lyapunov 定理\nLyapunov theorem\n11　　可控性\nControllability\n12　　可觀性\nObservability\n13　　論文報告 II\nPaper presentations II\n14　　互質分式\nCoprime fractions\n15　　最小階實現\nMinimal realizations\n16　　狀態迴授\nState feedback\n17　　期末考試\nFinal exam\n18　　論文報告繳交\nReports for presentations due\n\nPS: The contents and order of lectures and presentations will be adjusted according to actual needs 上述授課與報告內容及順序將因應實際狀況調整",
    "scorePolicy": "The final grade will be a weighted average of homework (including quizzes) 20%, midterm 25%, paper presentation and report 25%, and final examination 30%.",
    "materials": "Linear System Theory and Design - Fourth Edition, Chi-Tsong Chen, Oxford University Press, 2012",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >Response to government epidemic alert, course lecture and presentations will be offered online via Microsoft Teams at class hours and recorded lectures are available in iStudy.  Please refer to Taipei Tech's iStudy for details about this course.\n疫情警戒期間將透過 Microsoft Teams 線上授課及報告，授課錄影請登入北科 i 學園 +，細節請參照北科 i 學園 + 課程公告。</div>"
  }
]
