[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-06-01 11:38:53",
    "objective": "本課程之目的在探討如何運用科學與系統化的方式解決管理上的問題。整個過程包括：資料蒐集與問題分析、數量模式的建構、問題求解、成本效益分析、系統規劃設計與執行等步驟。課程內容主要以應用案例說明為主，讓同學瞭解理論如何與實際問題結合，也會介紹最佳化計算軟體來求解數學模式並輔助說明所得數據之意涵。\nThe purpose of this course is talking about how to utilize scientific and systematical approaches to solve management problems. The solution process includes data collection and problem investigation, model formulation, optimal solution derivation, cost and efficiency analysis, system implementation and execution etc. This course mainly contains various application cases. Accordingly, participant can understand how to apply theoretical methods on solving real problems. Computational software is also utilized to solve the formulated models and analyze and interpret the obtained solutions.",
    "schedule": "W1 Introduction to Management Science\nW2 Linear programming: application problems solved with Lingo\nW3 Linear programming: application problems solved with Lingo\nW4 Linear programming: application problems solved with Lingo\nW5 Linear programming: application problems solved with Lingo\nW6 Simplex method\nW7 Duality and sensitivity analysis (Homework 1 due)\nW8 Goal programming \nW9 Integer linear programming: application problems \nW10 Integer linear programming: application problems \nW11 Integer linear programming: application problems \nW12 Midterm exam \nW13 Decision analysis \nW14 Decision analysis (Homework 2 due) \nW15 Game theory with application problems \nW16 Presentation &amp; paper discussion\nW17 Presentation &amp; paper discussion\nW18 Presentation &amp; paper discussion",
    "scorePolicy": "Homework: 15% \nMidterm: 35%\nPaper presentation: 40%(Papers selected from Journal: INFOR, MS, OR, EJOR, C&amp;OR…)\nPresent situation: 10% (No more than three absences)",
    "materials": "Hamdy A. Taha, Operations Research- an introduction, 2017, 10th Edition, Prentice Hall.\nReferences:\n1. Optimization Modeling with Lingo, 2001, LINDO System INC.\n2. Wayne L. Winston, Operations Research- Applications and Algorithms, 2004, Thomson.\n3. Selected journal papers.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1. The online course platform is MS teams.\n2. The announcement will be informed via email.\n3. The way to reach the instructor is email.</div>"
  }
]
