[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2022-06-13 18:58:59",
    "objective": "This course aims to build up the financial framework for students when making financial decisions. It will focus on learning the fundamentals of financial management and applying for main decisions making while facing every day by the financial managers. It helps students to understand various tools of financial management and use them effectively when making investment and financing decisions.\n\nCourse Goals and Learning Objectives:\n1. Gaining financial experience/framework for students.\n2. Understanding basic principles of financial management.\n3. Applying knowledge to the Management Business Simulation. \n4. Roleplay as a CEO/CFO, students will apply various tools for financial management decisions.\n\nBy using an integrated Management Business simulation game as a major learning tool to illustrate how strategic and operational/financial decisions should be made in a competitive dynamic environment. So they will experience integrating and aligning key decision factors in different business scenarios. Simultaneously to achieve a set of defined performance objectives of a company by evaluating decision alternatives and tradeoffs for optimizing the resource utilization.",
    "schedule": "Week 07\tLearning MBS – Model 1-2 Game\nGroup presentation on planning and execution strategy (the two lowest-ranked teams in competition game: Round 2) \nGroup breakout session for competition game: Round 3 and 4\nDiscussion and analysis of results\nSubmit decisions for competition game: Round 5 (W)\nReturn on Investment and Financial Risk\n\nWeek 08\tLearning MBS – Model 4 Game\nGroup presentation on planning and execution strategy (selected teams) Group breakout session for the competition game\nDiscussion and analysis of results. Submit decisions for competition game: Round 8 (W)\n\nWeek 09\tReturn on Investment and Financial Risk\nWeek 10\tGroup presentation + Lecturing\nWeek 11\tLearning on Dividends and Valuing the Stock Price\n\tStudying TSMC for Stock Price Setting, 4 debates\nWeek 12\tReflections\nWorking on MBS – Model 4 Game: Discussion and analysis of execution strategy and Group breakout session.\n\nWeek 13\tReflections: Working Capitals and the Cost of Capitals\nWeek 14\tReflections: Group 2 + 4 \n\tGroup presentation on Model 4 – 10 mins for each group.\n\tThe competition Winner will get NT500 from Prof. Yang\n\tWorking Capitals and the Cost of Capitals\nWeek 15\tOptimal Portfolio Choice and the Capital Asset Pricing Model\nWeek 16\tReflections. Outing or Invite Speaker 講者邀請\n\tGroup Presentation on Blockchain Papers–25 Mins, including QA.\n\tPersonal Report submission: 2 Questions (Insights-new learning and Critiques).\nWeek 17\tReflections:  \n\tGroup Presentation on Blockchain Papers (Group 1 + 3) –25 Mins, including QA.\n\tOptimal Portfolio Choice and the Capital Asset Pricing Model\n\tOverview and Problem Solving+ 360 Evaluation/Assessments\nWeek 18\tReflections \nFinal Exam  hand in：360 Evaluation/Assessments",
    "scorePolicy": "Grades:\nThe final course grades will be determined by the following criteria and point distribution.\nGroup game planning and review/analysis\t20 %\nGroup competition games \t\t\t\t20 %\nParticipation (10-12 lucky draw)\t\t\t30 % (each class 3 points)\nFinal exam and peer evaluation\t\t\t30 %\t\t\t\t                  \nTotal \t\t\t\t\t\t               100 %\n*PS: Extra Bonus for servicing as a Class leader: 3 to 5 points add on to final score\nGroup leaders: 1 to 3 points add on to final score",
    "materials": "Jonathan Berk: Corporate Finance, the Core 4/E (subject to change)\nFintech, financial constraints and innovation: Evidence from China by Na Dinga, Leilei Gub, Yuchao Penga (2022)\nHow does FinTech affect the development of the digital economy? evidence from China, by Xiaohui Chen, Lei Teng *, Wen Chen (2022)The impact of the FinTech revolution on the future of banking: Opportunities and risks\nVictor Murinde, Efthymios Rizopoulos, *, Markos Zachariadis (2022)",
    "consultation": "Contact information:Shenchu.yang@gmail.comLine: shenchu.yangCell phone: 0932302756",
    "remarks": "If Taipei Tech announces distance learning, the course will be conducted by the following ways:1. The online course platform is: the MS team 2. The announcement will be informed via:  and Line group3. The way to reach the instructor is shenchu.yang@gmail.com,",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "趙莊敏",
    "email": "cmchao@ntut.edu.tw",
    "latestUpdate": "2022-05-25 17:34:26",
    "objective": "This course is to build up the financial framework for students when making financial decisions. The focus is on setting out the basic principles of financial management and applying them to the main decisions faced by the financial managers. It helps students to understand various tools of financial management and use them effectively when making investment and financing decisions.",
    "schedule": "My part is for the first six weeks:\n1 Introduction\n2 The Firm and the Financial Manager\n3 Agency Problem\n4 Financial Markets and Intermediaries\n5 Accounting and Finance\n6 Midterm Report",
    "scorePolicy": "Midterm Report  30%",
    "materials": "Brealey, R.A., Myers, S.C., and Marcus, A.J, “Fundamentals of Corporate Finance,”  McGraw-Hill/Irwin.",
    "consultation": "Please email the teacher for further inquiries or make appointments: cmchao@ntut.edu.tw",
    "remarks": "If the status of the pandemic situation suggests we adopt distance learning, a synchronous online class will be conducted for this course. Students can use the Cisco Webex link to join the class at the original class schedule.All the teaching materials and class video recordings will be posted in Taipei Tech i-School. I will also post the teaching materials in the Line group during the Add/Drop Period.",
    "foreignLanguageTextbooks": true
  }
]
