[
  {
    "name": "簡良翰",
    "email": "lhchien@ntut.edu.tw",
    "latestUpdate": "2022-06-17 16:18:43",
    "objective": "課程大綱：\n本課程之目的為訓練學生有關電子設備散熱設計之相關原理與技術。介紹各項電子元件之發熱量、溫度與元件穩定性之關係，熱對流、熱輻射等熱傳原理在電子設備散熱之的應用法則；解說電子設備散熱器之演進與設計原理，如：熱管之原理與演進、小型風散之特性與設計原則等。探討電子設備的熱阻抗分析、溫度計算、熱應力分析，並介紹相關電腦輔助分析軟體。\nThis course introduces principles and techniques of thermal management and cooling design of electronic equipments. Subjects of this course include: thermal and physical properties of electronic components, thermo-fluid phenomena and principles of thermal management for electronic devices, and the evolution of cooling devices such as heat pipes and micro fans, discussion of analysis methodologies and computer software of thermal management problems including thermal resistances, temperature gradient, and thermal stress.",
    "schedule": "週次\t授 課 內 容 要 項\n1\t電子設備散熱問題介紹 Introduction of the problems in cooling of electronics\n2\t熱傳導原理簡介與散熱鰭片之熱傳計算 Fundamentals of conduction theory and caluculation of fin efficiency\n3\t電子設備之熱阻與熱傳分析 Thermal resistance and heat transfer analysis of electronic cooling\n4    流體力學基礎 Fundamentals of fluid mechanics\n5\t雙十國慶 Holidy\n6    電子設備散熱系統壓降計算 Pressure drop calculation for cooling system of electronic devices\n7\t熱對流原理與氣冷式冷卻器 Principles of convection heat transfer and air cooled heat sinks\n8\t液體冷卻與微渠道熱傳 Liquid cooling and micro-channel heat transfer\n9\t期中考 Midterm exam\n10\t電子設備之散熱模組設計實例 Design case of cooling modules for electronic devices\n11\t蒸發與冷凝在電子設備散熱器之應用 Evaporation and condensation in cooling of electronics\n12   浸泡式電腦散熱系統 Immersion cooling of computer system\n13\t熱管原理與電子設備散熱之應用 Heat pipe theory and its application in cooling of electronics\n14\t電子設備之熱輻射問題解析 Thermal radiation analysis in cooling of electronics\n15\t電子設備散熱模組之氣流模擬與分析 Air flow simulation and analysis in cooling modules for electronic devices\n16\t電子設備散熱模組之氣流模擬設計實例 Design case of Air flow simulation in cooling modules for electronic devices\n17\t電子冷卻技術之發展方向 Trends of development in cooling of electronic devices\n18\t期末考 Final exam\n之發展\n18\t期末考",
    "scorePolicy": "作業 (Home work) 40% + 期中考 (Midterm exam) 30%+ 期末考 (Final exam) 30%",
    "materials": "1.\tRemsburg, R., Advanced Thermal Design of Electronic Equipment, International Thomson Publishing, Newyork, 1997.\n2.\tYeh, L.T. and Chu, R.C., \"Thermal management of microelectronic equipment: heat transfer theory, analysis methods, and design practices,\" ASME Press, New York, 2003.\n3.\tSergent, J. and Krum, A., Thermal Management Handbook, McGraw-Hill, New York, 1998.\n4.\tMills, A. F., Heat Transfer 2nd Ed., Prentice Hall, 1999.Myers, G. E., Analytical Methods in Conduction Heat Transfer, Genium Publishing, 1987.\n5.\tSteinberg, D. S., Cooling Techniques for Electronic Equipment, John Willey & Sons, Inc., New York, 1991.\n6.\tOosthuizen, P. H., Naylor, D., Convective Heat Transfer Analysis, , McGraw Hill, 1999.",
    "consultation": "1. 課程諮詢時間 Office hour: Monday 4:00~5:00pm, Thursday 3:00~4:00pm2. 開學後組成線上群組 Line group discussion: to be announced.",
    "remarks": "依據本校採遠距教學時機，採用 Microsoft Teams 進行線上教學，並提供上課錄影檔案連結功課後觀看。",
    "foreignLanguageTextbooks": true
  }
]
