[
  {
    "name": "王多柏",
    "email": "tpwang@ntut.edu.tw",
    "latestUpdate": "2022-05-31 19:51:22",
    "objective": "生物工程和醫療技術的研究和發展，在最近幾十年中，促成明確的臨床醫學和衛生保健的進步。這些領域的發展，開啟了生物工程、臨床技術和醫學信息領域課程的蓬勃發展；目前，各大學及研究所多有提供這些領域的課程。然而，大多數參與者多來自工程背景，因此學習生物科學和醫學應用於工程思維及模式，方能使得工程師和醫生之間的科學能無礙地交流。\n這項課程主要是為了使主修工程及材料的學生提供具有實用性的人體結構和組織的原則及相互依存的細胞和組織器官的生理系統進行有用的學習。雖然課程可能無法全然覆蓋所有生物醫學工程領域的基礎，但在這個學習過程中，我們將專注於大多數生物醫學工程以及生技和組織工程從事的主要研發領域作出努力。這門課程是醫學和工程及材料之間的橋樑。這將是促進各類工程及設計師和醫事人員之間文化和科學的交通和相互研習課程，促進生物醫學工程的創新發現和發展。在這個過程中，我們將提供一系列的生物學和醫學知識和方法，應用在工程、材料和電子領域，旨在幫助他們能將其整和連接，可以開始從工程進入生物醫學工程的專業，或者提供工程師期許能 “簡單” 理解特定臨床醫療科學和技術。經由醫學背景引導進入此領域，將結合工程及材料師長的經\nResearch and development in bioengineering and medical technology, conducted during recent decades, have led to spectacular progress in clinical medicine and healthcare. These achievements have triggered an enormous increase in the number courses offered in the areas of bioengineering, clinical technology and medical informatics; nowadays, most major universities offer curricula oriented towards these fields. The majority of participants however come from engineering background and so modules dealing with basic biological and medical sciences have been included, to the detriments of scientific exchanges between engineers and medical doctors. \nThis study is primarily to give those majoring in the electronic and engineering students a useful glimpse of the principles of human structure and organization and of the interdependence of cellular and organ physiological systems. Although it is no possible to cover all of the biomedical engineering domains in this course, we will have made an e",
    "schedule": "與房同經老師相同",
    "scorePolicy": "與房同經老師相同",
    "materials": "與房同經老師相同",
    "consultation": "與房同經老師相同",
    "remarks": "與房同經老師相同",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "房同經",
    "email": "nathan1@ms39.hinet.net",
    "latestUpdate": "2022-09-13 09:42:44",
    "objective": "什麼是人體結構和功能？\n人體結構與功能是一門非 必修 主要 課程，旨在探索人體形式和功能之間的\n基本關係。解剖學和生理學是生命科學中兩個最基本的術語和研究領域。解剖\n學是指身體的內部和外部結構及其物理關係，而生理學是指研究這些結構的功\n能。本課程旨在定義瞭 解剖學和生理學，並解釋了為什麼它們對生物醫學工程\n很重要。主要器官系統的解剖學和生理學將在正常和疾病狀態的背景下進行研\n究。學生將學習關鍵的生物過程，如中心教條，膜擴散和運輸，細胞信號傳\n導，氣體交換，血流，營養吸收，血液 pH 平衡以及動作電位的產生和傳播。然\n後，學生將應用這些知識來瞭解器官如何對維持體內平衡的各種輸入做出反\n應。 課程 將納入實踐演示，為課程中提供的資訊提供實用框架 :\n1. 根據位置，功能，關鍵成分和解剖命名法確定主要的人體系統。\n2. 展示對代謝功能和每個主要器官系統的生理控制的理解。\n3. 認識並綜合體內平衡 的原理，即主要器官系統在生理上如何相互關聯以維持\n人類健康。\n在學期階段，學生將廣泛瞭解身體系統如何在細胞，組織和器官\n系統 水平上發\n揮作用，並能夠將簡單的生理過程聯繫起來，以更好地了解社會中高度流行的\n疾病和對生物醫學工程重要實用框架。\n人體結構和功能的課程目標：\n1. 人體是一個 實用 的結構，它由四種主要類型的數十億個較小的結構組成：細\n胞，組織，器官和系統。\n2. 器官是幾種不同種類的組織，如此排列，以至於它們可以一起執行特殊功\n能。\n3. 系統是一個由不同數量和種類的器官組成的組織，它們如此排列，以至於它\n們可以一起為身體執行複雜的功能。\n4. 十個主要系統包括骨骼，肌肉，神經，內分泌，心血管，淋巴，呼吸，消\n化，泌尿和生殖系統。\n5. 身體功能是身體系統的生理或心理功能。身體的生存取決於身體維持或恢復\n其內部環境的體內平衡，這是一種相對恆定的狀態。\n6. 人類的生命過程包括組織、新陳代謝、反應性、運動、繁殖、生長、分化、\n呼吸、消化和排泄。所有這些過程在微調的平衡中協同工作，以維護個人的\n健康和維持生活。\n7. 生命依賴於環境中的某些物理因素，包括水，氧氣，營養物質，熱量 和壓\n力。\n人體結構和功能\n人體結構和功能課程課程的的學習學習評估評估：：基於出勤基於出勤以及以及課堂互動，每周提供一個課堂互動，每周提供一個帶回家的研究案例以突出所涵蓋系統的人體解剖學和生理學，每周測驗以及一帶回家的研究案例以突出所涵蓋系統的人體解剖學和生理學，每周測驗以及一個期中和期末測驗。個期中和期末測驗。\n人體的結構和功能的課程實踐體驗\n人體的結構和功能的課程實踐體驗\n如果人體解剖學和生理學的想法看起來很可怕，請不要擔心。本課程將通過以\n如果人體解剖學和生理學的想法看起來很可怕，請不要擔心。本課程將通過以平易近人且相關的格式涵蓋這些主題來減輕您可能有的任何恐懼。本課程將使平易近人且相關的格式涵蓋這些主題來減輕您可能有的任何恐懼。本課程將使您對人體所有複雜的功能和系統如何協同工作更加自信，並將您從解剖學和生您對人體所有複雜的功能和系統如何協同工作更加自信，並將您從解剖學和生理學方面學到的知識與您已經瞭解的身體聯繫起來。將此視為人體使用者指理學方面學到的知識與您已經瞭解的身體聯繫起來。將此視為人體使用者指南。有些人可能會說你不能沒有它！南。有些人可能會說你不能沒有它！\n本課程還將涵蓋身體的主要系統，並解釋它們是如何工作的，為什麼它們有時\n本課程還將涵蓋身體的主要系統，並解釋它們是如何工作的，為什麼它們有時不起作用。此外，它還將檢查不同的疾病和紊亂，醫學的最新進展以及照顧身不起作用。此外，它還將檢查不同的疾病和紊亂，醫學的最新進展以及照顧身體的方法。課程包括現實生活中的例子和互動練習，讓你批判性地思考自己的體的方法。課程包括現實生活中的例子和互動練習，讓你批判性地思考自己的經歷，並與課程建立聯繫。在整個課程中都使用經歷，並與課程建立聯繫。在整個課程中都使用全面綜合知識和理解全面綜合知識和理解，為您提，為您提供必要的學習材料，以便在您繼續接受教育或職業生涯時保留本課程及以後的供必要的學習材料，以便在您繼續接受教育或職業生涯時保留本課程及以後的內容。在本課程結束時，你將對人體的奇妙複雜性有更大的欣賞和理解。內容。在本課程結束時，你將對人體的奇妙複雜性有更大的欣賞和理解。",
    "schedule": "週次   日期   課程內容\n1. 9/16 人體研究導論 (chapter 1) \n2. 9/23 人體的化學組成與穩態的調節 (chapter 1 and 2)\n3. 9/30 血液 (chapter 13)\n4. 10/7 細胞 (chapter 3)\n5. 10/14 皮膚系統 (chapter 5)\n6. 10/21 骨骼關節系統 (chapter 6 and 7)\n7. 10/28 肌肉組織與肌肉細胞生理學 (chapter 9)\n8. 11/4 肌肉系統 (chapter 9)\n9. 11/11 期中考\n10. 11/18 神經組織 (chapter 10)\n11. 11/25 人類神經系統：脊髓與脊神經 (chapter 10)\n12. 12/2 人類大腦的功能與自主神經功能 (chapter 10) \n13. 12/9 人類大腦的功能與人類的感覺功能 (chapter 11)\n14. 12/16 人類大腦的功能與人類的運動功能 (chapter 8 and 10)  \n15. 12/23 循環系統 (循環系統的組成與血管構造)  (chapter 15)\n16. 12130 循環系統 (心臟構造與心動週期)  (chapter 14) \n17. 1/6 淋巴系統與疫系統 (chapter 16)\n18. 1/13 期末考",
    "scorePolicy": "期中考 【 25%】\n期末考 【 25%】\n課堂作業及報告 【 50%】\n* 上課注意事項 *\n1. 堅持 100% 比堅持 99% 做得到\n2. 遲到與早退扣學期成績 5%\n3. 上課不到扣學期成績 10%\n4. 請假：公假請提前一周報告；臨時病 / 事假出示正式證明文件\n5. 上課禁止飲食及手機使用\n6. 考試請準時參加，試後無補考\n7. 欺騙造假作弊經證實，成績零分並依校規辦理",
    "materials": "Gale Sloan Thompson: Understanding Anatomy & Physiology: A Visual, Auditory, Interactive Approach  3rd Edition 2020. F.A.Davis \nFrederic H. Martini: Visual Anatomy & Physiology. 3rd edition 2018. New York, NY: Pearson,\n1. Kenneth S Saladin: Anatomy and Physiology The Unity of Form and Function. (9th, 2022)\n2. Eric P Widmaier: Vander Human Physiology. (16th, 2022)\n3. John E Hall: Guyton and Hall Textbook of Medical Physiology. (14th, 2020)",
    "consultation": "email:ftj@ntut.edu.tw",
    "remarks": "北科 i 學園",
    "foreignLanguageTextbooks": true
  }
]
