[
  {
    "name": "\n  黃如瑩　教師諮商時間(Office Hours) ",
    "email": "vinia@ntut.edu.tw",
    "latestUpdate": "2022-09-14 14:54:34",
    "objective": "The purpose of this course is to create a context for our students to clearly express themselves in English and to effectively communicate with others on current issues most relatable to them.",
    "schedule": "I.　　Syllabus:\nWeek 1: Introduction\nWhy do you think there are less high school students choose English as their major?\nWhy do you think there are more and more high school students choose other Asian languages, especially Korean and Japanese, as their major? \n.\nTheme One: Entering into university\nWeek 2: \nHow to balance yourself between school course work and extra-curriculum activities?\n\nWeek 3: Are there many required courses for freshman students? Shall a university student just focus on the courses that interests him/her?\n\nWeek 4: \nDo you have the habit of procrastination? How do you tackle this problem?\n\nWeek 5: \nHow to cover all the expenses for a university student studying in Taipei city? Will you try to live within your budget? Are you looking for a part-time job?\nWeek 6: Have you used social apps to make friends? What are the advantages and disadvantages of making friends on social apps?\n\nWeek 7: \nAre you interested in cultivating a second and even a third specialization? \nDo you know your potential and goal(s) in life?\n\nWeek 8:\nAre you planning to study abroad (or work overseas) in the near future?\nOr, you would like to stay in Taiwan?\nWhat motivates you to do so? What do you plan to achieve?\n\nWeek 9 (Mid-term exam week): midterm group presentations\nTheme Two: Let's observe how famous people talk\nTexts collected in this FB Page: Voice and Converse\nWeek 10:\n American English by Hillary Clinton; British English by Emma Watson\nWeek 11: \nYoung American's English by Nathan Chen\nWeek 12: \nNon-native English speaker Malala Yousafzai\nWeek 13: \nNon-native English speaker Ukrainian President Zelensky\n\nTheme Three: Let's observe the voice of a character\nTexts collected in this FB Page: Voice and Converse\nWeek 14: \nThe different dubbings of Howl's Moving Castle\nWeek 15: \nThe voices of Tom Hiddleston\nWeek 16: \nThe voices of Benedict Cumberbatch\nWeek 17: \nThe voice of Sir David Attenborough\n\nWeek 18 (Final examination week): Final group presentations",
    "scorePolicy": "I. Weekly performance in classroom participation and dialogue presentation: \n5% X 16 = 80%\nII. Midterm and final group presentations: 20%",
    "materials": "1. Good Chats (3rd edition),by Sandsberry, Sorenson, and Ring. Taipei: Bookman, 2008.\n2. Essential Idioms in English (New Edition), by Dixson. New York: Pearson Education, 1994.\n3. Dictionary of Idioms, by Terban.  New York:  Scholastic, 1996.\n4.Idioms Made Easy:  Stories of Selected English Idioms. By Tseng and Kao. Taipei: Bookman, 2004.",
    "foreignLanguageTextbooks": true,
    "remarks": "1. Through e-mails\n2. Through LINE messages\n3. Face to face meetings"
  }
]
