[
  {
    "name": "\n  葛瑞斐　Office Hours ",
    "email": "griffith@ntut.edu.tw",
    "latestUpdate": "2022-06-17 11:27:24",
    "objective": "在 20 世紀末和 21 世紀初，另類藝術形式 —— 電影、漫畫書、電子遊戲 —— 在塑造我們的文化和日常生活方面變得越來越有影響力。\n看看電影、電視和其他形式的流行文化，如流行音樂和漫畫書，我們將考慮流行文化在西方和東方的性質和意義。 在我們將提出的問題中：流行文化與學校通常研究的傳統或 “高雅” 文化有何不同？ 評價此類作品的標準是什麼？ 我們是否應該像評價經典作品一樣重視流行文化作品？ 流行文化的好壞有區別嗎：流行的東西能好嗎？ 流行的東西一定是好的嗎？\n課程設計基於對可觀察到的文化現象和媒體演繹的比較討論。 看電影和文化之旅（待定）是課程的重要組成部分。 採用連續三期的形式，使課程實施更加靈活有效。\nIn the late 20th and early 21st centuries, alternative forms of art – movies, comic books, video games – became increasingly influential in shaping our culture and our daily lives.\n\nLooking at films, television, and other forms of pop culture like pop music and comic books, we will consider the nature and significance of pop culture in the West and in the East.  Among the questions we will ask:  How does pop culture differ from traditional or “high” culture normally studied in schools?  What are the standards for evaluating such works?  Should we value pop culture works in the same way as classic works?  Is there a difference between good and bad pop culture:   Can what is popular be good? Must what is popular be good?\n\nThe course design is based on comparative discussion of observable culture phenomena and media renditions. Viewing films and having culture tours （TBD) are the essential parts of the course. Adopting a consecutive three-period format allows the course implementation more flexible and effective.",
    "schedule": "Week 　　1: Introduction\n　　\n2-5: Definitions of Pop Culture　　\n\n6-8: Popular Culture in the News\n\n9: Midterm week\n\n10-13: Popular Culture and Ethics\n\n14-17: Popular Culture and Critical Reasoning\n　　\n18: Finals week",
    "scorePolicy": "Grades:\n　　Midterm  50%\n　　Final       50%\n　　\n\n\nAttendance:   \n　　a combination of 3 absences or late days or classwork zeroes =  -10 points from course grade\n　　a combination of 4 absences or late days or classwork zeroes =  failing course grade\n\nWeekly response pages:  each missing/late paper  =  -10 points from course grade",
    "materials": "Texts:\n       Course book",
    "foreignLanguageTextbooks": true,
    "remarks": "No"
  }
]
