[
  {
    "name": "\n  鄭以旋　教師諮商時間(Office Hours) ",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2022-06-08 16:54:39",
    "objective": "This course teaches relevant and up-to-date business topics such as finance, globalization, start-ups, marketing, logistics, risk management and business ethics (e.g. fair trade). We will also read foundational literature on economics to familiarize students with basic concepts in commerce and business. Lastly, students will be taught practical business English skills in writing and speaking.",
    "schedule": "Schedule:\n\nWeek 1 – Introduction \nWeek 5 – Holiday\nWeek 8 – Mid-term\nWeek 9 – School mid-term (no class)\nWeek 16 – Final Exam\nWeek 17 - Holiday\nWeek 18 – School exam week (no class)\n\nWeeks 2, 3, 4, 6, 7, 10, 11, 12, 13, 14, 15:\n1.　　Work on a selected unit from the textbook. \n2.　　Read and discuss one current business news article or issue.\n3.　　Group presentation (schedule to be determined).",
    "scorePolicy": "Attendance policy:\nSeven or more absences from Week 3 onwards will result in a grade of 0% for the course.   \n\nAssessment:\nMid-term* 　　　　　　　　　　25%\nFinal exam* 　　　　　　　　　　35%\nGroup presentation　　　　　　　　30%\nAttendance and participation　　　　10%　　　　\n\n* At the lecturer’s sole discretion, a make-up Mid-term or Final exam may be granted upon presentation of a valid proof of illness (medical certificate or record of hospitalization) within 10 days of the date of absence.\n\nTextbook: The Business – Advanced, MacMillan (to be confirmed)",
    "materials": "Textbook; The Business – Advanced, MacMillan (to be confirmed)\n\nReadings (subject to change):\n\n•　　Nick Srnicek, “Chapter 2: Platform Capitalism,” Platform Capitalism, 2016.\n•　　Thomas Piketty, “Introduction,” Capital in the Twenty-first Century, 2013.\n•　　Steven D. Levitt and Stephen J. Dubner, “Chapter 5: What Makes a Perfect Parent,” Freakonomics, 2005.\n•　　Abhijit Banerjee and Esther Duflo, “Chapter 1: MEGA Make Economics Great Again,” Good Economics for Hard Times, 2019.",
    "foreignLanguageTextbooks": true,
    "remarks": "Students may make appointments for consultation during office hours with the lecturer in advance by email."
  }
]
