[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-06-04 11:50:33",
    "objective": "本課程以當代文學批評和文化理論為基礎，探討小說與戲劇改編成電影的過程中，文字轉化成視覺意象之間的差異，期能提升多元化的思辯及表達能力。\nDrawing upon modern literary criticism and cultural theory, this course aims to examine the difference between works of literature and the distinctive medium of the cinema. Students will be offered a variety of discussion which stimulates the kinds of critical thinking that lead to a better understanding of the process of transposition from literature to film.",
    "schedule": "In this course, we will watch approximately six films that approach the idea of literary adaptation from a variety of ways. By reading excerpts of the literature the film was based on, we will discuss the variety of ways in which adaption may be done and students will judge the extent to which the film is successful as film and the extent to which the film is successful as adaptation. \n\nThe final selection of films and texts has not yet been set, but students may contact me if they need more information about the films I am considering. I am potentially interested in including the new Cyrano de Bergerac film. (You will enjoy the play.) I also plan to include at least one adaptation of Shakespeare, and one adaptation of a fantasy text. I may also consider the loose adaptation of The Odyssey, Oh Brother Where Art Thou?\n\nStudents will write short reflections after viewing the films and may make short presentations on the filming techniques used, etc. \n\nFor the final project, students may choose to write a formal film analysis or to do a creative project in which they make a short film adaptation (under ten minutes) or film trailer (i.e. something akin to the Doctor Faustus trailer we watched in the literature class--with a different text chosen).",
    "scorePolicy": "Quizzes and In-class work: 25%\nReflections: 20%\nFinal Analysis/Creative Film: 30%\nPresentation(s): 15%\nParticipation: 10%\n\nThese categories may be modified at my discretion.",
    "materials": "Films\nCourse Packet\nExcerpts of literary texts (at times I may ask you to buy the whole book; at other times I may put excerpts into a course packet)\nHandouts",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >I will make use of MS Teams for both in-person and distance learning. See the following page for instructions: https://britamericanlit.wordpress.com/ms-teams-login-information/</div>"
  }
]
