[
  {
    "name": "\n  施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-09-12 04:43:14",
    "objective": "本課程以當代文學批評和文化理論為基礎，探討小說與戲劇改編成電影的過程中，文字轉化成視覺意象之間的差異，期能提升多元化的思辯及表達能力。\nDrawing upon modern literary criticism and cultural theory, this course aims to examine the difference between works of literature and the distinctive medium of the cinema. Students will be offered a variety of discussion which stimulates the kinds of critical thinking that lead to a better understanding of the process of transposition from literature to film.\n\nIn this course, we will watch films and film clips that approach the idea of literary adaptation from a variety of ways. By reading excerpts of the literature the film was based on, we will discuss the variety of ways in which adaption may be done and students will judge the extent to which the film is successful as film and the extent to which the film is successful as adaptation. \n\nFor the final project, students may choose to write a formal film analysis or to do a group or individual creative project in which they make a short film adaptation (under ten minutes) or film trailer (i.e. something akin to the Doctor Faustus trailer we watched in the literature class--with a different text chosen—approximately three minutes but extremely well edited). The creative project is my preference. Students will introduce their film and/or trailer and explain their rationale and adaptation strategies. I will try to keep the workload as equal as possible for the two project options—thus, people working on the film analysis will have separate library and peer review assignments on the days that filmmakers are filming/editing. \n\nWhy should you take this course? \n・　　Many of you may be working with films, literature, or film adaptation for your senior projects. Some of the secondary sources we are reading will be quite helpful to you. \n・　　The course will help you learn more about filming and editing and will allow you to explore your creative side.\n・　　You will (hopefully) feel accomplished when you complete your project and show it to your classmates. If you’re pleased with the product, the short film can be a line on your resume. \n・　　You’ll read some great selections of literature and/or view interesting literary adaptations. This is the first time I’ve ever had the opportunity to teach the play Cyrano de Bergerac, which I love, and I hope you will love it too. (I have mixed feelings about the 2021 film, but I think it’s worth viewing.) The Two Towers is one of my favorite texts to teach, and, as Tolkien’s work comes back into the popular culture limelight with the Rings of Power series, it’s worthwhile to revisit some of the adaptations.) Shakespeare adaptations are always worth viewing, and the two we are watching are not usually taught in the Taipei Tech Shakespeare class. Jane Austen’s cultural afterlives show an interesting intersection between high and popular culture. It’s worthwhile to consider the peculiar perils of attempting to adapt a mystery on film with Agatha Christie’s Murder on the Orient Express, and Oh Brother Where Art Thou? is an extremely interesting transformation of Homer’s Odyssey, useful for any budding filmmaker or critic to see.",
    "schedule": "Week 1: Introduction \nWeeks 2–3: Much Ado About Nothing and Othello\nWeek 4: From A Theory of Adaptation\nWeek 5: No class\nWeek 6: Informal presentation discussing a scene from a Jane Austen adaptation\nWeek 7: The Odyssey/Oh Brother Where Art Thou?\nWeek 8: No class\nWeek 9: Murder on the Orient Express\nWeek 10–11: Cyrano De Bergerac\nWeek 12: The Two Towers (excerpts)\nWeek 13: Filming on your own (if you are doing the filming option)\nWeek 14: The Two Towers (excerpts)\nWeek 15: The Two Towers (film)\nWeek 16: Wrap-up, Filming Meeting\nWeek 17: No class\nWeek 18: Final presentation of films",
    "scorePolicy": "Grading Criteria:\nQuizzes, Homework, Online, and In-class work: 30%\nFinal Analysis/Creative Film Adaptation: 40%\nFormal and Informal Presentations: 20%\nParticipation: 10%\n\nThese categories may be modified at my discretion.",
    "materials": "Selected Readings in a Course Packet \nDownloadable Materials on MS Teams\nCyrano de Bergerac (Edmund Rostand, 1897)\nMurder on the Orient Express (Agatha Christie, 1934) \nThe Two Towers (J.R.R. Tolkien, 1954)",
    "foreignLanguageTextbooks": true,
    "remarks": "FALL 2022 office hours will be Mondays (by appointment) from 11:10–12:00 and Wednesdays from 1:10–4:00 (appointment recommended)."
  }
]
