[
  {
    "name": "\n  陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2022-06-05 13:53:43",
    "objective": "In literary studies, when we encounter the term \"legend\", it is often understood as stories that center on human protagonists rather than supernatural beings - as differentiated from \"myth\" - such as the stories of King Arthur and his knights, the search for the Holy Grail, and the dragon-slaying in medieval literature. This course, however, will not be limited by the scope of the Middle Age and will extend the definition of \"legend\" by examining the prominent archetypes in Western literature. The course will explore how these archetypes not only form the basis of classic literature, but also pervade and enrich our popular culture including films, anime, and video games.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction to the course\n\nWeek 2-5: the legend of gods and heroes\nTexts: The Iliad, The Song of Roland\nFilms: Troy, The Kingdom of Heaven\nVideo Games: Assassin's Creed\nCritical essay: to be decided\n\nWeek 6-9: the Christian legend: God and the Devil\nTexts: The Bible (King James Version), Paradise Lost\nFilms: The Devil's Advocate\nCritical essay: to be decided\n\nWeek 10-13: the legend of the libertine and the Romantic hero\nTexts: Marquis de Sade's works (to be decided), William Blake's poetry, Byron's poetry\nFilms: Quills, BBC's Byron\nCritical essay: to be decided\n\nWeek 14-17: the legend of monsters: the vampire and the cannibal\nTexts: Bram Stoker's Dracula, Anne Rice's The Interview with the Vampire\nFilms: Dracula, The Interview with the Vampire, Hannibal, Alien\nAnime: Attack on Titan\nGames: Diablo, Starcraft\nCritical essay: to be decided\n\nWeek 18: Mock conference of students' final paper",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 20%\nIndividual presentation (mock conference): 30%\nFinal paper: 30%",
    "materials": "To be announced.",
    "foreignLanguageTextbooks": true,
    "remarks": "Office: 共同科館 409\nEmail: kpchen@ntut.edu.tw"
  }
]
