[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2022-06-05 23:51:13",
    "objective": "本課程強調全方位的國際商用英語溝通。現今各領域上之商業活動多以英語進行，因此本課程注重發展學生以英語文進行流暢之溝通的關鍵能力，特別強調商業組織內外部常見的正式溝通之形式，包括商用英語寫作、簡報與會議技巧。課時也納入非正式溝通技巧，指導學生學習應對職場情境，因應相關之溝通需求。\nThis current course emphasizes a holistic view of business communication in a global context.  Given that business communication across from fields of business activities is now made possible by the English language, the course thus aims to develop the ability to use critical skills essential to successful communication in English, with particular emphases on forms of formal communications that are highly visible within and outside business organizations, including writing of business correspondence and reports, presentations and meetings. Informal communication skills are also incorporated to address workplace situations to identify the relevant communication needs.",
    "schedule": "Week\tTopic\n1\tCourse overview and ice breakers \n2\tU1 Connections: Cross-cultural communication \n3\tU2 Careers: Managing discussion \n4\tU3 Change: Showing understanding \n5\tU4 Risk: Taking part in a teleconference \n6\tU5 Teamwork: Dealing with conflict \n7\tPerformance\n8\tU6 Progress: Brainstorming ideas \n9\tMidterm \n10\tSWOT analysis presentation\n11\tU8 Performance: Giving an impromptu presentation\n12\tU9 Resources: Dealing with misunderstandings\n13\tU10 Leadership: Giving a briefing \n14\tVideo resume \n15\tU11 Values: Reaching agreement \n16\tU12 Persuasion: Selling an idea \n17\tBusiness pitch presentations\n18\tBusiness pitch presentations\n\nNote: The weekly schedule is occasionally subject to change due to time constraints, unexpected disruptions, or needs of the class.  Readings and online conferences should be done before that week’s class.",
    "scorePolicy": "The course adopts a 100 point scale for grading. Your grade will be based on the quality of your work in the following areas. The distribution of each item may be subject to change accordingly. \n\n                                                           \nAssignment\t                       Points\nAttendance and participation \t15%\nAssignments \t                        20%\nProjects and presentations\t65%\nTotal\t                              100/100%",
    "materials": "Baade, K., Hollowway, C., Scrivener, J., & Turner, R. (2018). Business result (Advanced). Oxford: OUP. \n\n*Additional readings will be supplemented.",
    "consultation": "Contact email: hichen@mail.ntut.edu.tw",
    "remarks": "本學期原則採實體授課方式；因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) Microsoft Teams will be used for online classes. To log in: 帳號：學號 @cc.ntut.edu.tw 密碼：自己校園入口網站的密碼",
    "foreignLanguageTextbooks": true
  }
]
