[
  {
    "name": "\n  林彥良 ",
    "email": "ericlin@ntut.edu.tw",
    "latestUpdate": "2022-09-10 09:44:07",
    "objective": "This course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers.  Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers.  The main topics for instruction include: the research process; major research methods; and the structure of a research paper.  The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.",
    "schedule": "W1. Introduction to Research:\nDifferent types of research / What is a research paper? \nW2. Research Design:\nWhat makes a good research question? / Online resources\nW3. Data Collection &amp; Coding: Audio- and video-recorded data, experiments, questionnaires &amp; interviews, observation, etc. \nW4. Using Computers to Study Texts:\nCorpora &amp; discourse analysis; compiling your own corpus\nW5. Analyzing Quantitative Data &amp; Statistics\nW6. Analyzing Qualitative Data \nW7. APA Style &amp; Citing Sources (Bullock, pp 170-207)\nW8. Project Presentation \nW9. Midterm",
    "scorePolicy": "Project Presentation (group presentation): 25%\nProject Report (group report): 25%\nMidterm: 30%\nParticipation, In-class Tasks &amp; Assignments: 20%",
    "materials": "Bullock, R., Brody, M., &amp; Weinberg, F. (2017). The little seagull handbook. New York: Norton. (Required, Available in the Taipei Tech bookstore)\nMackey, A., &amp; Gass, S. M. (2015). Second language research: Methodology and design. New York: Routledge. (Available online)\nWray, A., &amp; Bloomer, A. (2006). Projects in linguistics: A practical guide to researching language. London: Hodder Arnold. (Available online)",
    "foreignLanguageTextbooks": true,
    "remarks": "ericlin@ntut.edu.tw"
  },
  {
    "name": "\n  施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-09-12 04:34:32",
    "objective": "本課程介紹研究方法和論文寫作知識，期能培養學生獨立研究和撰寫學術報告、論文的基本能力。主要分為三部份：（一）研究內涵與步驟，（二）主要的研究方法，（三）如何撰寫英文論文及報告。涵蓋主題包括：運用圖書館資源選擇研究主題、研究計劃的撰寫、問卷調查法、訪問法、觀察法、田野工作研究方法、文獻資料分析法（內容分析法）、個案研究法、相關研究法、實驗法、文學研究法，研究報告論文格式與寫作要領，如何撰寫文獻探討，參考書目寫法等。\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers.  Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers.  The main topics for instruction include: the research process; major research methods; and the structure of a research paper.  The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.",
    "schedule": "This course is required for all juniors, but you may wish to choose the section first (literary or linguistics) that best matches your desired senior project. (Last year, only just over half of the students ended up choosing the half first that ended up matching their senior project topic.) \n\nYou will receive a detailed syllabus on the first day of class, but topics include project management; how to do in-library research (at Taipei Tech and NTU), archival research, open-access resources, and database research; how to find strong sources; MLA-style citation; and avoiding plagiarism. Students will, by the end, turn in a proposal and annotated bibliography that would be suitable for sharing with their senior-project advisor as a proposal or even first draft. \n\nStudents are reminded that, while they are allowed to discuss the *possibility* of working with a particular advisor during any part of the semester, professors have been strongly advised not to take on any students until Ms. Zhang (Ya-ting) makes the announcement--usually in week 10 or so of the semester.",
    "scorePolicy": "Presentations: 20%\nQuizzes: 20%\nAssignments: 25%\nProposal and Annotated Bibliography: 25%\nParticipation: 10%",
    "materials": "The Seagull Handbook, 4th edition (Please buy from Bookman Representative on Wednesday 9/14 from 11 a.m. to 1:00 p.m. in the 4th floor lobby.) \nCourse Packet",
    "foreignLanguageTextbooks": true,
    "remarks": "FALL 2022 office hours will be Mondays from 11:10–12:00 (by appointment) and Wednesdays from 1:10–4:00 (appointment recommended)."
  }
]
