[
  {
    "name": "華國媛",
    "email": "kyhwa@ntut.edu.tw",
    "latestUpdate": "2022-05-29 23:51:58",
    "objective": "Introduce the trend of the emerging biomedical industry and its cross-field characteristics. Course content includes: Introduction to the Biomedical Industry, New Century Human Genome Project, New Applications of Microbial Engineering, Development of New Protein Pharmaceuticals, Innovations in Molecular Medical Diagnosis, New Computer Technology in the Biomedical Industry, New Models of Telemedicine Services, Innovative health management and insurance system innovation, biomedical industry and technology law, biomedical industry and social ethics, new stem cell industry, new industry of tissue regeneration, the birth of super mice, beautiful biomedical beauty, new anti-cancer research technology, New technology to fight infectious diseases. The grading method is mainly based on student reports.\n\n介紹新興生醫產業的趨勢與其跨領域之特性。課程內容含：生醫產業簡介，新世紀人類基因體大計畫，微生物工程新應用，新型蛋白質藥劑之開發，分子醫療診斷之革新，生醫產業之電腦新科技，遠距醫療服務新模式，創新健康管理與保險制度的創新，生醫產業與科技法律，生醫產業與社會倫理，幹細胞新產業，組織再生新產業，超級老鼠的誕生，美美的生醫美容，抗癌症研究之新科技，抗傳染疾病之新科技。評分的方式以學生報告為主。",
    "schedule": "Week\tTitle\n1.\t\tIntroduction to the Biomedical Industry (生醫產業簡介)\n2.\t\tHuman Genome Project for the New Century (新世紀人類基因體計畫\n3.\t\tNew applications of microbial engineering (微生物工程新應用)\n4.\t\tDevelopment of new protein medicine (新型蛋白質藥劑之開發)\n5.\t\tInnovation in molecular medical diagnosis (分子醫療診斷之革新)\n6.\t\tNew Stem Cell Industry (幹細胞新產業)\n7.\t\tTissue Regeneration New Industries (組織再生新產業)\n8.\t\tBiomedical Industry and Social Ethics (生醫產業與社會倫理)\n9.\t\tMid-term Exam (期中報告)\n10.\t\tIndustry Teacher (專利佈局)\n11.\t\tIndustry Teacher (技術作價)\n12.\t\tIndustry Teacher (生物製劑)\n13.\t\tIndustry Teacher (精準醫療)\n14.\t\tIndustry Teacher (數位醫療)\n15.\t\tIndustry Teacher (數位醫療)\n16.\t\tIndustry Teacher (新藥新劑型)\n17.\t        Industry Teacher (高風險醫療器材)\n18.\t\tFinal EXAM",
    "scorePolicy": "Evaluation: Attendance (30%) + Seminar note (20%) +  online presentation (50%)\n(評估：出勤率 (30%) + 研討會筆記 (20%) + 報告 (50%))\n\nPresentation note: Each person has 10-15 min online present.  The maximum slide number is 15.\n(演示說明：每個人有 10-15 分鐘的時間進行 (英文) 線上演說。最多幻燈片數為 15 張)",
    "materials": "Industry report (產業報告)\nCompany case report (公司個案)",
    "consultation": "If you have any question in regards to the class, you can reach the TA or me:1. in class discussion 2. prior or after class discussion with TA3. via TEAM or Line group",
    "remarks": "We will use Microsoft Team for the class.  Register and download the software:https://www.microsoft.com/zh-tw/microsoft-teams/group-chat-software",
    "foreignLanguageTextbooks": true
  }
]
