[
  {
    "name": "吳欣怡",
    "email": "cinewu@mail.ntut.edu.tw",
    "latestUpdate": "2022-05-28 11:06:53",
    "objective": "This course aims to give the guidance to the film essay writing. In films, the off-screen elements usually play much profound roles than the on-screen ones. In the sense, the relation between the visuality and the hidden elements will be examined from scenes to scenes. Also, we will survey some of the philosophical, theoretical, and the critical literatures to further analyze the invisible aspects in the images.\n    During this course we will focus on the subjects of “Time” and “Film sounds”. Since both subjects are invisible and they are the cinematic elements that are significant to this art form. At the end of this course, the auteur films will be discussed. Course requirements include a midterm essay, an oral presentation, and a term paper .",
    "schedule": "WK 1: Introduction  \n\nPhase 1: Time and consciousness\nWK2-5\nEugenie Brinkema, 2009. “Writing about Media!”\nScreening (S) Nostalghia, 1983, Tarkovsky (Russia)\nReading (R) Sokolowski, R.. 1999. ‘Ch.9 Temporality,’ Introduction to Phenomenology, Cambridge University Press. UK. Pp. 130-145.\n\nPhase 2: Film Space\nWK6-8\n(S) Tokyo Story, 1953, Ozu (Japan)\n(R) McDonald, Keiko. 1982. ‘Ozu’s Tokyo Story: Simple Means for Complex Ends,’ in The Journal of the Association of Teachers of Japanese , Apr., 1982, Vol. 17, No. 1 (Apr., 1982), pp. 19-39\n\nWK 9: Midterm Study\n\nWK 10-11 : Oral presentation\n\nPhase 3: Film Sounds\nWK12-14\n(S) Three Colors: Blue, 1993, by Krzysztof Kielowski\n(R) Michel Chion, 1994. Translated by Claudia Gorbman. “The AudioVisual Scene,” Audio-Vivsion: Sound on Screen. Columbia University Press. pp. 66-94.\n(R) Silverman, Kaja. 1988. “Body Talk,” The Acoustic Mirror. IN: Indiana University Press. pp. 42-71.\n(R) Irena Paulus and Graham McMaster. 1999. Music in Krzysztof Kielowski's Film \"Three Colors: Blue\". A Rhapsody in Shades of Blue:The Reflections of a Musician, International Review of the Aesthetics and Sociology of Music, Vol. 30, No. 1(Jun., 1999), pp. 65-91.\n\nPhase 4: Auteur Film\nWK15-17\n(R) Sarris, Andrew. 1962. “Notes on the Auteur Theory”.\n(R) Peter Wollen. 1972.“The Auteur Theory”.\n\nWK 18: Feedback",
    "scorePolicy": "• Attendance and strong participation in class. 20%\n• Midterm essay (1000 words). 30% \n• Oral presentation. 20% \n• Final essay (1000 words). 30%",
    "materials": "Refer to the syllabus.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div>"
  }
]
