[
  {
    "name": "陳匡正",
    "email": "kchen34@gmail.com",
    "latestUpdate": "2022-05-29 06:20:57",
    "objective": "為保障著作人著作權益，調和社會公共利益，促進國家文化發展，國家特制定著作權法；本課程重心在於介紹我國著作權法之內涵，包含該法所保護之「著作」範圍、權利人及著作權範圍、著作權管理及權利侵害之救濟等，除講授理論外，同時搭配案例解析，以期讓同學對著作權法有最完整之了解。\nCopyright Act is specifically enacted for the purposes of protecting the rights and interests of authors with respect to their works, balancing different interests for the common good of society, and promoting the development of national culture. This course introduces the main meanings, concepts and contents of the Copyright Law. Including the scope for copyright protection, the kinds of works that qualify for copyright protection, the rights granted to copyright owners, the management of copyright, and remedies for right infringement. The discussion in the course covers theory and examples, to enhance a deeper understanding of Copyright for the students.",
    "schedule": "Week 1 (111/9/12~111/9/17) Introduction: Legislative Purpose of Copyright Act\nWeek 2 (111/9/19~111/9/24) Choices of the Principle of Creative Protection and Registration System\nWeek 3 (111/9/26~111/10/1) Copyright Protection for Animals’ Works\nWeek 4 (111/10/3~111/10/8) Concretely Application on the Doctrine of Idea-Expression Dichotomy and the Merger Doctrine of Idea and Expression (I) \nWeek 5 (111/10/10~111/10/15) Concretely Application on the Doctrine of Idea-Expression Dichotomy and the Merger Doctrine of Idea and Expression (II)\nWeek 6 (111/10/17~111/10/22) Are Pornography or Obscene Works Copyrightable?; Agreements on Authors’ in the Works Made for Hire and Their Impacts on Ownership of Moral Rights (I)\nWeek 7 (111/10/24~111/10/29) Agreements on Authors’ in the Works Made for Hire and Their Impacts on Ownership of Moral Rights (II)\nWeek 8 (111/10/31~111/11/5) Distinguish between Joint Works and Collective Works\nWeek 9 (111/11/7~111/11/12) Discussions about Forever Protection of Moral Rights \nWeek 10 (111/11/14~111/11/19) Whether Moral Rights are not Enforced by Agreement or not?\nWeek 11 (111/11/21~111/11/26) Public Performance, Public Broadcast, and Public Presentation \nWeek 12 (111/11/28~111/12/3) Whether Parallel Importation of Copyright is Legal or not in Taiwan? \nWeek 13 (111/12/5~111/12/10) Whether Neighboring Rights should be Included in Taiwan Copyright Act or not?; Introduction of Plate Rights\nWeek 14 (111/12/12~111/12/17) What are Scopes of General Clause about Fair Use in Taiwan Copyright Act?; Electronic Rights Management Information and Technological Protection Measures\nWeek 15 (111/12/19~111/12/24) Whether Re-licensing by Members of Collective Management Group is Banned or not?; New Trends about Amendments of Taiwan Copyright Act\nWeek 16 (111/12/26~111/12/31) Final Project Report (I)\nWeek 17 (112/1/2~112/1/7) Final Project Report (II)\nWeek 18 (112/1/9~112/1/14) Winter Vacation",
    "scorePolicy": "1.Final Project Report 70%\n2.Class Attendance 20%\n3.Class Participation and Performance 10%",
    "materials": "1.Chi-Yu Chien, Case Analyses of Copyright Law (Angle Publishing Co. Ltd., 2017).\n2.Hsiung-Lin Hsiao, Copyright Law (Wu-Nan Book Inc., 2015).\n3.Hsiung-Lin Hsiao, Analyses of Practical Issues in Copyright Law (Wu-Nan Book Inc., 2013).\n4.Chung-Hsin Chang, Interpretation of Copyright Law (Wu-Nan Book Inc., 2014).",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >※「一級」及「二級」警戒：實體授課。\n※「三級」(含) 以上警戒：課程全部採取遠距授課。\n●上課方式：上課使用 Microsoft Teams 視訊會議軟體進行遠距教學。\n●評量方式：\n1. 期末專題報告 70%\n2. 上課出席 20%\n3. 上課參與及表現 10%</div>"
  }
]
