[
  {
    "name": "劉宇晨",
    "email": "ycliu@ntut.edu.tw",
    "latestUpdate": "2022-08-11 13:37:42",
    "objective": "本課程將針對電子電路在電力電子轉換器的應用上教授電路的分析與設計，本課程包含了電力電子學、電子學、控制系統等領域。\n課程的內容包含:\n\n1.\t基礎理論的回顧\n2.\t模擬軟體的學習與應用\n3.\t被動 / 主動元件介紹\n4.\t轉換器的電路架構說明\n5.\t轉換器的電路動作分析\n6.\t功率開關的特性與其應用的場合\n7.\t功率轉換器的損耗分析\n8.\t轉換器的基本控制模式介紹\n9.\t轉換器的控制迴路設計與模擬驗證\n10.\t周邊的保護電路與感測電路介紹\n11.\t設計案例說明\n12.\t進階電力電子技術分析探討\n\nThis course will teach the analysis and design of circuits for the application of electronic circuits in power electronic converters. This course covers the fields of power electronics, electronics, and control systems.\n\nCourse content includes:\n\n1. Review of power electronics background\n2. Learning a simulation software\n3. Introduction of the principle of the passive components\n4. Description of the circuit topologies of the converter\n5. Analysis of the circuit operation principle of the converter\n6. Introduction of the characteristics of power switches and their applications\n7. Introduction of the loss analysis of power converters \n8. Introduction to the control method of the converter\n9. Introduction of the control loop design and simulation verification of the converter\n10. Introduction of peripheral protection circuit and sensing circuit\n11. Design case review\n12. Introduction of the advanced power electronics topic",
    "schedule": "Week 1: Power Electronics Application Notes\nWeek 2: Introduction to Passive Components (1)\nWeek 3: Introduction to Passive Components (2)\nWeek 4: Introduction to Power Semiconductor Devices (1)\nWeek 5: Introduction to Power Semiconductor Devices (2)\nWeek 6: Circuit Topology of DC-DC Converter and Its Steady-State Characteristics (1)\nWeek 7: Circuit Topology and Steady-State Characteristics of DC-DC Converters (2)\nWeek 8: Loss Analysis for Converter Architectures\nWeek 9: Mid-Term Exam\nWeek 10: Control Mode Description and Design of Converters (1)\nWeek 11: Control Mode Description and Design of Converters (2)\nWeek 12: Introduction to Power IC Circuits and Their Applications (1)\nWeek 13: Introduction to Power IC Circuits and Their Applications (2)\nWeek 14: Introduction to Peripheral Protection Circuits\nWeek 15: Introduction to Sensing Circuits\nWeek 16: Advanced Power Electronics Technology Analysis and Discussion (1)\nWeek 17: Advanced Power Electronics Technology Analysis and Discussion (2)\nWeek 18: Final Exam/Report",
    "scorePolicy": "Attendance/Assignment: 40%\nMid-term exam: 30%\nFinal exam/topic: 30%",
    "materials": "[1] Robert Erickson and Dragan Maksimovic, “Fundamentals of Power Electronics,” 2nd Edition, Kluwer Academic Publishers, 2001.\n[2] Christophe P. Basso “Switch-Mode Power Supply,” 2nd Edition\n[3] ByungCho Choi, “Pulsewidth Modulatied DC-to-DC Power Conversion”\n[4] Robert W., Maksimovic, Dragan, “Fundamentals of Power Electronics,” 3/e/, Springer/2020",
    "consultation": "There will be teaching assistants to assist in the course, and there will also be teaching assistants' consultation hours to allow students to ask questions after class. Professor can also be contacted via email to discuss the questions.",
    "remarks": "1. If you cannot attend classes due to the epidemic, please follow the school's regulations on the epidemic. After isolation and recovery, please make an appointment with the teaching assistant to complete the unfinished experiment again.2. Because it is an experimental class, if physical classes are available, the class will be taught in the way of diverting people. Suppose it is not possible to teach in person. In that case, the online teaching method will be used instead, with online teaching and circuit simulation for teaching.",
    "foreignLanguageTextbooks": false
  }
]
