[
  {
    "name": "蔡佩青",
    "email": "christiane.tsai@gmail.com",
    "latestUpdate": "2022-09-13 17:07:53",
    "objective": "本課程以培養學生尊重與欣賞西洋古典音樂而設。\n藉由對音樂元素、本質的認知及介紹，欣賞各時期作曲家之代表作品，培養西方音樂的基本常識，建立音樂欣賞的專業態度。\n教學目標：\t\n1. 提高學生音樂欣賞的素養，充實其音樂生活的內涵，\n2. 激發學生對音樂欣賞的興趣，培育愛樂人口，增進社會祥和的原動力，\n3. 經由音樂家生平介紹西洋古典音樂名家名作，讓學生瞭解音樂創作的動機與時代背景，\n4. 建立學生對西洋古典音樂正確認知與包容力，培養世界性的音樂觀。\n整學期課程循序漸進由不懂音樂至期末已有音樂欣賞能力\n\n本課程以培養學生尊重與欣賞不同族群、不同時空、不同價值觀所產生的音樂而設。藉由對音樂元素、本質的認知及介紹，欣賞各時期作曲家之代表作品，培養西方音樂的基本常識，建立音樂欣賞的專業態度。教學目標：1. 提高學生音樂欣賞的素養，充實其音樂生活的內涵，2. 激發學生對音樂的興趣，培育愛樂人口，增進社會祥和的原動力，3. 介紹古今中外音樂名家名作，啟發學生對音樂創作的認知與敬重，4. 建立學生對古典音樂、民族音樂、應用音樂及通俗音樂等不同類型音樂的正確認知與包容力，培養世界性的音樂觀。授課內容：1. 概論，2. 歌樂，3. 器樂，4. 儀式音樂，5. 舞蹈音樂，6. 戲劇音樂。\nThis course aims to cultivate students' ability to appreciate music of different ethnic groups, different time and place, different value systems. Through the introduction of basic music elements as well as the appreciation of the masterpieces of various composers, it is hoped that students will build up basic music knowledge about music and enhance professional music appreciation potentiality in music. The goals include: 1. Elevating students' capability in music appreciation 2. Inspiring students' interest in music with a view to improving our society into a harmonious world. 3. Introducing domestic and international famous composers' pieces 4. Touring of various forms of music: classical, ethnic, applied and popular music. Contents of this course include: 1.Introduction 2. Vocal music 3. Instrumental music 4. Ritual music 5. Dance music 6. Theatre music",
    "schedule": "1. 課程介紹\n2. 樂器運用\n3. 管弦樂入門\n4. 彼得與狼\n5. 巴哈\n6. 貝多芬\n7. 莫札特\n8. 威爾第\n9. 期中活動\n10. 舒伯特\n11. 蕭邦\n12. 舒曼\n13. 李斯特\n14. 約翰史特勞斯\n15. 布拉姆斯 \n16. 林姆斯基。高沙可夫\n17. 歌劇弄臣\n18. 總結",
    "scorePolicy": "考核方式為：出席率及上課互動狀況合計 30%。\n每堂課都需到 zuvio 點名系統「111-1 音樂欣賞」課程代碼: 98733030 簽到。\n期中成績以當週課堂活動佔 30%。\n期末報告：最遲於第 16 週交「西洋古典音樂」紙本心得 (1200 字以上) 40%【若抄襲，則不計分】。\n針對因防疫無法返校上課之學生可以多交一份心得報告取代無法親自到教室上課的加分機會。",
    "materials": "音樂巨匠 1994 年 6 月 6 日錦繡文化企業文庫版",
    "consultation": "電郵：2cai777@gmail.com",
    "remarks": "zuvio 點名系統簽到 +「北科 i 學園」當週討論室留言 50%，取代「出席率及上課互動」。期中考 (10%) 當週課堂時間以電郵送出 (即時公布題目) 心得申論 300 字。期末報告：最遲於第 16 週交遠距教學時的心得報告 40%，以 A4 規格寄到 2cai777@gmail.com 遠距教學時，進入「北科 i 學園」309814 音樂欣賞，先看當週影片，下課前十至十五分鐘再到當週線上討論室留言回覆提問。每堂課都需到 zuvio 點名系統簽到：98733030。取代「出席率及上課互動」。第一週班上建立 LINE 社群，為上課前後聯繫使用。(入群碼：309814) https://line.me/ti/g2/vYbAMUnUKEYnNtdt2KFNqfzfno9Lgysc-nF4HQ?utm_source=invitation&utm_medium=link_copy&utm_campaign=default",
    "foreignLanguageTextbooks": false
  }
]
