[
  {
    "name": "詹傑勝",
    "email": "jasonjan@gmail.com",
    "latestUpdate": "2022-08-29 11:19:52",
    "objective": "「社會心理學」主要探討的重點在於日常生活，社會群體刺激以及情境如何影響個人的認知，態度及行為，它需要經過科學的方法進行研究，藉以預測一個人在某種情境下，可能會出現哪些行為。社會心理學主要是從社會學，群體的角度，探討個人的態度與行為如何受到社會價值以及群體的影響。該課程強調理論與實務結合，提供日常生活以及新聞案例，提升學生參與社會的知能。\nSocial psychology investigates how social stimulus and social environment affect people’s cognition, attitudes, and behavior. It requires scientific methods to research what people act in certain conditions. Social psychology takes sociological perspective to investigate how individuals’ attitudes and behavior affected by social values and group. The course emphasizes theories and practices, and provides news and events in daily life as examples to enhance students’ social participation.",
    "schedule": "第一週  課程介紹 Intro\n第二週  人文學科、社會科學、自然科學，與職業學院的區分 Sciences and humanities\n第三週  第三章 社會認知 Social Cognition\n第四週  第四章 社會知覺 Social perception\n第五週 第五章 自我瞭解 Understanding self\n第六週 第六章 為自己辯護的需求 Defending for self\n第七週 第七章 態度和態度的改變 Attitude and attitude change\n第八週 複習 Review\n第九週 期中考 Midterm\n第十週 第八章 從眾 Conformity \n第十一週 第九章 團體歷程  Group process\n第十二週 第十章 人際吸引 Attraction\n第十三週 第十一章 利社會行為的基本動機 Altruism \n第十四週 第十二章 攻擊 Attack\n第十五週 第十三章 偏見 Prejudice\n第十六週 複習 Review\n第十七週 期末考 Final\n第十八週 回顧與討論",
    "scorePolicy": "課堂出席：每週點名，全勤者學期總分最多加 4 分，遲到及缺課者按情況扣分。遲到超過兩次者，開始扣分，每次 0.5 分。缺課一小時每次扣 1 分，缺課 8 小時以不及格計算。\n課堂要求：禁用手機或從事非課業相關事務，違反者每次學期總分扣 5 分。課堂學習包括抄筆記與分組討論。\n成績計算：期中考期末考各佔 50% 平均之後。再依照出席狀況以及課堂學習狀況加分或減分。\nRollcall each week. Each absence and late to class will result in deduction of final grade by 2 points  and one point relatively. No cellphone and other tasks unrelated with the class are allowed. Violating this rule will result in 5 points deduction of final grade. \ngrading policies:\nMidterm exam 50% \nFinal exams 50% \nAttendance, class participation, and leaning attitudes are also considered for extra or minus points.",
    "materials": "社會心理學 (原書第八版)\nSocial Psychology (8th Edition)\n作者： Elliot Aronson, Timothy D. Wilson, Robin M. Akert  \n譯者： 余伯泉， 陳舜文， 危芷芬， 李茂興\n出版社：揚智  出版社\n出版日期：2015/06/01\nISBN：9789862981818",
    "consultation": "校內分機 3051 或電子郵件",
    "remarks": "若因應疫情改線上課程，將以 email 通知學生上北科 i 學園觀看預錄課程，並加入 Line 群組即時討論內容。本課程內容第五週認識自我，第十二週了解並建立良好人際關係，促進心理健康，與 SDGs 3. 健康福祉相關.",
    "foreignLanguageTextbooks": false
  }
]
