[
  {
    "name": "\n  黃麗珠",
    "email": "lh03232000@yahoo.com.tw",
    "latestUpdate": "2022-05-31 11:40:31",
    "objective": "創業與財務概論課程的主要目的是要使學生了解如何在企業創立的時候，透過財務技術，來評估企業的經營績效與價值。本課程將介紹以下內容：(1) 公司創業的財務報表與科目報導與分析 (2) 基本創業財務分析理論 (3) 公司的償債能力、獲利能力、經營能力、資本結構、現金流量的分析 (4) 特殊行業的財務報表分析 (5) 探討我國最近發佈的會計準則公報對企業與投資人的影響。\n\nThe goal of the introduction to entrepreneurship and finance course is to help students, when the company is in the stage of entrepreneurship, evaluate the performance and measure the values of firms by financial statements. The topics of this course includes (1) entrepreneurship financial reports and analysis; (2) basic entrepreneurship financial statement analysis; 3) solvency, profitability, business performance, financial structure and cash flow analysis; 4) financial statement analysis of special industries 5) recent developments of GAAP.\n\nIntroduction to Entrepreneurship and Finance\nThis course aims to enable students to understand how to use financial knowledge and skills to assess the business performance and value of a new venture. This course is specially planned for non-business students. It introduces the following in a simple but profound way:\n\n(1) Distinguish the concepts of entrepreneurship from employment\n(2) Concept and application of general financial statements\n(3) The theory and practice of entrepreneurial finance\n(4) Group simulation of entrepreneurial financial project planning\n\n\n\nThe goal of the Introduction to Entrepreneurship and Finance course is to enable students to understand how to evaluate the business performance and value of enterprises through financial technology when the company is founded.\nThis course is specially designed for non-commercial students, and introduces the following in a life-like manner: \n(1) Identify the concepts of entrepreneurship and employment\n(2) General financial statement concepts and applications\n(3) Theory and Practice of Venture Finance\n(4) Simulated venture finance project planning",
    "schedule": "第一週　　辨別創業與就業的概念\n第二週　　創業實例分享 (創新與創業的一體兩面)\n第三週　　3-1 一般財務報表概念簡介\n第四週　　3-2 一般財務報表概念簡介\n第五週　　3-3 一般財務報表概念簡介\n第六週　　3-1 財務報表的應用指標\n第七週　　3-2 財務報表的應用指標\n第八週　　3-3 財務報表的應用指標\n第九週　　期中考\n第十週　　        2-1 創業財務理論與實務\n第十一週　　2-2 創業財務理論與實務\n第十二週　　3-1 模擬創業財務專案規劃\n第十三週　　3-2 模擬創業財務專案規劃\n第十四週　　3-3 模擬創業財務專案規劃\n第十五週　　3-1 模擬創業財務專案發表與修正\n第十六週　　3-2 模擬創業財務專案發表與修正\n第十七週　　3-3 模擬創業財務專案發表與修正\n第十八週　　期末考",
    "scorePolicy": "平時表現    35%\n期中考        25%\n期末考        40%",
    "materials": "1. 老師自製上課 PPT. 不使用其他教材\n2. 參考書目: (圖書館可以借閱)\n    A. 在飛機上遇見彼得杜拉克 (真希望開店前就知道的事)\n    B. 你不必走得快，但，定要走得遠 (作者：丁菱娟)\n    C. 創新與創業精神 (管理大師彼得杜拉克談創新實務與策略)\n3. 本課程歡迎非商學系學生選修",
    "foreignLanguageTextbooks": false,
    "remarks": "有任何課程諮詢請 Email 給老師\nEmail:  f23815@mail.ntut.edu.tw"
  }
]
