[
  {
    "name": "\n  王李吉　Office Hours ",
    "email": "richwang@ntut.edu.tw",
    "latestUpdate": "2022-06-03 00:14:06",
    "objective": "學習相似於 Microsoft Power Point 的「拖 - 拉 - 點 - 選」操作方式，再加上一小部份的 Low Code 程式編碼，即可以設計與製作出:「專業級的 APP」 !\n本課程運用學校內的雲端平台: AgilePoint NX，改變了以往撰寫 APP 的模式，不再需要撰寫複雜的程式碼，讓學生專注於 APP 的邏輯流程與 UI (使用者介面)，進而發展貼近市場裡的商業模式，設計出精彩的 APP!\n課程的教學，採用傳統臺北工專的黑手工程師訓練模式:\n「由經入史」: 先講解理論架構，進而延伸到產業的實務運用。\n嚴格要求上課同學動手實做，達成每週的設定目標。課堂上講師所示範的範例非常豐富，下課後會有一定份量的 Homework (實作型作業)。\n經此系統化訓練，在 APP 的設計與製作上，將擁有踏實的內涵與技術，增強在校學生，未來在職場上的競爭力。\n「讓不懂 IT (資訊工程)、非理工背景的學生，更能設計出高人氣的 APP! 」\nLearn the \"Click and Drag\" operation method, as like Microsoft Power Point, and adds some Low-Code, you can design and create: \"Professional APP\"!\nThis course uses the cloud platform in the school: AgilePoint NX, which changes the mode of writing APP in the past, no longer needs to write complex code, let students focus on the logic flow of the APP and UI (user interface), and then close to the market requirement. \nThis course uses the Taipei Tech Practical-Engineer training method:\n\"From Theory to Practical\": First explain the theoretical structure, and then extend to the practical application of the industry.\nStrictly ask the trainees to do it, and achieve the weekly set goals. The examples demonstrated by the lecturers in the class are very rich, and there will be a certain amount of Homework after the class.\nThrough this systematic training, in the design and production of APP, we will have practical connotation and technology to enhance the competitiveness of students in coll",
    "schedule": "第 01 週 App Inventor 2 概述及開發環境建置\n第 02 週 App Inventor 2 基本操作與手機連結\n第 03 週 基本元件以及事件、方法使用\n第 04 週 事件驅動與條件判斷\n第 05 週 介面配置與 BMI 計算\n第 06 週 迴圈與副程式\n第 07 週 清單元件的介紹與外部資料存取\n第 08 週 多重畫面 (Screens) 的切換應用\n第 09 週 期中測驗 \n第 10 週 影音應用介紹\n第 11 週 繪圖動畫介紹\n第 12 週 繪圖動畫的應用\n第 13 週 簡易瀏覽器的應用開發\n第 14 週 手機影像擷取與檔案存取\n第 15 週 手機通訊介紹與應用\n第 16 週 專題製作 - 藍牙連結的應用\n第 17 週 專題製作 - 地圖應用\n第 18 週 期末測驗",
    "scorePolicy": "出席 (20%)\n作業 (20%)\n小考 (20%)\n期中考試 (20%)\n期末考試 (20%)",
    "materials": "稍後公告。",
    "foreignLanguageTextbooks": false,
    "remarks": "請於課堂上發問，或於輔導時間來討論。"
  }
]
