[
  {
    "name": "\n  陳正中 ",
    "email": "chenjengchung@gmail.com",
    "latestUpdate": "2022-09-02 20:47:15",
    "objective": "透過分析創新成功之實際個案，讓修課同學了解創新的本質。課程中將介紹不同類型的創新個案，包括：技術創新、產品創新、服務創新與管理創新。本課程也擬搭配邀請成功之創業顧問與談，提供實務經驗，分享創業者該有的認知以及創業的重要理念，當然也包括分享他們在邀創業過程中所面臨的各類挑戰。\n創業是每個人都曾經懷抱過的夢想，透過創新成功之個案的分析，可以了解到個案公司是如何有步驟的循序漸進。針對每個個案，我們要求每位同學於課前完成個案的閱讀，並於上課前交出本次課程的課前預習心得。我們希望每位參與的同學都能在討論時充分表達意見，遇有不清楚或不同意見時能夠勇於提出他們的看法。本課程擬營造出一種研究的環境，讓學生可以針對個案盡其所能清楚的提出建議並來說服同儕。\nThe course enable participant to realize the essential features of innovation via cases study. Various types of innovation cases are included, such as: technology innovation, service innovation and management innovation. We also plan to invites some successful constants to give participants talk and share their experiences, including the challenge and their resolving process.\nThe real case study enables participants to understand the entrepreneurship and the steps to start a business. The participants are required to complete the case reading and a preview report is required in advance the class. We hope that every participant can propose their opinion and persuade others colleges of their viewpoints.",
    "schedule": "WK-1 創業管理課程說明 Introduce to entrepreneurship &amp;\nWK-2 創業管理概論 Basic concepts of entrepreneurship \nWK-3 創業精神的力量 The power of entrepreneurship \nWK-4 機會的辨識 Recognizing opportunities \nWK-5 商業模式及發展策略 Develop business model \nWK-6 創業行銷 Marketing issues \nWK-7 新企業的行銷 Marketing in a New Venture \nWK-8 建立創業團隊 Create an entrepreneur team\nWK-9 期中報告 - Midterm exam\nWK-10 商業計畫書 Write an Effective Business Plan\nWK-11 創業計畫過程 Write a business plan \nWK-12 建立擬制財務報表 Prepare your financial forecast \nWK-13 全球的創業融資 Global entrepreneurial finance \nWK-14 新創事業的資金募集 Funding your new business \nWK-15 專題演講 Speech \nWK-16 群眾募資 Crowdfunding\nWK-17 小組期末報告 - 1 Team final report 01\nWK-18 小組期末報告 - 2 Team final report 02",
    "scorePolicy": "　　Homework 20%\n　　Midterm exam 25%\n　　Final exam 25%\n　　Final team project 30%\n-　　Write a survey report for the selected problem.\n-　　Solve a real-world problem using knowledge and skills of logistics management",
    "materials": "Robert A. Baron，Scott A. Shane (2008), Entrepreneurship: A Process Perspective (2nd ed.), South Western (華泰文化事業股份有限公司代理)\n陳明惠 (2010), 創業管理，華泰文化",
    "foreignLanguageTextbooks": true,
    "remarks": "Email: chenjengchung@gmail.com\nLine ID: 0936946023"
  }
]
