[
  {
    "name": "\n  楊梵妤　教師諮商時間(Office Hours) ",
    "email": "fanyu@ntut.edu.tw",
    "latestUpdate": "2022-08-27 00:45:02",
    "objective": "本課程目標如下：（一）以心理學為基礎，探討人類生活各面向的知識；（二）建立學生生活行為的技能；（三）促使學生建立自己積極的價值體系。  本課程內容涵蓋人類的個體發展、學習方式、動機、情緒、態度、人格、兩性、愛情、家庭、育兒、健康管理、社會行為等生活面的相關行為。  本課程採學生中心教學法，以啟發法、小組討論、創造式發表等方式授課，藉以活潑學生的思考並增加學生上台練習的機會。\nThe objectives of this course are : (1) By basing on the psychology   to guide our students to discuss the variant facets of their lives. (2) To establish the students' good skills to deal with their own lives. (3) To found the students' positive value systems .  This course includes the human behaviors of individual development , learning strategies, motivations, emotion, attitudes, personality, social interaction, religious lives, love, bisexual interaction, family lives, children cultivation , and etc. This course uses the learner-centered instructing strategies. The methods of discovery learning, teams discussion, creative teaching , and etc. will be adopted, in order to excite the students to do deep thought and give them the opportunities to show their efforts and achievements themselves.",
    "schedule": "第一週    認知取向\n第二週    影片欣賞與課堂問題討論 (課堂發表並繳交作業)\n第三週    行為取向\n第四週    社會取向\n第五週    智力\n第六週    影片欣賞與課堂問題討論 (課堂發表並繳交作業)\n第七週    記憶策略\n第八週    動機\n第九週    期中考週：期末企畫提案討論與撰寫\n第十週    影片欣賞與課堂問題討論 (課堂發表並繳交作業)\n第十一週  決策與推理 / 小組報告：人生重要議題及處理方式\n第十二週  關於自我 / 小組報告：人生重要議題及處理方式\n第十三週  態度  / 小組報告：人生重要議題及處理方式\n第十四週  失調 / 小組報告：人生重要議題及處理方式\n第十五週  情緒 / 小組報告：人生重要議題及處理方式\n第十六週  影片欣賞與課堂問題討論 (課堂發表並繳交作業)\n第十七週  攻擊 / 小組報告：人生重要議題及處理方式\n第十八週  期末考週：繳交小組企劃報告、繳交個人週記 / 小組報告：人生重要議題及處理方式",
    "scorePolicy": "1. 平時成績 30%：出缺席：15%(遲到早退曠課，全勤加 3 分)  + 課堂參與：  15 % (課堂表現、參與活動、上課是否有積極討論、是否操作手機平板作與本課程無關之活動)\n2. 課堂中小組問題討論與報告：15%\n3. 個人作業 --- 個人週記：25%\n4. 期末小組企劃報告：30%",
    "materials": "Robert E. Slavin (2021) 教育心理學：理論與實際 第四版。張文哲譯\n李宏鎰 (2017) 認知心理學\n陳皎眉，王叢桂，孫蒨如 (2014) 社會心理學（第三版）\nRobert J. Sternberg (2016) 普通心理學。鄭昭明，陳億貞譯",
    "foreignLanguageTextbooks": false,
    "remarks": "fanyu@ntut.edu.tw\n\n「i 學園」或 Zuvio 課程平台"
  }
]
