[
  {
    "name": "\n  房同經",
    "email": "nathan1@ms39.hinet.net",
    "latestUpdate": "2022-09-13 09:56:03",
    "objective": "什麼是醫學和生活（健康管理）\n1. 影響人們健康實踐變化以及與此類 醫學 變化相關的知識和態度的過程。\n2. 教學過程提供健康的基本知識和實踐，以便被詮釋為正確的健康行為。\n醫學和生活（健康管理）\n課程的目標\n1. 促進健康和預防疾病。\n2. 早期診斷和管理。\n3. 利用現有的 醫學和生活 服務。\n醫學和生活（健康管理）\n課程的內容\n1. 個人衛生\n2. 正確的健康習慣\n3. 營養教育\n4. 個人預防措施\n5. 安全規則\n6. 正確使用 醫學和生活 服務\n7. 心理健康\n8. 性教育\n9. 特殊教育 職業， 等\n醫學和生活（健康管理）\n課程 的具體 實踐\n1. 使健康成為 學生 重視的資產。\n2. 增加 學生 對影響健康的因素的瞭解。\n3. 鼓勵促進和保持健康的行為。\n4. 爭取對公共衛生措施的支援，並在必要時敦促 學生 採取適當行動。\n5. 鼓勵 學生 適當利用衛生服務，特別是預防性服務。\n6. 向 學生 宣傳醫學進步、用途和局限性。\n醫學和生活的學習評估:\n基於出勤以及課堂互動，每周提供一個帶回家的研究案例以突出所涵蓋醫學和\n生活的內容，每周測驗以及一個期中和期末測驗。\n醫學和生活（健康管理）\n課程 的想法或實踐 五個步驟\n1. 意識（知道）\n2. 興趣（詳情）\n3. 評估（優點與缺點）\n4. 審判（實踐）\n5. 行動 （習慣)\n醫學和生活\n課程 的動機和教育\n1. 意識 階段 人們意識到 醫學和生活 新出現的問題，例如「 Long COVID,\nVaccines…」。 它如果被敏感化 那麼他們就會更容易接受健康教育資訊 並\n圖尋求有關健康問題的更多資訊。圖尋求有關健康問題的更多資訊。\n2.  評估評估階段階段 –– 在媒體和一切可能的在媒體和一切可能的宣傳宣傳廣告手段，向公眾提供資訊。接受的廣告手段，向公眾提供資訊。接受的\n人會吸收並理解這種疾病的影響。這裡的想法是人們相互討論並變得更加知人會吸收並理解這種疾病的影響。這裡的想法是人們相互討論並變得更加知\n識淵博。識淵博。\n3. 教育階段教育階段 -- 這是無利害關係和真正教育階段。這是無利害關係和真正教育階段。\n4. 態度轉變的階段態度轉變的階段\n5. 動機和行動階段動機和行動階段\n6. 生活生活轉型階段（轉型階段（生活生活變革）變革）\n教師學生\n教師學生課程的課程的溝通障礙溝通障礙\n1. 發送方和接收方之間的社會和文化差距發送方和接收方之間的社會和文化差距\n2. 接收接收方方的接受能力有限的接受能力有限\n3. 對人或事物對人或事物的消極態度的消極態度\n4. 理解和記憶力有限理解和記憶力有限\n5. 教師教師強調不足強調不足\n6. 矛盾的資訊矛盾的資訊\n7. 教師教師不確定 “不確定 “學生學生需求” 的健康教育需求” 的健康教育\n教師學生\n教師學生課程課程中中行為更改行為更改的變數的變數\n一個人頭腦中的想法和想法對個人的健康行為有重大影響。這些變數與社一個人頭腦中的想法和想法對個人的健康行為有重大影響。這些變數與社會和環境因素相互作用，正是所有這些影響之間的協同作用對行為起作用。會和環境因素相互作用，正是所有這些影響之間的協同作用對行為起作用。\n1. 知識：對通過視覺、經驗或報告獲得的事實、真理或原則的知覺認識。知識：對通過視覺、經驗或報告獲得的事實、真理或原則的知覺認識。\n2. 技能：從天賦，培訓或實踐中產生做好某事的能力。技能：從天賦，培訓或實踐中產生做好某事的能力。\n3. 信仰：在沒有正面知識或證據的情況下，接受或相信所謂的事實或事實主體信仰：在沒有正面知識或證據的情況下，接受或相信所謂的事實或事實主體\n是真實的或正確的是真實的或正確的；；一個感知到的真理。一個感知到的真理。\n4. 態度：對人或事物的態度，性格，感覺或位置。態度：對人或事物的態度，性格，感覺或位置。\n5. 價值觀：引起 接受 或反對它們的 意識和 情感反應的想法，理想，習俗。",
    "schedule": "週次　　日期　　課程內容\n9/16 你的人生是不是卡住了？一日一頁醫學知識 (p. 1-14)\n9/23 注意力被偷走了？一日一頁醫學知識 (p. 13-28)\n9/30 就是「很不公平」？別以為這不正常！一日一頁醫學知識 (p. 29-42)\n10/7 忘東忘西，是失智嗎？一日一頁醫學知識 (p. 43-56)\n10/14 誰說分數不重要！讀同一本書，為何學習結果大不相同？一日一頁醫學知識 (p. 57-70)\n10/21 年輕而迷惘和憤怒，你抗壓性強嗎？一日一頁醫學知識 (p. 71-84)\n10/28 不是在打瞌睡，就是睡不著？一日一頁醫學知識 (p. 85-98) \n11/4 媽媽中風 10 年臥床從沒褥瘡！作為子女的必修課？一日一頁醫學知識 (p. 99-112) \n11/11 期中考\n11/18 後疫情時代，是天災還是人禍？一日一頁醫學知識 (p. 113-126) \n11/25 你一天上幾次廁所？一日一頁醫學知識 (p. 127-140)\n12/2 做愛做的事，可不可以不受限制？一日一頁醫學知識 (p. 141-154)\n12/9 男性雄風和女人味？一日一頁醫學知識 (p. 155-168)\n12/16 看東西變得吃力？螢幕保母？一日一頁醫學知識 (p. 169-182)\n12/23 聽不清楚？ 一邊耳朵還是兩邊？一日一頁醫學知識 (p.183-196)\n12/30 眾多年齡段人群體能下降？一日一頁醫學知識 (p. 197-210)\n1/6 挑醫生、選醫院，吃藥當吃補？一日一頁醫學知識 (p. 211-224)\n1/13 期末考",
    "scorePolicy": "期中考 【 25%】\n期末考 【 25%】\n課堂作業及報告 【 50%】\n* 上課注意事項 *\n1. 堅持 100% 比堅持 99% 做得到\n2. 遲到與早退扣學期成績 5%\n3. 上課不到扣學期成績 10%\n4. 請假：公假請提前一周報告；臨時病 / 事假出示正式證明文件\n5. 上課禁止飲食及手機使用\n6. 考試請準時參加，試後無補考考試請準時參加，試後無補考\n7. 欺騙造假作弊經證實，成績零分並依校規辦理欺騙造假作弊經證實，成績零分並依校規辦理",
    "materials": "1. Kidder, David S.: The Intellectual Devotional Health: Revive Your Mind, Complete Your Education, and Digest a Daily Dose of Wellness Wisdom 一日一頁醫學知識：看就懂的必修健康課 （墨刻城邦出版集團 2021\n2. Nina Shapiro: Hype A Doctor’s Guide to Medical Myths, Exaggerated Claims and Bad Advice How to Tell What’s Real and What’s Not 誇大不實的醫療迷思 醫師教您如何分辨虛與實 天下文化 2022 (報告 500 字 20221021)\n3. Daniel Kahneman: Noise: A Flaw in Human Judgment 雜訊：人類判斷的缺陷 天下文化 2021 (報告 500 字 20221202)\n4. David Robert Grimes: The Irrational Ape《反智》：鍛煉批判性思考，看透那些好像講什麼都很有道理的猿人 天下文化 2022 (報告 500 字 20230106)",
    "foreignLanguageTextbooks": true,
    "remarks": "email:\nftj@ntut.edu.tw"
  }
]
