[
  {
    "name": "李立緯",
    "email": "011708good@gmail.com",
    "latestUpdate": "2022-05-30 17:23:40",
    "objective": "病毒可說是介於無生命和有生命之間的物質。它小至用光學顯微鏡看不見除非在電子顯微鏡下。儘管看不見卻無所不在，與人類關係異常密切。人類基因體約 8% 是從病毒來的。目前最難解決的傳染病問題也是由病毒引起。病毒結構看來似乎很簡單，但為了生存也進化出非凡的策略。人類從研究病毒得到非常多重要的知識和研究工具。讓我們能夠對分子、細胞和生物體的結構和功能得到更深地了解，進而對疾病問題得到解決。本課程將以深入簡出的方式讓同學認識病毒：從病毒的起源，病毒如何進入宿主細胞與複製，並在宿主群體間存活和傳播所必須具備的機制。通過一系列較具代表性的人類病毒為例子進行介紹病毒複製的基礎、人類與病毒的相互作用以及如何導致疾病。同時認識人體 4006 的疫系統如何對抗病毒。了解為什麼新興病毒的出現並造成疫情。人類應如何應對。最後介紹兩種不尋常的傳染因子 - 類病毒和狂牛病蛋白。它們與病毒似乎都是在生命起源中在化學演化時期殘留下來的分子。\nVirus is between life and no-life substances. It is Invisible to the naked eye unless under an electron microscope. However, virus is existed everywhere and has a very close relationship with humans. 8% of the human genome comes from viruses. At present, the most difficult to solve infectious disease problem is caused by virus. Although the structure and composition seems simple, virus has evolved an extraordinary strategy for survival. Virology enable us to insight the structure and function of molecules, cells, and organisms. From studying virus, people has gained a lot of important knowledge and research tools, which help people solving disease problems. This course will emphasize the mechanisms necessary for the virus to successfully enter and reproduce in the host cell, and survive and spread in the host population. Through a series of representative examples of human viruses, I will introduce the general basis of virus replication, the interaction between the virus and the host,and how these factors cause diseases and our immune system against virus. Finally, I will briefly introduce two unusual infectious agents- viroid and prion.",
    "schedule": "週次　　課程進度與內容\n第 1 週　　什麼是病毒？認識各類病毒\n第 2 週　　病毒傳染週期\n第 3 週　　病毒基因體\n第 4 週　　認識病毒結構\n第 5 週　　病毒如何進入細胞\n第 6 週　　病毒複製的特性\n第 7 週　　致病機制\n第 8 週　　病毒演化\n第 9 週　　期中考\n第 10 週　　負鏈 RNA 病毒：從小到大\n第 11 週　　雙鏈 RNA 病毒與人類對抗病毒之先天疫系統\n第 12 週　　HIV 病毒與人類後天疫系統\n第 13 週　　疫苗的出現與重要性。疫苗的種類與製造\n第 14 週　　正鏈 RNA 病毒 (小兒痲痺病毒) 與 不尋常的傳染因子 (一): 類病毒\n第 15 週　　正鏈 RNA 病毒 (冠狀病毒) 與 不尋常的傳染因子 (二): 狂牛症蛋白\n第 16 週　　新興病毒的崛起 (一) 與分組報告 (一)\n第 17 週　　新興病毒的崛起 (二) 與分組報告 (二)\n第 18 週　　期末考",
    "scorePolicy": "期中考 (20%)　　對課程內容了解程度的評估\n期末考 (20%)　　對課程內容了解程度的評估\n課堂參與 (15%) 學習態度與討論\n出席　　(15%)　　學習態度\n報告　　(30%)　　資料收集與組織能力",
    "materials": "1. 講義 (ppt)\n2. 主要參考書: Principles of Virology.\n(S.J. Flint et al., Third Edition, ASM Press 2015).",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因受疫情影響時的 評量方式及配分比例:\n1) 平時（學習態度）: 30% (是否有上北科 i 學園查看教學內容 與 上課出席 (MS Teams)\n考試 : 40% \n個人或分組書面心得報告：佔總成績 30%\n題目 (自選)- 有關病毒任何議題\n或 \n2) 平時（學習態度，出席）: 30%\n線上測驗：期中考佔 30% 和 期末考佔 40%\n上課方式: Microsoft Teams\n聯絡 e-mail: 011708good@gmail.com</div>"
  }
]
