[
  {
    "name": "陳殿禮",
    "email": "chentl@ntut.edu.tw",
    "latestUpdate": "2022-09-12 09:41:42",
    "objective": "21 世紀的工業設計師已不能再靜待市場研究及產品企劃人員提供產品設計規範，而應以使用者代言人、及企業產品開發整合者身分，主動參與產品策略與企劃，並以視覺化技術協助相關人員作橫向溝通。因此，「產品創新設計策略與企劃」課程主要目標在教導學生以「前瞻性的視野」，透過創新設計的步驟與方法，策劃出符合企業技術及經營體質，並且能滿足市場及使用者使用情況需求的產品。本課程將以理論、方法、案例研討及個案研究方式進行。\nThe function of industrial design in the 21st century, will no longer waiting for the product definition from the marketing and product planning, It will become a integrator and visualizer during the product innovation strategic phase, and concerning to the user's needs. Product Innovation Strategy will guide the enterprise looking beyond their current operation to match their technologies and the distinct competencies with emerging the user and the market needs. The contents of this topic will include theory, methodology, and practical case study.",
    "schedule": "09 月 14 日\t開學課程介紹課程簡介\n09 月 21 日\t創新設計概論\n09 月 28 日\tChapter 1：What Drives New Product Development Transition Design\n10 月 05 日\tChapter 2：Moving to the Upper Right\n10 月 12 日\tChapter 3：The Value Quadrant. Transition Design ，Value Analysis 。\n10 月 19 日\tChapter 4：The Core of a Successful Brand Strategy: Breakthrough Products and Services\n10 月 26 日\t  Chapter 5: A Comprehensive Approach to User-Centered, Integrated New Product Development\n10 月 29 日\n10 月 30 日\n\t產品與服務創新設計工作營二全天\n9：00~16：30\n11 月 02 日\t各組討論競賽 (補工作營 1）\n11 月 09 日\t各組討論競賽 (補工作營 2）\n11 月 16 日\t各組討論競賽 (補工作營 3）\n11 月 23 日\tChapter 6 : Integrating Discipline and Managing Divers Teams. Tool Kit。\n11 月 30 日\tChapter 7 : Understanding the User’s Needs, Wants, and Desires.\n12 月 07 日\tChapter 8 :Service Innovation Breakthrough Innovation on the Product-Service Ecosystem Continuum. Transition Design,\nThis is Service Design, Industrial 4.0\n12 月 14 日\t (補工作營 4）\n12 月 21 日\t個案研究\n12 月 28 日\t個案研究\n01 月 04 日\tChapter 11. Where Are They Now?\n01 月 11 日\t工作營及期末檢討",
    "scorePolicy": "出席率 15%\n參與課程討論及平時成績 35%\n期中報告 20%\n期末報告 30%(含工作營)",
    "materials": "自編教材",
    "consultation": "可透過 email:chentl@ntut.edu.tw 或至設計學院三樓 308 研究室直接咨詢討論。",
    "remarks": "本課程開課後將設立課程專用 line 群組及透過學校設置的 teams 視訊軟體進行必要的視訊教學。",
    "foreignLanguageTextbooks": false
  }
]
