[
  {
    "name": "\n  張瑋倫 ",
    "email": "wlchang@ntut.edu.tw",
    "latestUpdate": "2022-09-08 15:25:16",
    "objective": "本課程將介紹人工智慧概念以及在企業轉型中扮演的角色，目的在於增加對於人工智慧的瞭解以幾所應用的產業，人工智慧的技術概要介紹包含大數據、資料探勘、與機器學習也會整合於課程設計中，課程主要目的在於學習數位科技如何應用在不同的商業情境，以及如何調整在數位轉型時代下商業策略與運作，最後，學習如何將人工智慧成為競爭優勢的重要來源。\nThis course provides an overview of AI and its role in business transformation. The purpose is to improve understanding of AI and being used in the industries. The brief technical overview of AI will be covered such as big data, data mining, machine learning, etc. The objectives are to learn how digital technologies will be applied to various business settings and how to adapt business strategy and operation in the era of digital transformation. Finally, learning how to utilize AI as the source of competitive advantage.",
    "schedule": "9/14 Orientation\n9/21 AI for Business Course Intro  (Is AI a General Purpose Technology?) \n9/28 Intro to Big Data and AI\n10/5 Understanding the use of AI in business (chap 2&amp;3 of T2)\n10/12 AI (Machine Learning) (chap 4&amp;5 of T1)\n10/19 Business Applications of Machine Learning (chap 3 of T1)\n10/26 Psychology of algorithm (chap 6&amp;7 of T1)\n11/2 AI-driven strategy (chap 4 of T2)\n11/9 Midterm week\n11/16 Building and Investing in AI-Based Businesses (R4)\n11/23 Introduction to Business Analytics (R5, R6, R7)\n11/30 AI tasks, organizational structures, and business processes (chap 5 of T2)\n12/7 Jobs and skills in a world of smart machines (chap 6 of T2)\n12/14 Risks with AI (chap 10 of T1)\n12/21 AI Strategy and Governance (AI-Driven Business Transformation)\n12/28 Organizational, social, and ethical implications (chap 8 of T2)\n1/4 Final Presentation",
    "scorePolicy": "期末報告: 60%\n出席: 20%\n隨機作業: 20%",
    "materials": "使用自編講義與英文參考資料\nT1. A Human’s Guide to Machine Intelligence by Kartik Hosanagar \nT2: The AI Advantage: How to Put the Artificial Intelligence Revolution to Work (Management on the Cutting Edge) \n\nOther:\nR1.Brynjolfsson E, McAfee A. 2017. The Business of Artificial Intelligence. Harvard Business Review. Available at: https://hbr.org/cover-story/2017/07/the-business-of-artificialintelligence.\nR2.Fountaine, T., McCarthy, B., &amp; Saleh, T. (2019). Building the AI-Powered Organization. Harvard Business Review, 97 (August), 1–13.・Hagiu, A., &amp; R3.Wright, J. (2020). When Data Creates Competitive Advantage. Harvard Business Review, 98 (January–February), 94–102.\nR4.Venkat Srinivasan, “Context, Language, and Reasoning in AI: Three Key Challenges,” MIT Technology Review, October 4, 2016 (https://www.technologyreview.com/2016/10/14/156968/context-language-and-reasoning-in-ai-three-key-challenges/)\nR5.Davenport article - “Competing on Analytics” (Harvard Business Review)  R6.LaValle et al. article - “Analytics: The New Path to Value” (MIT Sloan Management Review) \nR7.Davenport and Harris article - “The Dark Side of Customer Analytics” (Harvard Business Review) \nR8. Loveman article – “Diamonds in the Data Mine” (Harvard Business Review)",
    "foreignLanguageTextbooks": true,
    "remarks": "可透過 email 聯繫: wlchang@ntut.edu.tw"
  }
]
