[
  {
    "name": "葉惠蘭",
    "email": "hlyeh@ntut.edu.tw",
    "latestUpdate": "2022-10-25 11:18:35",
    "objective": "「生活美學」是現代人依據東西方文化及各方美學的定義所推論出來的名詞，指應用於「生活」中食、衣、住、行、育、樂所體現美的內容及活動。依循相異的生活型態、社會環境，人類試圖重構生活藝術化與藝術生活化的當代美學。\n“Aesthetics of living \" will address the East-West cultural and aesthetic experience through series of questions that drive the discourse in contemporary life’s content and activities. Following the different lifestyles, social environment, human tries to reconstruct everyday life into contemporary aesthetics of living. This course aims to encourage students to think what is aesthetic of living, through the real life and spiritual life and concerned itself with the aesthetic problems in the lives of others.",
    "schedule": "生活美學– 嗅味覺美感體驗      週一 78\n1.  課程概述 / 課堂管理 ﹝確認分組、選班長、建群組、6 組抽籤排序﹞\n2.  一、品飲的嗅覺味覺觸覺 / 發講義\n          ●交作業一：我的 24 小時 - 四季養生企劃\n3. 二、審美心理要素及其培養       \n4. 二、審美心理要素及其培養\n          ●交作業二：清大林秀豪教授等視頻觀後─嗅覺與量子力學的關係         \n                     ﹝500 字﹞\n5. 三、中國茶文化源流及台茶特色\n6. 三、中國茶文化源流及台茶特色\n7.  四、茶類泡法及器用\n8.  四、茶類泡法及器用\n9.  筆試         \n10. 五、茶類泡法及器用\n11. 六、大碗泡–微禮茶儀預備        \n12. 六、大碗泡–微禮茶儀執行   ●交作業三\n13. 七、「席」–說茶藝   \n14. 七、「席」–說品香   （期末報告擬定題旨大綱）      \n15. 九、四般閒事–從口韻身心到 Wabi Sabi\n16.  期末報告 1–3 組﹝每組至少 15 分鐘﹞\n           實地體驗過去人類值得學習的一項休閒生活（事物）\n           例《銷閒清課圖》卷由明代孫克弘繪製。畫卷內容為明晚期文人的\n           閒雅生活方式，依次描繪：燈一龕、高枕、禮佛、烹茗、展畫、焚\n           香、月上、主客真率、灌花、摹帖、山遊、薄醉、夜坐、聽雨、閱\n           耕、觀史、新筍、洗研、賞雪、養鶴等林下清課二十段，每段加上\n           點題數語。此卷現藏台北故宮博物院。請從中擇一體驗（實地攝影\n           ），以 ppt 心得報告\n    .   \n17 期末分組報告 4-6 組﹝每組至少 15 分鐘﹞\n18.  結算成績 / 回顧與評量\n               ●交《幽夢影》點讀 15 則並回答附錄二問（加分作業）\n\n※課程進度與內容以開學後課堂上的公布為準",
    "scorePolicy": "期中筆試                  45%\n作業一、二、三        30%\n各組期末團體報告     25%\n\n※任課教師保有電詢（或視訊）後調整配分的權利",
    "materials": "葉士敏《茶科學・台灣茶》",
    "consultation": "課堂公布的關於味嗅覺、茶化學的相關資訊",
    "remarks": "若採遠距上課，微禮茶儀執行及期中考仍儘量以到校實體課為準；期末報告則可採線上報告教材擬於首次上課時指定一位同學處理轉傳事宜※對應 SDGs 永續發展第 3 健康福祉、4 項教育品質。課程中「六大茶類及其製成」茶的內涵物與人體健康息息相關；           「品飲的味嗅觸覺」「審美心理要素」「茶儀茶席」等單元均與審美教            育品味養成及台灣文化生活的建構有切合的關係另「台茶特殊性」單元對於台灣陸地生態及永續也呈現台茶作為全球夥伴之一的特殊角色。此則與 SDGs 永續發展第 15 項陸地生態、9 及 11 項永續運輸永續城市略相關。",
    "foreignLanguageTextbooks": false
  }
]
