[
  {
    "name": "陳小英",
    "email": "eaglechen219@gmail.com",
    "latestUpdate": "2022-09-14 13:24:29",
    "objective": "婚姻是一般人所必經的過程，家庭是生活的場所，關係著人生的幸福與美滿。本課程強調美滿婚姻與幸福家庭是一門學問，因此，課程內容包括：對婚姻與家庭有正確的認知、積極的態度、完整的規劃，並培養有認真努力去實踐的方法與能力。如何追求真正的快樂與幸福？除了在婚姻與家庭中追求平等化、合理化、自由化、公平化外，自我成長、相互尊重都是本課程的學習目標，以協助學生思考婚姻與家庭的終生大事。\nMarriage is a process that most people will go through.  Family is where you belong to, and where the satisfaction and happiness come from. We believe that it is a kind of scholarship to have a high-quality marriage and a wonderful family.  The contents of this course include having the correct understanding of marriage and family, cultivating positive attitude, developing complete plans, and realizing them with all efforts. This course will help students think totally about marriage and family, learn to pursue equality, reasonableness and liberty, keep growing and respect each other, so that we can obtain the real delight and happiness.",
    "schedule": "週次\t上課主旨與活動\n1\t課程簡介 ＆ 婚姻與家庭意涵\n2\t社會變遷下臺灣的婚姻與家庭\n3\t政策因應\n4\t家庭的多元性 (1) 各種家庭的經營\n5＆6 家庭的多元性 (2) 多變的關係\t\n7\t親密關係的發展 (1)\t婚姻，昏姻\n8\t親密關係的發展 (2)  雙人關係～情感建立與發展、變奏\n9\t期中考\n10\t家庭的生命歷程 (1)\t多重關係～角色責任與配偶互動\n11\t家庭的生命歷程 (2)\t家庭發展各階段\n12\t源自家庭 (1)\t瞭解自己？原生家庭的依附與情感表達\n13\t源自家福 (1)\t戀愛與擇偶\n16\t建構幸福 (2)\t另類選擇庭 (2)\t性別角色與親密關係\n14&15\t建構幸\n17\t建構幸福 (3)\t婚前準備、尋找家庭的正向力量\n18\t期末報告",
    "scorePolicy": "(一) 小組合作（議題＋訪查）   20%\n(二) 個人表現\n      期中考                                25%\n      個人作業（三份）              15%\n      家庭日活動                        15%\n      期末報告                            25%",
    "materials": "王以仁等（2016）。婚姻與家人關係。台北：國立空中大學。\n彭懷真（2009）。婚姻與家庭。臺北：巨流圖書公司。\n劉秀娟（1997）。兩性關係與教育。臺北：揚智。",
    "consultation": "eaglechen219@gmail.com",
    "remarks": "* 課程對應 SDGs 指標：5 性別平等（實現性別平等及所有女性之賦權）* 指標對應課程內容：第二週主題「社會變遷下臺灣的婚姻與家庭」對應指標  5.1.1：國內的出生性別比。  5.2.1：過去 12 個月曾遭受目前或過去伴侶施暴（身體、性或精神）的 18 歲至 74 歲婦女的受暴盛行率。  5.4.1：有偶女性與其配偶間（含同居）無酬家務與家庭照護的時間落差。其他注意事項：1. 缺課不得超過五次，事假需事前通知。2. 授課教師聯絡方式：(1) eaglechen219@gmail.com (2) 課程群組：3. 因應疫情調整之上課方式：   310091 婚家（1510-1700）   從 9 月 14 日 (星期三)・下午 3:00 - 5:00 起 18 週   如何加入 Google Meet 會議   視訊通話連結：https://meet.google.com/szt-bdfh-msg",
    "foreignLanguageTextbooks": false
  }
]
