[
  {
    "name": "\n  陳冠薇　教師諮商時間(Office Hours) ",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2022-05-31 23:43:20",
    "objective": "本課程將以華語譜系為視角，以中國現代文學的總體概述為起始，進行一場發現之旅。課程將以王德威的《哈佛新編中國現代文學史》為起點，進而回顧新編版本與夏志清《中國現代小說史》的異同，王德威如何繼承夏志清的工作，來呈現新格局、輻射的、「史蘊詩心」的中國文學史呈現。課程中將以四個作家為討論個案，分別探討魯迅、老舍、沈從文、張愛玲的文學地位，解釋他們在文學系譜上承前啟後的位置，以各種面向來看待文學作品對於當代文化建構的貢獻。\nThis course adapts a genealogy perspective and begins with a general overview of modern Chinese literature as a journey of discovery. The course will start with a introduction of A new literary history of modern China edited by Wang David Der-wei Wang (王德威), and then review how Wang succeeded Chih-tsing Hsia’s (夏志清)   work to present a new, diversify, and historically poetic version of Chinese literature history. This course will take four authors as cases for discussion, mapping Lu Hsun (魯迅), Lao She (老舍), Shen Tsung-wen (沈從文), and Eileen Chang (張愛玲).With further navigating their positions in the literary genealogy, the lecturer aim to address how their literary works construct contemporary culture.",
    "schedule": "1. Course Overview\n2. Introduction to Chinese modern literature\n3. David Der-wei Wang’s (王德威) Introduction\n4. Chih-tsing Hsia (夏志清)  A history of modern Chinese fiction.\n5. The Literary Revolution\n6. Lu Hsun (魯迅) 1\n7. Lu Hsun (魯迅) 2\n8. Lao She (老舍) 1\n9. Lao She (老舍) 2\n10. Midterm Exam\n11. Shen Tsung-wen (沈從文) 1\n12. Shen Tsung-wen (沈從文) 2\n13. Shen Tsung-wen (沈從文) 3\n14. Eileen Chang (張愛玲) 1\n15. Eileen Chang (張愛玲) 2\n16. Eileen Chang (張愛玲) 3\n17. Final Discussion\n18. Final Exam",
    "scorePolicy": "Class Participation and after-class activities 40%\nMidterm exam 30%\nFinal exam 30%",
    "materials": "Hsia, Chih-tsing. A history of modern Chinese fiction. Indiana University Press, 1999.\nWang, David Der-wei, ed. A new literary history of modern China. Harvard University Press, 2017.",
    "foreignLanguageTextbooks": true,
    "remarks": "kuanwei31433@mail.ntut.edu.tw"
  }
]
