[
  {
    "name": "\n  陳昭伶 ",
    "email": "zipsarah@mail.ntut.edu.tw",
    "latestUpdate": "2022-09-26 16:20:47",
    "objective": "This course aims to provide pre-service management students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.",
    "schedule": "The detailed schedule will be distributed on the first day of class.\n\n09/14 Week 1 Course introduction and policy\n09/21 Week 2 Pre-test: Mock TOEIC Speaking Test  \n09/28 Week 3 Market research (Using leading and open questions to effect)\n10/05 Week 4 Market research needs assessment\n10/12 Week 5 Responding to questions during a presentation\n10/19 Week 6 Renegotiation of an agreement (Online)\n10/26 Week 7 Renegotiation of an agreement (Online)\n11/02 Week 8 Promoting collaboration  \n11/09 Week 9 Midterm exam (Online)\n11/16 Week 10 Money Matters\n11/23 Week 11 Money Matters (Fact-based and emotion-based presentation) (Online)\n11/30 Week 12 Money Matters (Defending ideas and describing consequences)\n12/07 Week 13 Money Matters (Online)\n12/14 Week 14 Managing challenging negotiations  \n12/21 Week 15 Talking about performance (Online)\n12/28 Week 16 Dealing with conflict\n01/04 Week 17 Pre-test: Mock TOEIC Speaking Test\n01/11 Week 18 Final Examination\n\n(The schedule is subject to change due to unforeseeable factors.)",
    "scorePolicy": "1.School-wide English Proficiency Test: 20% \n2.Attendance 20% (Five unexcused absences from class will result in automatic failure of the course)\n\nPlease provide a valid proof of illness (medical certificate or record of hospitalization) within 10 days of the date of absence.\n\n3.In-Class Performance &amp; Assignments 40% \n4.Presentation 20 %",
    "materials": "Selected materials about business management",
    "foreignLanguageTextbooks": true,
    "remarks": "zipsarah@mail.ntut.edu.tw"
  }
]
