[
  {
    "name": "\n  鍾建屏 ",
    "email": "thomas6311@mail.ntut.edu.tw",
    "latestUpdate": "2022-06-14 22:34:45",
    "objective": "本課程教授內容包括外匯理論與實務操作，課程內容包括： 1. 探討有那些因素會影響匯率的波動以及均衡匯率的決定，並以實務案例，引導學生得以學習到外匯交易的知識，並懂得結合外匯交易的理論與實務來建置自己的外匯交易策略，進行正確的外匯投資操作。2. 透過對外匯市場交易之思考、探討、批判與洞察，來打造最適合的外匯交易策略，進而提升外匯專業之操作能力。\nThis course prepares students to effectively analyze, assess, and trade foreign currency in the FOREX spot market. Topics presented during the course include: models of success and historical evidence on buying and selling patterns, how to understand volatility of return on the foreign currency exchange, the price behavior of currency, and technical tools for analysis including Japanese Candlesticks and Bar charts. The course focuses on foreign exchange market, major players in the FOREX market, spot and forward market, currency futures and options, foreign exchange exposure and risk, FOREX traders and trading, technical analysis in the FOREX market, profiles of the world’s major currencies and their characteristics. Students will also explore and use the various trading platforms in use on the spot market today and will complete a project in which they will maintain and trade a practice account over the length of this course and track their performance, trading behaviors, and motivat",
    "schedule": "Week 1. Chapter 1 Exchange Rates and the Foreign Exchange Market\nWeek 2. Chapter 1 Exchange Rates and the Foreign Exchange Market\nWeek 3. Chapter 2 Interest Rate Parity and Model of Foreign Exchange Markets\nWeek 4. Chapter 2 Interest Rate Parity and Model of Foreign Exchange Markets\nWeek 5. Chapter 3 Money, Interest Rates, and Exchange Rates\nWeek 6. Chapter 3 Money, Interest Rates, and Exchange Rates\nWeek 7. Chapter 4 Price Levels and the Exchange Rate in the Long Run\nWeek 8. Chapter 5 Output and the Exchange Rate in the Short Run (DD-AA Model)\nWeek 9. Chapter 5 Output and the Exchange Rate in the Short Run (DD-AA Model)\nWeek 10. MIDTERM EXAM\nWeek 11. Chapter 6 Fixed Exchange Rates and Foreign Exchange Intervention\nWeek 12. Chapter 6 Fixed Exchange Rates and Foreign Exchange Intervention\nWeek 13. Chapter 7 Technical Analysis of Forex Markets: Charts and Patterns\nWeek 14. Chapter 7 Technical Analysis of Forex Markets: Charts and Patterns\nWeek 15. Chapter 8 Technical Analysis of Forex Markets: Indicators\nWeek 16. Chapter 8 Technical Analysis of Forex Markets: Indicators\nWeek 17. Review and Practice\nWeek 18. FINAL EXAM",
    "scorePolicy": "Attendance/Participation, Class Discussion and Homework Assignments 20%\nForex trading practice in operations (By using Trading Platform and hand in\nForex Investment Report) 30%\nMid-term Exam 20%\nFinal Exam 30%",
    "materials": "Paul Krugman and Maurice Obstfeld (2018), International Economics: Theory and Policy, 11h Edition, Pearson-Addison-Wesley.\nIn addition to the readings, you are expected to follow current events in the\nfinancial press, such as The Economist and the Financial Times.",
    "foreignLanguageTextbooks": true,
    "remarks": "Office Hours: 星期三 13：00～17：00"
  }
]
