[
  {
    "name": "\n  黃如瑩　教師諮商時間(Office Hours) ",
    "email": "vinia@ntut.edu.tw",
    "latestUpdate": "2022-08-25 02:51:02",
    "objective": "本課程的主題聚焦於全球與區域的經貿議題，訓練學生藉由英語之聽說讀寫譯各方面的練習，培養全方位英語表達力，並增進全球視野與區域國際觀。為幫助學生達到更高、更全面的英語力，本課程活動內容包括：英文文章閱讀、英語問答與討論、英語演講與發表、英文心得短文、簡短口筆譯練習。\nThe first goal of this course is to engage students in the understanding and discussions on the current economic and trading issues on both global and regional scales. The second goal is to cultivate students’ full English skills, including listening, reading, speaking, writing, and interpreting/translating while exploring aforementioned global and regional economic/trading affairs.",
    "schedule": "Dear students:\nI was assigned this course on August 24!\nI need some time to plan the whole course.\nPlease be patient and I will get it done as soon as possible.\nThank you!\nI.  Primary textbook\nII. Supplemental sources for international business reports include BBC News, The Economist, TIME, etc.\nIII. Syllabus\nWeek One: Introduction\nTheme One: Extreme weather conditions and economy\nWeek Two\nDraught, wildfires, flooding, and their economical impacts\nWeek Three\nNew inventions to tackle the problem of lack of drinking water\n\"How to capture water from the air”\nWeek Four\nNew inventions to cope with climate change\n \"Artificial Milk\" to reduce global warming\n\"Floating Farm\" to cope with rising sea levels\nTheme Two: Cultural/political conflicts and world economy\nWeek Five  \nRussia/Ukraine war and its impacts on world and regional economy\nWeek Six \nInternational sanctions on Russia and the need for Russia’s energy supply\nWeek Seven\nRegional conflicts in Asia and the possible  impacts\nWeek Eight\nGlobal demand for advanced computer chips \nWeek Nine: Midterm exam week\nWeek Ten \nThe disruption of world trade routes \nTheme Three: Covid-19 pandemic and world health issues\nWeek Eleven\nThe impact of Covid-19 pandemic on the poor\nWeek Twelve\nHow does different business cash in on the Covid-19 pandemic?\nWeek Thirteen\nHow does Covid-19 pandemic change the ways business are conducted?\nWeek Fourteen \nThe impact of new Covid-19 variants and monkeypox\nWeek Fifteen \nHow does health industry become so prosperous?\n\"How to Boost Your Immune System\"\nWeek Sixteen: Final exam 1/3\n(6 min reports) x 13\nWeek Seventeen: Final exam 2/3\n( 6-min reports) x 13 students\nWeek Eighteen: Final exam 3/3\n( 6-min reports) x 13 students",
    "scorePolicy": "1. General proficiency text:20%\n2. Presence and participation in classroom discussions: 30%\n3. In-class exercises and homework: 20%\n4. Mid-term exam: 15%\n5. Final presentation (6 mins on the stage): 15%",
    "materials": "Reference books:\nAge Power (1999).  By Ken Dychtwald.\nGlobal Issues for Global Citizens (2006).  Ed. by Vinay Bhargava. \nAn Inconvenient Truth (2006).  By Al Gore.\nBlue Gold (2011).  By Maude Barlow and Tony Clark.\nThe World in 2050 (2011).  By Laurence C. Smith\nThe Clash of Civilizations and the Remaking of World Order (1996).\nBy Samuel Huntington\nDVD:\nChanging Climate, Changing Time",
    "foreignLanguageTextbooks": true,
    "remarks": "1. Through e-mail\n2. Through LINE group messages\n3. Making appointment to meet in person or in virtual conference room (Google Meet, Webex Meet, and LINE)"
  }
]
