[
  {
    "name": "\n  鄭又平",
    "email": "youpingcheng@gmail.com",
    "latestUpdate": "2022-08-29 11:06:15",
    "objective": "本課程講授媒體、企業與政治三者之間競合的互動關係，教你看透媒體新聞背後的意識形態、商業利益與政治操作。深入瞭解由傳統紙媒到當代電子媒體、網路媒體、各種新媒體通路中，大數據與內容的製作該如何結合運用。新聞媒體在企業與政治體系中的特殊角色與效應也是探討焦點。課程中將會針對海峽兩岸新聞媒體與綜藝節目製作做對比分析。\n    本課程結合理論與實務導向的專題，以培養學生對當代傳播媒體現象與體制深入分析探究的能力；更引導學生具體認識在數位新媒體的時代中，如何利用新媒體來進行廣告、行銷、公關等實務操作的策略及步驟。\nThis course focuses on the interactive relationship between media, business, and politics, thereby helping students understand the political ideology, business interests, and political manipulation behind news and media events. The course also presents an in-depth analysis of the combination of big data and media content, in the complex production network of paper media, electronic media, internet media, and various other new media. The role and effects of news media in contemporary business and political establishments will also be explored. The course brings in a comparative and critical analysis of news and entertainment programming in both Taiwan and mainland China. \nThis course combines theoretical framework and professional practice in order to cultivate the ability to intelligently analyze and explore the dynamics of various media phenomena and media institutions. The students will also be expected to learn the basic concepts of practical strategies and operating skills of new",
    "schedule": "1　　9/24　　總論\n2　　10/1　　媒體的本質 (上)：記者，你為什麼不反叛？\n3　　10/8　　媒體的本質 (下)：新聞 vs 權力：理想很豐滿，現實很骨感→給年輕記者的信\n4　　10/15 富媒體，窮民主\n5　　10/22 幻象的政治 (上)：新聞和民主之間的脆弱關係 / 自由放任、市場競爭：古典自由主義理論\n6　　10/29 幻象的政治 (下)：好新聞、壞新聞、假新聞：審視新聞的四種傾向性\n7　　11/5　　後真相時代\n8　　11/12 放假\n9　　11/19 (期中考周) 假新聞\n10　　11/26 媒體偏見、客觀性與雙重標準：公民兩難 -- 相信誰？相信什麼？\n11　　12/3　　媒體操作與議程設置\n12　　12/10 數位匯流 (AI 與新聞媒體的發展)\n13　　12/17 新媒體的崛起與衝擊：點擊率、瀏覽人次、廣告收入與商業模式 (注意力商人)\n14　　12/24 社交媒體和民主的關係 (Google 與 fb: 平台定位與社會責任)\n15　　12/31 (元旦連假)　　放假\n16　　1/7 媒體與選舉實務：形象包裝及政治廣告\n17　　1/14　　新聞自由 VS 社會責任和國家安全\n18　　1/21 (期末考周)　　放假",
    "scorePolicy": "課程要求:\n1. 出席率\n2. 比報\n3. 書面報告",
    "materials": "Samuel G. Freedman，給年輕記者的信 (博雅書屋，2010)\n Bill Kovach、Tom Rosenstiel，新聞的十大基本原則 (北京大學出版社，2011)\n 林照真，新聞，在轉捩點上：數位時代的新聞轉型與聚合（聯經出版，2017）\n 林照真，記者你為什麼不反叛 (天下雜誌，2006)\n James Curran，媒體與權力（清華大學出版社，2006）\n W. Lance Bennett， 新聞：政治的幻象（第五版）(當代中國出版社，2005)\n Louis Alvin Day，媒介傳播理論（北京大學出版社，2004）\n Robert W. McChesney，富媒體 窮民主︰不確定時代的傳播政治 (新華出版社，2004)\n C. Edwin Baker，傳媒、市場與民主（巨流，2008）\n Sarah Oates，媒介與政治初探 （韋伯文化，2008）\n Matthew Kieran，媒體倫理與規範（韋伯文化，2003）\n Karen Sander，探究新聞倫理（韋伯文化，2008）\n 臧國仁，新聞媒體與消息來源 (三民書局，1999)\n Noam Chomsky，誰統治世界？主張民主人權的政府為何霸凌他國，勾結財團操控媒體、扭曲真相（時報出版，2018）\n Hector Macdonald，後真相時代：當真相被操弄、利用，我們該如何看？如何聽？如何思考？（三采，2018）\n Jeff Jarvis，媒體失效的年代（天下文化，2016）\n Ryan Holiday，被新聞出賣的世界：「相信我，我在說謊」，一個媒體操縱者的告白（臉譜文化，2013）\n David Verklin &amp; Bernice Kanner，新媒體消費革命 (商周，2008)\n Eric Schmidt、Jared Cohen，數位新時代（遠流，2013）\n Viktor Mayer-Schonberger、Kenneth Cukier，大數據（天下文化，2013）\n Seth Stephens-Davidowitz，數據、謊言與真相：Google 資料分析師用大數據揭露人們的真面目（商周，2017）\n Michael Shapiro、 Anna Hiatt、Mike Hoyt，關鍵轉折：內容媒體的科技轉型之路（新樂園，2017）\n 陳威如、余卓軒，平台革命：席捲全球社交、購物、遊戲、媒體的商業模式創新 (商周，2013)\n Joseph S. Nye，權力大未來：軍事力、經濟力、網路力、巧實力的全球主導 (天下文化，2011)\n Joseph S. Nye，柔性權力（遠流出版，2006）\n John Stauber、Sheldon Rampton，有毒污泥愛你好：揭開黑心公關的祕密檔案（紅桌文化，2011）\n Dan Ariely，誰說人是理性的 (天下文化，2010)",
    "foreignLanguageTextbooks": false,
    "remarks": "對於課程有任何問題可以寄信給助教詢問\n助教：陳欣瑋\n信箱：cxw10122000@gmail.com"
  }
]
