[
  {
    "name": "\n  陳冠薇　教師諮商時間(Office Hours) ",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2022-08-29 12:35:26",
    "objective": "本課程將以華語譜系為視角，以中國現代文學的總體概述為起始，進行一場發現之旅。課程將以王德威的《哈佛新編中國現代文學史》為讀本，介紹王德威如何繼承夏志清的工作，呈現新格局、輻射的、「史蘊詩心」的中國文學史呈現。課程中將著重介紹魯迅、張愛玲的文學地位，解釋他們在文學系譜上承前啟後的位置，以各種面向來看待文學作品對於當代文化建構的貢獻。\nThis course adapts a genealogy perspective and begins with a general overview of modern Chinese literature as a journey of discovery. The course will start with a introduction of A new literary history of modern China edited by Wang David Der-wei Wang (王德威), and then review how Wang succeeded Chih-tsing Hsia’s (夏志清)   work to present a new, diversify, and historically poetic version of Chinese literature history. This course will take these authors as cases for discussion, mapping Lu Hsun (魯迅) and Eileen Chang (張愛玲).With further navigating their positions in the literary genealogy, the lecturer aim to address how their literary works construct contemporary culture.",
    "schedule": "1.Course overview\n2.Introduction: Worlding Literary China (DAVID DER-WEI WANG)\n3.Introduction: Worlding Literary China (DAVID DER-WEI WANG)\n4.Movie: Spring in a Small Town \n5.Between Chineseness and Modernity: The Film Art of Fei Mu(WONG AIN-LING)\n6.【Asynchronous online learning】1.Vedio: Lu Xun  2.Preread\n7.Zhou Yucai Writes “A Madman’s Diary” under the Pen Name Lu Xun(HA JIN)\n8.【Asynchronous online learning】Reading：The fiction of Lu Xun\n9.Review\n10.Midterm paper\n11.Movie:  The New Woman\n12.On Language, Literature, and the Silent Screen(KRISTINE HARRIS)\n13.【Asynchronous online learning】1.Vedio:Eileen Chang  2.Preread    \n14.Eileen Chang in Hong Kong(LEO OU-FAN LEE)\n15.【Asynchronous online learning】Reading:The fiction of Eileen Chang\n16.Review\n17.Final Exam\n18.Meeting Time",
    "scorePolicy": "Attendance &amp; Participation: 30% \nMidterm paper:30%\nFinal Exam:40%",
    "materials": "Wang, David Der-wei, ed. A new literary history of modern China. Harvard University Press, 2017.",
    "foreignLanguageTextbooks": true,
    "remarks": "kuanwei31433@mail.ntut.edu.tw"
  }
]
