[
  {
    "name": "葛瑞斐",
    "email": "griffith@ntut.edu.tw",
    "latestUpdate": "2022-05-30 00:27:36",
    "objective": "因為很多人每天都在玩、看和討論體育，所以在與說英語的人互動時，能夠談論體育和理解體育成語是非常有幫助的。 本課程向學生介紹英語詞彙，這些詞彙對於談論體育運動很有用，但在其他社交場合也很有用。 （例如，許多體育習語 —— 例如 “to play hardball” 和 “to triterout”—— 被商人在與體育沒有直接關係的職業場合使用）。 該課程幫助學生更清楚地了解有關體育的英語新聞，與說英語的人更深思熟慮地談論體育，並更批判性地思考體育在英語中人們的文化、語言和日常生活中所扮演的重要角色 —— 說話的世界。\nBecause many people play, watch, and discuss sports everyday, being able to talk about sports and to understand sports idioms is very helpful when interacting with English speakers. This course introduces students to English vocabulary that is useful for talking about sports, but also useful in other social situations.  (For example, many sports idioms -- such as “to play hardball” and “to strike out” -- are used by businessmen in professional situations not directly related to sports).  The class helps students to understand more clearly English news about sports, to talk more thoughtfully with English speakers about sports, and to think more critically about the important role that sports play in the culture, language, and everyday life of people in the English-speaking world.",
    "schedule": "Week 　　1: Introduction\n　　\n2-5: Baseball in the News　　\n\n6-8: Baseball and Culture\n\n9: Midterm week\n\n10-13: Sports and Society\n\n14-17: Sports and Ethics\n　　\n18: Finals week",
    "scorePolicy": "Grades:\n　　Class Exams 80 % \n　　University Exams 20%\n　　\n\n\nAttendance:   \n　　a combination of 3 absences or late days or classwork zeroes =  -10 points from course grade\n　　a combination of 4 absences or late days or classwork zeroes =  failing course grade",
    "materials": "Readings: course book",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >A hybrid model will be adopted complying with the government policy.\n\nGoogle Meet joining info\nVideo call link:</div>"
  }
]
