[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-09-12 04:51:21",
    "objective": "本課程提供學生及職前專業人士必備之英語文語言技巧，強調設計專業領域之英文溝通能力之訓練。課程內容依學院專業內容區分並整合英語文之聽說讀寫之能力為未來全球化移動及以英語專業溝通人才培育為目標。\n英文概述\nEnglish Description\tThis course aims to provide pre-service design students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.",
    "schedule": "We will be making use of American Headway 5--which is a textbook that will help students generally with their English vocabulary and Grammar; however, the activities that we do will be tailored towards students in the Design and Cultural Vocations field. \n\nWeek 1: Intro, Read “Why Clay Shirky Banned Laptops, Tablets and Phones from His Classroom”\n\nDo Related vocabulary homework.\n\n(As always, if a reading or assignment is listed here, is must be completed before you come to class. The units from American Headway, listed below, are advisory. I will assign additional American Headway homework in class; please take good notes and contact a friend for the assignment if you are absent. ) \n\nUnit One—American Headway: What makes us Human? \n\nWeek 2: Unit One—American Headway (cont.) \n\nWeek 3: Unit 2—American Headway: In So Many Words\nArticles in your discipline projects/show and tell\n\nWeek 4 +5: My Fair Lady\n\nWeek 6: Unit 3--Enough is Enough\n\nWeek 7: Unit 3\n\nWeek 8: Review/Oral exam\n\nWeek 9: Midterms\n\nWeek 10: Unit 4, Not all it Seems: Start-up Company Project\n\nWeek 11: Unit 4\n\nWeek  12–13, Unit 5, Culture Clashes\n\nWeek 14–15: Fruits of War\n\nWeek 16–17: Review\n\nWeek 18: Exam",
    "scorePolicy": "Homework: 25%\nQuizzes/Tests: 25%\nParticipation, Skits, and Presentations: 20%\nMidterm: 20%\nIn-class final: 10%\n\nThese percentages may be modified at my discretion. \n\nPlease note that cell phones may not be used in my classes. You may read why not on my course website, on the page \"Why I have a Screen-Free Policy in Class\": https://britamericanlit.wordpress.com/screen-free/.",
    "materials": "American Headway 5: The book can be bought at a discount at this link: https://www.cavesbooks.com.tw/Caves_Search/TBSearch.aspx?key1=9780194726573&querytype1=EAN. It is recommended to buy two or more books with friends so as to save on shipping. Alternatively, students may go directly to the Caves bookstore and get the discount by showing their student IDs. (See MS Teams for more information.) \n\n\nOnline readings and other materials. (Please print these, read them in hard copy, and bring them to class.)",
    "consultation": "FALL 2022 office hours will be Mondays from 11:10–12:00 (by appointment only) and Wednesdays from 1:10–4:00 (appointment recommended). My office is room 816 in the General Education building (across from the the eighth floor elevator)",
    "remarks": "I will make use of MS Teams for both in-person and distance learning. See the following page for instructions: https://britamericanlit.wordpress.com/ms-teams-login-information/",
    "foreignLanguageTextbooks": true
  }
]
