[
  {
    "name": "\n  吳景龍",
    "email": "michaelwu@ntub.edu.tw",
    "latestUpdate": "2022-08-25 15:52:15",
    "objective": "本課程以英文時事為教材，訓練學生英文新聞時事字彙，並藉由增加詞彙量與練習重要句型，使學生進而能閱讀與理解國際時事英文新聞。教材將選自報紙 / 雜誌（如 China Post 與 Taipei Times 雙語新聞）或線上新聞（如 VOA Special English）中適合學生之各類新聞（如政治、經濟、科技、娛樂與時尚新聞等），以有效提升其英文閱聽能力。  \n\nEnglish Description: \nThis course aims to use latest and current news as teaching materials to help students build their vocabulary, familiarize themselves with basic sentence patterns and eventually develop their comprehension abilities. News reports suitable for basic-level students will be selected from newspapers or news magazines (e.g. bilingual news from China Post and Taipei Times) and online news websites (e.g. VOA Special English) to effectively enhance students’ fundamental reading skills.",
    "schedule": "Syllabus 課程表:\n\nWeek 1: Introduction.\nWeek 2: Discuss issues and concepts raised in authentic news articles.\nWeek 3: Various Kinds of Headlines (1).\nWeek 4: Various Kinds of Headlines (2).\nWeek 5: The Special Vocabulary of Headlines.\nWeek 6: Tips on Reading a News Story (1).\nWeek 7: Tips on Reading a News Story (2).\nWeek 8: Tips on Reading a News Story (3). \nWeek 9: Midterm Exam or Report.\nWeek 10: News Story and Journalistic English Vocabularies for Society and Politics.\nWeek 11: News Story and Journalistic English vocabularies for Weather and Disaster.\nWeek 12: News Story and Journalistic English vocabularies for Entertainment and Arts.\nWeek 13: News Story and Journalistic English vocabularies for Businese and Finance.\nWeek 14: News Story and Journalistic English vocabularies for Technology.\nWeek 15: News Story and Journalistic English vocabularies for Health and Medicine.\nWeek 16: Final Group Report (1).\nWeek 17: Final Group Report (2).\nWeek 18: Final Group Report (3) or Final Exam.",
    "scorePolicy": "Percentile of Fnal Grades (成績配分):\n1. Midterm Exam: 20%\n2. Group Presentation in the Class or Final Exam:  20 %\n3. Attendance, Individual Tasks (Homework, Solo Presentation, or Report), and Participation in the Classroom Discussions: 40 % (Note: Five Absences Leading to Failure) \n4. English Proficiency Test: 20%\n\n備註：本課程十八周之教學內容、進度、方法及成績評量方式等，除了校定不可更改之內容外，均為預期計畫。實際之教學內容、進度、方法及成績評量方式等，會依教師實際授課狀況及同學學習成效而定，教師保留彈性調整之權力。(Adjustments are made according to instructor's actual teaching schedule and students’ classroom performance and learning outcomes.)",
    "materials": "1. 教師自編\n2. VOA app\n3. CNN app\n4. ABC app\n5. USA Radio app\n6. Voicetube.com",
    "foreignLanguageTextbooks": true,
    "remarks": "*michaelwu@mail.ntut.edu.tw\n*michaelwu@ntub.edu.tw"
  }
]
