[
  {
    "name": "\n  高楷雲",
    "email": "kaykaoo@hotmail.com/kaykaoo@yahoo.com.tw",
    "latestUpdate": "2022-06-10 14:03:36",
    "objective": "在現今產業激烈競爭與利潤微薄之階段，落實執行 \"突破創新\" 以增加競爭力之唯一生存之道，但鮮少有企業真正瞭解與實際地徹底執行它。不僅工程或服務技術要創新，管理思維更要突破創新，以有效迅速解？錯綜複雜的研發、工程與管理之諸多矛盾問題。本課程以創新構思問題解？法 (TRIZ) 為基礎，詳細介紹工程技術如何落實創新與管理實務創新如何執行。本課程適用於自有品牌業者、ODM 或 OEM 製造業者、服務業者與學術單位教學研究，特點如下：完整詳實闡述 TRIZ 理論並輔以大量簡單案例說明 TRIZ 概念、工程 TRIZ 實務案例 10 餘個與 TRIZ 工程與管理之參數與創新原則說明簡例約 800 餘個，管理實務案例 20 餘個，包含研發管理、服務業管理、專案管理與生產管理等。案例與簡例最多，創新執行力可快速上手與實施應用。本課程 TRIZ 研發、工程與管理兼顧，製造業與服務業高層、中層與基層員工皆符合讀者條件，使 \"突破創新\" 輕易實務執行並成為企業文化，亦適用於大學與研究所之工管、企管 (經營管理)、工商管與工程相關科系，可自行按需求選擇性深入教授講解某些章節，也替產業界事先磨練一群創新思維之活力新血，可長久伴隨您在職場 (或未來進入職場) 解決研發、工程與管理之困難矛盾問題。\nThe aim of this course is to show how to implement TRIZ to resolve conflicts in Product R&amp;D, engineering, and management tactic in a innovative thinking manner. TRIZ has been well-known as a creative and innovative thinking theory in solving engineering and technology contradictions in the last two decades. However, few studies and practical usage were proposed in Product R&amp;D, management area. Nearly 30 real cases are discussed to demonstrate the ideas guided by TRIZ in product R&amp;D management, engineering technology, Project management, Service industry management, and Production management. This course is able to pre-train a lot of students creative way and solve contradiction for further applications in real career.",
    "schedule": "第一週 創新與創業概述\n第二週 創業案例\n第三週 發覺問題與需求：創新準則\n第四週 發覺問題與需求：產品操作問題情境分析\n第五週 設計思考：探索需求、詮釋需求\n第六週 設計思考：後續推展、計思考常見的誤解與錯誤\n第七週 創新事前的評估與事後的評價\n第八週 期中考\n第九週 傳統的創新方法：腦力激盪法、奔馳法\n第十週 傳統的創新方法：心智圖法、曼陀羅九宮格思考法\n第十一週 現代的創新方法 TRIZ (1)\n第十二週 現代的創新方法 TRIZ (2)\n第十三週 專利概念及專利申請\n第十四週 從創意、創新到創業\n第十五週 以創造力讓革新之動員正當化\n第十六週 個案分析\n第十七週 個案分析\n第十八週 期末考",
    "scorePolicy": "期中考 30%\n期末考 30%\n平時成績 40%",
    "materials": "創新與創業管理\n作　　者：林永 、賴文正 、劉基欽 、林秀蓁 、王蓓茹 、高垂 、葉樹正 、王勇懿 、郭芝辰 、杜建緯 、李雅筑\n出版社別：五南\n出版日期：2022/04/01 (1 版 1 刷)\n\n創新的理由：以創造力讓資源動員正當化\n作　　者：武石 彰 、青島矢一 、輕部 大\n譯　　者： 陳文棠 、 劉中儀 、 劉佳麗\n審　　定：劉慶瑞\n出版社別：五南\n出版日期：2021/12/17 (1 版 1 刷)",
    "foreignLanguageTextbooks": false,
    "remarks": "xmaspudding@yahoo.com.tw"
  }
]
