[
  {
    "name": "\n  阮祥微　教師諮商時間(Office Hours) ",
    "email": "tvy.nguyen@ntut.edu.tw",
    "latestUpdate": "2022-08-31 17:36:12",
    "objective": "本課程旨在提供學生解決跨文化管理問題所需的專業知識與行為技能。討論的議題包含文化複雜性、不同組織與個人的文化取向以及世界多種文化維度等面向。本課程鼓勵學生發展跨文化的溝通協調能力與管理技能，使學生在面對全球化組織中的管理問題時，可以從概念與行為上解決這些問題。\nOrganizations are becoming increasingly global. This course aims to provide the students with both the intellectual understanding and behavioral skills necessary to solve cross-culture management problems. The course addresses various issues related to the complexity of culture, the cultural orientation of different organizations and individuals, and the mapping of the world cultures dimensions. The course confronts the students with managerial problems in global organizations and requires the students to address these problems conceptually and behaviorally. Students are guided and encouraged to develop skills in cross-cultural communications, negotiation, and managing cultural differences in a multicultural environment, in order to effectively manage international businesses. Finally, students through various contemporary studies will be able to understand the cultural dynamics that are taking place around the globe",
    "schedule": "Week 1 　　Course introduction\nWeek 2 　　The Challenging Role of the Global Manager\nWeek 3 　　Describing Culture: Hofstede and GLOBE\nWeek 4 　　Describing Culture: Hofstede and GLOBE\nWeek 5 　　How Culture Works: Fundamentals of Cross-Cultural Interaction\nWeek 6 　　How Culture Works: Fundamentals of Cross-Cultural Interaction\nWeek 7 　　The Manager as Decision Maker: Cross-Cultural Dimensions of Decision-Making\nWeek 8　　The Manager as Negotiator: Communicating and Negotiating Across Cultures\nWeek 9 　　The Manager as Negotiator: Communicating and Negotiating Across Cultures\nWeek 10 The Manager as Leader: Motivation and Leadership across Cultures \nWeek 11 　　The Manager as Leader: Motivation and Leadership across Cultures \nWeek 12 The Challenge of Multicultural Work Groups and Teams\nWeek 13 The Challenge of Multicultural Work Groups and Teams\nWeek 14 The Challenge of International Organizations: Structure and Culture\nWeek 15 The Challenge of International Organizations: Structure and Culture\nWeek 16 The Challenge of International Assignments\nWeek 17 Term projects submission\nWeek 18 Final Exam",
    "scorePolicy": "Class Participation in Response-Based Learning Activities 　　30%\nGroup term project and presentation 　　40%\nFinal Exam 　　30%",
    "materials": "Required and recommended reading\n• Instructor provided course materials\n• Cross-Cultural Management: Essential Concepts, David C. Thomas, Mark F. Peterson\n• Essentials of Organizational Behavior, Stephen P. Robbins, Timothy A. Judge",
    "foreignLanguageTextbooks": true,
    "remarks": "Email: tvy.nguyen@ntut.edu.tw"
  }
]
