[
  {
    "name": "\n  鄭鈺潔　教師諮商時間(Office Hours) ",
    "email": "milu775199@gmail.com",
    "latestUpdate": "2022-09-01 16:15:25",
    "objective": "光機系統應用極為廣泛，無論是天文、航太、軍事、醫療、半導體、加速器等高階系統，或講究快速與需價格競爭力之手機、車載、智慧監控等商品，皆仰賴札實的光學與機械知識以確立系統設計滿足需求。本課程內容特別挑選重要的光學與機械做解析外，搭配光學設計軟體、Matlab 模擬以及應用實例以強化重要觀念，並使學生建立相關知解決工程問題與創新能力，並進一步確立興趣與發展方向為主要目標。\nOptical mechanical systems have changed the world and they will continue to do so. The course of optical machinery designed practice aims to be a solution provider for high-end customers in astronomy, aerospace, military, accelerator, and medicine. Also the knowledge can satisfy mass production industries of mobile, automobile, and machine vision. To meet that need, not only does the course introduce core knowledge in optics and mechanics but also practice modeling and case studies to enhance the capability of problem solving and innovation. The subject makes possible to initiating students’ interest in the optical mechanical industry so as to make it as their future careers.",
    "schedule": "與下學期著重在波動光學、傅立葉光學、偏光、雷射應用、晶體光學與非線性光學，上學期著重在「運用幾何光學在成像系統」與「照明光學於非成像系統」的基本知識，在 18 周課程裡盡量涵蓋以下子單元：1. 理想系統，2. 現實像差系統，3. 鏡片及鏡面，4. 光學玻璃材料特性、5. 照度學、6. 補充相關實例模擬與分析，7. 光學評價及光學檢測、8. 光學元件製造上的限制、9. 光學元件及系統的製圖、10. 光學系統的公差分析、11. 變焦鏡頭光學設計、12. 變焦鏡頭凸輪軌跡。為確保學生可學以致用，將輔導學生針對有興趣的專題於第 18. 週期末考繳交報告並上台 (或線上) 報告。\n######\nThis semester will introduce ：1. ideal systems, 2. real systems, 3. optical and diffraction elements, 4. optical materials, 5. photometry and radiometry. Modeling and practice courses include 6. assessment of optical systems, 7. Zoom Lens principles 8. Zoom Lens Cam 9. Telescope Baffle design 10. tolerance analysis, 11. stray light analysis. 10. Final report and oral presentation.",
    "scorePolicy": "需特別注意選修本堂課學生必須參與專題研究，以實際手作獲取所需之知識為本課程主要核心價值。(1) 課程參與 40%(2) 提問 10%(3) 期末報告 20%(4) 期末上台報告 30%。The core of this course is to join different projects. class attendance (40%). question asking (10%). report (20%) and oral presentation (30%) for final.",
    "materials": "1. Malacara: Geometrical and Instrumental Optics, Academic Press 1988\n2. Mahajan: Optical Imaging and Aberrations\n3. Mouroulis/McDonald: Geometrical Optics and Optical Design Oxford 1997\n4. WelfordAberrations of Optical Systems, Hilger 1986\n5. Fischer/Tadic-GalebOptical System Design, McGraw Hill 2000\n6. Kingslake/Johnson: Fundamentals of optical design\n7. Smith: Modern Optical Engineering, Graw Hill 2000\n8. Goodman: Introduction to Fourier Optics,Wiley 2005\n9. lecture notes from University College London, University of Jena, University of Arizona, Imperial College London",
    "foreignLanguageTextbooks": true,
    "remarks": "Please contact via email: yu-chieh.cheng@mail.ntut.edu.tw"
  }
]
