[{"name":"辜炳達","email":"pingtaku@me.com","latestUpdate":"2019-10-25 09:11:27","objective":"This course is designed as an introduction to the craft and culture of short fiction. Students will be introduced to a range of short texts written in English and some significant short stories translated into English (such as the masterpieces by Kafka, Sartre and Borges). \n\nThe course aims to broaden students’ understanding and appreciation of the range of writing in short forms and of the contexts of short story production. The short story is particularly appropriate for encouraging comparative analysis between literary cultures and different phases of socio-political development (say, the Biblical time, 19th-century colonialism and industrialised capitalism, the two traumatic Wars of the 20th century, the Cold War, and beyond).\n\nStudents will be expected to acquire the capacity to analyse literary texts against technopolitical contexts and incorporate relevant critical theories into their interpretative reading.\n\n本課程將引導學生瞭解短篇小說的寫作技巧與文化內涵。學生將閱讀一系列英美短篇小說或其他語系經典作者（如卡夫卡、沙特、波赫士）的作品英譯本。\n\n本課程旨在拓展學生對短篇小說的理解和欣賞能力，並深入探索短篇小說寫作背後的歷史脈絡。短篇小說可以帶領學生比較分析文學文化與不同社會政治發展階段（如聖經時代、殖民和工業資本主義盛行的十九世紀、經歷兩次大戰的二十世紀、冷戰以降直至二十一世紀）之間的相互影響。\n\n學生將習得兩項核心能力：透過科技政治背景分析小說文本，並且運用相關文學理論進行詮釋性的小說閱讀。","schedule":"Week 1. Course Intro: The implications and cultural logic of short fiction’s “shortness”\nWeek 2. “Genesis” from The Bible (ca 950 BCE)\nWeek 3. “The Purloined Letter” by Edgar Allan Poe (1844)\nWeek 4/5. “Bartleby, the Scrivener: A Story of Wall Street” by Herman Melville (1853) \nWeek 6. “After the Race” by James Joyce (1914)\nWeek 7/8. “Metamorphosis” by Franz Kafka (1915)\nWeek 9. Midterm exam\nWeek 10/11. “The Curious Case of Benjamin Button” by F. Scott Fitzgerald (1922)\nWeek 12. “The Wall” by Jean-Paul Sartre (1939)\nWeek 13. “The Garden of Forking Paths” by Jorge Luis Borges (1941)\nWeek 14/15. “Minority Report” by Philip K. Dick (1956)\nWeek 16. “The Love of Lady Purple” by Angela Carter (1974) \nWeek 17. “Solid Geometry” by Ian McEwan (1975)\nWeek 18. Final exam","scorePolicy":"In-class performance 25%\nIndividual presentation 25%\nMidterm exam 25%\nFinal Exam 25%","materials":"All course materials are available on https://archive.org/ and https://www.pingtaku.com/","foreignLanguageTextbooks":true}]
