[{"name":"白俊恩","email":"allenbalaz@gmail.com","latestUpdate":"2019-05-29 15:32:24","objective":"本課程目的在啟發學生英語聽力，分析及思辨能力。本課程自報紙，雜誌及電視選取豐富的教材, 以訓練聽力及筆記的技巧。 此外，在課堂上將討論一些有爭議性的或者有趣的議題，以培養學生獨立思辨能力。\nThe course aims to develop the student's listening techniques and critical thinking in English. A variety of texts will be selected from newspapers, magazines and T.V. to reinforce listening training and note-taking skills. Besides, some controversial or interesting issues will be discussed in class to encourage the student's independent and critical thinking.","schedule":"WED 3-5 LISTENING\nWeek 1 Intro to the class – organization, grading; TED Talk – Do schools Kill Creativity? Discussion Video: Bart the Genius\nWeek 2 Ally McBeal (Pilot); Questions for group discusion and follow-up presentations\nWeek 3 Group presentations (spokesperson for each group)\nWeek 4 House M.D. (Pilot); Questions for group discusion and follow-up presentations\nWeek 5 Group presentations\nWeek 6 AllyMcBeal (The Affair); Questions for group discusion and follow-up presentations\nWeek 7 Group presentations (spokesperson for each group)\nWeek 8 Outsourced\nWeek 9 MIDTERM EXAM (Individual Presentations)\nWeek 10 House, M.D. (pilot); Questions for group discusion and follow-up presentations\nWeek 11 Group presentations (spokesperson for each group)\nWeek 12 Sex and the City (Pilot); Questions for group discusion and follow-up presentations\nWeek 13 Group presentations (spokesperson for each group)\nWeek 14\nWeek 15 House, M.D. (It's a Wonderful Lie); Questions for discusion\nWeek 16 Group presentations (spokesperson for each group)\nWeek 17 Self-evaluations\nWeek 18 FINAL EXAM (Individual Presentations)\nNOTE: Schedule subject to change pending Fall 2019 holidays","scorePolicy":"Grading:\nMidterm 20%\nFinal 20%\nIn-class Participation 60%","materials":"Materials:\nAll materials will be provided by the teacher for downloading by class members.\n\nContact Information:\nallenbalaz@gmail.com","foreignLanguageTextbooks":false}]
