[{"name":"賴峓斈","email":"end90up@gmail.com","latestUpdate":"2019-09-02 09:07:54","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"※9/20第一次上課時請於東校區排球場集合，若為雨天則直接於中正館六樓集合。\n※上課時請著運動服裝、攜帶毛巾、水。防曬物品則自行決定是否攜帶及使用。\n一、中秋節放假\n二、排 球-東校區排球場\n                  高低手發球、低手擊球、高手托球、分組練習、比賽、體適能、徑賽練習\n三、排 球-東校區排球場\n                  高低手發球、低手擊球、高手托球、分組練習、比賽、體適能、徑賽練習\n四、排 球-東校區排球場\n                  高低手發球、低手擊球、高手托球、組合練習、比賽、體適能、徑賽練習\n五、國慶日調休\n六、排 球-東校區排球場\n                  高低手發球、低手擊球、高手托球、組合練習、比賽、體適能、徑賽練習\n七、班級團隊合作接力賽\n八、桌 球-中正館地下室桌球教室\n                  發球、正反拍、分組對推、分組練習\n九、桌 球-中正館地下室桌球教室\n                   發球、正反拍、分組對推、分組練習\n十、桌 球-中正館地下室桌球教室\n                  發球、正反拍、分組對推、分組練習\n十一、桌 球-中正館地下室桌球教室\n                      發球、正反拍、分組對推、分組比賽\n十二、桌 球-中正館地下室桌球教室\n                      發球、正反拍、分組對推、分組比賽\n十三、羽 球-中正館五樓球館\n                      發球、長球、單打、分組練習\n十四、羽 球-中正館五樓球館\n                      發球、長球、單打、分組練習\n十五、羽 球-中正館五樓球館\n                      發球、平球、雙打、分組練習\n十六、羽 球-中正館五樓球館\n                      發球、平球、雙打、分組比賽\n十七、羽 球-中正館五樓球館\n                      發球、短球、雙打、分組比賽\n十八、補考\n課程內容以實際上課狀況為主。","scorePolicy":"技能30%、認知10%、情意60%","materials":"自編","foreignLanguageTextbooks":false}]
