[{"name":"邵文政","email":"wcshao@ntut.edu.tw","latestUpdate":"2019-09-05 17:08:34","objective":"大學入門是針對大一新生所開授之全校性課程。用以協助學生:(一)認識高等教育的理念、目的與價值(二)有效學習(三)涵養正視困境並妥適因應能力。藉以實踐自我鍛鍊，自我掌握，自我經營並建構宏觀視界的高等教育宗旨。依據提供服務準則,工程師們須以誠實公平公正正當和奉獻保護公共健康,安全及幸福。工程師們必須以專業標準的行為履行最高的倫理準則。本課程以（1）工程倫理概述（2）衝突與抉擇（3）守則與解說（4）個案分析，提供學生瞭解及研析。\n\"First step to achieving the goals of universities\" is a campus-wide course provided for all of the first-year students at this school. The course is designed to help first-year students to achieve the following aims and objectives:(1) understanding the basic idea, goals, and fundamental value of higher education at college level;(2) learning proper study attitudes and methods effectively;(3) cultivating the required abilities and skills of responding appropriately to setbacks and difficult situations in order to acquire self-knowledge, self-control, and self-management, so that they may construct the knowledge and imagination that are needed in planning for grand visions of achieving the goals of higher education. Accordingly, the services provided by engineers require honesty, impartiality, fairness, and equity and must be dedicated to protection of the public health, safety and welfare. Engineers must perform under a standard of professional behavior that require adherence to the hi","schedule":"週次/日期/星期/各週主題/講師/上課地點\n(1)09/13(五)中秋節放假\n(2)09/20(五)課程導論暨大學教育理念及價值/帶班老師/各班教室\n(3)09/27(五)社團力-北科社團好好玩/北科社團/中正廳\n(4)10/04(五)國際力-交換生大作戰/北科交換生/中正廳\n(5)10/11(五)國慶日放假\n(6)10/18(五)生涯力-做自己的生命設計師/各大企業講師/中正廳\n(7)10/25(五)各系所介紹/帶班老師/各班教室\n(8)11/01(五)教師自選課程/帶班老師/各班教室\n(9)11/08(五)期中考\n(10)11/15(五)教師自選課程/帶班老師/各班教室\n(11)11/22(五)簡報力-上台簡報表達how容易/康輔協會老師/中正廳\n(12)11/29(五)情感力-大學生愛情how幸福/康輔協會老師/中正廳\n(13)12/06(五)教師自選課程/帶班老師/各班教室\n(14)12/13(五)溝通力-最討人喜歡的說話方式/康輔協會老師/中正廳\n(15)12/20(五)倫理力-工程倫理(老師授課)/帶班老師/各班教室\n(16)12/27(五)倫理力-工程倫理(學生分組報告)/帶班老師/各班教室\n(17)01/03(五)倫理力-工程倫理(學生分組報告)/帶班老師/各班教室\n(18)01/10(五)期末考","scorePolicy":"評分依據為課堂出席狀況與報告心得\n兩份期中及期末報告\n(1)\"精彩讀大學計畫書-無論是校園活動、專業領域、社團規劃、校外參與、感情生活、人生方向等，都可納入思考及規劃。透過精彩讀大學計畫書的撰寫，讓學生自己對未來大學四年充滿期待與規劃之餘，也試著去探索讓大學生涯更豐富更有意義的方式。不限格式與呈現方式(簡報、文字、影片、圖片等)\"繳交期限2019/11/01期中考前一週\n(2)\"擇一合院演講之心得報告\"繳交期限2019/01/03期末考前一週","materials":"1.綠建材標章與解說評估手冊\n2.健康建築Well V2\n3.永續循環校園及UN SDGs","foreignLanguageTextbooks":false}]
