[{"name":"葉惠蘭","email":"hlyeh@ntut.edu.tw","latestUpdate":"2019-09-08 12:27:43","objective":"文化事業是以「文化」為素材所開展的事業，性質上以文化、美學或社會價值為訴求，但也往往同時兼具經濟價值。本課程旨在介紹文化事業的內涵與範疇，比較其與當前政府推展的「文化創意產業」間的異同，其中「文化」、「文化政策」、「國際文化生態」等都是觸及的議題。其次，討論「高品質的文化服務」與「從業人員的素養」，探討從事者應具備的基本能力與人格特質，並借重測驗工具協助同學理解個人人格特質組成及分布。\n    對於重要文化事業區塊，或將採取主題介述方式，邀請業界人士進行講座，而實地參訪與場景演練也是重要的教學活動。\nCultural Vocation is a developing vocation base on culture. The scope of the nowadays so-called \"Cultural Business\" has more or less been verlapped with \"The Business of Culture and Creativeness\" with the essence of emphasis not only on the economic values but also on those of culture, esthetics and society. The course will be focused on introductory methodology through main topic discussions by inviting professionals from different realms of industries for panel symposiums. In addition, on-site visits and case simulations are also to be included as important educational activities. The initial courses will be discussions on cultural relevant topics such as \"Culture\", \"Cultural policies\", \"Cultural Development\" and \"International Cultural Systems\". Further various scopes and contents of \"Cultural Vocation\" and status quo of its development will be introduced and discussed.","schedule":"「文化事業概論與人才培育」2019授課大綱    41人分8組\n\n課程目標：\n一、　　從「文化」到「文化事業/文創產業」範疇與屬性的釐清\n二、　　由「文化事業上下產業鏈」及「文創範籌分佈」的宏觀認知，揭櫫文發系培養文化產業鏈開發、中介人才的願景。 完成個人職場座標經緯設定。\n三、　　聚焦未來趨勢，凸顯風雲領域。\n四、　　提出人才評比關鍵四力，以及自我經營修練法則。\n五、　　學生期末報告\n本學期將回歸目標與理念的把握        \n   ※從創作到藝文素材轉化為用             \n   ※跨域異業連結的嘗試                     \n   ※重新貞定目標與理想的開發\n         ◆追求實現真善美的價值              \n         ◆留更好的地球給下一代              \n                      ◆有大用，非僅小用                           \n                      ◆關切人/人與人\n            \n一週、課程預備 ─\n             ● 相關專書必買一冊﹝書目﹞/﹝文化部出版品﹞\n             ● 課堂管理/分組完成﹝推選小組長﹞          \n二週   課程預備 ─\n文發系的Logo\n           文化/文化公民權  \n           ﹝發閱讀講義及參考資料﹞         \n三週  「文化事業」/「文創產業」\n四週   本系發展目標與特色\n         ◎文發系的定位、目標及發展特色/課程地圖\n         ◎中介人\n五週   ※講座        \n六週   個人的定位經緯（作業一） ─ 文創分布及產業鏈           \n         ●交上週講座心得（作業二）\n七週   台灣文創十年                       \n八週   邱誌勇〈文化創意產業的發展與政策概念〉（分組問答/作業三）\n九週   期中考﹝●筆試﹞         \n十週  檢討考題\n十一週   風口往哪裡去？ \n十二週   人才評比關鍵四力\n        （※講座）\n         ●交一書心得（作業四）\n十三週   人才評比關鍵四力\n         ●交上週講座心得（作業二）/檢討一書心得  \n十四週   人才評比       \n  競爭關鍵─「文化力」      \n十五週   人才評比\n 競爭關鍵─「服務力」          \n十六週   小組報告1234﹝期末報告﹞        \n十七週   小組報告5678﹝期末報告﹞\n十八週   座談\n          \n\n、","scorePolicy":"成績考核\n  作業 40%\n  筆試  30%\n  期末報告  30%","materials":"秋山利輝「匠人精神」等十數冊參考書","foreignLanguageTextbooks":false}]
