[{"name":"胡憲倫","email":"allenhu@ntut.edu.tw","latestUpdate":"2019-08-13 09:41:33","objective":"Students will not just learn traditional business management but also new strategies and practices for doing business in the emerging green and low carbon economy. Students will understand the characteristics and landscape of the new economy, and how to help enterprises enhance their competitiveness in response to the megatrends of sustainability. In addition, latest practices and theories of corporate sustainability, such as UN Sustainable Development Goals (SDGs), Bottom of the Pyramid (BOP), and Creating Shared Values (CSV), will be taught in the class. Case studies and group discussion will be adopted in the class.\n這門課除了教授傳統企業環境管理及相關實務之外，特別將著重在企業提升如何透過綠色創新來提升綠色競爭力的策略與做法；此外，課程另一重點將會是企業如何透過協助聯合國永續發展目標(UN SDGs)的達成，來創造企業的永續競爭力。學生將會深入探究金字塔底層(BOP)與創造共享價值(Creating Shared Value, CSV)之理論及實務做法，以及成為一個真正永續企業的策略。瞭解新經濟時代的特徵，以及企業如何透過環境與永續發展議題，來協助大環境的永續發展並提昇企業的競爭優勢。課堂上將會應用多個企業案例，讓學生們透過分組討論，來獲得最大的學習效果。","schedule":"Schedule\n*Guest Lecture by Dr. Grace Liu (Acer Inc)\n第一週(9/10) 企業本質與企業管理概論(企業環保主義之興起與演進)\nWeek 1 Introduction to the Corporation and Business Management\n第二週(9/17)全球趨勢與企業永續思維*\nWeek 2 Global Trends and Business Thinking for Sustainability\n第三週(9/24) 環境管理工具：環境管理系統、環境會計、清潔生產、綠色設計\nWeek 3 Environmental Management Tools- Environmental Management Systems (EMS), Environmental Accounting, Cleaner Production, Green Design\n第四週(10/1) 環境競爭策略理論與實務(一)：環境產品差異化與管理競爭者\nWeek 4 Environmental Strategies Theory and Practices (I): Environmental Products Differentiation; and Managing Competitors\n第五週(10/8) 環境競爭策略理論與實務(二)：降低成本與重新定義市場\nWeek 5 Environmental Strategies Theory and Practices (II): Reducing Costs within the Firm; and Redefining Markets\n第六週(10/15) 企業永續管理重點(一)：經濟面向核心議題\nWeek 6 Focuses of Corporate Sustainability (I)- Core Issues of Economic Aspect\n第七週(10/22) 企業永續管理重點(二)：環境面向核心議題*\nWeek 7 Focuses of Corporate Sustainability (II)- Core Issues of Environmental Aspect\n第八週(10/29) 企業永續管理重點(三)：社會面向核心議題*\nWeek 8 Focuses of Corporate Sustainability (III)- Core Issues of Economic Aspect\n第九週(11/5) 期中考\nWeek 9 Midterm\n第十週(11/12) 透明與永續資訊揭露專題－環境與永續性報告書\nWeek 10(11/18) Transparency and Disclosure- Non-financial/Sustainability Reporting \n第十一週(11/26) 環境與永續風險管理專論(一)：綠色暨永續供應鏈管理*\nWeek 11 Special Topics on Risk Management of Sustainability (I) Green and Sustainable Supply Chain\n第十二週(12/3) 環境與永續風險管理專論(二)：碳管理與氣候治理\nWeek 12 Special Topics on Risk Management of Sustainability (II) Carbon and Climate Governance\n第十三週(12/10) 企業倫理與企業社會責任專論－含公司治理\nWeek 13 Special Topic on Business Ethics and Corporate Social Responsibility\n第十四週(12/17) 企業新藍海策略專論—金字塔底層暨包容性商業及共享的價值(行銷3.0理論)\nWeek 14 Special Topic on the Base of the Pyramid/Inclusive Business and Shared Value- A New Business Ocean Strategy\n第十五週(12/24) 企業價值新論—環境與社會損益(Environmental and Social Profit and Loss, EP&amp;L and SP&amp;L)\nWeek 15 Special Topic on New Evaluation Methodology- Natural Capital Accounting (NCA) and Environmental and Social Profit and Loss (EP&amp;L and SP&amp;L)\n第十六週(12/31, Week 16) 專題分組報告 Group Presentation (一)\n第十七週(1/7, Week 17) 專題分組報告Group Presentation (二)\n第十八週(1/14, Week 18)總結&amp;期末考 Conclusion and Final Exam","scorePolicy":"Homework/Reports: 20%  Participation: 10% Midterm: 15%\nFinal Exam: 25%   Project: 30% (TBA in the class)","materials":"1.　　Blowfield, Michael (2013), Business and Sustainability, Oxford : Oxford University Press, 2013.\n2.　　Weybrecht, Giselle (2010), The Sustainable MBA: The Manager's Guide to Green Business, John Wiley &amp; Sons, Chichester, UK\n3.　　Werther, W.B. and D. Chandler (2011). Strategic Corporate Social Responsibility- Stakeholders in a Global Environment (2nd edition), Sage Publications\n4.　　Esty and Winston (2009), Green to Gold: How Smart Companies Use Environmental Strategy to Innovate, Create Value, and Build Competitive Advantage, Wiley \n5.　　Andrew S. Winston (2014), The Big Pivot: Radically Practical Strategies for a Hotter, Scarcer, and More Open World, Harvard Business Review Press \n6.　　Elkington, J. and J. Zeitz (2014). The Breakthrough Challenge- 10 Ways to Connect Today’s Profits with Tomorrow’s Bottom Line, Jossey-Bass\n7.　　顏和正譯，Philip Kotler等著，行銷3.0 (Marketing 3.0- From Products to Customers to Human Spirit)，天下，2011(原版書籍可從http://ishare.iask.sina.com.cn/f/10664542.html下載)\n8.　　Others (papers, reports…) 其他補充資料","foreignLanguageTextbooks":true}]
