[{"name":"陳匡正","email":"kchen34@gmail.com","latestUpdate":"2019-12-08 18:15:50","objective":"為保障著作人著作權益，調和社會公共利益，促進國家文化發展，國家特制定著作權法；本課程重心在於介紹我國著作權法之內涵，包含該法所保護之「著作」範圍、權利人及著作權範圍、著作權管理及權利侵害之救濟等，除講授理論外，同時搭配案例解析，以期讓同學對著作權法有最完整之了解。\nCopyright Act is specifically enacted for the purposes of protecting the rights and interests of authors with respect to their works, balancing different interests for the common good of society, and promoting the development of national culture. This course introduces the main meanings, concepts and contents of the Copyright Law. Including the scope for copyright protection, the kinds of works that qualify for copyright protection, the rights granted to copyright owners, the management of copyright, and remedies for right infringement. The discussion in the course covers theory and examples, to enhance a deeper understanding of Copyright for the students.","schedule":"第一週 (108/9/8~108/9/14) 中秋節放假一天 \nWeek 1 (108/9/8~108/9/14) Mid-Autumn Festival\n第二週 (108/9/15~108/9/21) 課程緒論；著作權法之立法目的；創作保護主義與登記及註冊制度之選擇\nWeek 2 (108/9/15~108/9/21) Introduction: Legislative Purpose of Copyright Act, Choices of the Principle of Creative Protection and Registration System\n第三週 (108/9/22~108/9/28) 動物著作之著作權保護\nWeek 3 (108/9/22~108/9/28) Copyright Protection for Animals’ Works\n第四週 (108/9/29~108/10/5) 思想與表達區分、合併原則之具體運用 \nWeek 4 (108/9/29~108/10/5) Concretely Application on the doctrine of idea-expression dichotomy and the merger doctrine of idea and expression\n第五週 (108/10/6~108/10/12) 國慶日調整放假一天 \nWeek 5 (108/10/6~108/10/12) National Day\n第六週 (108/10/13~108/10/19) 色情或猥褻著作是否受著作權保護？；僱傭與聘任關係之著作人約定，對著作人格權歸屬之影響\nWeek 6 (108/10/13~108/10/19) Are Pornography or Obscene Works Copyrightable?; Agreements on Authors’ in the Works Made for Hire and Their Impacts on Ownerships of Moral Rights\n第七週 (108/10/20~108/10/26) 共同著作與結合著作之區別 \nWeek 7 (108/10/20~108/10/26) Distinguish between Joint Works and Collective Works\n第八週 (108/10/27~108/11/2) 著作人格權採取永久保護制之合理性\nWeek 8 (108/10/27~108/11/2) Discussions about Forever Protection of Moral Rights\n第九週 (108/11/3~108/11/9) 著作人格權可否約定不行使？\nWeek 9 (108/11/3~108/11/9) Whether Moral Rights are not Enforced by Agreement or not?\n第十週 (108/11/10~108/11/16) 公開演出權、公開播送權及公開上映權之異同\nWeek 10 (108/11/10~108/11/16) Public Performance, Public Broadcast, and Public Presentation\n第十一週 (108/11/17~108/11/23) 我國著作真品平行輸入違法之商榷\nWeek 11 (108/11/17~108/11/23) Whether Parallel Importation of Copyright is Legal or not in Taiwan?\n第十二週 (108/11/24~108/11/30) 著作鄰接權是否該納入我國著作權法？\nWeek 12 (108/11/24~108/11/30) Whether Neighboring Rights should be Included in Taiwan Copyright Act or not?\n第十三週 (108/12/1~108/12/7) 製版權制度之介紹\nWeek 13 (108/12/1~108/12/7) Introduction of Plate Rights\n第十四週 (108/12/8~108/12/14) 權利管理電子資訊與反盜拷措施之介紹\nWeek 14 (108/12/8~108/12/14) Electronic Rights Management Information and Technological Protection Measures\n第十五週 (108/12/15~108/12/21) 著作合理使用概括條款之範疇為何？\nWeek 15 (108/12/15~108/12/21) What are Scopes of General Clause about Fair Use in Taiwan Copyright Act?\n第十六週 (108/12/22~108/12/28) 集體管理團體會員之再授權該被禁止？\nWeek 16 (108/12/22~108/12/28) Whether Re-licensing by Members of Collective Management Group is Banned or not?\n第十七週 (108/12/29~109/1/4) 著作權法修法新趨勢\nWeek 17 (108/12/29~109/1/4) New Trends about Amendment of Taiwan Copyright Act\n第十八週 (109/1/5~109/1/11) 期末專題報告\nWeek 18 (109/1/5~109/1/11) Final Project Report","scorePolicy":"1.期末專題報告 50%\n1.Final Project Report 50%\n2.上課出席 30%\n2.Class Attendance 30%\n3.上課參與及表現 20%\n3.Class Participation and Performance 20%","materials":"1.簡啟煜著，著作權法案例解析，元照出版有限公司，2017年9月。\n1.Chi-Yu Chien, Case Analyses of Copyright Law (Angle Publishing Co. Ltd., 2017).\n2.蕭雄淋著，著作權法論，五南圖書出版公司，2015年2月。\n2.Hsiung-Lin Hsiao, Copyright Law (Wu-Nan Book Inc., 2015).\n3.蕭雄淋著，著作權法實務問題研析，五南圖書出版公司，2013年7月。\n3.Hsiung-Lin Hsiao, Analyses of Practical Issues in Copyright Law (Wu-Nan Book Inc., 2013).\n4.章忠信著，著作權法逐條釋義，五南圖書出版公司，2014年3月。\n4.Chung-Hsin Chang, Interpretation of Copyright Law (Wu-Nan Book Inc., 2014).","foreignLanguageTextbooks":false}]
