[{"name":"林榮禾","email":"rhlin@ntut.edu.tw","latestUpdate":"2019-05-30 19:07:27","objective":"產品研發創新管理課程主要對象為有興趣從事企業產品研發創新發明機會或技能的學生們。此課程不僅介紹基礎發明工具而且提供課程上實際演練。主要內容包含如何辨識企業產品研發創新機會與問題；發現新點子；發展最適解答；展示創新成果與萃思方法介紹。課程上也會提出許多相關企業的應用實例討論。\n    其目的在於幫助學生們學習了解創新工具與系統創新方法在產品研發創新管理的專業領域及利用課程上的產品研發創新工具或取更好的工作機會\n\n    Production R&amp;D Innovation Management course focuses on the particular interest to those students who are considering Production R&amp;D development of an innovative business opportunity or innovation management skills. This course not only discusses the basics toolkits for every innovator needs, but also provides the practice workshop of systematic innovation. Major topics include how to identifying the opportunity and problem of Production R&amp;D; discover the new ideas; develop the solution; demonstrate the innovation; and the TRIZ works. Many of the examples will also be discussed in their entrepreneurial approaches to Production R&amp;D innovation.\n    Objective: To develop an understanding of innovation toolkits and systematic innovation approach to help students making better understanding in Production R&amp;D innovation management and equipping with the innovation skills needed to pursue a viable career option.","schedule":"1~2: 產品研發問題探討與機會辨識-林榮禾\n3~4: 產品研發S-曲線與科技系統演化趨勢-林榮禾\n5~6：Creax軟體使用展示與實作-林榮禾","scorePolicy":"Description of Course Details:\n1. Homework and Assignments: 10 %\n2. Attendance  10%\n4. Term Project: 10%","materials":"暫訂(請勿先行購買下列課本)\n1.　　Mam, D.L., “Hands-On Systematic Innovation,” 3 edition, Thomson Higher Education, 2006.\n2. TRIZ 萃智系統性創新理論與應用，宋明弘著，鼎茂圖書，2010。\n3.　　Silverstein, D., Samuel P., and Decarlo, N., “The Innovator's Toolkit: 50+ Techniques for Predictable and Sustainable Organic Growth,” 2nd edition, John Wiley &amp; Sons, 2012.\n4.　　Strategic Management of Technological Innovation, 4th Edition, M.S. Schilling, McGraw-Hill, 2012.","foreignLanguageTextbooks":true},{"name":"張文華","email":"whchang@ntut.edu.tw","latestUpdate":"2019-06-03 05:41:48","objective":"隨著網際網路的盛行，電子商務迅速地蓬勃發展，經營網路行銷/數位行銷的需求，已經是每個公司所必需的。從新產品的開發、行銷、到售後服務均受影響。網路電子商務已經成為傳統行銷通路以外的一個新興通路。再加上網路全年無休、成本低廉、以全球為市場的優勢，以及可符合消費者的需求的特色，使得電子商務明顯的成為未來商業發展的主流。因此，如何經營數位行銷已是現代企業具有競爭力重要課題。  在數位行銷的潮流下，產品差異化和產品研發創新管理更是格外的重要。此課程主要內容包含了如何操作數位行銷，和產品研發創新管理。主要對象為有興趣從事數位行銷和企業產品研發創新發明機會或技能的學生們。此課程不僅介紹數位行銷和產品研發創新發明工具而且提供課程上實際演練。產品創新管理主要內容包含如何辨識企業產品研發創新機會與問題；發現新點子；發展最適解答；展示創新成果與萃思方法介紹。課程上也會提出許多相關企業的應用實例討論。 其目的在於幫助學生們學習了解創新工具與系統創新方法在產品研發創新管理的專業領域及利用課程上的產品研發創新工具。","schedule":"第1週　　網路行銷入門\n第2週　　網路行銷成功個案分享\n第3週　　如何做好B2B網路行銷Alibaba\n第4週　　B2B網路行銷的成功之道\n第5週　　網路行銷專案外包因素\n第6週　　網路行銷專案績效評估\n第7週　　網路行銷與顧客關係管理\n第8週　　網路行銷成功的要素總結\n第9週　　期末考試或報告\n第10週　　產品研發問題探討與機會辨識\n第11週　　產品研發問題探討與機會辨識\n第12週　　產品研發S-曲線與科技系統演化趨勢\n第13週　　產品研發S-曲線與科技系統演化趨勢\n第14週　　Creax軟體使用展示與實作\n第15週    Creax軟體使用展示與實作) \n第16週　　衝突辨識與功能屬性分析\n第17週　　物理矛盾與發明原則\n第18週　　S-曲線與科技系統演化趨勢(含Creax軟體使用展示)","scorePolicy":"Final Project 30%\nMidterm Exam 20%\nHands-on Practice 20%\nHomework and Casework 20%\nClass Participation – (Think and Discuss) 10%\n\n期末專題 30%\n期中考 20%\n實務操作練習 20%\n作業與案例研討 20%\n課程參與 (思考並參與討論) 10%","materials":"圖解小資老闆集客行銷術：不必花大錢也能做好行銷\n作者： 林杰銘  \n 出版社：書泉  \n出版日期：2018/12/28","foreignLanguageTextbooks":false}]
