[{"name":"薛人瑋","email":"angusshiue@gmail.com","latestUpdate":"2019-06-05 16:54:45","objective":"目前永續發展已被視為推動社會和諧、經濟發展和環境保護的共同目標，化學科技則居中扮演一個非常關鍵的角色，因此，這門課程的主要目的是介紹綠色化學與潔淨技術的設計、開發和評估，其中包括：非傳統原料的利用、有利於生態的合成方法、設計更安全的化工產品以及生物合成和生物模擬原理的使用，並從原材料的選擇以至終端產物之整個生產流程，做一完整的評估以了解對人員安全健康以及生態的影響，並與對應的傳統製程相互比較。\nSustainable development is now accepted as a necessary goal for achieving societal, economic and environmental objectives. Within this chemistry has a vital role to play. Therefore, this course aims to introduce the students to the design, development, and evaluation processes of new Green Chemistry methodologies, and it include: alternative feedstocks, environmentally benign synthetic methodologies, designing safer chemical products, new reaction conditions, alternative solvents and catalyst development, and the use of biosynthesis and biomimetic principles. The students are introduced to the new evaluation process that encompasses the health and environmental impact of a synthetic pathway from choice of starting materials through to target molecule. Furthermore, comparisons and contrasts with classical methodologies are offered as illustrative examples in this course, too.","schedule":"週 次　　   月   日 　　 時數 　　授課內容要項\n1　　13/9　　3　　Introduction of Green Chemistry\n2　　20/9　　3　　Green Engineering (Control of Environmental Impact of chemical processes and products)\n3　　27/9　　3　　Alternative Reaction Media\n4　　4/10　　3　　Catalysis for Green Chemistry\n5　　11/10　　3　　Clean Synthesis\n6　　18/10　　3　　Renewable Resources and Energy Efficiency &amp; Emerging Technologies\n7　　25/10　　3　　Clean Technology\n8　　1/11　　3　　Cleaner Production\n9　　8/11　　3　　Global Environmental Issues\n10　　15/11　　3　　Waste Minimization and Design for the Environment\n11　　22/11　　3　　Environmental Risk Management\n12　　29/11　　3　　Energy Management\n13　　6/12　　3　　Process Design\n14　　13/12　　3　　Sustainable Development\n15　　20/12　　3　　Life Cycle Assessment\n16　　27/12　　3　　Project Cycle Management\n17　　3/1　　3　　Quality Control of Cleaner Production\n18　　10/1　　3　　(Final exam)","scorePolicy":"1.　　Homework 30%：Homework must be handed in during class when the date is due.\n※ Late homework – HALF GRADE if handed within a week; ZERO GRADE thereafter.\n2.　　Mid-term exam 35%.\n3.　　Final exam 35%.","materials":"1.　　Paul T. Anastas, John C. Warner, “Green Chemistry: Theory and Practice”.\n2.　　Ruth Hillary, “Environmental Management Systems and Cleaner Production”.\n3.　　ISO 50001 and ISO 14000.","foreignLanguageTextbooks":true}]
