[{"name":"楊仁傑","email":"yangrenjye@gmail.com","latestUpdate":"2019-08-30 17:49:42","objective":"This course is an entry-level, application oriented, graduate course to lead students with basic understanding in finite element method and its applications. Several programming and software will be introduced. Students will practice and define their own engineering problems and use finite element method to solve them. Through home-works, project exercises, project discussions and presentations, students will be able to utilize the finite element method in their own researches.\n本課程是入門級、應用為主的研究生課程，旨在引導學生對有限元方法及其應用有基本的瞭解。將介紹一些程式設計和軟體。學生將練習和定義自己的工程問題，並使用有限元法來解決。通過作業、專案練習、專案討論和發表，學生將能夠在自己的研究中運用有限元方法。","schedule":"Week　　date　　Class Contents　　\n1　　9/10　　Syllabus and Introduction (Ch1)　　\n2　　9/17　　Introduction (Ch1) &amp; Introduction to the Stiffness (Displacement) Method (Ch2)　　\n3　　9/24　　Hands-on Demo &amp; Training (Process &amp; Static) /Max吳偲豪, Altair @綜合科館 610\n4　　10/1　　Development of Truss Equations (Ch3), Development of Beam Equations (Ch4) /Define Project I topics. Report outline is due the following week.\n5　　10/8　　Frame and Grid Equations (Ch5), Development of the Plane Stress and Plane Strain Stiffness Equations (Ch6)　　\n6　　10/15　　Practical Considerations in Modeling; Interpreting Results; and Examples of Plane Stress/Strain Analysis (Ch7), Development of the Linear-Strain Triangle Equations (Ch8)　　\n7　　10/22　　Project I Presentation /Project final reports are due prior the class.\n8　　10/29　　Complete Project I Presentation/ Review Midterm Exam　　\n9　　11/5　　Midterm Exam　　\n10　　11/12　　Axis-symmetric Elements (Ch9)　　\n11　　11/19　　Iso-parametric Formulation (Ch10)　　\n12　　11/26　　Three-Dimensional Stress Analysis (Ch11)　　\n13　　12/3　　Hands-on Demo &amp; Training (Dynamics &amp; Design) /Max吳偲豪, Altair @綜合科館 610\n14　　12/10　　Plate Bending Element (Ch12), Heat Transfer and Mass Transport (Ch13)　　/ Define Project II topics. Report outline is due the following week.\n15　　12/17　　Fluid Flow (Ch14), Thermal Stress (Ch15) &amp; Structural Dynamics (Ch16)　　\n16　　12/24　　Explicit/Implicit Transient Dynamics/Design Concept　　\n17　　12/31　　Project II Presentation /Project final reports are due prior the class.\n18　　1/7　　Complete Project II Presentation + Final Coffee Outing @Mr. Brown Coffee","scorePolicy":"1.　　Midterm Exam：25 %\n2.　　Homework/In-class discussion, participation and attendance 25 %\n3.　　Project I Presentation: PPT + Oral presentation (25%) \n4.　　Project II Presentation: PPT + Oral presentation (25%)","materials":"Textbook : “A First Course in the Finite Element Method”, by R. Daryl L. Logan (Edition 6); Publisher:\nCengage Learning\n\nReferences： 　　\n1. The Finite Element Method, O.C. Zienkiewicz &amp; R.L. Taylor (Vol. I &amp; II); Publisher: McGraw-Hill\n\n2. Concepts and Applications of Finite Element Analysis, R. Cook, D. Malkus, M. Plesha, R. Witt; Publisher: Wiley \n\n3. The Finite Element Method: Linear Static and Dynamic Finite Element Analysis, Thomas J. R. Hughes, Dover Publications, 2000.","foreignLanguageTextbooks":true}]
