[{"name":"楊育群","email":"","latestUpdate":"2019-09-06 12:08:49","objective":"本課程介紹系統工程，系統工程專注於處理大型、複雜的專案發展時，所面臨的相關工程發展程序與問題，如何從計畫任務成型、系統設計、實體產出、整合測試、品質保證、系統操作、後勤支援、任務操作與結束等全程的一門跨多學科領域的管理與工程科學。本課程簡介系統工程重要議題，並以典型衛星系統研發作為本課程之應用範例。課程內容包括: 系統基本概念、系統工程基本概念、任務分析、系統需求、功能分析與配置、設計整合、產品獲取(或發展)與系統驗證、品質保證、系統管控、系統工程的實施、衛星系統工程實務。\nThe course will introduce systems engineering. Systems engineering normally emphasizes handling the engineering process and problems in the development of large and complicated projects/programs. It involves how the project/ program mission formed, system design, hardware/software components produced, integration and testing, quality assurance, system operations, logistics, mission operations until its decommission. It involves various interdisciplinary sciences and management skill for the engineering knowledge and skill to meet the needs for mission success.  This course will provide the introduction on the systems engineering and provide the typical satellites (mission) systems research and development as the examples for better understanding its wide applications. The courses may cover: fundamental concept of system and systems engineering, mission analysis, system requirements, functional analysis and allocations, design and integration, products procurement/ development and syste","schedule":"Week 1: Overview of Systems Engineering mainly for electro-mechanical systems engineering.\nWeeks 2-5 : Mission system engineering based on relevant space missions to Taiwan \nWeeks 6–8 : Special mission and systems development for Taiwan;\nNamely Space SAR （Synthetic Aperture Radar) constellation development plan \nWeeks left: Verification plan, reliability issue vs. cost and performance, etc.","scorePolicy":"Everyone needs to present his/her work on the system development plan including good objectives and system requirements for development, and more requirements by the teacher for the presentations.","materials":"One reference book should be able to be downloaded from the Internet. One text book written in Chinese is encouraged to be bought or borrowed from the previous students who has the book.","foreignLanguageTextbooks":true}]
