[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2019-05-30 18:16:53","objective":"本課程介紹數據分析的基本及進階的概念和技術，以及如何將它們應用於大規模數據集。主要是在回顧描述性統計，概率分佈，推理統計（估計和假設檢驗）和回歸分析，機器學習技術(PCA、ICA)、判別分析、聚類分析、SVM、隨機森林、人工神經網絡、DTW、EMD。此外，本課程將使用流行且功能強大的數據分析語言(即R)來解決許多實際問題。\nThis course covers the basic and advanced concepts and techniques of data analytics and how to apply them to large-scale data sets. Mainly, after a review of descriptive statistics, probability distributions, inferential statistics (estimation and hypothesis tests), and regression analysis, various machine learning techniques such as PCA, ICA, discriminant analysis, cluster analysis, SVM, random forest, artificial neural network, DTW, EMD will be dealt. Also, this course will show you how to use the popular and powerful data analysis language, that is, R, to solve many practical problems based on use cases extracted from real domains.","schedule":"Tentative schedule\nWeek 1　　Introduction to big data analytics: big data overview, concepts of supervised and unsupervised learning, and data pre-processing\nWeek 2　　Basic statistics: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 3　　Regression: Simple and multiple linear regression\nWeek 4　　Dimension reduction techniques (Part I): Principal component analysis (PCA)\nWeek 5　　Dimension reduction techniques (Part I): Independent component analysis (ICA)\nWeek 6　　Classification (Part I): Logistic regression, k-NN, decision trees, SVM\nWeek 7　　Classification (Part II): Logistic regression, k-NN, decision trees, SVM\nWeek 8　　Classification (Part III): Logistic regression, k-NN, decision trees, SVM\nWeek 9　　Midterm Exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 10　　Clustering (Part I): Hierarchical clustering\nWeek 11　　Clustering (Part II): Nonhierarchical clustering\nWeek 12　　Ensemble methods: bagging, random forests, boosting\nWeek 13　　Ensemble methods: bagging, random forests, boosting\nWeek 14　　Artificial neural network (ANN)\nWeek 15　　Artificial neural network (ANN)\nWeek 16　　Dynamic time warping (DTW)\nWeek 17　　Empirical mode decomposition (EMD)\nWeek 18　　Final Exam (In-Class, 1 Cheat sheet, Calculator)","scorePolicy":"1. Midterm exam: 25 %\n2. Final exam: 25 %\n3. Quiz: 20 %\n4. Individual projects: 25 %\n5. Attendance: 5 %","materials":"An Introduction to Statistical Learning with Applications in R by Gareth James, Daniela Witten, Trevor Hastie, and Robert Tibshirani","foreignLanguageTextbooks":true}]
