[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2019-09-02 15:20:44","objective":"Data and decision course is about using data to make decisions. Recent years have seen an explosion of the amount of data available to everyone, and making sense of that data has become an operational imperative. The tools of statistics are one of the ways we can make sense of the data and use it to make more effective decisions. So, this course focuses on information and data engineering, computational reasoning applied, and enterprise decision management to the design of decision support systems, information extraction, and data mining. It implements the use of computers to discover patterns in data. Thus, in this course we will introduce the concepts of descriptive and inferential statistics, several efficient data mining techniques, and their use in decision making.","schedule":"Week 1　　Introduction to data analysis for decision-making\nWeek 2　　Basic statistics Part I: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 3　　Basic statistics Part II: Random variables, mean, median, standard deviation, variance, correlation, covariance \nWeek 4　　Basic statistics Part III: Hypothesis tests\nWeek 5　　Basic statistics Part IV: Hypothesis tests\nWeek 6　　Simple and multiple linear regression – Part I\nWeek 7　　Simple and multiple linear regression – Part II\nWeek 8　　Dimension reduction techniques: Principal component analysis (PCA)\nWeek 9　　Interim presentation of individual project and submission of interim report\nWeek 10　　Classification (Part I): Logistic regression, k-NN, decision trees, SVM\nWeek 11　　Classification (Part II): Logistic regression, k-NN, decision trees, SVM\nWeek 12　　Classification (Part III): Logistic regression, k-NN, decision trees, SVM\nWeek 13　　Clustering (Part I): Hierarchical clustering and Nonhierarchical clustering\nWeek 14　　Clustering (Part II): Hierarchical clustering and Nonhierarchical clustering\nWeek 15　　Artificial neural network (ANN) – Part I\nWeek 16　　Artificial neural network (ANN) – Part II\nWeek 17　　Final presentation of individual project and submission of final report\nWeek 18　　Final exam (In-Class, 1 Cheat sheet, Calculator)","scorePolicy":"1. Assignment : 25 points\n2. Individual projects: 40 points\n3. Final exam: 30 points\n4. Attendance: 5 points","materials":"An Introduction to Statistical Learning with Applications in R by Gareth James, Daniela Witten, Trevor Hastie, and Robert Tibshirani","foreignLanguageTextbooks":true}]
