[{"name":"葛大光","email":"da.kuan@msa.hinet.net","latestUpdate":"2019-08-22 12:23:45","objective":"本課程為ㄧ跨文化、跨領域及跨國界的實務導向課程。\n課程結構涵蓋二個主軸：\n(1)透過分組討論議題與任務指派，學習團隊合作，從領導力到團隊成員之間的溝通，確認每個成員的角色定位，建立高績效團隊；\n(2)透過宏觀的金融分析以及時事的案例研討，判斷國際市場趨勢，並透過市場上真實的投資工具模擬，逐步帶領學生從基本面、技術面進行國際市場的行情分析以及個人的風險控管。\nThis course is a practical international Economic course.\nThere are two main parts of the lecture.\n\nThe first one is team building, you will learn how to divide the work and communicate effectively.\n\nThe second part is learning by doing. The teacher will analysis the trend of the international market by macroeconomics. Moreover, teaching students using technical and fundamental analysis to predict the market. Most important of all, let students use the online application to imitate the real trading world.","schedule":"2019\n\n9/13 　　Holiday (No Class)\n9/20　　   An overview of International Monetary &amp; Financial Economics and Organizational \n           Behaviour  \n9/27    Interest Yields, Interest Rate Risk, and Derivative Securities and the changing \n           environment of organizations\n10/4　　   International Banking, Central Banks, and Supranational Financial Policymaking \n           Institutions and Individual values, perceptions, and reactions\n10/11　　Holiday (No Class)\n10/18  The International Financial Architecture and Emerging Economies and Groups and \n           teams\n10/25  Monetary and Portfolio Approaches to Balance-of-Payments and Exchange-Rate \n           Determination and Decision Making and Problem Solving\n11/1　　  Traditional Approaches to Balance-of-Payments and Exchange-Rate Determination \n          and Managing Conflict and Negotiating\n11/8 　　　　　　Midterm Exam\n11/15　　An Open Economy Framework and Motivating Behaviour with Work and \n                Rewards\n11/22 　　Economic Policy with Fixed Exchange Rates and Communication\n11/29 　　Economic Policy with Floating Exchange Rates and Power, Influence, and \n                Politics\n12/6  　　Domestic Economic Policymaking in a Global Economy and Organizational \n                Structure and Design\n12/13 　　Empirical practice in Forex market 1\n12/20 　　Empirical practice in Forex market 2\n12/27　　Empirical practice in Forex market 3　　\n\n2020\n\n1/3　　　　　　presentation \n1/10　　　　　　Final Exam","scorePolicy":"Presentation  　　          = 30%\nMidterm Exam 　　  = 30%\nFinal Exam　　　　  = 30%\nTrading Simulation   = 10%","materials":"International Monetary &amp; Financial Economics (Pearson Series in Economics) by Joseph Daniels, \n\nand \n\nOrganizational Behavior: Managing People and Organizations twelfth edition  By Ricky W. Griffin, Jean M. Phillips, Stanley M. Gully","foreignLanguageTextbooks":true}]
