[{"name":"陳玉敏","email":"yumchen@umail.iu.edu","latestUpdate":"2019-08-26 20:16:50","objective":"In this course we will learn how to analyze a text, to think critically and to write strategically and creatively. Students are expected to research topics, organize a draft, present your ideas, rewrite and edit through extensive reading of famous authors’ works, discussion, and participate in peer review and individual workshops. Throughout the semester, we will continuously practice outlining your essay structure, writing a thesis statement, topic sentences, writing a narrative, description, and offering supporting examples. In addition, you will investigate an issue critically and rhetorically, which means you will inquire deeply into an issue that arises from a particular context, articulate a research question from that inquiry, and develop an informed and complex response to that question. By completing a sequenced writing project, you will learn the skills for academic writing, including ways of reading, investigating, reasoning, questioning, and inventing ideas. We will look at how writing changes when used for different purposes, and how genres of academic writing are shaped for different audiences and contexts. And we will consider how you negotiate languages, discourses, and texts.","schedule":"Week 1: Introduction\nWeek 2: Chapter One: Good Writers are Good Readers\nWeek 3: Chapter Two: The Writing Process: planning, generating ideas\nWeek 4: Chapter Two: The Writing Process: organizing and drafting.\nWeek 5: Chapter Two: The Writing Process\nWeek 6: First Essay\nWeek 7: Chapter Three: Academic writing.  Research your topic. \nWeek 8: Chapter Three: Academic writing.  Considering other views. \nWeek 9: Chapter Four: Narration: Defining, and composing narratives\nWeek 10: Chapter Four: Narration\nWeek 11: Chapter Four: Narration\nWeek 12: Second Essay\nWeek 13: Chapter Five: Description: Defining, composing, reading and editing a description. \nWeek 14: Chapter Five: Description\nWeek 15: Chapter Five: Description\nWeek 16: Chapter six: Example: defining, composing, reading and editing examples. \nWeek 17: Chapter Five: Description: Commencement advice. \nWeek 18: Final Paper Due:  Presentations","scorePolicy":"Participation / Attendance　　　　　　　　　　\nClass Presentations　　　　　　　　　　　　　　\nTwo essays　　                          　　　　　　           \nFinal Paper","materials":"‧　　Cooley, Thomas. Back to The Lake: A Reader for Writers. New York; Norton, 2012.\n‧　　MLA Handbook 8th edition. New York: The MLA Association of America.","foreignLanguageTextbooks":true}]
