[{"name":"陳匡正","email":"kchen34@gmail.com","latestUpdate":"2019-12-08 12:09:52","objective":"本課程只提供給欲參與每年暑假，由日本大阪工業大學智慧財產學院舉辦之夏季智慧財產權密集課程的學生來選修。而本課程之內容，以準備夏季課程中之英語簡報比賽為主，並以每年暑假為本課程之上課時間。至於本課程開設之目的，乃以增強學生實際應用英語之能力，並以加強學生國際智慧財產權之知能為主，除了強化本所與日本大阪工業大學智慧財產學院之學術交流關係外，更能夠擴展參與學生之國際人脈及視野。\nThis course is only provided for students to enroll, and they decide to participate summer intellectual property intensive course held by the School of Intellectual Property, Osaka Institute of Technology. Moreover, contents of this course are focused on preparing English presentation contest held in the summer intensive course, and time of this course is in the periods of each summer vacation. In addition, purposes of this course are mainly to promote students’ English abilities in practices and students’ knowledge of intellectual property. This course not only enhances relations of academic exchanges between our institute and the School of Intellectual Property, Osaka Institute of Technology, but also broaden attended students’ international relations and visions.","schedule":"First Lesson (108/6/15) Introduction of Contest Guidelines, Teaching for Presentation Contest: Setting a Contest Topic and Job Allocation\nSecond Lesson (108/6/29) Teaching for Presentation Contest: Collecting Materials and Suggestions\nThird Lesson (108/7/14) Mock Contest (1)\nFourth Lesson (108/7/18) Mock Contest (2)\nFifth Lesson (108/7/20) Mock Contest (3)\nSixth Lesson (108/7/25) Mock Contest (4)\nSeventh Lesson (108/7/27) Mock Contest (5)\nEighth Lesson (108/8/1) Mock Contest (6)\nNinth Lesson (108/8/3) Mock Contest (7)\nTenth Lesson (108/8/9) Mock Contest (8)\nEleventh Lesson (108/8/10) Mock Contest (9)\nTwelfth Lesson (108/8/15) Mock Contest (10)\nThirtieth Lesson (108/8/17) Mock Contest (11)\nFourteenth Lesson (108/8/22) Mock Contest (12)\nFifteenth Lesson (108/8/25~108/8/30) 2019 Summer Intellectual Property Intensive Course and English Presentation Contest at Osaka Institute of Technology, Japan","scorePolicy":"1.Class Attendance 60%\n2.Class Participation and Performance 40%","materials":"1.OIT Summer Intellectual Property Intensive Course 2019--Intellectual Property Studies (Summer Intensive).\n2.Evaluation Method of OIT Summer Intensive Course 2019.\n3.Information and Rules on English Presentation Competition at the Summer Intensive Course.","foreignLanguageTextbooks":false}]
