[{"name":"黃少妤","email":"phsophia@gmail.com","latestUpdate":"2019-06-03 20:06:22","objective":"本課程將檢視一系列以近10-20年為主之當代建築與都市議題。在經濟社會文化與構體型態相互交織影響下的當代城市中，建築，又或建築議題本身則可視為一種反照或批判都市變遷結果下的凝聚。雖建築與都市學門在西方知識體系下已有豐富且多樣的累積傳承，然而，在千禧年代後，相對更加複雜且未定性的社會空間現象，迸發出許多前所未有的空間議題與研究視角，進而使學界不斷提出新興理論和概念以描繪與分析其變化。因此， 本課程主要透過閱讀當代幾種關鍵的社會空間狀態與理論，以進理解並討論建築與都市如何反應，再塑，甚至協同工業，後工業與全球化影響下之議題。基於此，本課程著重內部與跨學門之連結，期待透過論點互相參照如對話的方式，將多向度的空間切入點，帶入當代城市中的建築與都市討論。除理論文本外，課程中也將以議題聚焦，探討東西方現代城市的特殊意表與其相較性。期習者能建立具有提問，方法且深度理解性的批判能力，以為重新思考近代建築，都市與景觀論述的他樣可能性。\nThe course examines a range of debates in contemporary architectural and urban themes, focusing on the last 10-20 years. Architecture as the interaction between built forms and economic, social and cultural contexts may take various modes ranging from reflection on and critique of the consequence of urban transformation. Drawing from key movements, and theories, this course will primarily articulate the varying roles that architecture has played in confronting, shaping, or even celebrating the e?ects of industrialization, post--industrialization, and globalization. In addition, the course will be strongly concerned with intra- and inter-disciplinary linkages, looking at “conversation” within the discipline and at relevant debates in related spatial disciplines. It aim to furnish students with a set of questions, methods, and understandings for criticism and self-critique which shall destabilize and re-think recent architectural, urban, and landscape discourse.","schedule":"W 01 Course Introduction- Two Folds: architecture research and design \nW 02 Scale, Scalar, Scaling- theoretical and methodological dialectic \nW 03 Inviting Speaker 01- [Environmental architecture]\nW 04 Brutalism in the city\nW 05 Shopping Malls and Data centres- Consumption and service\nW 06 Airport and city gate- none places\nW 07 Olympic game- Super-architectural events\nW 08 Architecture underground- Fields, Diagrams, Maps\nW 09 Mid-term/ Reading week\nW 10 (Im)materiality and  (un)boundaries- Virtual, Presence, Hpyer-modernities \nW 11 Peripheral architecture and periphery of the city 01\nW 12 Peripheral architecture and periphery of the city 02\nW 13 Informal, illegitimacy, invisible and temporary arch/ infrastructure 01\nW 14 Informal, illegitimacy, invisible and temporary arch/ infrastructure 02\nW 15 Essay discussions \nW 16 Inviting Speaker 02- [Asian architectures in contexts] \nW 17 Course reflections [Essay draft submission]\nW 18 Essay submission","scorePolicy":"A topic-based presentation 30%\nAn essay 50%\nAttendance 20%","materials":"Ballantyne, Andrew (2005). Architecture theory: A reader in philosophy and culture.  London: Continuum. \nCorner, James (2002). ˋThe agency of mapping: Speculation, critique and inventionˊ, Mappings, Denis Cosgrove (ed.). London: Reaktion: 213-52.\nAllen, Stan (2000). ˋMapping the unmappable:  On notationˊ, Practice: Architecture technique and representation. London: Routledge: 30-45.\nPallasmaa, Juhani (2005). The eyes of the skin.  Architecture and the senses. New York: John Wiley: 15-38.\nKaufmann, Vincent (2011).’ Describing the city based on mobility’, Rethinking the city: urban dynamics and motility. Milton Park, Abingdon, Oxon; New York, NY : Routledge ; Lausanne, Switzerland : EPFL Press: 49-64.\nShane, Grahame (2005). ‘ Heterotopias, the Net City, and Recombinant Urbanism’,\nRecombinant urbanism: Conceptual modelling in architecture, urban design and city theory. Chichester : J. Wiley:  304-315. \nBergdoll, Barry and Werner Oechslin (eds.) (2006) Fragments : architecture and the unfinished. London; New York: Thames &amp; Hudson.\nSassen, Saskia. (2007) Deciphering the global: Its scales, spaces, and subjects. New York: Routledge: 1-20.","foreignLanguageTextbooks":true}]
