[{"name":"張桂菱","email":"Nadine779@yahoo.com.tw","latestUpdate":"2019-06-04 13:33:56","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"Week 1 【09/09】課程熱身\nWeek 2 【09/16】肢體覺察與控制1\nWeek 3 【09/23】肢體伸展與呼吸1\nWeek 4 【09/30】肢體伸展與呼吸2\nWeek 5 【10/07】肢體動作的空間元素—方向與水平1\nWeek 6 【10/14】肢體動作的空間元素—方向與水平2\nWeek 7 【10/21】肢體動作的時間元素—速度1\nWeek 8 【10/28】肢體動作的時間元素—速度2\nWeek 9 【11/04】舞蹈影片欣賞與討論（一）\nWeek 10【11/11】肢體動作與節奏1、空間創作練習1（繳交舞蹈影片報告）\nWeek 11【11/18】肢體動作與節奏2、空間創作練習2\nWeek 12【11/25】肢體的放鬆技巧練習、時間創作練習1\nWeek 13【12/02】肢體的即興動作發展、時間創作練習2\nWeek 14【12/09】身體動作的想像練習、力量創作練習（繳交期末分組名單）\nWeek 15【12/16】單/雙/多人之即興創作、力量創作練習（期末分組考試抽籤）\nWeek 16【12/23】單/雙/多人之即興創作、力量創作練習（email期末考音樂）\nWeek 17【12/30】學習成果期末呈現（繳交觀舞、上課心得）\nWeek 18【109/01/06】現代舞蹈欣賞與討論（二）/期末心得補交與補考","scorePolicy":"一、上課服儀\n1.著方便肢體活動的服裝，ex: T-Shirt、運動長褲、襪子、爵士鞋，切勿穿著牛仔褲。\n2.將頭髮束起、勿披頭散髮，盡量不要穿戴飾品影響自己與他人活動。\n\n二、評量標準\n1.出席（30%）: 曠課3次則本課程以不及格計算。遲到者30分鐘以上，依曠課乙次計算。請假一律依照學校規定，事、病假於「事前」以email請假，事後請假依「曠課」劃記。\n2.課堂參與（20%）: 動作組合參與度、課堂討論、服裝儀容。\n3.期末考（30%）: 舞蹈即興創作（單人2-3分鐘；雙人3-4分鐘；三人4-5分鐘）。\n4.報告（20%）: \n(1)舞蹈影片報告。11.11上課前繳交\n (2)觀賞現場舞蹈表演2/3及上課心得1/3。(註明團體場次)。12.30上課前\n報告格式：標楷體；字12；800~1000字。勿超過1頁。上傳【北科i學園】數位教學平台（不用列印出來）\n5.演出訊息：請參閱【北科i學園】或兩廳院網站。\n6.臉書：【演出票券交易所】可購入削價售出或已售罄的票券。","materials":"1.　　《表演藝術》雜誌 國家兩廳院出版\n2.　　《完美，稍縱即逝：舞蹈家古名伸的追尋筆記》古名伸 小貓流文化\n3.　　《舞蹈欣賞》平珩 編 三民書局\n4.　　《我的看舞隨身書》 李立亨 天下文化\n5.　　《身體記憶52講》、《身體美學》蔣 遠流\n6.　　《高處眼亮》林懷民 遠流\n7.　　《當代歐洲新舞蹈—表演：反舞蹈、非身體》魏淑美\n8.　　《當代舞蹈的心跳：從身體的解放到靈魂的觸動，當代舞蹈的關鍵推手、進化論與欣賞指南》，菲利普・努瓦澤特(Philippe Noisette)\n9.　　 Sharing the Dance: Contact Improvisation and American Culture. Novack, Cynthia J.","foreignLanguageTextbooks":true}]
