[{"name":"鄭又平","email":"youpingcheng@gmail.com","latestUpdate":"2019-05-31 10:02:14","objective":"中國的崛起正在改變全球的政治、經濟和文化，而台灣與港澳都是已然成型的大中華經濟圈成員，吾人必須要趁早了解中國市場崛起的原因，並開始作好準備。\n \n本課程帶領學生深入瞭解中國崛起的背景、所代表的意義、以及如何去面對隨之而來的新挑戰。課程中並將描繪出世界的未來走向、美國霸權的逐日衰退、和各種產業即將面臨的威脅/挑戰/機遇。\n \n中國已經成為世界最大的經濟體，未來台灣的企業、經濟前景、甚至個人生活都會感受到巨大的衝擊。中國的經濟成長何以會影響到所有的全球性產業和消費者，並分析許多工作即將面臨的威脅。\n \n本課程由總體宏觀角度出發，逐步進入細部剖析，期末再以全球觀點回顧大中華經濟圈的發展，並對未來趨勢提出分析。","schedule":"台北科技大學108學年度第一學期 【大中華經濟圈】課程課綱\n\n臺北科技大學108學年度第1學期\n【大中華經濟圈】課程綱要\n\n第一週 09/13 \n中秋節停課一次\n　\n第二週 09/20\n課程總論 大中華經濟圈的崛起與衝擊\n　\n第三週 09/27\n中國企業無限公司：中國好，世界就好? 從山寨經濟邁向自主創新\n\n　\n第四週 10/4\n獨特又矛盾的經濟體：21世紀中國奇蹟背後的真相\n\n\n第五週 10/11\n國慶日彈性放假 停課一次\n\n第六週 10/18\n媒體中國的『軟實力』：甄嬛傳、舌尖上的中國、中國好聲音、中國有嘻哈\n\n　\n第七週 10/25 \n強國不強？：中國國力與經濟成長的極限。從鄧小平到習近平：21世紀中國面對的挑戰與國際角色的調適\n\n第八週11/ 01 \n我是世界最大黨：誰在統治及如何統治中國\n\n\n第九週11/08。期中考週\n\n第十週 11/15 \n出賣中國：權貴資本主義的起源與共產黨政權面臨的壓力與挑戰\n　\n　\n第十一週 11/22\n匱乏：中國14億人口到底還缺什麼？對中國崛起有多少限制？\n\n第十二週 11/29　\n傳統產業的工廠女孩 與 科技產業的白領小資\n\n第十三週 12/06\n超級中國的超級工程：工程師眼中的中國技術\n\n　\n第十四週 12/13\n當中國買下全世界：全球資源佈局戰的最大贏家，如何掌控世界商品的供需網絡\n\n\n第十五週 12/20　\n金融霸權的誘惑：買下全世界後，中國夢的下一步會往哪裡去？\n\n\n第十六週 12/27　\n一個中國、兩個世界：底層的抗爭所帶來的危機與衝突\n\n　　\n第十七週 01/03\n休昔底德陷阱：中、美兩大國終將一戰嗎？\n失衡的經濟：美中「再平衡」戰略大藍圖！\n與龍共舞：外資企業如何與中國政府打交道\n\n第十八週 01/10。期末考週。","scorePolicy":"1. 期末報告\n2. 出席率\n3. 平時表現","materials":"1. Karl Gerth。中國好，世界就好?（台灣：高寶，2011。）As China Goes, so Goes the World。（New York,NY：Hill and Wang 2010）\n\n2. Arthur R. Kroeber。獨特又矛盾的經濟體：21世紀中國奇蹟背後的真相\n（台灣：聯經出版社，2017。）China’s Economy: What Everyone Needs to Know。\n\n3. David M. Lampton（2015）。從鄧小平到習近平Following the Leader Ruling: China, From Deng Xiaoping to Xi Jinping。（林添貴，譯）。新北：遠流出版社。（原著出版於2014）\n\n4. Regina M. Abrami, William Kirby,F. Warren McFarlan（2016）。強國不強？：中國國力與經濟成長的極限Can China Lead?: Reaching the Limits of Power and Growth。（林添貴，譯）。台北：天下文化。（原著出版於2014年）\n\n5. Rowan Callick（2014）。我是世界最大黨：誰在統治及如何統治中國 Party Time: Who Runs China and How。（盧意寧，譯）。台北：聯經出版公司。（原著出版於2013年）\n\n6. 裴敏欣 Minxin Pei (2017)。出賣中國：權貴資本主義的起源與共產黨政權的潰敗\nChina’s Crony Capitalism: The Dynamics of Regime Decay。(梁文傑，譯）。台灣：八旗文化。\n\n7. 馬暘Damien Ma,葉文斌 William Adams（2014）。匱乏：中國到底還缺什麼？In Line Behind a Billion People: How Scarcity Will Define China’s Ascent in the Next Decade。（楊濤斌、蔣文豪、魏宏舉，譯）。新北：八旗文化。（原著出版於2013年）\n\n8. 張彤禾（2012）。工廠女孩 。台北：樂果文化\n\n9. 傅高義Ezra F.Vogel（2012)。鄧小平改變中國Deng Xiaoping and the Transformation of China。（馮克利，譯）。台北：天下文化。（原著出版於2011年）\n\n10. 張維迎（2011）。中國市場的邏輯。新北：木馬。\n\n11. 于建嶸（2010）。危機與對策:中國社會衝突觀察。香港：天地圖書。\n\n12. 于建嶸（2011）。抗爭性政治:中國政治社會學基本問題。中國：人民出版社。\n\n13. Dambisa Moyo（2013）。當中國買下全世界：全球資源佈局戰的最大贏家，如何掌控世界商品的供需網絡 Winner Take All: China’s Race for Resources and What It Means for the World 。(黃中憲，譯)。新北：野人出版。（原著出版於2012年）\n\n14. Stephen Roach（2015)。失衡的經濟：美中「再平衡」戰略大藍圖！Unbalanced:The codependency of America and China。(洪世民，譯)。台北：寶鼎。（原著出版於2014年）","foreignLanguageTextbooks":false}]
