[{"name":"陳建文","email":"a868@ntut.edu.tw","latestUpdate":"2019-06-01 22:04:46","objective":"所有人際圈都有倫理問題。家庭有家庭倫理，學校有學習倫理，在職場中則存在著職場倫理關係，有待個人學習理解、奉行。職場倫理是人與工作(生產)組織之間的關係，也可以?就是在職場中的人際關係，其牽涉幾個層面，包括正確的工作態度、正確的價值觀念以及正確的人際關係。\n職場倫理牽涉到職場中個體或群體對於人際互動判定對錯是非的?為觀?，若不具備或不健全的職場倫理觀念將會導致職場人際圈秩序混亂或被破壞，引來觸犯法律規定底限之懲處不利後果。因此，企業懲戒法律案例形同職場倫理負面教材，可藉之推演人際互動規則、體會個案經驗，來思考合宜的人際往來互動的拿捏取捨。\n職場倫理議題牽涉禮貌、法律與溝通技巧等多元問題面向。本課程除從理論面演繹職場倫理內涵，亦採企業懲戒個案探討方式，來協助學生習得適應融入職場生活所需之人際相處知識。\nAll kinds of relationship involve ethic issue. There is learning ethic in school, while there exists workplace ethic in a company we need to understand and follow.\nEthic of workplace is the relationship between individuals and organizations, meaning a social relationship of workplace. It involves several aspects, including correct work attitudes, values, and personal relationships.\nWorkplace ethic involves ideas individuals and groups hold in workplace to judge right or wrong about behavior. Without correct or sound ethic in workplace may result in chaos or destruction of order among social networks, or offend the legal baseline. Thus, enterprise punishment cases equal negative examples for workplace ethic. By reasoning rules between personal interactions, and experiencing lawsuits, it allows to consider appropriate social interactions among individuals. \nWorkplace ethic involves topics of manners, laws and communication skills. This course provides not only theoretical perspective","schedule":"第1週　　課程規劃說明\n第2週　　職場倫理之基本觀念\n第3週　　勞動關係之倫理特性:雇主的保護照顧義務與勞工的忠誠勤勉義務\n第4週　　企業秩序、企業懲戒與職場倫理\n第5週　　職場中的人際關係與溝通制度\n第6週　　職場資訊、隱私的倫理爭議:雇主詢問權與勞工隱私權衝突  \n第7週　　職場歧視的倫理爭議:就業歧視個案分析\n第8週　　性別、性向平等尊重的職場倫理爭議\n第9週　　期中考試\n第10週　　勝任工作的倫理義務:不能勝任工作解雇爭議案例\n第11週　　職場同事相處倫理(一)：暴行與重大污辱爭議案例分析\n職\n第12週　　職場同事相處倫理(二)：職場性騷擾案例分析\n第13週　　職場秘密守護倫理爭議：客戶個資、營業秘密保護及競業禁止爭議案例\n第14週　　職場規範遵守倫理爭議：違反勞動契約或工作規則情節重大解雇爭議案例\n第15週　　職場工作秩序維護倫理:曠工、請假爭議案例\n第16週　　勞資紛爭處理倫理\n第17週　　職場不法情事的處理難題:公益申報的職場倫理案例\n第18週　　期末考試","scorePolicy":"案例報告作業30%　　修課同學分組負責討論作業\n　　期中學習成果驗收  (職場倫理戲劇表演)　　20%　　\n　　期末學習成果發表  (各組自選職場倫理問題主題研究報告)　　20%　　\n　　課堂討論參與　　30%","materials":"本課程相關訊息及資料均公布於“歪樓學國文”臉書社團:\nhttps://www.facebook.com/groups/219624825401106/\n\n相關參考書籍:\n陳繼盛，勞動倫理要義，台灣勞動學會出版，2013年2月出版。\n劉志雄，聖經中的工作觀，水牛出版社，2008年12月出版\n楊戊龍.李淑如著，公益揭發: 職場倫理新趨勢，巨流圖書有限公司，2010年9月30日。\n葉保強，職場倫理，五南圖書出版股份有限公司，2016年10月10日出版。\n朱立安著，職場倫理  ，揚智文化事業股份有限公司  ，2018年4月1日。\n莫嘉廉/陳建榮/趙茂林/ 陳瓊霞/ 王涵青，職場倫理 (第2版)，全華圖書股份有限公司，2017年2月6日\n楊政學著，企業倫理: 倫理教育與社會責任 (第2版)，全華圖書股份有限公司，2008年8月13日。\n于卓民審訂.廖勇凱編著，企業倫理學，智勝文化事業有限公司，2008年9月出版。\n許書揚，CEO最在乎的事: 職場倫理與工作態度，  天下雜誌股份有限公司，2013年11月28日\n鄭津津，職場與法律，新學林出版有限公司，2018年9月25日第7版。\n陳建文（擔任計畫主持人），2008年3月，教育部補助，技職校院勞動法課程之對話式教學教材創新研究計畫：工作職場情、理、法的對話，（研究期間：2008年6月1日至2009年3月31日）\n陳建文，教育部補助，99年度新興議題與專業教育改革中綱計畫--法學教育教學研究創新子計畫，「專業法律與專業倫理：從勞資、企業、公民與醫學領域談起」整合型計劃－「勞資關係的法律與倫理：事理、情理、倫理、管理、治理、法理的交融思辯」子計畫（研究期間：2010年8月1日至2011年7月31日）\n陳建文等人合著，2011年5月，國立政治大學法叢書70社會公義：黃越欽教授紀念論文集，元照出版公司（ISBN編號：978-986-255-109-7）\n陳建文(擔任計畫主持人)，2017年9月，問題解決導向(PBL)課程106年度創新先導計畫─勞動法通識課程，執行期間:2017年9月1日至2018年3月31日，教育部補助。\n陳建文等著變遷中的勞動世界:理論與實務-基礎理論篇台灣勞動法學會2018年7月出版【ISBN/ISSN】978-986-86504-7-3。","foreignLanguageTextbooks":false}]
