[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2019-12-18 20:53:01","objective":"全球面臨高齡化、少子化、人口過度集中大都市與城鄉發展失衡問題，包含台灣在內的許多國家紛紛提倡社區營造，鼓勵社區居民積極參與地方公共事務，以激發「故鄉之愛」凝聚社區共識，進而號召居民共同經營社區生活。如何擬定政策、透過什麼鼓勵與參與機制，是社區營造必需面對的挑戰。地方創生是立基於既有社區營造的經驗，找尋每一個地方的獨有特色，以培養自身適合的產業為目標，推動企業返鄉投資、導入科技、匯聚公私部門資源、鼓勵社會參與及建立品牌。從而能改善地方的生活空間與創造地方生機，減緩地方人口的外流，逐步吸引湧往都市的青年回流，以均衡地方發展。本課程將介紹社區營造與地方創生關聯的理論與實務，國內外案例的理念、策略、行動與啟發，進而檢視自身的社區，討論如何創造地方安穩的工作環境？如何創造企業地方據點以吸引人才回流？如何滿足年輕世代穩定經濟支援的生涯規劃？如何創造宜居與樂活的生活環境？\nAging, fertility decline, highly populated urban areas, and unbalanced development are global issues. Community Empowerment has been advocating encouraging local people actively involved in public affairs. How to formulate policies and what incentives adopted are challenges for communities. Based on the experience of community empowerment, Place-making is looking for place's unique natures, aiming at cultivating industries, promoting investment in returning home, introducing technology, pooling resources of all sectors, encouraging social participation and building brands. It can improve living space, create vitality, slow down outward migration, and attract the youth returning home. This course will introduce theories and practices, and strategies, actions, implications of the cases, explore the way of creating stable platform, attract talents, and meet the youth career planning and living environment.","schedule":"1. 課程介紹 (Introduction)\n2. 21世紀的社區脈絡與挑戰(Contexts and challenges for 21st century communities)\n3. 社區營造與地方創生的原則與實務(Principles and practice of empowerment and placemaking)\n4. 創造地方的健康、安全與永續：檢核與規劃(Making places healthy, safe and sustainable：checklist and planning)\n5. 提供地方需求、資源利用與社區設計(Providing for local need, use of local resources, neighbourhood design)\n6. 如何形塑城市與社區(How people can shape their cities, towns and villages)\n7. 為何與如何參與規劃、營造及創生(Why get involved and how get started with community planning)\n8. 社區營造與創生發展原則(General principles of empowerment and placemaking)\n9. 社區發展的情境模擬(Common development scenarios)\n10. 社區與生活品質：宜居性、指標、量測與分析(Community and quality of Life：livability and indicators, measurement and analysis of livability)\n11. 社區營造計畫與地方創生案例 (Cases of development plan and placemaking)\n12. 邁向新都市主義社區建築(New urbanism: toward an architecture of community)\n13. 營造與創生實際案例參訪(Field trips)\n14. 學生研究報告或閱讀心得報告(Reports &amp; presentations)","scorePolicy":"（一）上課互動情形（30%）：閱讀主要的參考文獻、上課聽講、參與課堂討論\n（二）課堂報告（30%）：就各人所選的主題進行文獻閱讀與專題研究，並作課堂報告\n（三）學期報告（40%）：撰寫學習報告，內容需包括師生討論意見，修撰完稿後繳交","materials":"1. Wates, N. (2006) The Community Planning Handbook, Earthscan, London.\n2. Barton, H. et al. (2003) Shaping Neighborhoods: a Guide for Health, Sustainability and Vitality, Spon Press, London.\n3. Weil, M. et al. (2013) The Handbook of Community Practice, SAGE, London.\n4. Hall, K.B. et al. (2001) Community by Design: New Urbanism for Suburbs and Small Communities, McGraw-Hill, London,\n5. Grabow, S. (2015) Principles and Practice of Community Placemaking, University of Wisconsin-Extension, Madison.\n6. National Research Council, (2002) Community and Quality of Life: Data Needs for Informed Decision Making, National Academy Press, Washington, DC.\n7. City of Swan, (2017) City of Swan - Midland Oval: Place Making Strategy, City of Swan\n8. Silberberg, S. et al. (2013) Places in the Making: How placemaking builds places and communities, Massachusetts Institute of Technology, Massachusetts.\n9. 陳亮全，(2000) 近年台灣社區總體營造之展開，住宅學報，9(1)，p.61-77.\n10. 陳志仁，(2018) 日本地方創生發展經驗，國土及公共治理季刊，6(2)\n11.文化部，社區營造三期及村落文化發展計畫，https://www.moc.gov.tw/content_268.html\n12.行政院，(2019) 地方創生國家戰略計畫（核定本），行政院，台北\n13.國家發展委員會，(2017) 設計翻轉、地方創生計畫規劃作業指引，臺北\n14.農村發展基金會，(2019)  臺日地方創生經驗觀察交流會資料分享，https://www.rdf.org.tw/?p=2779\n15. LocalWiki，臺北市社區營造資料庫，https://zh.localwiki.org/taipeicommunity/\n16.國家發展委員會，地方創生資料庫，https://colab.ngis.org.tw/lflt/index.html\n17.External links:\n   •Sustainable placemaking site curated by Michigan State University professor\n   •Project for Public Spaces\n   •City Repair, Portland, Oregon Citizen activism for a more community-oriented and ecologically sustainable society\n   •Places: Forum of Design for the Public Realm, a placemaking journal\n   •StreetPlans: Tactical Urbanism Projects","foreignLanguageTextbooks":true}]
