[{"name":"林峰輝","email":"double@ntu.edu.tw","latestUpdate":"2019-08-15 11:26:39","objective":"組織工程教學大綱\n\n組織工程(Tissue engineering)是最近發展出來之新領域學門，在醫學工程上逐漸扮演重要的角色，這門領域橫跨著新近快速發展的細胞分子生物學(cellular and molecule biology)，與材料化學及機械工程學。在下個十年臨床上組織之修復與重建，將與基因治療(gene therapies)與細胞工程緊密結合在一起。\n\n人體組織扮演許多重要功能是一複雜，包含許多內在的生物與生理過程，組織工程發展最困難的一點，是界定他的範疇，經仔細考慮後我們認為他包含，基因工程的問題(genetic engineering issue) 、基因細胞生物問題(generic cell issue)、及修復器官之組織工程等三方面。\n\n本課程在第一個問題上，我們將介紹材料發展上的挑戰，一者為材料與生物分子間的表面性質及特性﹔再者為材料做為細胞，生長模版並植入修復器官的效果。接著在第二個問題將以細胞為主題，介紹生物細胞學將是重要主題，如幹細胞生物學、細胞移動、組織環境、及組織功能基質細胞之研究等。在第三個問題上，主要描述特殊器官與工程學上之關係，與極可能在臨床的發展與應用。\n\n我們將在本課程中探討上述三個主題，藉由三個主題的說明讓學生瞭解，組織工程之定義與未來發展。\n\n\nTissue Engineering\nTissue engineering will ultimately have a more profound impact than we can appreciate. It not only will modify the practice of medicine and help elucidate mechanisms of developmental biology, but also the potential to influence economic development in the industry of biotechnology more than any single advance in science or medicine during the last decades. \nA challenge to the large-scale development and application of tissue engineering is the immunological barrier. Improvements in the understanding of immunology and the ability to trick the host into thinking foreign cells are “self” may ultimately allow for implantation of allograft or even xenograft cells to generate functional tissue. \nThe class is going to give a basic principle to the students in cell sources, cell-cell communications, stem cells, material for scaffold, extracellular matrix for tissue engineering. This class is intended not only as a class for engineering students and students in cell biology, biotechnology, and medical courses at advanced graduate level, but also as a reference tool for research and clinical laboratories. I believe the students can have the knowledge of tissue engineering after the class finished.","schedule":"Tissue Engineering\n\nSyllabus:\n\nTopic　　　　　　　　　　　　　　　　　　　　　　　　Hours\n1. Why Tissue Engineering　　　　　　　　　　　　　　　　3\n2. Introduction (What is tissue engineering?)　　　　　　　　　　3\n3. Stem cells (幹細胞及其應用)          　　　　　　　　3\n4. Cell signaling (細胞訊息傳遞) 　　　　　　　　　　　　　　3\n5. Cell junction 　　　　　　　　　　　　　　　　　　　　3\n6. Cell adhesion (細胞貼附)　　　　　　　　　　　　　　　　3\n7. Extra-cellular matrix (細胞外基質)　　　　　　　　　　　　6\n8. Biopolymer (生物高分子)　　　　　　　　　　　　　　　　6\n9. Scaffold (支架)　　　　　　　　　　　　　　　　　　　　3\n10. Surface modification &amp; bio-molecules immobilization　　　　6\n11. Bioreactor (生物反應器)    　　　　　　　　　　　　　　3","scorePolicy":"Mid-term Exam \nTerm Exam","materials":"\"Tissue Engineering\" by Palsson and Bhattia (\"P&amp;B\"), Pearson \nPrentice Hall Publishers (ISBN: 0-13-041696-7)","foreignLanguageTextbooks":true}]
