[{"name":"吳斯偉","email":"swu@ntut.edu.tw","latestUpdate":"2019-09-05 09:28:09","objective":"本課程目的在於培養學生創業及創新的知識，並透過不同的企業具體經驗，帶領學生學習企業之創新與創業的思維。當學生有了相關創新創業知識與思維後，以專業英文之角度讓學生認識簡報應有之流程與架構，並提升學生及工作所需要之英文簡報能力。培育學生為全球化移動以及英語專業溝通人才，進而以適應全球化生活與培養終身競爭力。\nThis course aims to learn innovation and entrepreneurship through different models of outstanding and successful enterprise. In addition, this course makes students enhance their English presentation skills for current academic and future career pursuits via the perspectives of ESP. By this course, as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials requires for a global profession and makes students learn further about the world, and inspires students to strengthen their independent thinking and global perspective.","schedule":"吳斯偉老師：\n隨著科技的發展與產值快速成長，網路、電商、商業新模式等各式創業大行其道，成為許多創業者的新選擇，本課程將以真實具體的創業經驗為教材，讓學生更深刻體驗創業家之精神。希冀以觀摩學習典範企業的具體經驗，帶領學生學習企業創新與創業的思維，進而激發學生追求成就的渴望，強化青年學子對人生願景的規劃。\nAlong with the prosperous development of Internet, the output value of E-commerce is growing fast. Launching a business on the internet has become a new choice for many entrepreneurs. By offering the real and specific examples, business manager will make students learn further about the enterprisers' entrepreneurship. Through their experiences, we hope students can learn innovations and creations of enterprise; furthermore, students can be inspired to pursue their ambition to strengthen their wills to plan the future.\n\nWeek 1: 簡介\nWeek 2: 創新創業注意事項\nWeek 3: 認識失敗\nWeek 4: 即席報告\n\n林澄億老師：\n此四週課程著重在商業個案探討，以美國商業實境秀「誰是接班人」為上課教材，授課教師將挑選合適內容，於課堂上與同學討論，並從中學習商業英文字彙與文化。希望藉此機會，讓同學將前四週所學之創新創業相關理論融會貫通，並嘗試用英語表達自己的想法。各週次的討論主題如下：\nWeek 6 (10/17)--- 自己創業該考慮的面向\nWeek 7 (10/24)--- 跳脫框架的思考1\nWeek 8 (10/31)--- 跳脫框架的思考2\nWeek 9 (11/07)--- 創新企業的人力管理\n\n張中倩老師：(Week 13-16)\n英文簡報技巧中，Visual Aid 扮演極大的輔助角色，選擇適當的圖表方式，佐以搭配特定的語言表達，方能達到最大之溝通成效。故此四週的授課與學習重點放在五大圖表及其相關的英語表達訓練上，五大表格包含圓餅圖、長條圖、線條圖、流程圖及樹狀圖。\nIn English presentation skills, the use of visual aid plays an influential role in the effective communication of the prepared materials. In these four weeks, the instructional focus will be placed on five types of visual aid (mainly graphs and charts) and their specific language patterns and expressions. These five types are pie chart, bar chart, line graph, flow chart and organigram.\n\n黃湘玲老師：\n本五週的課程主要著重在增進學生五大能力：（一）籌備簡報前的分析決策；（二）簡報中的視覺藝術；（三）簡報中的必要和需要；（四）簡報中的想要和不要；（五）簡報中的語言藝術。1. Individual：此門課將從學生的英文語用開始微調，從剛開始的簡報講搞，我們著重在語言的邏輯組織、聲音腔調的影響、身體語言的配合、視覺輔佐工具的使用和增加演說記憶點的小技巧。2. Interpersonal：在強化學生的個人簡報實力及風格後，教師將帶入一場成功簡報的決勝點---成功建立連結(Connection)。上台前如何評估觀眾的背景與需求，上台時如何觀察觀眾的理解情況，下台後如何審視自我的表現及精進的機會。各週次的授課內容主軸如下：\nWeek 10 (11/14)：Essentials---Informative Logic, Opener/closer &amp; Content Delivery\nWeek 11 (11/21)：Presence---Body Language, Facial Expressions, Gestures and Appearance\nWeek 12 (11/28)：Language---Voice/intonation, Breath/pace/fillers &amp; Articulation\nWeek 17 (109/01/02)、Week 18 (109/01/09)：Evaluation---Presentations &amp; Feedback Time","scorePolicy":"吳斯偉老師\n出席率：40%\n課堂討論：30%\n報告：30%\n\n林澄億老師\n出席率：40%\n課堂討論：30%\n小考：30%\n\n張中倩老師Attendance: 20%\nParticipation in in-class exercises: 20%\nHomework and assignments: 30%\nPresentations and Exams: 30%\n\n黃湘玲老師\n出席率：30%\n課堂實作：20%\n期末報告：50%","materials":"教師自編教材","foreignLanguageTextbooks":false}]
