[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2016-06-06 10:59:46","objective":"課程通過一系列關於城市的文本(文學、電影、建築、或其他藝術），思考人跟城市的關係：文化產物如何呈現城市，和城市設計如何給不同思潮影響。如果都市化成了大趨勢，如果我們當下的存在處境離不開城市及對它的想象，我們就有理由研究城市和建築空間在不同歷史脈絡下如何影響人，和如何閱讀城市這充滿符號的文本。課程會介紹關於城市的著作、論述和理論，也會探討如現代性、後現代主義、全球化、殖民主義、解構等議題。如可能，課程會安排實地考察。\nIn this course we will examine the special place of the city in reading, writing and film-making.  Although we will not exclude from discussion ancient, mythical and imaginary cities, the bulk of our study will concern the modern metropolis which has a special connection with writing, serving not just as not just as subject matter for fiction, poetry or film but as engendering and even structuring story-telling and artistic experimentation.  The textualization of the city can be traced back at least as far as The Epic of Gilgamesh, and certainly can be discussed intelligently in reference to a number of eras.  There’s the Avalon of King Arthur, the much mythologized Atlantis of Socrates, the City of the Sun of Campanella, the Paris of Hugo’s The Hunchback of Notre Dame.  We will begin with the city of the 19th century, since this was the time of a great fusion of science, technology and commerce which has only intensified in our current era.  We will read works thematically and formally related to writing and reading the modern city with classic tales and detective stories of Edgar Allen Poe, short prose-poetry by Charles Baudelaire and Arthur Rimbaud, experimental fictions of Franz Kafka, Italo Calvino and William S. Burroughs, hardboiled mystery stories of Raymond Chandler, contemporary journalistic writing by Joan Didion, the “New York School” poetry of Alice Notley, and the science-fiction of J.G. Ballard, Ursula K. LeGuin and Philip K. Dick.  Depending on availability, films we might view include:  Fritz Lang’s Metropolis, Chaplin’s Modern Times, Godard’s Alphaville and David Lynch’s Mulholland Drive or Inland Empire.","schedule":"COURSE SCHEDULE (Subject to change)\nAll assignments are due next class session and are fully required unless otherwise indicated.  Further suggestions for specific topics of journal entries will be offered at the conclusion of each class, as drawn from class discussions.\nSeptember 12　　The City as Text  ASSIGNMENT:  Read Poe’s “The Man in the Crowd.” Journal Entry (JE) #1: Articulating your comments/questions, analysis OR responding creatively to the literary experience of reading Poe (notice that Poe’s story is itself a sort of essay about itself, as much as about the city which is its setting and ultimate subject matter).  Suggested Reading by Poe: “The Imp of the Perverse”(still another conflation of essay and narrative genres).\nSeptember 19　　The Genius of Crime.  ASSIGNMENT: Read Poe’s “The Murders at the Rue Morgue.”   [Suggested Reading:  Poe’s “The Purloined Letter”] Journal Entry (JE) #2: Articulating your comments/questions, analysis OR responding creatively to the film experience.\nSeptember 26 The City as Media  ASSIGNMENT: READ selection from Baudelaire’s Paris Spleen  [Suggested Reading: B’s Flowers of Evil.]  Journal Entry (JE) #3: Articulating your comments/questions, analysis OR responding creatively to the literary experience.  In what ways does Baudelaire tacitly or directly refer to the city?\nOctober 3 What is the difference between an essay, a prose-poem and a story?  What are the limits of the purely expository?  ASSIGNMENT:  READ Rimbaud selection.  [Suggested reading: R’s A Season in Hell.  Journal Entry (JE) #4: Articulating your comments/questions, analysis OR responding creatively to the literary experience. In what ways does Rimbaud require a new kind of logic, “as simple as a musical phrase”?\nOctober 10 HOLIDAY\nOctober 17  This is What Cities Are Like  The Maltese Falcon, Pt. 1.  ASSIGNMENT:  READ Invisible Cities by Italo Calvino  [Suggested Reading:  “The Burrow” by Franz Kafka] Journal Entry (JE) #6: Articulating your comments/questions, analysis OR responding creatively to the literary experience.\nOctober 24 The Ever-Shifting Cartography of the Mind  The Maltese Falcon, Pt. 2. ASSIGNMENT:  READ Chandler Journal Entry (JE) #7: Articulating your comments/questions, analysis OR responding creatively to the film experience.\nOctober 31 Film Noir:  The Maltese Falcon, Pt. 3.  ASSIGNMENT:  READ Joan Didion. Journal Entry (JE) #8: Articulating your comments/questions, analysis OR responding creatively to the artistic experience afforded by both literature and the cinema.. \n\nNovember 7　　The City Where We Live:  ASSIGNMENT:  READ Burroughs selection.  Journal Entry (JE) #9: Articulating your comments/questions, analysis OR responding creatively to the experiment.\nNovember 14　　  Cities of the Red Night.  ASSIGNMENT:  READ Ballard’s “Concentration City.”  Journal Entry (JE) #9: Articulating your comments/questions, analysis OR responding creatively to the film experience.\nNovember 21　　MIDTERM DUE.  Inland Empire, Pt. 1.   ASSIGNMENT:  Read P.K. Dick selection.  Journal Entry (JE) #10: Articulating your comments/questions, analysis OR responding creatively to the artistic experience.\n November 28  DARK ALICE.  Inland Empire, Pt. 2.  ASSIGNMENT:  READ Notley selection.  Journal Entry (JE) #11: Articulating your comments/questions, analysis OR responding creatively to the artistic experience.\nDecember 5  Notley’s Subway Ride Through the City of the Damned. Inland Empire, Pt. 3.  ASSIGNMENT:  Prepare upcoming presentation.  Read Deleuze selection.\nDecember 12　　Presentations\nDecember 19　　Presentations\nJanuary 2  HOLIDAY\nJanuary 7　　The City as Text\nJanuary 14　　Concluding Remarks by One and All.  FINAL PAPER DUE","scorePolicy":"GRADING\n25%　　Midterm Paper　　　　　　25%　　Journal Writing and Participation\n25%　　Final Paper　　　　　　　　25%　　Two Presentations Averaged Together","materials":"Class Packet","foreignLanguageTextbooks":true}]
