[{"name":"呂怜樺","email":"lhlu@ntut.edu.tw","latestUpdate":"2016-09-02 10:44:19","objective":"The goal of this course is to survey the major theoretical perspectives in organizational theory (OT). More specifically, we introduce the foundation questions of the strategy filed and focus on the strategy ‘content” research in this class. The major purpose of this class is to expose students to samples of the contemporary strategy content research and to point out some access points to the broader universe of thought on each topics. In other words, we will start from the fundamentals in order to have a solid understanding of the theoretical approach. This elaboration will be followed by more in-depth exploration of the empirical articles assigned for each week, and how this contribute to organization theory. Finally, we will move on to assessment and critique of theoretical view. One or two students will be assigned to lead each week’s discussion.","schedule":"COURSE SCHEDULE AND READINGS\nPapers can be downloaded from the E-library on EBSCOhost database. Read and well-prepare for No.1 article in each session is necessary before our class. Moreover, all the students have to read the assigned article and one or two students will lead us to review the paper and I will assign one or two students to share with his/her personal opinions in our class. \nWeek 1 (9/14): Introduction the perspective of Organization Theory\n\nWeek 2 (9/21) Session 1: Introduction: Research Design and Approaches of Strategic management\n1.　　Nag, R. Hambrick, D. Chen, M.J. 2007. What is strategic management, really? Inductive\nderivation of a consensus definition of the field. Strategic Management Journal. 28(9):935-955.\n2.　　Sutton, R. I. and B. M. Staw. 1995. What theory is not? Administrative Science Quarterly 40(3): 371-384.\n3.　　Weick, K. E. 1995. What theory is not, theorizing is. Administrative Science Quarterly 40(3): 385-390.\n4.　　DiMaggio, P. J. 1995. Comments on ‘What theory is not’. Administrative Science Quarterly 40(3): 391-397.\n5.　　Suddaby, Roy. 2006. From the editors: What grounded theory is not. Academy of Management Journal 49(4): 633-642.\n6.　　Shah, Sonali K. and Corley, Kevin G. 2006. Building better theory by bridging the quantitative-qualitative divide. Journal of Management Studies 43(8): 1821-1835.\nAssigned Reading:\n　　Whetten, D.A. 1989. What constitutes a theoretical contribution? Academy of Management Review. 14(4): 490-495.\n　　Ghoshal. S. 2005. Bad management theories are destroying good management practices. Academy of Management Learning &amp; Education. 4(1), 75-91. \nWeek 3 (9/28) Session 2 : Industry and competitive strategy \n1.　　Rumelt, R., Schendel, D. and Teece, D. 1991, “Strategic Management and Economics,\" Strategic Management Journal, Winter Special Issue: Fundamental Issues in Strategy.\n2.　　Porter, M., 1981, \"The Contributions of Industrial Organization to Strategic \n3.　　Management”. Academy of Management Review, 6(4): 609-620. \n4.　　Rumelt, D. 1991, “How Much Does Industry Matter?” Strategic Management Journal, 12: 167-185.\n5.　　Ruefli, T., Wiggins, R. 2003, \"Industry, Corporate, and Segment effects and Business Performance: A non-parametric approach. Strategic Management Journal. 24(9): p. 861.\n\nAssigned Reading:\n　　Porter, Michael 1996, “What is Strategy?,” Harvard Business Review, November-December\nGoshal\nWeek 4 (10/5) Session 3: The Internalization Theory and the Scope of the Firm\n*Transaction Cost Economics\n1.　　Coase, R. 1937, “The Nature of the Firm,” Economica.”\n2.　　Williamson, O. 1991. “Comparative Economic Organization: The Analysis of Discrete\nStructural Analysis”, Administrative Science Quarterly, pp. 269-291\n3.　　Williamson, O. 1975, Markets and Hierarchy, Free Press.\n4.　　D’Aveni, R. and Ravenscraft, D. 1994, “Economies of Integration versus Bureaucratic Costs: Does Vertical Integration Improve Performance,” Academy of Management Journal, 1167-1206.\n5.　　Williamson, O. 1979. “Transaction-Cost Economics: The Governance of Contractual Relations”, Journal of Law and Economics, 22, pp. 233-261.\nAssigned Reading:\n　　Shih-Fen, S. Chen. 2010. Transaction cost implication of private branding and empirical evidence. Strategic Management Journal, 31: 371–389\n\nWeek 5 (10/12) Session 4: Firm as a System of Incentives\n*Agency Theory\n1.　　Jensen, M. and Meckling, W. 1976. Theory of the Firm: Managerial Behavior, Agency Cost, and Ownership Structure, Journal of Financial Economics, 3: 305-360.\n2.　　Eisenhardt, K. M. 1989. Agency Theory: An Assessment and Review. Academy of\nManagement Review, 14(1): 57-74.\n3.　　Jacobides, M.G. &amp; Croson, D. C. 2001. Information policy: shaping the value of agency relationships. Academy of Management Review, 26(2): 202-223.\n4.　　Grossman, S., and Hart, O. 1986, The Costs and Benefits of Ownership: A Theory of Vertical and Lateral Integration, Journal of Political Economy, 94(4): 691.\nAssigned Reading\n","scorePolicy":"Leading discussion--20%\nClass preparation and participation--30%\nIndividual paper and presentation--50%","materials":"Journal Articles","foreignLanguageTextbooks":true}]
