[{"name":"蔡榮發","email":"jftsai@ntut.edu.tw","latestUpdate":"2016-08-13 17:35:57","objective":"The purpose of this course is talking about how to utilize scientific and systematical approaches to solve management problems. The solution process includes data collection and problem investigation, model formulation, optimal solution derivation, cost and efficiency analysis, system implementation and execution etc. This course mainly contains various application cases. Accordingly, participants can understand how to apply theoretical methods on solving real problems. Computational software is also utilized to solve the formulated models and analyzed and interpreted the obtained solutions.","schedule":"W1 Introduction to Management Science\nW2 Linear programming: application problems solved with Lingo\u000b\nW3 Linear programming: application problems solved with Lingo\u000b\nW4 Linear programming: application problems solved with Lingo\u000b\nW5 Linear programming: application problems solved with Lingo\u000b\nW6 Simplex method\u000b\nW7 Duality and sensitivity analysis (Homework 1 due)\u000b\nW8 Goal programming \u000b\nW9 Integer linear programming: application problems \u000b\nW10 Integer linear programming: application problems \u000b\nW11 Integer linear programming: application problems \u000b\nW12 Midterm exam \u000b\nW13 Decision analysis \u000b\nW14 Decision analysis (Homework 2 due) \u000b\nW15 Game theory with application problems \u000b\nW16 Presentation &amp; paper discussion\nW17 Presentation &amp; paper discussion\nW18 Presentation &amp; paper discussion","scorePolicy":"Homework: 15% \u000b\nMidterm: 35%\u000b\nPaper presentation: 35%\u000b(Papers selected from Journal: INFOR, MS, OR, EJOR, C&amp;OR…)\nPresent situation: 15% (No more than three absences)","materials":"Textbook:\nHamdy A. Taha, Operations Research- an introduction, 2011, 9th Edition, Prentice Hall.\nReferences:\n1、Optimization Modeling with Lingo, 2001, LINDO System INC.\n2、Wayne L. Winston, Operations Research- Applications and Algorithms, 2004, Thomson.\n3、Selected journal papers.","foreignLanguageTextbooks":true}]
