[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2016-06-06 11:02:58","objective":"「研究成果具有足以影響意見和行動的力量，因此有責任感的作者會以謹慎細心的態度撰寫之」。(MLA Handbook for the Writers of Research Papers, xiv).\n本課程以人文學科領域通用的MLA系統為基礎，加強學生對論文撰寫規範的認識，並經由研究過程的實踐和論文的撰寫體認學術研究的目的及價值。課程開始時學生須選擇一較為廣泛的主題，學習如何抽絲剝繭，找出核心的問題，進一步釐清研究的重點所在，然後經過仔細研究搜尋，最後以論文報告呈現成果。透過此一過程，學生將體認到學術研究有嚴謹明確的規範，需經過一步一步的印證，方能寫出合乎專業水準的研究論文或報告。\nTo communicate sensibly in an academic environment, certain conventions of arisen.  Many such conventions are actually flexible; one does well to flow them unless there is some reason not to.  Of all the conventions in academic written discourse, however, one remains recalcitrant.  IT will be followed or your paper just sort of naturally sinks to the bottom of the swimming pool to drown.  It has no mooring, is fundamentally disconnected from the main.  The “main” being the world of ideas in which we are training you to communicate.  To communicate intelligibly on a college level you must demonstrate a command of the ideas with which shape your thesis.  Since only a few of the ideas in your essay will be, strictly speaking, your own invention, you must (indeed it is your sacred duty to) honestly inform your reader which ideas come from what source.  If you do not inform the reader of the origin of an idea that comes from an outside source, it does not matter the quality of your work in other ways, it is a an embarrassing failure.  It is a slap in the face of true scholarship.  So the typical college-level research paper, thesis or dissertation will contain a multitude of quotations, all with transition connecting together your own ideas and observations, presumably proving a case if that is what you are arguing or deepening meaning if you’re exploring an aesthetic, literary or philosophical idea.  But all of these quotatations, paraphrases and summaries mustneeds have a system of categorization to make it easier for the reader to understand and evaluate the source-material being used.  For this reason, a few, common systems for documenting sources emerged.  In our course we will study one of the two most popular forms of in-text citation, foot-note notation and bibliography reference.  It is called the MLA format, after the Modern Language Association.  The MLA is the form of reference most commonly used for writing in the humanities, while the APA (which you have already learned or will learn the second half of the semester) is most suited for the Social Science.  But you must be consistent in your choice.  Only MLA shall be used or only APA should be used.  In this course we will use only MLA.","schedule":"COURSE SCHEDULE\n\n \nSeptember 17　　Introduction  ASSIGNMENT:  LOCATE AT LEAST ONE SOURCE (EITHER A BOOK, A COMPLETE PDF FILE FROM COMPUTER. OR A JOURNAL ARTICLE.  Make sure you include all the information you will need to make a standard MLA reference.)\n\nSeptember 24　　QUOTATION  (IN-TEXT CITATIONS)\n\nOctober 1　　SUMMARY  (IN-TEXT CITATIONS)\n\nOctober 8 　　 PARAPHRASE  (IN-TEXT CITATIONS)\n\nOctober 15　　WORKS CITED PAGE\n\nOctober 22　　STUDENT PRESENTATIONS I\n\nOctober 29　　STUDENT PRESENTATION II\n\nNovember 5　　STUDENT PRESENTATION III.   DUE:  FINAL ASSIGNMENT (one-two pages containing examples of quotation, paraphrase and summary employing standard MLA format) \n\n\nNovember 21　　  Read Philip K. Dick (Individual Presentation #11)\n\nNovember 28　　Read Philip K. Dick  (Individual Presentation #12)\n \nDecember 5　　FILM:  Solaris by Tarkovsky \n　　　　\nDecember 12 Discussion of Solaris:  Science, Media and Technology.  Preparation for group presentations.\n\nDecember 19　　Group Presentations\n\nDecember 26　　Group Presentation\n\nJanuary 2　　Group Presentation\n\nJanuary 9　　Concluding Remarks.  DRAFT (WITH THREE EXTRA COPIES) OF FINAL PAPER DUE","scorePolicy":"Grading:\n¼ Class Participation\n¼ Homework\n¼ Shorter Papers\n¼ Final Paper","materials":"　","foreignLanguageTextbooks":true}]
