[{"name":"翁頌舜","email":"wengss@ntut.edu.tw","latestUpdate":"2017-02-08 23:57:45","objective":"雲端運算是指透過網際網路進行擴充、消費或提供IT服務，因而顧客可隨時取用Web化的網路資源、軟體或資料。本課程在雲端方面主要內容包含雲端運算基本概念、雲端應用的核心技術、多人租用控制、雲端應用的服務模式、雲端應用架構及服務管理、雲端應用的安全/私密/信任管理議題、雲端應用的發展策略以及結論。 隨著雲端應用的廣為使用及網際網路服務的發展，已產生巨量的資料，如何處理與儲存大數據、如何從大數據中，探勘有用的知識，成為近年來熱門的研究議題。隨著雲端應用的廣為使用及網際網路服務的發展，已產生巨量的資料，如何處理與儲存大數據、如何從大數據中，探勘有用的知識，成為近年來熱門的研究議題。本課程內容尚包括如何處理與儲存大數據、如何分析大數據、資料探勘介紹與應用以及大數據實務之相關個案等議題。","schedule":"第一週 網路基礎\n第二週 雲端運算概念\n第三週 雲端運算的核心觀念與技術\n第四週 雲端服務模式與其應用\n第五週 ~ 第六週 雲端應用分組報告\n第七週 大數據分析與實務介紹\n第八週 大數據分析與實務介紹\n第九週 資料分析與資料探勘基礎\n第十週 資料分析與資料探勘基礎\n第十一週 ~ 第十二週 大數據管理之方法論與策略\n第十三週 ~ 第十四週 大數據實務之個案，專題演講\n第十五週 ~ 第十六週 大數據實務之相關問題與其應用\n第十七週 ~ 第十八週 大數據實務相關個案之討論與報告","scorePolicy":"作業與案例研討 20%\n課程參與 (思考並參與討論) 40%\n期末發表與報告 40%","materials":"1. Lizhe Wang and Rajiv Ranjan (2012), \"Cloud Computing: Methodology, Systems, and Applications\", CRC Press, USA.\n2. Dimitris, N. Chorafes (2011), \"Cloud Computing Strategies\", CRC Press, USA.\n3. Syed, A. Ahson and Mohammad ILyas (2011), \"Cloud Computing and Software Services\", CRC Press, USA.\n4. K.C, Laudon and J.P. Laudon (9th Ed., 2011), \"Essentials of Management Information Systems\", Pearson Prentice-Hall Inc., NJ, USA.\n5. Viktor Mayer-Schonberger, \"Big Data: A Revolution That will Transform How We Live, Work, and Think\", Eamon Dolan/Houghton Mifflin Harcourt, USA.","foreignLanguageTextbooks":true},{"name":"楊欣哲","email":"sjyang@csim.scu.edu.tw","latestUpdate":"2016-06-04 15:57:19","objective":"雲端運算是指透過網際網路進行擴充、消費或提供IT服務，因而顧客可隨時取用Web化的網路資源、軟體或資料之新模式。雲端運算是新一代的網際網路與資料中心(Data Center)。總之，雲端運算被視為新的IT時代中最有影響力的整合技術之一，大數據是它主要的應用之一，它亦是近年來資通訊(ICT)產業重要的趨勢與創新的應用。本課程著重於雲端基礎與實務應用，其主要內容包含雲端運算基本概念、雲端運算之服務與管理策略、雲端化移轉之方法與策略、雲端與大數據應用以及雲端應用與服務之實例。此外，同學亦選擇有關雲端運算之應用與服務實例個案於課堂上簡報與研討。\n\n隨著雲端運算服務的廣為使用及網際網路服務的發展，我們已經處於大樹數據時代，如何處理與儲存大數據、如何從大數據中，探勘有用的知識，成為近年來熱門的研究議題。本課程內容尚包括如何處理與分析大數據、如何更進一步從大數據分析發展市場行銷與顧客關係管理策略，大數據各種案例實務探討等。","schedule":"Part I: Course Scheduling (雲端應用)\n1. Cloud Computing: An Overview　　　　　　　　　　　　(1 Week)\n2. Service and Management Strategies in Cloud Computing　　 　　(1 Week) \n3. Methodologies and Strategies for Cloud Migration　　　　 　　(1 Week)\n4. Cloud and Big Data Applications　　　　　　　　　　　　(0.5 Week)\n5. Practical Cases in Cloud Applications and Services                 (0.5 Week)\n6. Seminars in Case Studies of Cloud Applications and Services　　(2 Weeks)\n\nPart II. 大數據實務","scorePolicy":"Part I. Grading (雲端應用)\nFinal Presentation for Seminars in Case Studies: 40 %","materials":"Part I. Refeerences (雲端應用)\n- 自編上課講義- 2016版 (\"Cloud Computing and Applications \" PP Slide -2016)\n\n(1)　　Amir Gandomi and Murtaza Haider, “Beyond the Hype: Big Data Concepts, Methods, and Analytics”, International Journal of Information Management, Vol. 35, January 2015, pp. 137-144. \n(2)　　Rashmi, Shabana Mehfuz and G. Sahoo, “A Five-Phased Approach for the Cloud Migration”, International Journal of Emerging Technology and Advanced Engineering, Vol. 2, No. 4, pp. 286-291, April 2012.\n(3)　　M. Rak, A. Cuomo, Umberto Villano, and G. Aversano, “Prediction of Cost and Performance of Cloud Applications”, International Journal of Cloud Computing, InderScience Publishers, Vol. 3, No. 4, August 2014.\n(4)　　McKinsey &amp; Company, “Big Data: The Next Frontier for Innovation, Competition, and Productivity”, June 2015. \n(5)　　Kris Jamsa (2013), “Cloud Computing”, Jones &amp; Bartlett Learning Inc., U. S. A.\n(6)　　K. C. Laudon and J. P. Laudon (11th Ed., 2015),”Essentials of Management Information Systems,” Pearson Prentice-Hall Inc., NJ U.S.A.","foreignLanguageTextbooks":false}]
