[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2016-06-06 11:04:42","objective":"本課程將帶領學生學習英文文法、型態、及段落的基本技巧。學生可以運用這些技巧來練習批判是思考。學生在本課程中需要寫出多種英文句型正確的語句以及各種關於較爭議性的段落寫作，像是道德、政治和商業。學生會學到基礎堆論技巧，像是歸納、演繹、相互關係、因果關係、常見的謬誤等等。學生可以運用這些技巧而獨立寫出任何主題的英文文章。\n\nIn the West, the roots of scientific investigation can be traced back to a lineage of Pre-Socratic natural philosophers including Thales, who theorized the essence of material substance to be water, to Pythagoras, who maintained it was number, to others who emphasized as the primary substance air, fire, earth, an admixture of the four basic elements, or even atoms.  Interestingly, most of the textual works remaining of these ancients are short passages, usually of a rather simple syntactical construction. This makes these exciting windows for a close study of grammar and syntax as understood in the Western scientific tradition.  In this course we will focus on those Greek and Roman writers who define scientific investigation in the West, including Heraclitus, Lucretius and Marcus Aurelius.  Students will be asked to maintain a journal of their intellectual interaction with formative ideas of science, to draw possible comparisons between Eastern and Western approaches to natural philosophy, and to share their ideas with the rest of the class.  Periodic quizzes will be given; students are required to take the school-wide midterm and final exam.","schedule":"COURSE SCHEDULE\n\nN.B. All readings listed are to be accompanied with a journal entry in which the student responds to the assigned text.  This response may vary, from summary to analysis to responses to individual ideas or major concepts.  It is NOT acceptable to cut-and-paste such responses from internet sources, which is plagiarism.  I am happy to have the focus of your responses be a record of your own journey through the texts we read and the ideas we encounter, even if such responses must needs be brief (under one page), or even if lacking in complete comprehension of the actual ideas under consideration.\n\nWeek 1　　　　Introduction:  The Roots of Western Science in Ancient Greece\n\nWeek 2　　　　The Search for the Primordial Substance:  Thales and the Pre-Socratics\n\nWeek 3　　　　Pythagoras and the Inner-Meaning of Number\n\nWeek 4　　Heraclitus\n\nWeek 5　　　　Parmenides\n\nWeek 6　　　　Zeno’s Paradox\n\nWeek 7　　　　Empedocles\n\nWeek 8　　Plato\n\nWeek 9　　Study Day\n\nWeek 10　　　　MIDTERM EXAM\n\nWeek 11　　　　Presentations I\n \nWeek 12　　　　Presentations II\n\nWeek 13　　　　Presentations III\n\nWeek 14　　　　Democritus/Lucretius\n\nWeek 15　　　　Marcus Aurelius\n\nWeek 16　　　　Implications?\n\nWeek 17　　　　Study Day\n\nWeek 18　　　　FINAL EXAM","scorePolicy":"GRADING\n33%　　Midterm + Final, Averaged　　　　17% Class Participation\n25%　　Homework　　　　　　　　25% Presentation","materials":"Course Packet (required)","foreignLanguageTextbooks":true}]
