[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2016-06-06 11:06:28","objective":"本課程旨在提昇學生撰寫結構完整段落和短文之能力, 並著重如何重寫、摘要、 轉述、 陳述、筆記、編排、起草、修改等相關技巧。\n\nThe first semester of this two semester course will introduce students to ways to interact with key texts, which, though quite brief (usually 1 page in length) bring to bear of the highest level of perception, insight and exposition of the literary art. Students will be asked to respond to model texts in a manner in some way redolent of the original source—usually some key masterpiece from world literature.  Student responses may explore  imaginatively constructed experiences in writing as suggested by the source text, or may adapt the formal considerations of the source text, which themselves can never be fully disentangled from content.  There is no role in this class for Wikipedia or other such garbage-heaps of watered-down descriptions and puerile analyses.  Everything you must write down, except for a few approved secondary source texts under special occassions, must derive from either the original source text or follow as a development of the student’s own writing practice as it encounters this course of study as well as the works of fellow classmates. Class will often be conducted in a workshop manner, and students will be expected to share their works with their classmates on a regular basis.","schedule":"COURSE SCHEDULE\n\nAll assignments are due next class session unless otherwise indicated.  For complete details of formal writing assignments and informal writing tasks (journal entries), please see appropriate writing assignment or journal entry schedule.\n\nSeptember 13　　Introduction  ASSIGNMENT:  Journal Entry (JE) #1\n\nSeptember 20　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #2\n\nSeptember 27　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #3\n\nOctober 4　　 　　Workshop Discussion.  ASSIGNMENT:  Journal Entry/Revision (JE) #4\n\nOctober 11　　Live Reading/Critique.   ASSIGNMENT:  Journal Entry (JE) #5\n\nOctober 18　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #6\n\nOctober 25　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #7\n\nNovember 1　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #8/Plan for Final\n\nNovember 8　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #9\n\nNovember 15　　Individual Conferenes  \n\nNovember 22　　Individual Confrences\n \nNovember 29　　Individual Conferences  ASSIGNMENT:  Journal Entry (JE) #10\n　　　　\nDecember 6　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #11\n\nDecember 13　　Workshop Discussion.  ASSIGNMENT:  Journal Entry (JE) #12\n\nDecember 20　　Individual/Collaborative Live Readings\n\nDecember 27　　Individual/Collaborative Live Readings\n\nJanuary 3　　　　Individual/Collaborative Live Readings\n\nJanuary 10　　　　BOOK PARTY + OPEN READING","scorePolicy":"GRADING\n\n25%　　Journal Entries　　　　　　25%　　Open Mic and In-Class Readings\n25%　　Final Work　　　　　　　　25%　　Participation in Class Discussions","materials":"　","foreignLanguageTextbooks":true}]
