[{"name":"黃翊之","email":"","latestUpdate":"2016-09-13 17:00:06","objective":"This course is purposely designed for the graduate students in the Department of Electrical Engineering to enhance their English reading ability in eight domains: (1) invention and technology, (2) the Internet, (3) spam, (4) artificial intelligence, (5) integrated circuit, (6) nanotechnology, (7) robots, and (8) telecommunication related articles. Students in this course will be trained to learn the new terminologies and the cutting edge terms while improving the reading. Technical reports and research literatures are also covered in this course. The final presentation of science or technology subject is required to fulfill the course.","schedule":"Week 01 (09/16) - Holiday: No classes\nWeek 02 (09/23) - Orientation\nWeek 03 (09/30) - Invention and technology\nWeek 04 (10/07) - Invention and technology\nWeek 05 (10/14) - The Internet\nWeek 06 (10/21) - The Internet\nWeek 07 (10/28) - Spam\nWeek 08 (11/04) - Spam\nWeek 09 (11/11) - Midterm\nWeek 10 (11/18) - Artificial intelligence\nWeek 11 (11/25) - Artificial intelligence\nWeek 12 (12/02) - Integrated circuit\nWeek 13 (12/09) - Integrated circuit\nWeek 14 (12/16) - Nanotechnology\nWeek 15 (12/23) - Nanotechnology\nWeek 16 (12/30) - Robots/Telecommunication\nWeek 17 (01/06) - Team Presentation\nWeek 18 (01/13) - Team Presentation\n\ni. Participation and engagement: These cannot merely develop and test your own understanding but also clarify material presented in lectures. Technically, participation, including engagement and assignment, deeply influences your final grade. Please be alert!\nii. Note-taking: Effective note-taking is an important practice to master in class. It helps you process and understand the information you receive.\niii. A library is the delivery room for the birth of ideas, a place where history comes to life. Please take an advantage of it.\niv. \"The function of education is to teach one to think intensively and to think critically. Intelligence plus character - that is the goal of true education.\" This is a quote from Martin Luther King, Jr. So, please try to think in a critical, creative, and rational way especially when you are immersed in learning.\nv. Learners are passionately encouraged to speak up, share ideas, and join in the discussion. Further information will be accounted in class if necessary.","scorePolicy":"Engagement and Participation: 50%\nTeam Presentation: 50%","materials":"Book Title: English for Science and Technology\nISBN: 978-957-483-583-6\nLanguage: English and Mandarin\nPublication date: March, 2016\nPublisher: Tung Hua Book Co., Ltd.","foreignLanguageTextbooks":true}]
