[{"name":"林彥良","email":"ericlin@ntut.edu.tw","latestUpdate":"2016-06-06 16:45:20","objective":"This course offers an introduction to corpus linguistics, including the corpus analytical tools, techniques, corpus design and construction, and methodologies for doing corpus-based studies. We will also discuss its applications in English language teaching and learning.\nMajor topics include vocabulary teaching and learning, analysis of chunks, teaching materials analysis, interlanguage analysis, discourse analysis, and computer-assisted language learning. Students are expected to learn to collect corpora data, create a small corpus, run and analyze corpora data according to different research topics.","schedule":"A detailed syllabus will be distributed on the first day of class.\n\nW2. Course introduction; Online corpora and resources; Corpus analytical tools\nW3. Introduction to corpus linguistics &amp; its applications (Ch1)\nW4. Corpus search and analysis methods (Ch4, Cheng); Corpus annotation; Keyness analysis \nW5. Lessons from the analysis of chunks (Ch3)\nW6. Grammar and lexis and patterns (Ch4); Spoken grammar\nW7. Listenership and response (Ch7); Relational language (Ch8)\nW8. Academic and business corpora (Ch10)\nW9. Midterm; Tutorials\nW10. Exploring teacher corpora (Ch11) \nW11. Mini-conference 1: Project Proposal Presentation (10-min oral presentation + 5-min Q&amp;A)\nW12. Corpora and discourse analysis – with guest speakers \nW13. Computer assisted language learning– with guest speakers\nW14. Learner corpus research\nW15. Multi-modal corpora: Language and gestures\nW16. Mini-conference 2: Final Presentation (15-min oral presentation + 5-min Q&amp;A)\nW17. Computational Linguistics: Python Workshop\nW18. Final","scorePolicy":"Participation: 20%\nHomework assignments: 20%\nOral presentation: 20%\nFinal paper (project): 40%","materials":"1. Okeeffe, A., McCarthy, M. &amp; Carter, R. (2007). From Corpus to Classroom. Cambridge, Cambridge University Press.\n2. Handouts and journal articles (SSCI): Applied Linguistics, International Journal of Corpus Linguistics, TESOL Quarterly, System, ReCALL, etc.","foreignLanguageTextbooks":true}]
