[{"name":"翁文慧","email":"wendywwh@ntut.edu.tw","latestUpdate":"2016-09-20 17:52:45","objective":"邀請校內外學者專家至校針對某一專長領域進行專題演講，讓學生藉由聽講及心得報告之寫作，開展視野，並與時代之脈動相契合。","schedule":"週次　　date　　  演講者/題目　　                                                                       Host\n1　　09-13　　Introduction　　                                                             Prof. Weng\n2　　09-20　　Select 3 topics and titles ( 5 papers for each topic) send to Prof. Weng by email　　Prof. Weng \n3　　09-27\n(compensatory the time of extra lectures out of school )　　Preparation in library　　Prof. Weng\n4　　10-4\n(compensatory the time 11-08)　　Preparation in library　　Prof. Weng\n5　　10-11\n(compensatory the time 01-10)　　Preparation in library 　　Prof. Weng\n6　　10-18　　SAKTHIVEL M　　Prof. Weng \n7　　10-25　　Govindasamy Mani　　Prof. Weng\n8　　11-01　　Kubendhiran　　Prof. Weng\n9　　11-08　　 　　Prof. Weng\n10　　11-15　　　　Prof. Weng\n11　　11-22　　　　Prof. Weng \n12　　11-29　　　　Prof. Weng\n13　　12-06　　　　Prof. Weng\n14　　12-13　　　　Prof. Weng\n15　　12-20 　　　　Prof. Weng\n16　　12-27　　　　Prof. Weng\n17　　01-03　　(compensatory the time of extra lectures out of school)　　Prof. Weng\n18　　01-10　　(compensatory the time of extra lectures out of school)　　Prof. Weng","scorePolicy":".　　The score configuration to this course:\n　　Seminar performance 20%, discussion with Prof. Weng 25%  \n　　Questions proposed on the classes and interact with participants 40%\n　　Present 5%\n　　Hand in notes and paper works 10%","materials":"1.　　Select 3 different topics and prepare 3 titles (5 papers for each topic) send to Prof. Weng by email\n2.　　The criteria of papers selection:\n　　The selected papers should be top 10 of the ranking in the category. Please labeled the ranking information on the paper to show me. \n　　All papers should make a brief oral presentation when we meet to decide topic. \n　　As long as the topic has been selected by one of classmates, you are not allowed to use it. (Try to be an early bird…)\n3.　　All presenters please send me the titles, topics and papers 14 days before your presentation date, and discuss with me at Tuesday seminar class (we have 30 minutes, so only can take a student who is going to give a presentation in coming week).\n4.　　Presenters ready the PPT and send all your references to all members by email a week before your presentation.  \n5.　　All the attendants have to prepare at least 10 questions in the class for the discussion. \n6.　　Laptops are welcome to be used in the class.","foreignLanguageTextbooks":true}]
