[{"name":"陳建文","email":"a868@ntut.edu.tw","latestUpdate":"2016-05-30 17:17:18","objective":"一般創新思考課程為設計學院所重視，教學模式主要透過一系列的資料採集､參考與互動，包括經驗分享､影片欣賞等，帶領受教者探索如何進行創新思考本校除設計學院學生外，以理工科學生居多，學生教學回饋意見屢屢反應，工科學生長於機械結構操作事物，相對拙於天馬行空的靈活思考，對於傾聽他人意見､表達自己想法，亦少有練習機會故本課程設計理念針對前述受教者特質背景，結合翻轉教學的練習實作，來讓學生體驗創新思考講求結果､結局不一樣的精神\n\n    基於此等背景因素考量，本課程設計理念主要有以下幾項:\n\n1.重視創意思考練習實作，對話練習重於聽講記憶\n\n創意或創新思考一般有幾種教法可供參考，一是多方觀摩以求了解他人創意技巧，二是整理教授可供參考之創意方法，但不論採何種方法最終都得仰賴學習者自身不斷的大量練習不斷練習､累積深化，是培養提升自身創意思考能力的重要功夫，所以本課程的教學方式對話練習重於聽講記憶，運用各種素材與機會引導受教者主動積極的練習創新思考與發表想法\n    本課程將在課堂上不斷利用機會鼓勵學生靈活結合記憶與創意兩端來學習知識，以記憶端的溫故，檢索､分析既有知識，用創意端的知新，形成未知的構想布局，兩者結合來作不一樣的創新思考表達讓學生認知到，用記憶讀書，ㄧ切都不容易用創意讀書，到處都找新意凡事，都是變易、簡易、不易試著回憶、追憶(記憶的作用與目的)，翻譯其間所涉的利益以及意義，研議、提議、建議、倡議，會議、商議、協議的集思廣益，思索如何容易、變異的更加優異，就是創新思考的學習真意！\n \n2.手腦併用的創造､表達､溝通\n\n手腦併用有助於刺激創意手腦並用的意見塗鴉，讓思考的嚴肅感轉化成問題的遊戲感，有利於營造創新思考的氛圍故本課程在課堂上的小組練習作業採分組集體討論，先由各組在A3大小的紙張上形成意見塗鴉，再由各組於課堂板書塗鴉，視覺化的呈現思路，再由老師引導各組及全班同學進行對話思考，結合創造､表達､溝通三者所具有之功能關聯，手腦併用的創造､表達､溝通，來練習創新思考\n  \n3.寓教於樂､翻轉教學，讓受教者能放､晃､FUN的練習創新思考\n\n課堂上適時結合同學臉書上的動態消息､youtube上的流行歌曲等周遭素材，進行創新思考的練習與示範解說，樂中有教､教中有樂的發揮寓教於樂學習效應此外，採取翻轉學來讓受教者放､晃､FUN，不受拘束的去探索、發問。\n創新思考必須採取與專業知識不同的思考視野來教學白日依山盡 黃河入海流欲窮千里目 更上一層樓，專業知識教育在讓學生對專業知識擁有千里目；創新思考的學習目標則是鍛鍊學生使其擁有靈感跳躍的漂流目\n專業系所的入門教學，是開門見山的讓同學們攀爬不動如山的既有知識累積，能夠不斷翻越，就能擁有更上一層樓的「千里目」。創新思考課程的翻轉教學，反其道而行，不開門見山，而是開門漸刪，刪刪刪，刪到不見山。沒有了翻山越嶺的專業知識征逐，沒辦法一下子就培養出「千里目」，但是上課像出門玩水、遊山玩水，讓同學們返璞歸真、輕鬆自然的接觸知識、探索問題，像小朋友一樣自由自在的玩耍摸索，卻可以鍛鍊出活潑靈動的「漂流目」！\n千里目，是登上知識高山後造就的，不動如山的知識記憶，會壓得人難有創意。飄流目，是在知識匯流中連結流轉形成的，整個過程充滿活潑靈動的思考創意。仁者樂水，智者樂山。學習專業智識，到底是樂山好還是樂水好，見仁見智。但如能同時執山水兩端來建構學習策略，肯定更佳。上善若水，除了千里目，人還是得有漂流目來輔助。因為千里目讓人能像水一樣靈動流轉，活潑的隨機應變，不斷變易、持續容易，隨時隨地都有能力產生逼近於如意的創意。\n\n4.借用科技工具打破時空限制，提供隨身便利､無限延伸的創新思考交流論壇  \n\n網路科技時代，臉書等社群溝通科技盛行，帶來寫作復興，人們可以隨時隨地以文字照片捕抓靈感，或是匯流數位資料，來進行思考､表達意見､發展想法創新思考教學需要與時俱進，利用臉書等社群溝通科技提供之便利性，引導學生接收資訊､匯流資訊､靈活巧妙的參贊知識管理與生產，並從中體悟創新思考的技巧與方法\n\n有鑑於同學們普遍有使用網路社群科技工具(FACEBOOK)習慣，申請人開設之相關課程從多年前起即均開設課程教學之臉書秘密社團，於開學第一週即請同學加入，所有作業報告均彙整於臉書上，並隨時隨地運用網路社群科技工具隨機進行與課程知識具相關性的對話討論創新思考課程繼續援用此做法，借用科技工具打破時空限制，提供隨身便利､無限延伸的創新思考交流論壇\n\n5.採分組方式培養同學溝通表達､團隊合作能力\n\n創新思考的教學需要大量對話思考，班級人數規模若過大，不利對話互動，難以維持上課秩序，也會大大稀釋掉個別同學的創意思考的練習機會以及時間資源本課程採折衷作法，將全班分成三個小組，以小組討論方式進行創意思?","schedule":"週次　　課程內容　　指定閱讀/教學活動安排\n\n第1週　　第一階段 課程解說､小組編組\n1.期中考前每週閱讀報告討論：傅佩榮/譯，羅洛.梅/著，創造的勇氣，立緒文化事業有限公司，2013年12月2版1刷(本書共7篇，以徵求7位自願同學獲分配給3組每週報告1章方式進行) \n2.向名惠/譯，麥克.羅德/著，直覺式塗鴉筆記，城邦文化事業股份有限公司，2016年4月，出版1刷\n\n第2週　　翻轉教學一\n\n以周杰倫算甚麼男人等歌曲以及“男人你的名字叫弱者”､“我們來交換”等短文作為創新思考的引導閱讀素材。\n向同學傳達創新思考觀念；介紹易經中的創新思考~簡易.變異.不易的哲學思考方法及其運用，說明創新思考對人類文明進步的重要作用。　　1.開學前一週即將所有翻轉教學閱讀素材，事先PO於臉書社團\n\n2.翻轉教學進行方式分同學個人心得寫作與臉書社團分享對話，以及課堂小組討論板書塗鴉對話兩部分:（1）請所有同學先就翻轉教學閱讀素材個人心得報告寫作，PO於臉書社團並與其他同學還有老師進行對話交流（2）實體上課時，先進行小組討論整合個別同學意見，在A3大小的紙張上進行意見塗鴉､完成板書塗鴉後，由老師引導對話講解\n\n第3週　　翻轉教學二\n結合中秋節話題，引導同學從蒐尋月亮有關歌曲來進行知識管理與知識生產，分析著作權法的問題。另由蘇東坡賞月後寫出前赤壁賦帶出來的財產觀念，以及研究分析十分瀑布爭議事件，來說明財產管理收益觀念，以及財產運用的創新思考等問題。　　\n\n第4週　　翻轉教學三\n\n作業1：運用蔡依林的日不落的愛：*日不落的愛馬德理思議以及連串與第名相關的流行歌曲作為創新思考的靈感練習素材，進行相關引導提問，並請同學從中挑選兩首歌曲，試著欣賞分析創作者的創作創意，檢索與該歌曲相類題材的歌曲進行比較分析，指出它們之間所作的創新思考為何？想一想如果要寫這類歌曲還可以做如何做哪些創新思考？\n作業二､閱讀Burt’s Bees品牌故事創辦人的故事，討論分析看到什麼想到什麼，並練習歸納出知識。　　\n\n第5週　　翻轉作業四\n以金城武樹的廣告話題作為創新思考的對話教學素材，要同學思考談論金城武樹背後有何秘密?另檢索分析有無與其類似或相同的事件，將這些事件當思考素材，從中歸納整理出屬於自己的識見。\n\n\n第6週　　科技發明與發財的創新思考觀察報告一:電報的發明與發財故事\n第一組負責製作與進行簡報；簡報後三組分別進行分組討論、版書塗鴉與翻轉教學討論。\n任何科技發明的背後都存在著多層次的創新思考問題。第六週至第八週的教學活動將藉用科技發明實例，來引導學生進行技術發展的創意思考､生意發財的創新思考､名利效應的創新思考以及人生抉擇的創新思考等多層次的創新思考練習。\n\n第7週　　科技發明與發財的創新思考觀察報告二:電燈的發明與發財故事\n第二組負責製作與進行簡報；簡報後三組分別進行分組討論、版書塗鴉與翻轉教學討論。　　\n\n第8週　　電話科技發明與發財的創新思考觀察報告三:電話的發明與發財故事\n第三組負責製作與進行簡報；簡報後三組分別進行分組討論、版書塗鴉與翻轉教學討論。\n\n第9週　　期中考試，以下列方式進行成績評量:\n1.個人學習心得與創新思考塗鴉練習分享，並PO於臉書社團進行分享對話。(每位學生均需繳交報告/課堂上僅抽樣作口頭報告與討論)\n2.各組運用自己拍攝的學習過程記錄數位檔案，進行期中報告檢討。　　\n開學第一週授課說明時，即先行告知同學每一組要自行記錄、保留小組在各週討論過程的記錄影片及意見塗鴉、板書塗鴉作品..等學習練習過程中的衍生物，由小組成員共同討論整理編輯成記錄檔案，於期中考週分享報告學習發現與相關心得，另個人要繳交個人部份的學習記錄與心得。\n\n第10週　　智慧財產權法與創意思考(一)\n進行智慧財產權法總論介紹，由教師講解智慧財產權法知識的學習方法、內容重點以及創意運用等問題。讓同學瞭解具有多重層面的智財創新思考問題，包括：智財問題是「人際.科技.經濟.法紀」這四”繼”的創意思考設計問題。所謂創意創新，就是透過「翻譯(Translate).轉運(Transfer).移植(Transplant)」這三重動作，來到達「新莊」、變出「新裝」。以及環保節能的知識學習、知識生產以及知識循環運用等攸關創新思考的觀念問題。　　\n\n第11週　　智慧財產權法與創意思考(二)\n課堂上觀賞”草山春暉”(大愛電視台連續劇)之局部片段，進行心得寫作與板書塗鴉對話討論，引導同學思索智慧財產權與人生發展問題在觀念上的相通以及可互相轉用。　　\n\n第12週　　「由發明到發財的一路發創意思考~專利法及案例的創意思考練習」(一)\n第一組負責報告介紹專利制度及其相關重要的規定內容。\n簡報後，各組進行專利法報告小組競賽:讓人一張圖秒懂的專利法塗鴉筆記。\n\n第13週　　「由發明到發財的一路發創意思考~專利法及案例的創意思考練習」(二)\n各組自行尋找一則專利法相關案例，以簡報及板書塗鴉方式，來作報告討論。\n小組討論作業：珍珠奶茶的發明與發財故事　　\n\n第14週　　「吸引注意.做成生意","scorePolicy":"評分標準\n平常分數(上課參與討論的表現(主動程度.創意展現).個人創意塗鴉本練習的質量)40%；\n期中考(個人創意塗鴉分享對話+小組學習數位記錄檢討報告)40%；\n期末考(個人筆試題+小組討論板書塗鴉討論題個人筆試題+小組討論板書塗鴉討論題)20%","materials":"上課使用之臉書秘密社團\n北科大著作權法課程102.2\nhttps://www.facebook.com/groups/1444475105784024/\n\n\n相關參考書籍\n陳朝華，商標法實例解析，元照出版，2013年7月初版\n鄭煥生/譯，誰把橡皮擦戴在鉛筆的頭上:文具們的百年演進史，時報出版，2015年9月25日傅佩榮/譯，羅洛.梅/著，創造的勇氣，立緒文化事業有限公司，2013年12月2版1刷\n向名惠/譯，麥克.羅德/著，直覺式塗鴉筆記，城邦文化事業股份有限公司，2016年4月，出版1刷\n邱麗娟/譯，井上彥達，創新的第一課:模仿，2013年7月1版1刷\n林麗冠/譯，大衛.莫瑞/譯，借用創意，你最快出人頭地，，大雁(香港)出版基地.里人文化，2010年8月3日初版1刷\n張舜芬.錢佳緯/譯，點子都是偷來的:10個沒人告訴過你的創意撇步，遠流出版，2013年10月2版5刷。\n沈殿忠等編著，談創造說機遇—科學方法論談，復漢出版社有限公司，1996年6月初版\n張大凱，電的旅程–探索人類駕馭電子的過程，天下文化出版\n王蘊潔/譯，山田大隆/著，從故事看科學，世潮出版有限公司，2006年3月初版\n劉藍玉/譯，安娜‧克雷邦/著，我愛讀發明的故事，小天下出版社，2010年3月5日初版\n劉復苓/譯，邁可．J．蓋爾伯，莎拉．米勒．卡蒂/著，快樂腦：學習愛迪生的五種創新思考法(Innovation Like Edison：The ive-Step System for Breakthrough Business Success)，馬可孛羅出版社。\n劉蘊芳/譯，麥可‧葛柏 /著，7 Brains－怎樣擁有達文西的七種天才(How to Think Live Leonardo da Vinci)，大塊文化。\n趙晉枚等合著，智慧財產權入門，元照出版社，2014年9月10版1刷\n李光熹/編譯，愛迪生到iPOD:保護你的創意並從而致富，三民書局\n靠智慧變富有的秘密，三民書局\n蕭雲菁/譯，大發明調查團/編著，日本創意大發明，台灣東販股份有限公司，2011年6月24日初版\n林宜瑄/譯，追蹤發明的思路，臉譜出版，2006年3月\n楊雨樵/譯，佐藤健太郎/著，改變歷史的元素之王 碳，臉譜出版，2015年2月15日\n吳書榆/譯，賽斯.高汀/著，怪咖時代:小眾崛起，越怪越有商機，三采文化事業有限公司，2012年8月31日\n簡啟煜，著作權法案例解析，元照出版，2014年9月3版1刷陳樂融/著，我，作詞家:陳樂融與14位詞人的創意叛逆，天下出版，2010年1月22日\n陳朝華，商標法實例解析，元照出版，2013年7月初版\n鄭煥生/譯，誰把橡皮擦戴在鉛筆的頭上:文具們的百年演進史，時報出版，2015年9月25日陳朝華，商標法實例解析，元照出版，2013年7月初版\n鄭煥生/譯，誰把橡皮擦戴在鉛筆的頭上:文具們的百年演進史，時報出版，2015年9月25日","foreignLanguageTextbooks":false}]
