[{"name":"吳孟真","email":"philwu@gmail.com","latestUpdate":"2020-08-14 00:20:23","objective":"From the fundamental constants as concepts for understanding our universe, to the duality of matter and waves, we will build our understanding of the tangible universe in terms of optics and magnetism. Concepts beyond the classical description will be introduced, such as the semi-classical hydrogen model of Bohr, the Schrödinger Equation, and an introduction to applied technology. A major focus will be the modern attention of physics to medical device and technology. This course will utilize mathematical concepts from linear algebra and calculus.","schedule":"Week of 　　Topics　　Details　　Problem Sets\nSept. 14　　Fundamental Concepts – Constants and how they were determined. 　　-Atomic mass of proton, neutron and electron as well as the Avogadro’s number. \n-Millikan’s Oil drop.\n-Interferometry and gravitational lensing\n-Blackbody　　PS1\nSept. 21　　Optics　　-Photoelectric effect\n-Waves\n-X-rays\n-Compton effect\n-E&amp;M\n-Polarization,　　PS2\nSept. 28　　Introduction to Quantum Mechanics　　-Schrodinger Equation and solving particle in a well (box)\n-Tunneling and other examples\n\nAsk students availability for one extra hour this week.　　PS3\nOct. 5　　Atoms and Molecules　　-Bohr atom\n-atomic spectra\n-energy levels\n-nuclear motion\n-atomic excitation (lasers, spectroscopy)\n\nNo class on Wednesday　　PS4\nOct. 12　　　　-SG experiment introducing spin and uncertainty principle\n-periodic table, and an explanation\n-spin-orbit coupling\n-total angular momentum\n-xray spectra\n-molecular bonds\n-hydrogen molecule H2\n-rotational and vibrational energy levels (nmr)　　PS5\nOct. 19　　Concepts in Magnetism, Solids and Optoelectronic Devices　　-Magnetism an Introduction: para-, ferro-, ferri-, dia-, exotic etc.　　PS6\nOct. 19　　　　-Solids: band theory of solids semiconductors, conductors, superconductors\n-Hydrodynamics　　PS7\nOct. 26　　Elementary Particles and Cosmology　　-Elementary Particles, Relativity, Cosmology　　PS8\nNov. 2　　Applied Concepts　　-Applied concepts: IC, TCO, Transmission lines, Storage (batteries, capacitors, inductors, etc.) and ideas, solar cells, devices, thin films, photonics, integrated optics, lcds, fiber optics, sensors, fourier optics　　Oct. 31-Nov. 1, TT’s anniversary celebration.\nPS9\nNov. 9　　Medical Physics: Mechanics and Power Laws　　No lecture on Tuesday for Midterm Examination\n\n-Medical Physics:\n-Mechanics and forces, stress and strain in human body\n-Hydrostatics, buoyancy, compressibility, viscosity\n-Circulatory system and Poiseuille (Bernoulli) flow　　Midterm Examination on Tuesday, no problem sets, English proficiency test (undergraduates only)\nNov. 16　　Medical Physics: Systems of Many Particles and Thermodynamic Concepts 　　-Food Consumption\n-Basal Metabolic Rate and Scaling\nSystems of Many Particles : Gas Molecules in box\n-Systems of Many Particles: Thermodynamics Ensembles, Entropy, Boltzmann Factor, Nernst Equation　　Failure Warning Issued,\nPS10\nNov. 23　　Thermodynamic Concepts　　example in cells)\n-Heat Capacity (and heat transport)\n-Chemical Potential\n-Gibbs Free Energy\n-Diffusion (example of diffusion in pores, kidney)\n-Brownian Motion　　PS11\nNov. 30　　Biomagnetism　　-Biomagnetism : Quick Review of Lorentz, Magnetic field of moving charge, Magnetoencephalogram and induction\n-Discussion of topics for presentations　　PS12\nDec. 7　　Potentials and Transport (Through Neutral Membranes)　　-Membranes osmotic pressure\n-transport through a membrane and pore\n-Hodgkin-Huxley Model for Membrane Current\n-Electrocardiograms\n-Method of Least Squares and Signal Analysis (photosynthesis in plants) and other functions　　Help prepare presentations: ask students to work on presentations and submit by Tuesday\nDec. 14　　Medical Physics: Atoms and Lights　　-Atoms and Lights – Considerations such as IR to and from body, how to handle UV\n-Sound and Ultrasound　　PS13\n　　Medical Physics: Interaction of Photons and Charged Particles with Matter　　-Sound and Ultrasound\n-Radiometry and Photometry, Medical uses of X-rays, Photons　　PS14\nDec. 21　　Student Presentations　　Schedule of student presentations　　Presentations from all students\nDec. 28　　Medical Physics: Imaging　　-Magnetic Resonance Imaging　　PS15\nJan. 4　　Medical Physics: Nuclear Physics and Nuclear Medicine　　-Nuclear methods, half-life and why we should care\n- Nuclear Physics and Nuclear Medicine　　Prepare for finals.\nJan. 11　　　　Final Examinations　　Final Examination on Tuesday, no more problem sets =) \nJan. 18　　　　　　Winter Break Begins!\nJan. 25　　　　　　\nJan. 31　　　　　　Fall Semester Ends","scorePolicy":"Evaluation: \n•　　Attendance – 100% (full attendance or two sick leaves allowed), 90% (4 total allowed leaves, included 2 sick leaves). 75% &gt; 5 missed classes. 50% &gt; 50% missed classes.\n•　　Problem Sets – weekly homeworks to be turned in the following Tuesday before end of class.\n•　　Exams – midterm (50% of category) and finals (50% of category).\n•　　Presentation – Here’s an example of a good presentation (document and video?).\nEtiquette: No cellphones please unless emergency, computer or digital aids for note taking allowed.\n\n\nGrading Schema\nA+　　97-100\nA　　94-97\nA-　　90-94\nB+　　87-90\nB　　84-87\nB-　　80-84\nC+　　77-80\nC　　74-77\nC-　　70-74\nD+　　67-70\nD　　64-67\nD-　　60-64\nF　　0-60","materials":"This course is not planned to follow any single particular text. \nRecommended reading:\n“Essential University Physics”, 3E, by R. Wolfson, chapter 7.\n“Modern Physics for Engineers” Jasprit Singh, John Wiley &amp; Sons, New York 1999.","foreignLanguageTextbooks":true}]
