[{"name":"白俊恩","email":"allenbalaz@gmail.com","latestUpdate":"2020-06-11 19:42:21","objective":"本課程目的在啟發學生英語聽力，分析及思辨能力。本課程自報紙，雜誌及電視選取豐富的教材, 以訓練聽力及筆記的技巧。 此外，在課堂上將討論一些有爭議性的或者有趣的議題，以培養學生獨立思辨能力。\nThe course aims to develop the student's listening techniques and critical thinking in English. A variety of texts will be selected from newspapers, magazines and T.V. to reinforce listening training and note-taking skills. Besides, some controversial or interesting issues will be discussed in class to encourage the student's independent and critical thinking.","schedule":"This course is designed to strengthen the English skills that participants have as indicated by their diagnostic essays and descriptive sentence writing. The schedule outlined below can be amended to better fit the class needs as indicated by their diagnostic work.\nThe focus on the course is on students’ current English abilities relative to the demands that the various forms of the TOEIC place on test takers.\nThis course is ideally for those who have already taken the TOIEC test and want to strengthen the skills their experience has shown them they need to improve or for those who plan to take the TOEIC in the next 6-12 months.\nWeek 1 Intro to the class – organization, grading, overview of TOEIC and TOEIC grading policies; Intro to the class – organization, grading; TED Talk – Do schools Kill Creativity? BEFORE YOU GO TO SCHOOL, WATCH THIS || WHAT IS SCHOOL FOR? https://www.youtube.com/watch?v=_PsLRgEYf9E; I SUED THE SCHOOL SYSTEM !!! https://www.youtube.com/watch?v=dqTTojTija8; What you weren’t taught about making money | Sarah Potter https://www.ted.com/talks/sarah_potter_what_you_weren_t_taught_about_making_money; Robert Kiyosaki 2019 - The Speech That Broke The Internet!!! KEEP THEM POOR! https://www.youtube.com/watch?v=azq0S0DKS50\n\nWeek 2 Unit 2 Relative Clauses\nWeek 3 Discussion of homework\nWeek 4 Unit 3 Participles\nWeek 5 Discussion of homework\nWeek 6 Unit 4 Appositives\nWeek 7 Discussion of homework\nWeek 8 Unit 5 Absolutes\nWeek 9 MIDTERM EXAM\nWeek 10 feedback on midterms; Unit Coordination &amp; Subordination\nWeek 11 Discussion of homework\nWeek 12 Unit 7 Prepositional &amp; Infinitive phrases\nWeek 13 Discussion of homework\nWeek 14 Unit 8 Noun Substitutes\nWeek 15 Discussion of homework\nWeek 16 Unit 9 Paragraph Cohesion\nWeek 17 Discussion of homework\nWeek 18 FINAL EXAM","scorePolicy":"written midterm exam = 30%\nwritten final exam = 30%\nin-class participation = 40% (doing the tasks, asking questions in class or by email, downloading the teacher-provided pdfs, studying them, and asking follow-up question in class or by email)","materials":"The teacher will provide the book and all other materials in downloadable pdf form.\n\n\nContact Information:\nallenbalaz@gmail.com","foreignLanguageTextbooks":true}]
