[{"name":"吉塔","email":"sangeetha@mail.ntut.edu.tw","latestUpdate":"2020-06-15 10:58:32","objective":"GREEN TECHNOLOGY is a basic course taught completely in English, mainly for the students who have not studied Environmental Sciences as a subject. The course will cover topics related to Environmental processes and techniques that reduce the negative environmental impacts like pollution and protect our planet. Students can gain introductory knowledge about green and sustainable methods of producing energy and thereby preventing hazardous environmental issues through significant energy efficiency improvements and sustainable use of resources.\nWeek 1: Green Technology- Introduction and Basics\nWeek 2: Green  Energy Sources\nWeek 3: Carbon Cycle\nWeek 4: Carbon Footprint\nWeek 5: Carbon Trading \nWeek 6: Carbon Sequestration\nWeek 7: Geoengineering\nWeek 8: Bio energy\nWeek 9: Midterm Exam\nWeek 10: Sustainable Resource Management (SRM)\nWeek 11: Sustainable Biofuels\nWeek 12: Sustainable Hydrogen fuel cells\nWeek 13: Sustainable Biological fuel cells\nWeek 14: Sustainable Agriculture\nWeek 15: Sustainable Conversion Technologies\nWeek 16: Sustainable Remediation\nWeek 17: Sustainable Tourism\nWeek 18: Final Exam","schedule":"1.　　The students will be separated into groups\n2.　　In each class the Teacher will first teach a PowerPoint presentation\n3.　　This will be followed by the presentations of the students in each group\n4.　　The students can use Powerpoint and YouTube videos to make their presentations interesting","scorePolicy":"1.　　The Teacher will conduct 2 exams during the course (Midterm and Final) for 50 marks\n2.　　The final score will be for 100% and it will be a sum of evaluations as 50% (from the final written exam) 25% (from the Midterm exam score) 15% (from the class presentations) 10% (from class attendance and attentiveness).","materials":"This course does not have a prescribed book material as it involves many different disciplines. The Powerpoint presentations taught by the Teacher should be used by the students for exam preparations","foreignLanguageTextbooks":false}]
