[{"name":"呂怜樺","email":"lhlu@ntut.edu.tw","latestUpdate":"2020-07-08 14:08:04","objective":"The goal of this course is to survey the major theoretical perspectives in organizational theory (OT). More specifically, we introduce the foundation questions of the strategy filed and focus on the strategy ‘content” research in this class. The major purpose of this class is to expose students to samples of the contemporary strategy content research and to point out some access points to the broader universe of thought on each topics. In other words, we will start from the fundamentals in order to have a solid understanding of the theoretical approach. This elaboration will be followed by more in-depth exploration of the empirical articles assigned for each week, and how this contribute to organization theory. Finally, we will move on to assessment and critique of theoretical view. One or two students will be assigned to lead each week’s discussion.\n本課程主要目的透過介紹經典管理理論的介紹, 深入引導學生了解管理理論之精髓, 並深入探討管理理論之實務運用與接軌","schedule":"Week 1 : Introduction the perspective of Organization Theory(0918)(組織理論概要)\nWeek 2: Session 1: Introduction: Research Design and Approaches of Strategic management (0925)(組織理論之研究設計)\nWeek 3: Moon Festival (1002) Break(中秋節)\nWeek 4: National Holiday(1009)Break (國慶日)\nWeek 5: Session 3 : Industry and competitive strategy (Transaction Cost Theory)(1016)(產業競爭理論)\nWeek 6: Session 4: Firm as a System of Incentives(Agency Theory)(1023)(代理理論)\nWeek 7: Session 5: Strategic Assets and Resources within a firm (Resource-Based View (RBV) (1030)(資源基礎理論)\nWeek 8 : TEJ Database Introduction (1106) (資料庫中心介紹)\nWee 9: Mid-Term Project(1113)(期中考)\nWeek 10: Session 6 : The Knowledge Base of a Firm (Knowledge-Based View (KBV)(1120)(知識基礎理論)\nWeek 11: Session 7: Acquire Outside Supporting(Resource Dependent Theory (RDT)(1127)(資源依賴理論)\nWeek 12 : Session 8 : Network Organizations(Network Theory)(1204)(網絡理論)\nWeek 13 : Session 9 : Evolution Theory(Evolution Theory)(1211)(演化理論)\nWeek 14 : Session 10 : Institutional Theory(1218)(制度理論)\nWeek 15 : Session 11: Performance Feedback as Mechanism (Behavior Theory of Firm (Search Behavior)(1215)(績效回饋搜尋理論)\nWeek 16 : National Holiday(0101) Break(元旦)\nWeek 17: Session 11 : Technological Innovation (0108) (技術研發)\nWeek 18 : Final Exam (0115) (期末考)","scorePolicy":"Participation (課程參與): 40%, Term Project(期中報告):30%, Final Exam(期末考試):30%","materials":"Others (made by teacher)","foreignLanguageTextbooks":true}]
