[{"name":"林淑玲","email":"shuling@ntut.edu.tw","latestUpdate":"2020-06-07 17:21:48","objective":"本課程主要闡述財務管理中最重要的投資決策、融資決策與短期資金管理決策之基本架構及企業經理人之財務決策，配合各項相關議題進行個案研討，結合資訊工具與軟體運用、以深入淺出方式介紹財務管理之基本觀念及理論架構，並搭配財務軟體、財金資料庫、與財金資訊網站的應用。藉由這些資訊工具與技術，將財務管理的觀念與原理加以運用於重要的融資與投資決策制定。課程內容涵蓋：金融市場與金融機構、財務報表與現金流量分析、財務規劃與預測、風險與報酬、債券與股票之評價、資金成本、資本預算決策、資本結構與財務槓桿、營運資金管理、股利政策…等。本課程結合財務管理實務並融入財務決策研討，以培育理論與實務兼備之財務管理人才。透過本課程之修習，期許學生能具備財務管理領域之學科知識與專業技術整合能力、獨立研究之能力、判斷性思考與決策能力，以及制訂並解決財務管理問題之能力。\nThe course focus on the three most important decisions of the financial management: the investment decisions, the financing decisions and short-term capital management and financial decisions of corporate managers, and various related topics with case studies. This course combines information and software tools to use; the major goal of this course is to help students understanding the basic principles and theories of investments. By mixing explanation and implementation using financial software and database, it can give students the skills to conduct a sophisticated assessment on investment decisions. The major topics including: Financial markets and financial institutions, the financial statements and cash flow analysis, financial planning and forecasting, risk and return, bond and stock pricing, the cost of capital, capital budgeting decisions, capital structure and financial leverage, working capital management, dividend policy, mergers and acquisitions, etc. This course combines b","schedule":"週次　　日期　　課    程   進   度\n一　　9/14　　　　        課程簡介\n二　　9/21　　　　　　 財務管理的範圍 &amp; 公司目標\n三　　9/28　　　　　　 代理問題\n四　　10/5　　　　　　 金融市場功能與類型 &amp; 金融機構的業務\n五　　10/12　　　　 市場效率性\n六　　10/19　　　　 財務報表 &amp; 自由現金流量 (FCF)分析\n七　　10/26　　　　 財務報表分析\n八　　11/2　　　　　　 財務報表分析之應用\n九　　11/9　　【期  中  考  試】\n十　　11/16　　　　 財務規劃與財務預測\n十一　　11/23　　 貨幣的時間價值\n十二　　11/30　　 股票與股票評價之應用\n十三　　12/7　　　　 資本預算分析與應用：投資案評估\n十四　　12/14　　 運用決策分析系統於金融商品之資產配置\n十五　　12/21　　 資產配置決策軟體之策略操作與應用\n十六　　12/28　　【金融商品資產配置決策分析之報告與競賽】\n十七　　1/4　　       【期  末  考  試】\n十八　　1/11　　       【補  救  考 試】","scorePolicy":"1.　　出席紀錄、數位學習網站聆聽語音課程歷程、課後討論版參與討論狀況：25%\n2.　　平時測驗(北科i學園PLUS)：25%。\n3.　　金融商品資產配置決策分析之報告與競賽：25%。\n4.　　期末考試：25%。","materials":"Textbook：\n1. 王明昌(譯者)，「財務管理 (Ross / Fundamentals of Corporate Finance 12e)」，第12版，2020年 (華泰文化)，ISBN-13: 9789863414308。\n2. Stephen A. Ross, Randolph W. Westerfield, Bradford D. Jordan. Fundamentals of Corporate Finance (ISE), 第12版，2019年(華泰文化)，ISBN-13: 9781260091908。\n3. 俞海琴、陳隆麒，「財務管理概論」，2版修訂，2014年（華泰文化），ISBN-13: 9789576099328。\nReference：\n1. Stephen A. Ross, Randolph W. Westerfield, Jeffrey F. Jaffe, Bradford D. Jordan. Corporate Finance: Core Principles and Applications. 第6版，2021年 (華泰文化)，ISBN-13: 9781260571127。\n2. Stephen A. Ross, Randolph W. Westerfield, Bradford D. Jordan. Essentials of Corporate Finance. 第10版，2020 (華泰文化)，ISBN-13: 9781260565560。 \n3. Richard A. Brealey, Stewart C. Myers, Alan J. Marcus. Fundamentals of Corporate Finance. 第10版，2020年 (華泰文化)，ISBN-13: 9781260566093。\n4. 徐俊明著，「財務管理：基礎與應用」，3版修訂，2018年2月13日（新陸書局）。\n5. 謝劍平著，「財務管理原理」，第八版，2019年2月25日（智勝文化）。","foreignLanguageTextbooks":true}]
