[{"name":"陳匡正","email":"kchen34@gmail.com","latestUpdate":"2020-08-24 12:53:59","objective":"本課程講授如何使用Westlaw International資料庫進行IP研究。主要的專利資料庫的檢索方式也會展示。在每堂課前，學生必須要閱讀教材。課堂參與是必須的。其他資訊請見英文課程摘要。\nThis course is intended to expose students to various research skills for studying IP issues. Primarily, this course teaches how to use the Westlaw International database to do IP research. The framework of the database is based on the legal research methodology applied to American law. So, the basic knowledge of the American legal research methodology will be introduced. In addition, this course will demonstrate major patent databases to students. Students will be assgined to one research project. Students are required to study reading materials before each class. Class participation is also required.","schedule":"第一週 (109/9/14~109/9/19) Introduction; Writing the Sequence of Assignments #1 (Secondary Sources)\n第二週 (109/9/21~109/9/26) Westlaw International Database Training\n第三週 (109/9/28~109/10/3) Fundamentals of Legal Reasoning; Hand in the Sequence of Assignments #1 (Secondary Sources)\n第四週 (109/10/5~109/10/10) The Process of Legal Research; Review the Sequence of Assignments #1 (Secondary Sources: Common Law); Hand in the Sequence of Assignments #1 (Common Law)\n第五週 (109/10/12~109/10/17) Introduction of the \"Bluebook: A Uniform System of Citation\" (I); Writing the Sequence of Assignments #1 (State Statutes)\n第六週 (109/10/19~109/10/24) Introduction of the \"Bluebook: A Uniform System of Citation\" (II); Preview and Writing the Sequence of Assignments #1 (Federal Law); Hand in the Sequence of Assignments #1 (State Statutes)\n第七週 (109/10/26~109/10/31) Introduction of the \"Bluebook: A Uniform System of Citation\" (III); Preview and Writing the Sequence of Assignments #1 (Administrative Law); Hand in the Sequence of Assignments #1 (Federal Law)\n第八週 (109/11/2~109/11/7) Introduction of the \"Bluebook: A Uniform System of Citation\" (IV); Review the Sequence of Assignments #1 (State Statutes: Administrative Law); Hand in the Sequence of Assignments #1 (Administrative Law)\n第九週 (109/11/9~109/11/14) Introduction of the \"Bluebook: A Uniform System of Citation\" (V)\n第十週 (109/11/16~109/11/21) Preview and Writing the Sequence of Assignments #2 (State Statutes)\n第十一週 (109/11/23~109/11/28) Overview of the U.S. Legal System\n第十二週 (109/11/30~109/12/5) Preview and Writing the Sequence of Assignments #2 (Administrative Law); Review the Sequence of Assignments #2 (State Statutes: Federal Law)\n第十三週 (109/12/7~109/12/12) Preview and Writing the Sequence of Assignments #2 (Secondary Sources); Hand in the Sequence of Assignments #2 (Common Law)\n第十四週 (109/12/14~109/12/19) Review the Sequence of Assignments #2 (Administrative Law); Hand in the Sequence of Assignments #2 (Secondary Sources)\n第十五週 (109/12/21~109/12/26) Review the Sequence of Assignments #2 (Secondary Sources); Hand in the Sequence of Assignments #2 (Common Law)\n第十六週 (109/12/28~110/1/2) Review the Sequence of Assignments #2 (Common Law)\n第十七週 (110/1/4~110/1/9) Review of the Course\n第十八週 (110/1/11~110/1/16) Final Exam","scorePolicy":"1.平時課後作業 50%\n2.上課出席 20%\n3.期末考試 30%","materials":"1.McKinney, Ann Ruth &amp; Childs, Scott, Legal Research: A Practical Guide and Self-Instructional Workbook (Thomson/West, 5th ed. 2008).\n2.McKinney, Ann Ruth, Childs, Scott, Flanary-Smith, Amy, Legal Research Online: A Supplement to Accompany McKinney and Childs' Legal Research, Fifth Ed (Thomson/West, 5th ed. 2008).\n3.The Bluebook: A Uniform System of Citation (The Harvard Law Review Association, 20th ed. 2015).","foreignLanguageTextbooks":true}]
