[{"name":"林榮禾","email":"rhlin@ntut.edu.tw","latestUpdate":"2020-07-29 11:33:42","objective":"創新管理課程主要對象為有興趣從事企業創新發明機會或技能的學生們。此課程不僅介紹基礎發明工具而且提供課程上實際演練。主要內容包含如何辨識企業創新機會與問題；發現新點子；發展最適解答；展示創新成果與萃思方法介紹。課程上也會提出許多相關企業的應用實例討論。\n其目的在於幫助學生們學習了解創新工具與系統創新方法在創新管理的專業領域及利用課程上的創新工具或取更好的工作機會\nInnovation Management course focuses on the particular interest to those\nstudents who are considering development of an innovative business opportunity or innovation management skills. This course not only discusses the basics toolkits for every innovator needs, but also provides the practice workshop of systematic innovation. Major topics include how to identifying the opportunity and problem; discover the new ideas; develop the solution; demonstrate the innovation; and the TRIZ works. Many of the examples will also be discussed in their entrepreneurial approaches to innovation.\nObjective: To develop an understanding of innovation toolkits and systematic innovation\napproach to help students making better understanding in innovation management and equipping with the innovation skills needed to pursue a viable career option.","schedule":"Week Date Contents/Topic\n1 Introduction to Innovation Management\n2 Define the Opportunity\n3 Define the Opportunity\n4 Workshop\n5 Define the Problem\n6 Define the Problem\n7 Discover the new ideas;\n8 Discover the new ideas;\n9 Discover the new ideas;\n10 Midterm Exam &amp; Project Proposal\n11 TRIZ-1\n12 TRIZ-2\n13 TRIZ-3\n14 TRIZ-4\n15 TRIZ-5\n16 Workshop\n17 Term Project Presentation\n18 Term Project Presentation","scorePolicy":"Description of Course Details:\n1. Homework and Assignments: 30 %\n2. Quizzes: 10 %\n3. Attendance  20 %\n4. Midterm Project Proposal 5 %\n5. Term Project: 35%","materials":"1. Mam, D.L., “Hands-On Systematic Innovation,” 3 edition, Thomson Higher\nEducation, 2006.\n2. Silverstein, D., Samuel P., and Decarlo, N., “The Innovator's Toolkit: 50+\nTechniques for Predictable and Sustainable Organic Growth,” 2nd edition, John\nWiley &amp; Sons, 2012.\n3. Strategic Management of Technological Innovation, 4th Edition, M.S. Schilling, McGraw-Hill, 2012.","foreignLanguageTextbooks":true},{"name":"陳協慶","email":"cyutchen@ms28.hinet.net","latestUpdate":"2020-06-20 17:33:46","objective":"產品研發創新管理課程主要對象為有興趣從事企業產品研發創新發明機會或技能的學生們。此課程不僅介紹基礎發明工具而且提供課程上實際演練。主要內容包含如何辨識企業產品研發創新機會與問題；發現新點子；發展最適解答；展示創新成果與萃思方法介紹。課程上也會提出許多相關企業的應用實例討論。 其目的在於幫助學生們學習了解創新工具與系統創新方法在產品研發創新管理的專業領域及利用課程上的產品研發創新工具或取更好的工作機會\nProduction R&amp;D Innovation Management course focuses on the particular interest to those students who are considering Production R&amp;D development of an innovative business opportunity or innovation management skills. This course not only discusses the basics toolkits for every innovator needs, but also provides the practice workshop of systematic innovation. Major topics include how to identifying the opportunity and problem of Production R&amp;D; discover the new ideas; develop the solution; demonstrate the innovation; and the TRIZ works. Many of the examples will also be discussed in their entrepreneurial approaches to Production R&amp;D innovation. Objective: To develop an understanding of innovation toolkits and systematic innovation approach to help students making better understanding in Production R&amp;D innovation management and equipping with the innovation skills needed to pursue a viable career option.","schedule":"Week_1: Apply anthropometry data in design\nWeek_2: Ergonomics evaluation  of products\nWeek_3: Man-machine interface\nWeek_4: Workstation and tool design \nWeek_5: MSD prevention and work design\nWeek_6: KIM &amp; workload assessment\nWeek_7~18: Prof. Lin's","scorePolicy":"Project &amp; report 30%, Quiz 20%","materials":"Handouts","foreignLanguageTextbooks":false}]
