[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2020-06-05 08:36:35","objective":"This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of interaction design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the profession of interaction design. Therefore, one of the aims of this course is to construct multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate on an interactive media design project. It may execute interaction design by working with the form of the case study or design creation.","schedule":"Design studio helps to develop student’s research abilities to identify problems, envision current and future needs, and provide validated solutions to these problems and needs through interaction design.\n\nWeek 01-03  Introduction\nWeek 04-09  Problem 1\nWeek 10-18  Problem 2","scorePolicy":"Participation &amp; Final Project","materials":"Kim Erwin, Communicating the New, Methods to Shape and Accelerate Innovation, John Wiley and Sons, Inc. 2014","foreignLanguageTextbooks":true},{"name":"陳圳卿","email":"cceugene@ntut.edu.tw","latestUpdate":"2020-09-09 19:36:02","objective":"1. 本專題為教育部第二期大學社會責任實踐 (簡稱USR) 計畫 - 原住民部落安居構築與綠色樂業推動計畫中的一個主軸，目標為透過互動科技的輔助，提升本計畫所協助新竹縣尖石鄉原住民部落創建之「石磊友善蔬菜」客戶認同度，以提升品牌之價值。\n2. 本專題採兩人一組共同執行一個題目的方式進行，小組成員必須為不同學習專業背景或國籍，預期成果為提出一個具可行性的創新提案。\n(1)品牌分析與現況調查：分析品牌屬性、場域地理特質、目標族群及目前的商業模式與流程。藉由現狀問題的了解，才能提出解決方案。\n(2)情境脈絡調查：對於人的了解永遠是互動設計的第一要務。針對可能的潛在客戶或現有客戶進行一手資料的蒐集，以掌握目前的問題點與可能的設計需求。\n(3)構想提案展開與修正：針對需求訂定明確的設計指標，並開始著手進行概念設計。本專題產出目標為提出具體的構想提案，必要時佐以Lo-Fi Prototype進行說明或驗證。內容可能涵蓋該設計所運行的商業情境、所提供的產品、服務、功能、運作的時間、與顧客的互動模式與流程、接觸點等。當然，你的概念具有什麼樣的創新思維、應用什麼樣的新科技、能創造什麼樣的價值等等，都是互動設計的核心工作。\n本專題執行需具體應用訪談、觀察、問卷或其他相關於使用者研究的方法或工具(例如顧客旅程地圖等)，並與計畫執行人員互動討論。過程中可能依實際需要至石磊部落進行田野調查 (單程2.5小時)。\n\n1. This topic is based on the second phase of the Ministry of Education's University Social Responsibility (USR) Project - Aboriginal Tribes Settlement Construction and Green Agriculture Project. Based on the brand \"ATAYAL Jian-Shi Agriculture\" of aboriginal tribes in Jian-Shi, Hsinchu County, which was also built by this project, we plan to create more customer recognition, further with the aim to enhance the brand’ value through interactive technologies.\n2. This topic will be carried out in a team of two students. The team members must have different professional backgrounds or nationalities, and the expected result is to put forward a feasible innovative design proposal。\n(1) Brand analysis and current situation investigation: analyzing brand attributes, geographic characteristics, target audiences, and current business models and processes. Only by understanding critical issues can solutions be proposed.\n(2) Contextual survey: understanding people is always the first priority in interaction design. Collecting first-hand information for potential customers or existing customers to uncover the current problems and possible design requirements.\n(3) Development and revision of concept proposal: setting design criteria for user requirements, and proposing conceptual design. The goal of this topic is to put forward specific ideas and proposals, with Lo-Fi Prototype for explanation or verification when necessary. The content may cover the business context in which the idea is operated, the products, services, features, time, interactive methods and processes with customers, and touch points…etc. Surely, what kind of innovative thinking your concept has, what new technology you apply, what value it can create, etc., are the most critical issues of interaction design.\nThe implementation of this topic may requires interviews, observations, questionnaires, or other methods or tools related to user research (such as customer journey maps, etc.), and discussions with project staffs. During the process, you may need to go to the Quri tribe for field studies (2.5 hours one way).","schedule":"1. Week 1 (109/9/15) 課程介紹：集合完成分組，並開始分配與進行小組成員的工作。\n2. Week 2 (109/9/22) 現況問題彙整：各組彙整現況調查的結果，小組間互相交換蒐集到的資訊。預期各小組選定聚焦的問題痛點並開始進行使用者研究。\n3. Week 3 (109/9/29) 使用者研究：完成與分享小組獲得的使用者研究資訊，例如觀察到的現象，訪談到的意見等。如有不確定處再進一步探索。\n4. Week 4 (109/10/6) 問題定義與需求：確認問題的範疇與可能的需求以做為設計提案展開的準備。\n5. Week 5 (109/10/13) 設計提案：提出針對問題與需求發展的設計方案。必要時以擬定測試計畫以確定可行性。\n6. Week 6 (109/10/20) 設計提案完成與彙整：針對前階段的結果進行概念的收斂，以提出具可行性的方案。\n7. Week 7(109/10/27) 成果發表：彙整各組的成果提案並發表。\n\n1. Week 1 (109/9/15) Course introduction: Grouping and starting to assign work to team members.\n2. Week 2 (109/9/22) Exploring existing problems: Collecting and sharing all information related to current situation. It is expected that each group will select the problem and pain points to focus on and start user study.\n3. Week 3 (109/9/29) User study: Completing and sharing user study information collecting from observation or interviews. If in doubt, explore further.\n4. Week 4 (109/10/6) Verifying problems and user requirements: Confirming the scope of the problems and possible requirements to prepare for the design proposal.\n5. Week 5 (109/10/13) Proposing design concept: Proposing design solutions for the problems and needs. If necessary, conducting a test to ensure feasibility.\n6. Week 6 (109/10/20) Final refinement: Converging concepts to come up with final solutions.\n7. Week 7(109/10/27) Presentation: Proposing design concepts.","scorePolicy":"Participation &amp; Final presentation","materials":"N/A","foreignLanguageTextbooks":true},{"name":"韓秉軒","email":"robert19881004@gmail.com","latestUpdate":"2020-06-12 15:16:28","objective":"This course aims to explore the fields of interaction design, interactive media, and interactive art. With workshops, panel discussions, case studies and design practices, students are expected to learn research, analysis and prototyping skills. The aim of this course is to integrate different disciplines ranging from computer science, mechatronics, architectural design, industrial design, graphic design, and art, so as to foster the professional of interaction design. Therefore, one of the aims of this course is to provide a multidisciplinary learning environment that encourages students to collaborate to explore an innovative application of interaction design.","schedule":"Week 1-6 Exploration, collaboration &amp; group project\nWeek 7-18 Individual research/project development","scorePolicy":"Participation &amp; Final Project","materials":"None","foreignLanguageTextbooks":false}]
