[{"name":"郭五鳳","email":"ckuo66ntut@ntut.edu.tw","latestUpdate":"2020-06-09 14:48:32","objective":"The objective of this course is to enhance graduate students’ knowledge and capability in global marketing management and innovative business strategies. The 21st century business is driven by the third computing platform (i.e. mobile computing, social media, cloud computing, and the big data analysis). Although consumers have already changed the ways of searching, transforming, delivering and consuming marketing information and solutions, the enterprises’ strategies in marketing should take into consideration the 4P's, business innovation, marketing innovation, marketing investment, customer relationship management, and social awareness and responsibilities. They should also include contents of advanced planning, aggressive management and effective execution. The goals of this course are to understand 1) the dynamic challenges of the global market trend, 2) the up-to-date insights on customer preferences, and 3) the decision making process on value creation, in particular. We will have discussion on case studies, research theories and methodology deployment.","schedule":"Class　　Month　　Date　　Topic　　Note\n1　　Sep.　　14　　Global marketing management &amp; innovative business strategies.　　Introduction &amp; References\n2　　　　21　　Global economic environment　　\n3　　　　28　　Global political/legal/regulatory environments　　\n4　　Oct.　　05　　Global cultural environment　　\n5　　　　12　　Capturing marketing insights &amp; customers　　\n6　　　　19　　Marketing information systems &amp; research, Segmentation/targeting/positioning　　\n7　　　　26　　Marketing Project Research　　\n8　　Nov.　　02　　Industry Case Study &amp; Report　　\n9　　　　09　　Mid-term exam.　　Midterm Exam.\n10　　　　16　　Global entry &amp; expansion strategies　　.\n11　　　　23　　Competitive analysis&amp; strategy　　\n12　　　　30　　Product and Pricing decisions　　\n13　　Dec.　　07　　Global marketing channels　　\n14　　　　14　　Global integrated marketing communications　　\n15　　　　21　　Global organization and leadership　　\n16　　　　28　　Global corporate social responsibility　　\n17　　Jan./2021　　04　　Industry Case Study &amp; Report　　\n18　　　　11　　Final Exam.　　Final Exam","scorePolicy":"These assignments will involve a team project presentation and an individual presentation, which will be graded 30 % for the mid-term and 40% for the final exam. The remaining 30% of the total grade is for students’ attendance.","materials":"1)　　International Marketing, Cateora, Gilly, Graham, Money, McGraw-Hill\n2)　　Marketing of High-Technology Products &amp; Innovations Mohr. et. el. 3e\n3)　　Harvard Business Review\n4)    MIT Technology Review\n5)    The Economist","foreignLanguageTextbooks":true}]
