[{"name":"曹筱玥","email":"sytsau@ntut.edu.tw","latestUpdate":"2020-06-17 18:08:40","objective":"年來，在世博和花博兩大活動的帶動下，讓跨領域整合的「展示科技」成為新的研究焦點；新型態的展示手法，可以被應用在博物館及展場、商業空間、互動式機台、行銷活動和數位藝術。依照需求的不同，可以把展示科技分成『會場環境』和『觀眾體驗』兩類，前者就像是基礎建設、活動系統和周邊系統，而後者則是為觀眾創造全新體驗。而本課程則是為了掌握產業界相關的技術新知、學術界的專業研究與藝文界的脈動，本課程將廣邀展示科技的專家或學者，參與專題討論，就展場設計、互動技術、視覺呈現等面向，翻轉你與展示物的關係，體現創意展現的軟實力。\nThe promotion of Expo and Flora Expo in recent years makes the display technology a new focus in study. New pattern of display techniques can be applied to museum, exhibition, commercial space, interactive machinery, marketing and digital art. Depending on different needs, the Display Technology can be divided into two categories, which are \"the environment of exhibition\" and \"the experience of audience\". The former is like fundamental constructions, movable system, and peripheral system; the latter is like building a new and fresh experience for the audience. To understand science and technological information from business field, researches from academic field and issues from arts field, this course should be invited the expertise and scholars to participate the topic discussion.","schedule":"週 數　　單元名稱　　地點\n1　　課程說明 + 作業分配 + 選小老師　　六教B216\n2　　\"碩論研究：學長姐分享\n (新媒體藝術展演科技與觀眾互動體驗研究 )\"　　六教B216\n　　展示科技案例分享: Siggraph　　\n3　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　六教B216\n4　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　六教B216\n5　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　六教B216\n6　　9:30展覽參訪 (台北市立美術館)　　 (捷運圓山站)\n7　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　六教B216\n8　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　六教B216\n9　　展示科技特論文獻Paper閱讀報告 (一頁A4)　　　　六教B216\n10　　\"互動展示觀察報告： \n1.未來博物館的微觀趨勢 \n2.當古文明展遇到科技\n3.廢墟與新媒體展示 \"　　請試由新媒體互動展示及觀眾體驗兩部份提出三個業界趨勢，並由互動角度如何呼應此三個趨勢\n11　　9:50展覽參訪 – 台北數位藝術節 　　待確認\n12　　期末小論方向報告PPT(影像與展場空間提案規劃)　　六教B216\n13　　\"專題演講: 王明道（樂意非凡 創意總監）\n展示科技在商務上之應用及實例分析 – 以房地產為例\"　　六教B216\n14　　全球各國新媒體藝術競賽與展演介紹 　　六教B216\n　　布拉格2015 Signal Festival　　\n15　　互動媒體與智慧空間 (國外　　智慧空間與媒體建築)　　六教B216\n16　　期末作業上台報告(作業)　　六教B216\n17　　期末作業上台報告(作業)　　六教B216\n18　　紙本報告繳交至老師信箱","scorePolicy":"評分方式：30% 出席 ，20% 上台報告 ，50% 期末研究","materials":"1. 曹筱玥等5人合著（2014）新媒體藝術展演科技與觀眾互動體驗研究，故宮\n2. 黃心健（2013）科技蜃樓，大塊文化\n3. 中英文期刊論文選讀：請小老師統計與分配（電子檔為主）","foreignLanguageTextbooks":false}]
