[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2020-06-08 12:07:31","objective":"This course is about using data to make decisions. Recent years have seen an explosion of the amount of data available to everyone, and making sense of that data has become an operational imperative. The tools of statistics are one of the ways we can make sense of the data and use it to make more effective decisions. The aim of this course is to learn how to make decisions and solve problems through efficient decision-making skills and data mining techniques based on data. Specifically in this course we will discuss basic probability theory and its use as a basis for inferential statistics, discuss efficient decision-making techniques, and develop ability in the use of MINITAB for decision-making analysis.","schedule":"Week 1 Introduction to data analysis for decision-making\nWeek 2 Random variables, mean, median, standard deviation, and variance\nWeek 3 Correlation and covariance: MINITAB practice and interpretation\nWeek 4 Hypothesis tests – Part I\nWeek 5 Hypothesis tests – Part II: MINITAB practice and interpretation\nWeek 6 Simple linear regression – Part I\nWeek 7 Simple linear regression – Part II: MINITAB practice and interpretation\nWeek 8 Interim report – Presentation of individual (or team) project\nWeek 9 Interim report – Presentation of individual (or team) project\nWeek 10 Multiple linear regression – Part I\nWeek 11 Multiple linear regression – Part II: MINITAB practice and interpretation\nWeek 12 Classification – Part I: Logistic regression, MINITAB practice and interpretation\nWeek 13 Classification – Part II: k-NN, MINITAB practice and interpretation \nWeek 14 Classification – Part III: SVM, MINITAB practice and interpretation\nWeek 15 Clustering – Part I: Hierarchical clustering, MINITAB practice and interpretation\nWeek 16 Clustering – Part II: Nonhierarchical clustering, MINITAB practice and interpretation\nWeek 17 Final presentation of individual (or team) project\nWeek 18 Final presentation of individual (or team) project","scorePolicy":"Individual projects: 60 %\nAssignment : 30 %\nAttendance: 10 %","materials":"Data analysis and decision making , 4th Ed. by Albright, Winston, and Zappe\nEngineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)","foreignLanguageTextbooks":true}]
