[{"name":"郭政淳","email":"kuojona@gmail.com","latestUpdate":"2020-07-10 15:59:48","objective":"在此全球化之際，一種文化所發出的訊息很可能得從另一種文化來解讀，其間需要對於情境、語境、社會文化背景的熟悉與高度認知，通過這種高度認知方能瞭解整體篇章的意義。由於英文是國際企業的通用語言，因此現今全世界的英文教育都在戮力納入全球組織語言的系統性探討。此課程目標在於討論英語語用學在傳播與企業等領域的可能應用，同時培養思辯能力。此課程可能包含的議題如下：\n 　　道地英語/文對於英文學習在語言及文化上的挑戰\n 　　英語媒體和企業語言中的隱約/間接/譬喻表達用法\n 　　社會文化經驗與事件交互作用下的情境語感及意義變化\n 　　英語社會中新型態媒體的實際與象徵層面\n 　　資訊廣告類型如何合併資訊與說服以達意圖效果\n 　　跨文化情境中語用模式的策略契合與積極修飾\n 　　多國企業之多重語言/文化團隊所亟需之溝通技巧\nIn the wake of globalization, a message encoded in one culture may have to be decoded in the other, which entails the ability of making sense of a discourse through a strong awareness of language pragmatics in contextualization. English as the language for international communication has made English education worldwide strive to incorporate a systematic exploration of global organizational language. This course aims to address the potential applications of English pragmatics to fields such as media and business and simultaneously develop awareness for critical thinking, which may include the following topics: \n 　　The linguistic and cultural challenges of naturally-occurring English to EFL comprehension;\n 　　The covert/indirect/figurative use of expressions in English-language media and corporate discourses; \n 　　The contextual senses and variations in meaning of a discourse based on the matrix of sociocultural experiences and occurrences;\n 　　The pragmatic and symbolic dimensions in the","schedule":"Week 1　　Course Introduction\nWeek 2　　Semantics vs. Pragmatics \nWeek 3　　Referring, Denoting, and Expressing\nWeek 4　　Word Senses \nWeek 5　　Lexical Sense Relations\nWeek 6　　Maxims of Conversation \nWeek 7    Speech Acts\nWeek 8　　Language and Politeness / Language and Humor\nWeek 9　　Discourse Analysis / Conversation Analysis\nWeek 10  Research Topic: Demo \nWeek 11  Research Topic (I): Language and Politeness\nWeek 12　　Research Topic (II): Language and Humor\nWeek 13　　Research Topic (III): Conversation Analysis\nWeek 14  Research Topic (IV): Figure of Speech\nWeek 15  Research Topic (V): Inter-language Pragmatics \nWeek 16　　Research Topic (VI): Others\nWeek 17　　Term Project Presentation \nWeek 18　　No Class (Term paper due)","scorePolicy":"Reading Feedback: 20 %\nIn-class Activities: 20 %\nPresentation on Research Topics: 30 % \nTerm Project: 30 %","materials":"Assigned Readings will be accessible on the course website (i.e. 北科i學園).","foreignLanguageTextbooks":false}]
