[{"name":"杜敏誠","email":"mtu@ntut.edu.tw","latestUpdate":"2020-09-10 17:11:51","objective":"本課程目標為為土木主修之學生簡述人類與環境之相互關係。本靠程將從生態學與環境生態學之基本概念開始，介紹歷史上人類對環境造成的影響。課程最後將談到人類如何以環境管理系統，法制系統，與國際條約來管理此等問題。\n\nThe goal of this class is to introduce the interaction between the environment and human activities to students with civil engineering majors. Beginning with principles of ecology and environmental ecology, the course will first introduce the influences and impacts of human activities on the environment throughout human history. In the end, the class will talk about how human deals with this problem today by environmental management systems, legal systems, and international treaties.","schedule":"以下進度為暫定:\nWeek 1 (9/16) 學生與教師自我介紹，課程簡介，Q&amp;A\nWeeks 2-3 (9/23-30) 生態學簡介\nWeeks 4-6 (10/7-21) 環境生態學簡介\nWeek 7 (10/28) 期中考，簡報技巧\nWeeks 8-11 (11/4-25) 人類造成之環境問題\nWeek 12 (12/2) 環境管理系統\nWeek 13 (12/9) 環境影響評估\nWeek 14 (12/16) 國際條約與環境法規\nWeeks 15-16 (12/23-30) 期末報告\nWeek 17 (1/6) 期末總整理\n\nTentative schedule:\nWeek 1 (9/16) Self-introductions, introduction to the course, Q&amp;A\nWeeks 2-3 (9/23-30) Introduction to ecology\nWeeks 4-6 (10/7-21) Introduction to environmental ecology\nWeek 7 (10/28) Midterm exam, presentation skills\nWeeks 8-11 (11/4-25) Human-induced environmental issues\nWeek 12 (12/2) Environmental management systems\nWeek 13 (12/9) Environmental impact assessment\nWeek 14 (12/16) International treaties and environmental laws\nWeeks 15-16 (12/23-30) Presentations\nWeek 17 (1/6) Review of the semester","scorePolicy":"傳統課堂講授加上精選的短片與針對專題之課堂討論將為本課程之主要教學方式。學生將被分組已對一個區域性的環境問題做研究，並在期末做15-20分鐘左右之報告。不須繳交期末報告。\n\n課程內容將為全英文，但所有課堂之口頭溝通將混合標準中文與英文進行。\n\n課堂討論將作為期末加減分之依據。在每一堂課開始前請做好要開口的準備。\n\n25% 期中考\n35% 期末考\n30% 期末報告(5%投影片設計，5%報告流暢度，10%內容，10%簡報技巧)\n10% 出席統計\n\nTraditional lectures plus selected video clips and discussion on certain topics will be the main pedagogic tools in this class. Students will be broken into teams. Each team will research one regional environmental issue and present its findings in 15-20 minutes at the end of the semester. No written report is required. \n\nClass materials will be in English,but all oral communication will be a mixture of English and Mandarin.\n\nDiscussions in the classroom will be used as the basis to add/subtract final grades. Please be prepared for oral discussions before each class.\n\n25%　　Mid-term exam\n35%　　Final exam\n30%　　Presentation (5% Slide design，5% Flow of the presentation，10% Contents，10% Presentation skills)\n10%　　Attendance","materials":"教師自行整理之內容\nMaterials prepared and summarized by the lecturer","foreignLanguageTextbooks":false}]
