[{"name":"黃光廷","email":"alexkthuang@gmail.com","latestUpdate":"2020-06-01 10:39:44","objective":"本堂課主要在於從全球化與在地化的角度探討當代建築與都市設計中的重要理論、案例與關鍵課題，尤其藉由回溯其自二十世紀初以來的發展歷史，本課程將聚焦於一系列具有代表性的建築師與設計作品，透過他們在建築與都市設計上的專業實踐來反思當代人類社會所面臨的各種挑戰與機會。\n具體本課程將透過案例討論與分析的方式來進行，所有學生將對於指定案例進行獨立研究，並應用課堂所教授之方法與工具對於該案例進行理論與空間構成的分析性評論，最終再彙整成一份完整的評述報告。案例分析的內容將需要包括以下四個重點：一、時空背景如何對於建築與都市設計之實踐造成影響？二、空間生產的過程與結果如何回應真實社會的需求？三、如何從空間構成的角度反思設計之於空間的意義與價值？四、該案例如何影響未來建築與都市設計之發展趨勢？\n在分析工具的部分，本課程針對建築與都市設計兩種不同的尺度將分別著重於兩種不同面向的分析：在建築尺度的案例上主要的重點在於空間的組織性，實際操作則是以距離、深度與視野等不同元素的比較分析為主；在都市設計尺度的案例上重點則在於空間的序列性，透過軸線、區段與使用分析對於都市型態的轉變與演化提出反思。\n\n課外輔導時間: 周二 13:00-14:00\n\nThe course aims to analyze contemporary ideas, ideologies, and projects of architecture and urban design in the context of both globalization and specific local contexts. By tracing the development back to the early 20th century, the work and thinking of influential architects will be examined in terms of their reflection on current challenges in our profession and society. \nThe main content of this course will be delivered through case study. In specific, all students are expected to make analytic comments on assigned cases by applying tools taught in class. Four interrelated issues are to be focused: 1. Context of professional practice; 2. Production of space in relation to so\n\nOffice Hour: Tuesday 13:10-14:00","schedule":"1. Defining the Space\n2. Form and Order of Space\n3. Perception and Configuration of Space\n4. Spatial Typology \n5. Methods of Spatial Analysis I\n6. Methods of Spatial Analysis II \n7. Case Study Seminar I\n8. Case Study Seminar II\n9. Mid-term Presentation\n10. Methods of Computational Analysis I\n11. Methods of Computational Analysis II\n12. Case Study Seminar III\n13.Case Study Seminar IV\n14. Workshop\n15. Pin-up Critique I\n16. Pin-up Critique II\n17. Final Presentation I\n18. Final Presentation II","scorePolicy":"10% Attendance\n20% Participation\n30% In-class Presentation\n40% Research Project (Presentation/Report)\n\nOffice Hour: Tuesday 13:10-14:00","materials":"Rybczynski, W. (2010). Makeshift Metropolis: Ideas about Cities. New York: Scribner.\nKaijima, M., Kuroda J. and Tsukamoto Y. (2001). Made in Tokyo. Tokyo: Kajima Institute Publishing Co.\nHillier, B. (1996). Space is the Machine: A Configurational Theory of Architecture. London: Space Syntax. \nAl-Sayed, K. (2014). Space Syntax Methodology. London: Bartlett School of Architecture, UCL.","foreignLanguageTextbooks":true}]
