[{"name":"曾俊儒","email":"ktseng@pddlab.org","latestUpdate":"2020-06-13 08:33:00","objective":"Sustainable development is defined by Brundtland Report (1987) as “development that meets the needs of the present without compromising the ability of future generations to meet their own needs.” There are 17 Sustainable Development Goals (SDGs) build on the successes of the Millennium Development Goals, while including new areas such as climate change, economic inequality, innovation, sustainable consumption, peace and justice, among other priorities. The 17 SDGs came into effect in January 2016, and they will continue to guide UNDP policy and funding until 2030. This course aims to explore alternative conceptions and theoretical underpinnings of the notion of “sustainable development.” It focuses on the sustainability problems of industrial countries, especially in Taiwan such as aging of populations, sustainable consumption, etc. It intends to use IPDD approach systematically to explore the sociology of knowledge around sustainability, the economic and technological dimensions a","schedule":"Course introduction\nOverview of an innovative product design and development approach \nLecture (I): Identifying opportunities\nLecture (II): Understanding opportunities\nLecture (III): Conceptualising opportunities\nLecture (IV): Realising opportunities\nMethodology: IPDD approach\nCase and field study (I): Group discussion\nCase and field study (II): Group discussion\nWorkshop (I): Key market issues\nWorkshop (II): Key market positioning\nWorkshop (III): Target competitor products\nWorkshop (IV): Positioning map\nWorkshop (V): Design proposals","scorePolicy":"Class presentation/discussion: 30%\nClass participation: 10%\nFinal project: 30%\nEight-page paper: 30%","materials":"•　　Reading pack.\n•　　Ulrich KT, Eppinger SD, 2003. “Product Design and Development”, McGraw-Hill.\n•　　Kelley T, 2005. “The Ten Faces of Innovation”, Doubleday.\n•　　Kelly T, 2001. .“The Art of of Innovation”, Doubleday.\n•　　Ries E. (2011). The Lean Startup: How Today’s Entrepreneurs Use Continuous Innovation to Create Radically Successful Businesses. Crown Publishing Group, New York, NY.","foreignLanguageTextbooks":true}]
