[{"name":"林欽隆","email":"link6636@yahoo.com.tw","latestUpdate":"2020-06-17 13:55:04","objective":"海洋環境是人類賴以生存和發展的自然環境的重要組成 部分，包括海洋水體、海底和海面上空的大氣，以及與海洋密切相關，並受到海洋影響的沿岸和河口區域。海洋環境問題的產生，主要是人們在開發利用海洋的過程中，沒有考慮海洋 環境的承受能力，低估了自然界的反作用，使海洋環境受到不同程度的損壞。首先是向海洋排放污染物；其次是某些不合理的海岸工程建設，給海洋環境帶來的嚴重影響；第三是對水產資源的濫捕，對紅樹林、珊瑚礁的亂伐亂採，也危及到生態平衡。上述問題的存在已對人類生產和生活均構成了嚴重威脅。為此，海洋環境保護問題已成為當今全球關注的熱點之一 。\n本課題是當今全世界共同關心的課題之一，網路資訊眾多，從聯合國環境署（UNEP）、美國海洋大氣總署（NOAA）及Green Peace Marine Conservation等眾多推廣，培養學生的海洋倫理意識並與海洋生態保育的理念接軌是本課程目標。\nThe marine environment is an important part of mankind's survival and development of the natural environment, including marine waters, seabed and over the sea, the atmosphere, and is closely related with the ocean, and by the marine influence coastal and estuarine areas. Generation of marine environmental issues, people in the process of development and utilization of the ocean, without considering the capacity of the marine environment, underestimated the nature of the reaction, the marine environment are subject to different degrees of damage. The first is the discharge of pollutants to the ocean; followed by some unreasonable Coastal Construction, the serious impact to the marine environment; aquatic resources from over-exploitation, the indiscriminate logging Luancai mangroves, coral reefs, and also endangering the ecological balance. The presence of the above problems pose a serious threat to human life and production. For this reason, the issue of protection of the marine environ","schedule":"第1週：課程介紹及準備\n第2週：緒論\n第3週：海洋環境與資源\n第4週：海洋環境與資源(生物資源)\n第5週：海洋環境與資源(非生物資源)\n第6週：海洋環境破壞與危機-(海洋的天然災害)\n第7週：海洋環境破壞與危機-(不願面對的真相影片研討)\n第8週：海洋環境破壞與危機-(An Inconvenient Truth  AL GORE）\n第9週：海洋環境破壞與危機-(海洋的人為災害)\n第10週：海洋環境破壞與危機-海洋污染的種類與防治。\n第11週：海洋環境破壞與危機-海洋垃圾與處理\n第12週：環境災害的應變與復原\n第13週：海洋漁業資源的開發濫捕與危機-1\n第14週：海洋漁業資源的開發濫捕與危機-「魚線的盡頭」影片欣賞\n第15週：海洋漁業資源的開發濫捕與危機-海洋漁業資源的開發及管理\n第16週：能源與環境\n第17週：海洋環保與海洋經濟產業 \n第18週：綜合討論與結論","scorePolicy":"本課程不進行期中、期末考試，成績以同學自第3週起，對各週研討議題選擇兩個主題，就發生案例，提出研析報告。該項報告須以Powerpoint於上課前一天22.00前e-mail給授課老師，並於次日上課時發表討論，每次發表佔學期成績40%。未如期提送報告及事後有補繳者，酌扣分數。\n課程中兩次影片欣賞與研討，每次看完影片需撰寫心得報告，心得報告以A4 WORD 14號字格式撰寫，以A4紙2頁為原則，每次心得報告佔10%。\n本課程注重學員平日之參與及討論，除增益同學海洋環境保護及永續發展知識外，更旨在培訓同學蒐集資料，組合資訊及發表所知之能力。","materials":"海域管理與執法，林欽隆著，2016年11月28日，五南圖書出版股份有限公司\n台灣海洋，許惠等主編，行政院海岸巡防署發行，2005年8月10日出版。\n海洋政策白皮書，行政院海洋事務推動委員會編著，行政院研考會發行，2006年4月出版。。\n「海洋環境」，邱文彥（1998a），海洋戰略研討會論文。中華戰略學會、中國航運公司、國立台灣海洋大學等主辦。台北，聯勤信義俱樂部，1998年10月6日。\n「海洋立國的基礎：海洋與海岸整體管理的跨世紀課題」，邱文彥（1995），中華民國都市計劃學會一九九五年年會及論文發表會，台南。\n台灣的海洋環境與海洋產業發展，唐存勇，國台灣大學 海洋研究所Email: tyt@ntu.edu.tw\n台灣海洋保護區的現與挑戰，邵廣昭、賴昆祺；中央研究院生物多樣性研究中心","foreignLanguageTextbooks":true}]
