[{"name":"張桂菱","email":"Nadine779@yahoo.com.tw","latestUpdate":"2020-09-10 19:56:22","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"週次　　日期　　        課程內容　　                                                備註\n\n一　　09/14　　課程熱身　　   \n\n二　　09/21　　爵士舞基本動作練習1、基本動作組合練習1　　\n\n三　　09/28　　爵士舞基本動作練習2、基本動作組合練習2　　\n\n四　　10/05　　爵士舞基本動作練習3、基本動作組合練習3　　\n\n五　　10/12　　         爵士舞節奏與律動練習1、初級動作組合練習1\n　　\n六　　10/19　　         爵士舞節奏與律動練習2、初級動作組合練習2　　\n\n七　　10/26　　爵士舞音樂與身體開發3、初級動作組合練習3　　繳交期中分組名單\n\n八　　11/02　　         爵士舞音樂與身體開發　　                                  期中分組考試抽籤\n\n九　　11/09　　        ＊學習成果期中考試＊　　\n\n十　　11/16　　         百老匯爵士舞小品練習1　　\n\n十一　　11/23　　         百老匯爵士舞小品練習2　　\n\n十二　　11/30　　         百老匯爵士舞小品練習3　　\n\n十三　　12/07　　百老匯爵士舞小品練習4　　\n\n十四　　12/14　　        百老匯爵士舞小品練習5　　\n\n十五　　12/21　　        百老匯爵士舞小品練習6　　                                   繳交期末分組名單\n\n十六　　12/28　　百老匯爵士舞小品總複習　　                                   期末分組考試抽籤.  ＊之前登記評量5＊\n\n十七　　01/04　　＊學習成果期末呈現＊　　\n\n十八　　01/11　　         舞蹈欣賞與討論/期末心得補交與補考","scorePolicy":"一、上課方式：講述、示範、實作、討論、觀察。\n\n\n二、上課服儀\n1.　　著可肢體伸展的運動服裝，ex: T-Shirt、運動長褲、襪子，切勿穿著牛仔褲或時裝。\n2.　　儘可能將頭髮束起、勿披頭散髮，盡量不要穿戴飾品影響自己與他人活動。\n3.　　水瓶、毛巾。\n4.　　勿攜帶過於貴重的物品。\n\n\n\n三、評量方法\n\n1.　　出席（40%）: 曠課3次則本課程以不及格計算。遲到30分鐘以上或課程中未告知原因而消失20分鐘以上者，依曠課乙次計算。請假一律依照學校規定，公、喪假不扣分；事假需於「事前」請假（事後請假依「曠課」劃記）；病假請於下一堂上課時提出證明，事、病、生理假均會斟酌扣出席成績。缺曠的扣分可以參考「評分5-1」補回。\n\n2.　　課堂參與（20%）: 動作組合參與度、課堂討論、服裝儀容。\n\n3.　　期中考（20%）：爵士舞蹈基本動作組合(5-6人小品) 10.26分組名單；11.09考試\n\n4.　　期末考（20%）: 爵士舞蹈小品（2小品）12.21分組名單；01.04考試\n\n5.　　＊加分12.28上課前：\n（1）　　下載APP: NIKE RUN CLUB，跑走3公里可加一分。無缺曠者至多加5分(15k)；請事、病、生理假一堂約扣3分，單堂至多跑走6k可抵2分。\n（2）　　參加校內、外舉辦之運動賽事。提出證明（照片或參加證明）即可加分。\n\n\n\n\n四、課堂注意事項\n\n1.　　上課過程中，若有任何身體不適狀況請立即告知老師，安全、勿受傷為基本原則。\n2.　　未經老師許可切勿使用行動電話。進教室，請關靜音。\n3.　　勿穿鞋進入韻律教室。於教室鐵櫃擺放整齊。\n4.　　勿將水以外的飲料及食物帶進韻律教室。\n5.　　課堂中不准出現有任何故意危及他人或自身安全之行為。\n6.　　教師與學生互相尊重，彼此以誠信待之。\n7.　　每一堂課一定會點名，對於出席狀況將會詳實紀錄。\n8.　　請著運動服裝上課。\n9.　　課堂中無故離開上課地點超過20分鐘，以曠課計算。\n10.　　若對於課程有任何的疑問，請當下向教師提問或以E-mail陳述。","materials":"一、參考書目\n\n1.　　《表演藝術》雜誌 國家兩廳院出版\n2.　　《完美，稍縱即逝：舞蹈家古名伸的追尋筆記》古名伸 小貓流文化\n3.　　《舞蹈欣賞》平珩 編 三民書局\n4.　　《我的看舞隨身書》 李立亨 天下文化\n5.　　《身體記憶52講》、《身體美學》蔣 遠流\n6.　　《高處眼亮》林懷民 遠流\n7.　　《當代歐洲新舞蹈—表演：反舞蹈、非身體》魏淑美\n8.　　《當代舞蹈的心跳：從身體的解放到靈魂的觸動，當代舞蹈的關鍵推手、進化論與欣賞指南》，菲利普・努瓦澤特(Philippe Noisette)\n9.　　 Sharing the Dance: Contact Improvisation and American Culture. Novack, Cynthia J.\n\n二、參考影片\n《Chicago》、《舞孃俱樂部》、《華麗年代》、《Cats》、《大娛樂家》、《樂來越愛你》、《愛・滿人間》、《茱蒂》","foreignLanguageTextbooks":true}]
