[{"name":"胡同來","email":"jameshu@ntut.edu.tw","latestUpdate":"2020-06-16 13:46:04","objective":"策略管理主要是幫助製造業與服務業高階管理者作決策。一般而言，這門課程主要協助學員們具有策略思維與整合能力。學員可在策略管理學習過程活學活用，更能融合所學應用於管理決策中。此門課也採用適當的製造業與服務業個案研討來幫助學員學習、研讀與熟悉策略管理的運作，以達成此門課的目標。授課主題包括研討策略管理的本質與整體架構，瞭解組織所處環境 ， 分析外部環境之時機和危機， 剖析內部組織之優劣勢 ， 探討企業不同層次之應對策略，整合策略的執行與治理等。\nStrategic management deals with the decision making in manufacturing and service industry at the top management level. Generally, this course provides students with strategic thinking and knowledge integration. With case studies in manufacturing and service industry, this course also helps students learn, study, and understand the process of strategic management well to achieve the goals of the course. Topics in this course include the essence and whole framework of strategic management, in what circumstances an organization has been, analyses on the opportunities and threats of external environment, the strengths and weaknesses of internal organization, application strategies of companies at different levels, implantation on integration strategies and so forth.","schedule":"胡同來 博士\n9/15 策略管理課程介紹:\n       策略概念、架構與思維方法\n2 9/22 策略核心能力與持續競爭優勢\n3 9/29 企業競爭與獨佔策略建構\n4 10/6 集團策略多角化與資源運用策略\n5 10/13 企業經營者與領導模式\n6 10/20 策略方法論\n\n趙莊敏 博士\n策略方法論\n7 10/27 Case Study1: 數位顛覆與創新\n8 11/3 Case Study2: 領導、策略、創新與競爭優勢\n9 11/10 Case Study3: 事業層級與產業行銷策略\n10 11/17 Case Study4: 外部環境機會威脅策略\n11 11/24 Case Study5:外部環境機會威脅與新產品上市策略\n12 12/1 Case Study6: 內部資源與組織文化策略\n\n蔡榮發 博士\n\n13 12/8 演講\n14 12/15 企業技術策略\n15 12/22 企業規格策略\n16 12/29 企業智慧財產權策略\n17 1/5 演講\n18 1/12 Case study 期末作業\n14 12/15 企業技術策略\n15 12/22 企業規格策略\n16 12/29 企業智慧財產權策略\n17 1/5 演講\n18 1/12 Case study 期末作業\n（在課程進行中，日程安排可能會隨教授時間與授課內容變動做適當調整)","scorePolicy":"課堂出席 30%\n個案討論 40%\n作業、報告 30%","materials":"Charles W. L.Hill, Melissa A. Schilling, Gareth R. Jones (2020), Strategic\nManagement: Theory 13e, 13th Edition, South-Western. （朱文儀、陳建男譯，\n策略管理，第13版，華泰文化事業公司)","foreignLanguageTextbooks":false},{"name":"趙莊敏","email":"cmchao@ntut.edu.tw","latestUpdate":"2020-06-08 14:12:04","objective":"本課程主要在培育公司高階管理者做策略思考與經營決策，進而創造輝煌的經營績效。因此，策略管理重點在訓練學員們具有策略規劃、策略執行之專業能力。學員可在本課程學習過程中融合所學應用於管理決策中。此課程採用適當的企業個案研討來幫助學員學習、研讀與熟悉策略管理的運作方式，進而達成此門課的目標。授課內容包括策略管理的本質與商業模式，瞭解企業面環境變化，進而分析外部環境的機會與威脅、內部環境的強勢與弱勢，分析企業在不同層級的策略制定、策略執行與治理機制等重要策略管理議題。","schedule":"Case Study1: 數位顛覆與創新\nCase Study2: 領導、策略、創新與競爭優勢\nCase Study3: 事業層級與產業行銷策略\nCase Study4: 外部環境機會威脅策略\nCase Study5:外部環境機會威脅與新產品上市策略\nCase Study6: 內部資源與組織文化策略","scorePolicy":"1.　　課堂出席 30%\n2.　　個案討論 40% \n3.　　作業、報告 30%","materials":"1. Charles W. L. Hill, Melissa A. Schilling, Gareth R. Jones (2020), Strategic Management: Theory, 13th Edition, South-Western. （朱文儀、陳建男譯，策略管理，第13版，華泰文化事業公司)\n\n2.授課教授提供相關的講義、案例等資料","foreignLanguageTextbooks":false},{"name":"蔡榮發","email":"jftsai@ntut.edu.tw","latestUpdate":"2020-06-11 09:09:11","objective":"本課程主要在培育公司高階管理者做策略思考與經營決策，進而創造輝煌的經營績效。因此，策略管理重點在訓練學員們具有策略規劃、策略執行之專業能力。學員可在本課程學習過程中融合所學應用於管理決策中。此課程採用適當的企業個案研討來幫助學員學習、研讀與熟悉策略管理的運作方式，進而達成此門課的目標。授課內容包括策略管理的本質與商業模式，瞭解企業面環境變化，進而分析外部環境的機會與威脅、內部環境的強勢與弱勢，分析企業在不同層級的策略制定、策略執行與治理機制等重要策略管理議題。\n\nThe course of strategic management deals with the decision making in business at the top management level. Generally, this course provides students with the professional ability of strategic formulation and implementation. With case studies in business, this course also helps students learn, study, and understand the process of strategic management well to achieve the goals of the course. Topics in this course include the essence strategic management and business model, in what circumstances an organization has been, analyses on the opportunities and threats of external environment, the strengths and weaknesses of internal organization, application strategies of companies at different levels, implantation on integration strategies and the design mechanism of business government.","schedule":"週次 日期　　上課內容（授課教師）\n1　　 9/15　　策略管理課程介紹:策略概念、架構與思維方法（胡同來 教授）\n2　　 9/22　　策略核心能力與持續競爭優勢（胡同來 教授）\n3　　 9/29　　企業競爭與獨佔策略建構（胡同來 教授）\n4　　 10/6　　集團策略多角化與資源運用策略（胡同來 教授）\n5　　10/13　　企業經營者與領導模式（胡同來 教授）\n6　　10/20　　策略方法論（胡同來 教授）\n7　　10/27　　Case Study1: 數位顛覆與創新（趙莊敏、唐瓔璋 教授）\n8　　 11/3　　Case Study2: 領導、策略、創新與競爭優勢（趙莊敏、唐瓔璋 教授）　　\n9　　11/10　　Case Study3: 事業層級與產業行銷策略（趙莊敏、唐瓔璋 教授）　　\n10　　11/17　　Case Study4: 外部環境機會威脅策略（趙莊敏、唐瓔璋 教授）\n11　　11/24　　Case Study5:外部環境機會威脅與新產品上市策略（趙莊敏、唐瓔璋 教授）　　\n12　　 12/1　　Case Study6: 內部資源與組織文化策略（趙莊敏、唐瓔璋 教授）　　\n13　　 12/8　　演講（蔡榮發 教授）\n14　　12/15　　企業技術策略（蔡榮發 教授）　　\n15　　12/22　　企業規格策略（蔡榮發 教授）　　\n16　　12/29　　企業智慧財產權策略（蔡榮發 教授）　　\n17　　 1/5　　        演講（蔡榮發 教授）　　\n18　　 1/12　　Case study 期末作業（蔡榮發 教授）　　\n（在課程進行中，日程安排可能會隨教授時間與授課內容變動做適當調整)","scorePolicy":"1.　　課堂出席 30%\n2.　　個案討論 40% \n3.　　作業、報告 30%","materials":"1. Charles W. L. Hill, Melissa A. Schilling, Gareth R. Jones (2020), Strategic Management: Theory 13e, 13th Edition, South-Western. （朱文儀、陳建男譯，策略管理，第13版，華泰文化事業公司)\n2.授課教授提供相關的講義、案例等資料。","foreignLanguageTextbooks":false}]
