[{"name":"田方治","email":"fctien@ntut.edu.tw","latestUpdate":"2020-09-08 17:24:11","objective":"本課程之目標在於介紹智慧機器人及AR/VR之知識領域相關議題，關於智慧機器人部分，主要包括：機器人學原理與分析方法、機器人的設計分析製造與應用、智慧機器人的歷史與未來的發展、機器視覺之原理與應用等；關於AR/VR部分，此概論課程將介紹AR/VR相關技術於現今智慧製造與服務業之應用，並展示AR/VR於不同工作環境設計之應用實例，如VR/AR軟硬體操作及體驗、各式追蹤系統介紹等等。\nThis is an introduction course of intelligent robot and applications of aug-mented reality and virtual reality. The course is designed to provide the fol-lowings topics: 1. fundamentals of robotics and analytical methodologies, 2. design, manufacturing, and applications of robots, 3. the history and the fu-ture of intelligent robot, 4. fundamentals and practical applications of ma-chine vision, 5. overview about AR and VR technology applied in smart manufacturing and service industries, 6. applications and examples of AR/VR, e.g. software and hardware design and operation, various tracking systems, etc.","schedule":"Week #1 – 課程大綱簡介 --智慧機器人、Zuvio 登入與使用\nWeek #2 – 智能製造簡介(工業 4.0/ Why?)\nWeek #3 – AI 發展現狀 (智能機器人、無人車、智能物流 …)\nWeek #4 – 工業機器人 – 發展現況 &amp; Lab demo\nWeek #5 – 機器視覺應用 &amp; Case Study\nWeek #6 – iAOI 介紹 &amp; Case Study\nWeek # 17/18 – 專題報告","scorePolicy":"課堂參與　　　　　　　　　　        (10%)\n作業、課後測驗與回饋　　　　        (50%)\nProject – 組小專題報告 (每組30分鐘)　　(40%)","materials":"本課程主要之教材如下:\n個人教材 (PPT) + Video\n相關網頁\nYouTube – 請搜尋 北科大 田方治 youtube","foreignLanguageTextbooks":false},{"name":"黃瀅瑛","email":"yingyinhuang@ntut.edu.tw","latestUpdate":"2020-06-12 21:05:27","objective":"本課程之目標在於介紹智慧機器人及AR/VR之知識領域相關議題，關於智慧機器人部分，主要包括：機器人學原理與分析方法、機器人的設計分析製造與應用、智慧機器人的歷史與未來的發展、機器視覺之原理與應用等；關於AR/VR部分，此概論課程將介紹AR/VR相關技術於現今智慧製造與服務業之應用，並展示AR/VR於不同工作環境設計之應用實例，如VR/AR軟硬體操作及體驗、各式追蹤系統介紹等等。\nThis is an introduction course of intelligent robot and applications of augmented reality and virtual reality. The course is designed to provide the followings topics: 1. fundamentals of robotics and analytical methodologies, 2. design, manufacturing, and applications of robots, 3. the history and the future of intelligent robot, 4. fundamentals and practical applications of machine vision, 5. overview about AR and VR technology applied in smart manufacturing and service industries, 6. applications and examples of AR/VR, e.g. software and hardware design and operation, various tracking systems, etc.","schedule":"Block I: 田方治老師 \n共6週，主題為智慧機器人\n\nBlock II: 黃瀅瑛老師\n共12週，主題為AR/VR","scorePolicy":"Class participation\nMidterm exam/assignment\nFinal exam/project","materials":"自製教材","foreignLanguageTextbooks":false}]
