[{"name":"陳雪燕","email":"hsueh0810@tp.edu.tw","latestUpdate":"2020-09-17 10:46:46","objective":"本課程以培養學生尊重與欣賞不同族群、不同時空、不同價值觀所產生的音樂而設。藉由對音樂元素、本質的認知及介紹，欣賞各時期作曲家之代表作品，培養西方音樂的基本常識，建立音樂欣賞的專業態度。教學目標：1.提高學生音樂欣賞的素養，充實其音樂生活的內涵，2.激發學生對音樂的興趣，培育愛樂人口，增進社會祥和的原動力，3.介紹古今中外音樂名家名作，啟發學生對音樂創作的認知與敬重，4.建立學生對古典音樂、民族音樂、應用音樂及通俗音樂等不同類型音樂的正確認知與包容力，培養世界性的音樂觀。授課內容：1.概論, 2.歌樂, 3.器樂, 4.儀式音樂, 5.舞蹈音樂, 6.戲劇音樂。\nThis course aims to cultivate students' ability to appreciate music of different ethnic groups, different time and place, different value systems. Through the introduction of basic music elements as well as the appreciation of the masterpieces of various composers, it is hoped that students will build up basic music knowledge about music and enhance professional music appreciation potentiality in music. The goals include: 1. Elevating students' capability in music appreciation 2. Inspiring students' interest in music with a view to improving our society into a harmonious world. 3. Introducing domestic and international famous composers' pieces 4. Touring of various forms of music: classical, ethnic, applied and popular music. Contents of this course include: 1.Introduction 2. Vocal music 3. Instrumental music 4. Ritual music 5. Dance music 6. Theatre music","schedule":"第一週  引序\n1.課前準備、報告評量方式\n2.音樂與生活(人生)發展之關係：從各種文化層面分析探討~戲劇、文學、電影、電視、廣播………\n\n第二週\n1.有關音樂美學與生活美感的展現，音樂治療理性與感性的人生。\n2.莫札特音樂身心療法認識。\n\n第三、四、五週  音樂世紀巡禮\n1.簡介各時期之音樂樂派的風格比較，巴洛克→古典→浪漫〈國民樂派〉→近代、現代。\n2.認識樂器與各種古典音樂曲式的代表名曲欣賞，如交響曲、協奏曲、序曲、組曲、四重奏、五重奏等。\n3.討論古典音樂會的個人聆賞經驗、發表。\n\n第六、七、八週   音樂家傳記\n1.探討音樂家的創作背景與靈感的來源。\n2.認識其代表性的古典名曲。\n3.介紹古典名曲的音樂故事。 \n4.經驗分享、討論。\n\n第九週 期中考週 (音樂隨想作業活動)\n\n第十、十一週  樂器世界與曲式\n1.認識木管、銅管樂器\n2.提琴弦樂家族\n3.打擊樂器─現代打擊音樂劇場\n4.曲式認識\n\n第十二週  音樂逍遙遊-音樂城市之旅\n\n第十三週  你喜愛的中外名歌\n1. 結合文學、現代詩的歌謠。\n2. 各國民歌、藝術歌曲、合唱曲。\n3. 歌唱技巧、發聲法指導、習唱\n\n第十四、十五週  歌劇基素\n1.歌劇要素、音樂與戲劇的結合創造出許多扣人心弦的藝術精品。\n2.音樂生動了劇情，故事更豐富了音樂的表現力，這也是為什麼歌劇藝術往往比一般的樂曲能更加倍動人的原因。\n\n第十六、十七週  音樂劇萬花筒\n1.音樂劇介紹，將音樂、歌曲、舞蹈和對白結合當代商機的一種表演藝術。\n2.音樂劇入門。\n\n第十八週  期末考週","scorePolicy":"期末報告30％ \n上課出缺席情形40％\n個人上課發表10％\n「音樂隨想」期中隨堂作業20％\n\n※1091學期因疫情影響，未能到校出席上課，須提供證明，並以線上視訊參與課程，評量方式如下：\n\n1.提供記錄線上觀課之每週上課筆記(第1-8週筆記於第9週電郵繳交，第10-17週筆記於第18週電郵繳交) 40％\n2.提供個人各週課程上課心得(期末交)10％\n3.「音樂隨想」上課隨堂作業20％\n4.期末音樂報告30％","materials":"1. 感人音樂故事\n2. 音樂欣賞教程\n3. 音樂美學\n4. 百老匯音樂劇\n5. 世界名歌劇響宴\n6. 世界名歌曲集\n7. 音樂劇的九種風情\n8. 歌唱家的藝術\n9. 莫札特效應~音樂身心靈療法","foreignLanguageTextbooks":false}]
