[{"name":"黃麗珠","email":"lh03232000@yahoo.com.tw","latestUpdate":"2020-09-11 13:00:13","objective":"創新與創業並不是兩件事情,而是一體兩面相依相存的一件事情.想創業成功必須有能立足市場有商業價值的創新亮點,-而創新的產品或服務或構想也需要有事業實體的營運才能實現實際的商業價值. \n\n創新創業之初需要找到存活的依據、從無到創立強勢品牌、創立或擴張自有市場/消費者據點等。啟發修課同學創新創業的興趣並協助修課同學思考如何兼顧公司營運管理的面向並回應市場顧客所需。\n\n本課程為協助修課同學思考創新與創建企業應注意的各種面向以評估創新創業的機會與能力。 課程概分三大部份:\n   第一部份: 創新與創業概念啟發\n   第二部份: 創新與創業的成功機會理論與實務\n   第三部份: 創業營運管理與財務規劃概述。\n創業營運行銷管理能夠幫助創業者向潛在投資者及企業夥伴，銷售創意以獲得資源，也讓創業家透過創新的商業手法來充分利用稀少的資源。\n\nInnovation and entrepreneurship are not divided, but rather two facets of one thing. To successfully start a business, there must be innovative ideas that set footholds on the market and create business value; innovative products, services, or ideas also need to be driven by a business entity to generate actual business value.\n\nEntrepreneurs inevitably need to outwit the competition in the industry to survive, build a strong brand from ground zero, and creating or expand market and consumer bases, etc., at the beginning of founding a company. This course aims to increase students’ interests in entrepreneurship and enhance their ability to think further about how a venture responds to customer needs with rounded perspective. This course places emphasis on various aspects that are relevant to a viable, sustainable, and innovative venture, in order to enhance individual’s acumen to assess one’s opportunities and resources.\n\nStructure of the syllabus:\n   Unit 1: Concepts overview of innovation and entrepreneurship\n   Unit 2: Theory and practice of winning chance for innovation and entrepreneurship\n   Unit 3: Overview of entrepreneurial operation management and financial planning\nThe entrepreneurial operation and marketing management are the fundamentals of a successful pitch to potential investors or partners. Not only does it allow entrepreneurs to monetize business ideas but also make full use of scarce resources through innovative business models.","schedule":"週次　　主題\n第一週　　3-1  創新與創業概念\n第二週　　3-2  創新與創業概念\n第三週　　3-3  創新與創業概念\n第四週　　3-1  創新與創業的成功機會理論與實務\n第五週　　3-2  創新與創業的成功機會理論與實務\n第六週　　3-3  創新與創業的成功機會理論與實務\n第七週　　2-1  創新創業的公司組織\n第八週　　2-2  創新創業的資本規劃與募資\n第九週　　期中考\n第十週　　      創業開辦及營運成本試算模式(EXCEL)  \n第十一週      營運財務概念-營收,現金流,毛利,淨利試算模式(EXCEL) \n第十二週      3-1分組模擬創新創業企劃\n第十三週      3-2分組模擬創新創業企劃\n第十四週      3-3分組模擬創新創業企劃\n第十五週      3-1小組創新創業企劃發表與修正 \n第十六週      3-2小組創新創業企劃發表與修正\n第十七週      3-3小組創新創業企劃發表與修正\n第十八週      期末考","scorePolicy":"平時表現  35%\n期中考      25%\n期末考      40%","materials":"1. 老師自製上課PPT. 不使用其他教材\n2.參考書目: (圖書館可以借閱)\n   A.創新與創業精神(管理大師彼得杜拉克談創新實務與策略)\n   B.成功,與高手同行(從夢想到成功創業的路上)","foreignLanguageTextbooks":false}]
