[{"name":"林威玲","email":"rita33@ntut.edu.tw","latestUpdate":"2020-09-17 18:29:10","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"僅限二技四陸生選課\n一、09月17日遠距教學\n        課程規劃說明:課程內容介紹、上課規定及注意事項。\n二、09月24日遠距教學\n        1-如何正確走姿、跑姿。\n        2-請在家鄉找到一個安全又舒適又有特色的健走步道，或能運動的風景 \n           區，或戶外郊遊，需攜伴參加。\n        3-在WeChat向大家介紹家鄉該地點位置，值得一遊的理由。\n        4-拍照。有人物、景色兩張。如在乎個人正面肖像權，自行取景(背影牽 \n           手、腳ㄚ子…創意也可)。\n三、10月01日中秋節放假\n四、10月08日遠距教學\n        個人飲食建議與評估1\n五、10月15日遠距教學\n        個人飲食建議與評估2\n六、10月22日遠距教學\n        1-個人飲食建議與評估3\n        2-體適能定義含健康適能、運動適能。\n        3-人體解剖基礎認識。\n七、10月29日　　\n        1-運動安全與傷害防護\n        2-體適能檢測與器材介紹\n           *肌力及肌耐力、心肺功能、柔軟度評估。\n           *身體組成評估。(INBODY前測)\n        3-體適能訓練原則與健身運動DIY規劃\n           *肌力及肌耐力、心肺功、柔軟度能計畫\n八、11月05日　　\n        實務操作:體適能訓練DIY規劃\n        *肌力及肌耐力、心肺功能、柔軟度訓練。\n九、11月12日　　\n       身體組成INBODY介紹與認識\n十、11月19日　　\n        1-伸展放鬆運動\n        2-滾筒或網球放鬆\n十一、11月26日　　\n        Pilates彼拉提斯彈力帶VS重量訓練\n十二、12月03日　　\n         實務操作:肌力及肌耐力、心肺功能、柔軟度訓練\n十三、12月10日　　\n         實務操作:肌力及肌耐力、心肺功能、柔軟度訓練\n十四、12月17日　　\n         實務操作:肌力及肌耐力、心肺功能、柔軟度訓練\n十五、12月24日　　\n         保健食品知識\n十六、12月31日　　\n         1-划船訓練成果測驗\n         2-後側INBODY\n十七、110年01月07日　　\n         1-划船訓練成果測驗\n         2-後側INBODY\n         3-身體組成分析檢討\n十八、01月14日　　\n         補考周","scorePolicy":"一、出勤考核50%\n(一)學習態度20%\n   1.服裝儀容，著適宜之運動服裝。\n   2.安全考量，長髮者勿披頭散髮及不要穿戴飾品，亦影響自己與他人活動。\n   3.未經老師許可切勿使用手機，並關靜音。\n (二)出缺席狀況30%\n   1.一次曠課扣總成績5分。\n   2.遲到30分以上，無特殊原因者曠課論。\n   3.事病假以學校正式請假為主，超過三次以上依情況扣總成績1-5分。\n二、運動DIY規劃報告10%\n三、食品營養與保健計劃及實施結果心得報告10%\n四、學習成果報告10%\n五、划船訓練成果測驗20%\n *報告一律上傳至【北科i學園】數位教學平台","materials":"1-彼拉提斯解剖書（暢銷改版）\nPILATES ANATOMY\n作者： 艾比．埃爾渥斯  追蹤作者 新功能介紹\n原文作者： Abby Ellsworth\n譯者： 王怡璇\n出版社：木馬文化  訂閱出版社新書快訊 新功能介紹\n出版日期：2018/06/06\n2-","foreignLanguageTextbooks":false}]
