[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2013-02-20 19:36:02","objective":"Course Aims:\n\nThe course provides students with skill-based instructions in learning how to read literary and cultural texts. Desired learning outcomes include reading skill development, vocabulary building, language analysis, and critical thinking. Reading materials encompass a variety of viewpoints on global topics centered on social issues, the environment, psychology, business, and technology. Extended activities are designed to encourage students to go beyond the assigned materials, and to put what they have acquired from the readings into listening, speaking and writing practices.\n\n教導學生閱讀囊括全球議題的文章，並藉由文章的內容作技巧的訓練，字彙的建構，語言的解析，及思維的拕發。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。","schedule":"Focus for Spring 2013: Art and Life (Friday)\n\nWeek 1: Introduction:\nCalvino, ‘Why Read the Classics?’, Keats, ‘This Living Hand,’ Borges, ‘Borges and I’\nWeek 2: Holiday (no class)\nWeek 3: Ibsen, The Master Builder \nWeek 4: Ibsen continued\nWeek 5: Rope (dir. Hitchcock)\nWeek 6: Rope continued (D. A. Miller’s article on Rope)\nWeek 7: Holiday (no class) \nWeek 8: On Nietzsche\n\nWeek 9: Mid-term exam \n\nWeek 10: Freud, ‘Creative Writers and Day-Dreaming’\nWeek 11: D. H. Lawrence, ‘Morality and the Novel’ and ‘Why the Novel Matters’\nWeek 12: Terrorizers (dir. Edward Yang)\nWeek 13: Terrorizers continued\nWeek 14: Oscar Wilde, ‘The Critic as Artist’\nWeek 15: ‘The Critic as Artist’ continued\nWeek 16: Three Colours: Blue (dir. Kieslowski)\nWeek 17: Judith Butler, Precarious Life\n\nWeek 18: Final exam\n\n\nTeaching Approach:\n\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend lectures, participate in discussions in tutorials, take a mid-term examination, give a group presentation, and write an essay.","scorePolicy":"Assessment:\n\nParticipation　　　　　　　　　　10%\nGroup Presentation　　　　　　　　20%\nMid-term exam　　　　　　　　　　30%\nFinal exam　　　　　　　　　　40%","materials":"Bibliography 　　\n\nBorges, Jorge Luis.  ‘Borges and I.’ Labyrinths. Trans. James E. Irby. New Directions Publishing Corp. 1962. \nButler, Judith. Precarious Life: The Powers of Mourning and Violence. London and New York: 2004. \nCalvino, Italo. ‘Why Read the Classics?’ Trans. Patrick Creagh. The New York Review of Books 33.15 (9 October 1986).\nFreud, Sigmund. ‘Creative Writers and Day-Dreaming.’ 20th Century Literary Criticism. Trans. James Strachey et al. Ed. David Lodge. London and New York: Longman, 1972. 36-42.\nIbsen, Henrik. ‘The Master Builder.’ The Master Builder and Other Plays. Harmondsworth: Penguin, 1958. 121-212.\nKeats, John. ‘This Living Hand, Now Warm and Capable....’ John Keats: The Major Works. Oxford: Oxford University Press, 2008. 331.\nLawrence, D. H., ‘Morality and the Novel.’ 20th Century Literary Criticism. Ed. David Lodge. London and New York: Longman, 1972. 127-131.\n---. ‘Why the Novel Matters.’ 20th Century Literary Criticism. Ed. David Lodge. London and New York: Longman, 1972. 131-185.\nRope. Dir. Hitchcock. Writ. Hume Cronyn and Patrick Hamilton. Perf. James Stewart, John Dall and Farley Granger. 1948. Warner Bros. Pictures, 2006. DVD. \nThe Terrorizers. Dir. Edward Yang. Writ. Edward Yang and Hsiao Yeh. Perf. Cora Miao, Bao-ming Gu, and Wang An. 1986. Central Motion Pictures. DVD.\nThree Colours: Blue. Dir. Krzysztof Kieslowski. Writ. Krzysztof Kieslowski  and Krzysztof Piesiewicz. Perf. Juliette Binoche. 1993. MK2 Production. DVD.\nWilde, Oscar. ‘The Critic as Artist.’ The Soul of Man Under Socialism and Selected Critical Prose. Ed. Linda Dowling. Harmondsworth: Penguin, 2001. 213-279.","foreignLanguageTextbooks":false}]
