[{"name":"宋立垚","email":"lysong@ntut.edu.tw","latestUpdate":"2012-12-24 22:22:51","objective":"本課程區分為四個實習，共一學年之都市設計實習，每學期應從事幾項實習，依該學期之情況而定：(一)大型基地開發之建築規劃與都市設計實習：參照台北市都市發展局擬定之「都市設計與土地使用開發許可」之審議標準，練習建築、敷地與都市設計三者整合關係之設計實習。(二)都市更新地區都市設計實習：以台北市更新地區為範例，選定基地範圍從事都市更新地區之改造，建立地區未來像，並擬定都市設計準則。(三)都市計畫通盤檢討地區都市設計實習：依據都市計畫通盤檢討第八條規定，都市計畫通盤檢討地區必須依據該地區之交通、產業、文化、生態及基地等因素，擬定都市設計準則；以台北市都市計畫通盤檢討為例，練習都市設計準則之訂定，或以都市計畫細部計畫為例，研擬土地使用分區管制與設計準則。(四)新發展區都市設計實習：選定一個地區，可能是擴大都市發展地區或新市鎮、新社區之規劃設計實習。","schedule":"第一週 課程介紹、選擇基地\n第二週 基地現況分析\n第三週 專家演講\n第四週 開發構想研擬、案例分析\n第五週 開發構想研擬、民眾訪談\n第六週 規劃構想及策略(一)\n第七週 規劃構想及策略(二)\n第八週 策略發展地區選取\n第九週 全區規劃建設白皮書\n第十週 設計方案模擬討論\n第十一週 設計方案模擬討論\n第十二週 都市設計準則研擬(一)\n第十三週 都市設計準則研擬(二)\n第十四週 專家演講\n第十五週 校外參觀\n第十六週 準備展覽\n第十七週 展覽簡報\n第十八週 公開展覽","scorePolicy":"平時成績(口頭及書面報告)(60%)\n期末報告(40%)","materials":"　","foreignLanguageTextbooks":false},{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2012-12-24 23:21:19","objective":"一、課程目的：\n（一）瞭解如何應用都市設計理論、方法於實務之運作訓練，並舉實例比較說明，俾便學生能掌握都市空間尺度、建築量體（建蔽率、容積率）、地區環境紋理與實質規劃等理念，及早有機會習得解決都市設計實務問題的技能。\n（二）實地操作地區發展與都市設計準則之訓練，俾能因應地區特色（含歷史文化、實質環境、地方產業與活動）應用現代都市設計理論規劃一地區之都市設計指導。\n（三）配合新訂、擴大、修訂都市計畫及其通盤檢討，研習對應之都市設計實務，以訓練學生具有都市設計規劃、審議及行政協調能力，期能與現行機制接軌。\n二、課程概要：\n本課程區分為四個實習，共一學年之都市設計實習，每學期應從事幾項實習，依該學期之情況而定：(一)大型基地開發之建築規劃與都市設計實習：參照都市計畫通盤檢討實施辦法及台北市都市發展局擬定之「都市設計與土地使用開發許可」之審議標準，練習建築、敷地與都市設計三者整合關係之設計實習。(二)都市更新地區都市設計實習：以選定之更新地區為範例，選定基地範圍從事都市更新地區之改造，建立地區未來願景，並擬定都市設計準則。(三)都市計畫通盤檢討地區都市設計實習：依據都市計畫通盤檢討第八條規定，都市計畫通盤檢討地區必須依據該地區之交通、產業、文化、生態及基地等因素，擬定都市設計準則；以台北市都市計畫通盤檢討為例，練習都市設計準則之訂定，或以都市計畫細部計畫為例，研擬土地使用分區管制與設計準則。(四)新發展區都市設計實習：選定一個地區，可能是擴大都市發展地區或新市鎮、新社區之規劃設計實習。","schedule":"本課程分為上下兩學期，每學期至少操作一處之都市設計實務練習，主要訓練既成都市、都市更新、新市鎮（新社區）開發、古蹟維護、城鄉風貌、公共工程、景觀道路等之都市設計實習。訓練內容主要以「都市計畫定期通盤檢討實施辦法」所規定於辦理都市計畫定期通盤檢討時，應辦理都市設計之內容為原則，並參酌時空與因地制宜之特殊需求，分別就下列項目練習：\n（一）公共開放空間系統配置事項。\n（二）人行空間或步道系統動線配置事項。\n（三）交通運輸系統配置事項。\n（四）建築基地細分規模限制事項。\n（五）建築量體配置、高度、造型、色彩及風格之事項。\n（六）環境保護設施配置事項。\n（七）都市防災計畫\n（八）景觀計畫。\n（九）經營管理維護計畫。\n（十）財務計畫\n因此本課程主要以都市問題、都市政策與參與性的都市設計制度之建立開始，繼之探討國內外都市設計實例及以分組方式實際操作個案，並以前列之各項內容為主要研究議題，以加強實務經驗。\n本課程實際操作個案分為三組，分別就選定之基地，針對臚列之主要重點作實務練習。","scorePolicy":"一、授課方式：\n（一）課堂講授\n（二）邀請具實務經驗專家傳授經驗\n（三）實例探討及分組報告、實例操作\n（四）安排都市設計審議實況觀摩、都市設計成果現地參觀\n二、學期成績計算方式：\n（一）學期實務報告：50%\n（二）實務練習與上課出席及互動情形：20%\n（三）學期實習成果展覽：30%","materials":"1.American Planning Association, (2006) Planning and Urban Design Standards. Wiley, New Jersey.\n2.Urban Design Associates, (2004) The Architectural Pattern Book: A tool for Building great Neighborhoods, Norton, London\n3.OECD, (2002) Sustainable Development Strategies, Earthscan, London\nGosling, D. (2003) The Evolution of American Urban Design, Wiley, West Sussex.\n4.Walters, D. &amp; Brown, L. L. (2004) Design First: Design-based Planning for Communities, Architectural Press, London\n5.Corbett, J. &amp; Corbett, M. (2000) Designing Sustainable Communities: Learning from Village Homes, Island Press, Washington, D.C.","foreignLanguageTextbooks":false}]
