[{"name":"吳忠敏","email":"cmwu@ntut.edu.tw","latestUpdate":"2012-12-24 10:14:59","objective":"Piles of literature indicated that technology have been the main source of wealth creation of nations and that of competitive advantage of firms. Moreover, technology has also become more complex, uncertain and expensive than ever before. Along with rapid technological change, it is imperative for firms to manage technology in an active and integrated way in order to survive and compete in the increasingly globalized markets. Drawn upon theoretical articles and empirical case study, the course aims to provide a comprehensive understanding of Management of Technology (MOT) with both micro (technology and firm) level and macro (secot and policy) level.","schedule":"2月18日2月24日　　Introduction\n2月25日3月3日　　Recognizing technology: technological innovation and entrepreneurship\n3月4日3月10日　　Understanding technology (1): definition, scope and rationale\n3月11日3月17日　　Understanding technology (2): components, capabilities, technology life cycle and typology of innovation\n3月18日3月24日　　Appraising technology: technology forecasting, planning and evaluation\n3月25日3月31日　　Exploiting technology (1): technology strategy\n4月1日4月7日　　Exploiting technology (2): strategic alliance\n4月8日4月14日　　Organizing technology: creativity, innovation and technology\n4月15日4月21日　　Acquiring technology (1): research and development\n4月22日4月28日　　Mid-term week\n4月29日5月5日　　Acquiring technology (2): technology transfer and outsourcing\n5月6日5月12日　　Nurturing technology: technology infrastructure, Science and Technology Policy, innovation systems\n5月13日5月19日　　Sustaining technology: Green technology\n5月20日5月26日　　Technology as service: Knowledge-intensive business service\n5月27日6月2日　　Technology and law: Intellectual property right\n6月3日6月9日　　Social shaping of technology: The human side of technology\n6月10日6月16日　　Term project presentation\n6月17日6月23日　　Final Examination","scorePolicy":"評分標準﹕For this course, total score is one hundred points (100%). Middle term Examination worth thirty points (30%) and Final Examination worth thirty points (30%). Homework worth forty points (40%). Twenty points are for the reading assignment and another twenty points are self-designed activity to earn the points.","materials":"教科書﹕Robert A. Burgelman, Clayton M. Christensen and Steven C. Wheelwright 2009 Strategic Management of technology and Innovation　　\n請尊重智慧財產權請用正版書籍","foreignLanguageTextbooks":false}]
