[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2013-01-17 09:13:29","objective":"This course focuses on well-known marks. It is a research-based course. Two professors will teach this course together. Prof. Chen will teach U.S. cases and TIPC cases. The new faculty will teach EU cases. Each professor will lead four students to write a short thesis that will be submitted to a journal or conference.","schedule":"This year the course focuses on well-known trademarks.\n\nClass 1 Introduction: Well-known mark protection; research project assignments.\n\nClass 2 Legislation History and International Law: Paris Convention; TRIPS; WTO-WIPO Joint Recommendation Concerning Provisions on the Protection of Well-Known Marks; 1997 amendment; 2003 amendment.\n\nClass 3 Well-known mark protection in the United States: Mead Data Cent., Inc. v. Toyota Motor Sales, U.S.A., Inc., 702 F. Supp. 1031 (S.D.N.Y. 1988) (describing how Lexus was selected); Mead Data Cent., Inc. v. Toyota Motor Sales, U.S.A., Inc., 875 F.2d 1026 (2d Cir. 1989); Anne Gilson LaLonde, Don’t I Know You from Somewhere? Protection in the United States of Foreign Trademarks That are Well Known But not Used There, 98 Trademark Rep. 1379 (2008).\n\nClass 4 Fashion Industy: 最高行政法院判決100年度判字第495號和智慧財產法院行政判決98年度行商更(一)字第9號（VALENTINO）；智慧財產法院民事判決100年度民商上字第10號（CHANEL）；智慧財產法院民事判決100年度民商訴字第44號（SWAROVSKI）。\n\nClass 5-1 Hotel Industry: 智慧財產法院行政判決100年度行商訴字第73號（Amanresorts）；陳秉訓（2012年4月），「向旅館業的著名商標—以智慧財產法院行政判決100年度行商訴字第59號為例」，2012第六屆服務創新國際研討會，明新科技大學服務事業學院主辦，2012年4月25日，新竹縣；智慧財產法院行政判決97年度行商訴字第83號（Four Seasons）；陳秉訓（2012年11月），「四季酒店失敗的商標保衛戰：評智慧財產法院行政判決97年度行商訴字第83號」（第一及通訊作者，與王勅怡合著），2012旅遊觀光暨休閒運動學術研討會，台南市旅行商業同業公會主辦（南台科技大學休閒事業管理系執行），2012年11月17日，台南市。\nClass 5-2 Entertainment Industry: 最高行政法院判決100年度判字第2098號和智慧財產法院行政判決99年度行商訴字第232號（大長今）。\n\nClasses 6-8: TBD by the new faculty. \n\nClass 9 One-to-one meeting\n\nClasses 10-15 Lectures offered by judges, lawyers, and practitioners\nLecture 1-3/11-商標侵權民事訴訟中權利人不該做的事情-杜沛蓁（智慧財產法院/法官助理）\nLecture 2-3/25-著名商標保護的立法史-王䊵娟（智慧財產局法務室/事務員）\nLecture 3-4/8-商標實務及案例分享-葉易雲（台一國際專利法律事務所國外部商標處/主任）\nLecture 4-4/22-從科技公司觀點看商標保護與品牌經營-周繼芳（神達電腦股份有限公司/高級專員）\nLecture 5-5/6-著名商標保護的司法實務觀察-熊誦梅 法官（智慧財產法院/法官）\nLecture 6-5/13-台灣獨立音樂的中心：The Wall的品牌經營經驗-傅鉛文（THE WALL MUSIC/執行長） \n\nClass 16 Oral Presentation I\nClass 17 Oral Presentation II\nClass 18 Term paper due","scorePolicy":"Term Paper: 60%; Presentation 30%; Participation: 10%.","materials":"1. Court decisions and journal articles.\n2. The lectures will be scheduled from 6:40 PM to 8:30 PM.","foreignLanguageTextbooks":false}]
