[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2013-01-25 14:19:35","objective":"This course is not intended to teach how to prepare an opinion of patent infringement. Instead, this course covers the law related to patent infringement opinions in terms of civil procedure. Each student will be assigned with one research topic.\n\nThis course includes:\n--Module I Evidentiary Aspect\n--Module II Claim interpretation\n--Module III Legal doctrines of patent infringement analysis\n--Module IV In-depth research\n--Module V Lectures offered by TIPC judges, TIPC techincal examiers, lawyers, and practitioners","schedule":"Class 1 Introduction: 專利權與專利侵害；專利侵害鑑定報告之概念；research project assignments.\n\nClass 2 Legal Characteristics I: 教科書第二章第四節；司法院釋字第507號解釋；最高法院民事裁定101年度台上字第1473號（專利侵害鑑定基準的性質）；智慧財產法院民事判決101年度民專上易字第2號（未依鑑定原則之報告）；黃舒汉，再論「二分」與「三分」之爭：從憲法觀點檢討職權命令的存廢問題，東吳法律學報，23卷2期，2011，頁2-30。\n\nClass 3 Legal Characteristics II: （1）教科書第二章第五節；（2）最高法院民事判決92年度台上字第1479號；；陳秉訓（2008年1月），「最高法院民事判決92年度台上字第1479號評析—關於專利侵權民事訴訟中數份鑑定報告相互衝突的問題」，中律會訊雜誌，第10卷，第3期，頁32-36。（3）最高法院民事判決95年度台上字第1886號；；陳秉訓（2008年5月），「談專利侵權民事訴訟中侵權物遺失時鑑定報告證據力的判斷—以最高法院民事判決95年度台上字第1886號為中心」，中律會訊雜誌，第10卷，第6期，頁83-87。\n\nClass 4 Claim Construction I: 智慧財產法院民事判決99年度民專上字第60號（網際網路資訊蒐集方法及裝置）；智慧財產法院民事判決101年度民專上易字第1號（碎石排水袋）；智慧財產法院民事判決100年度民專上更(一)字第4號（罩杯襯墊組合構造改良）。\n\nClass 5 Claim Construction II: 智慧財產法院民事判決100年度民專上更(一)字第3號（衛星天線盤體唇緣構造改良）；智慧財產法院民事判決98年度民專訴字第36號（請求項差異化原則）；智慧財產法院民事判決99年度民專上字第5號（法院的更正權）。\n\nClass 6 Literal Infringement: 智慧財產法院民事判決99年度民專訴字第128號（具有端子保護功能之卡片連接器）；智慧財產法院民事判決101年度民專上易字第2號（設計專利）；智慧財產法院民事判決100年度民專訴字第7號（方法專利）。\n\nClass 7 Doctrine of Equivalents I-DOEs 101: 智慧財產法院民事判決99年度民專上字第6號（影像式插管輔助裝置）；智慧財產法院民事判決99年度民專上字第60號（網際網路資訊蒐集方法及裝置）；智慧財產法院民事判決101年度民專上字第17號（電錶接線座之導電構件改良）。\n\nClass 8 Doctrine of Equivalents II-File-Wrapper Estoppel and Other Defenses: 智慧財產法院民事判決99年度民專上字第76號（逆均等論）；智慧財產法院民事判決100年度民專上字第53號（禁反言）；智慧財產法院民事判決100年度民專上字第20號（禁反言）；智慧財產法院民事判決100年度民專訴字第128號（先前技術阻卻）。\n\nClass 9 One-to-one meeting\n\nClasses 10-15 Lectures offered by judges, techincal examiers, lawyers, and practitioners\nLecture 1-3/4-如何協助客戶準備專利侵害鑑定報告-溫鵬興（亞太國際專利商標事務所/專案經理）\nLecture 2-3/6 (Wed)- 專利侵害鑑定報告的證據力-蔡惠如 法官（智慧財產法院）\nLecture 3-3/18-從公司角度看專利侵害鑑定-闕河國（緯創資通股份有限公司/專利經理/專利代理人）\nLecture 4-4/1-專利侵害分析：技審官的角度-薛惠澤（智慧財產法院/技術審查官）\nLecture 5-4/15-專利侵害陳述中常見的錯誤-杜沛蓁（智慧財產法院/法官助理）\nLecture 6-4/29-專利侵害鑑定報告的撰寫-顏吉承（智慧財產局專三組/科長）\n\nClass 16 Oral Presentation I\nClass 17 Oral Presentation II\nClass 18 Term paper due","scorePolicy":"1. Grading policy: Term Paper: 60%; Presentation 30%; Participation: 10%.\n2. Each student has to finish one term paper ready for submission. Each student will be assigned with a research topic which is either a case study or a comprehensive analysis.","materials":"1. TIPC cases and journal articles.\n2. 陳榮宗、林慶苗，民事訴訟法（中），臺北：三民書局。You must buy this book.\n3. The lectures will be scheduled from 6:40 PM to 8:30 PM.","foreignLanguageTextbooks":false}]
