[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2012-12-29 10:54:54","objective":"This is a research-based course. The course covers international IP treaties, IP-related provisions in some free trade agreements, and judicial decisions related to those international IP treaties. Eight research topics will be assigned to the participating students.\n\nThe research-based course includes:\n--Module One: International law 101\n--Module Two: IP treaties; IP provisions in FTAs\n--Module Three: Case law\n--Module Four: In-depth studies\n--Module Five: Lecture series sponsored by the Taiwn Law Society (台灣法學會)","schedule":"Class 1-Introduction: Understanding International IP law; Project assignments\n\nClass 2-Taiwan and Sovereign State: Xin Qiang, Mainland China’s Taiwan Policy Adjustments, 5(1) CHINA SECURITY 55 (2009); Eric Ting-Lun Huang, The Modern Concept of Sovereignty, Statehood and Recognition: A Case Study of Taiwan, 16 N.Y. INT’L L. REV. 99 (2003); Winston P. Nagan &amp; Aitza M. Haddad, Sovereignty in Theory and Practice, 13 SAN DIEGO INT’L L.J. 429 (2012).\n\nClass 3-WTO, TRIPS, and WIPO: Hwan Kim, The World Trade Organization Dispute Settlement System: China—Measures Affecting the Protection and Enforcement of Intellectual Property Rights, 23 N.Y. INT’L L. REV. 83 (2010) (describing the history of the WTO); Emir Aly Crowne, Fishing TRIPS: A Look at the History of the Agreement on Trade-Related Aspects of Intellectual Property, CREIGHTON INT’L &amp; COMP. L.J. 77 (2011); Zion H. Park, Comment, What the PCT Can Learn from Two African Systems, J. MARSHALL REV. INTELL. PROP. L. 693 (2007).\n\nClass 4-Paris Convention; Berne Convention; Rome Convention; Phonograms Convention: Four treaties; Graeme W. Austin, Intellectual Property Politics and the Private International Law of Copyright Ownership, 30 BROOK. J. INT’L L. 899 (2005); 專利師考試之專利法規考題檢討。\n\nClass 5-FTAs: Mohamed R. Hassanien, Bilateral WTO-Plus Free Trade Agreements in the Middle East: A Case Study of OFTA in the Post-TRIPS Era, 8 WAKE FOREST INTELL. PROP. L.J. 161, 170-71 (2008); Taiwan’s FTAs; China’s FTAs; Japan’s FTAs; Korea’s FTAs.\n\nClass 6-EU Aspect: Kevin P. Mahne, A Unitary Patent and Unified Patent Court for the European Union: An Analysis of Europe’s Long Standing Attempt to Create a Supranational Patent System, 94 J. PAT. &amp; TRADEMARK OFF. SOC’Y 162 (2012); Patrick Coyle, Note, Uniform Patent Litigation in the European Union: An Analysis of the Viability of Recent Proposals Aimed at Unifying the European Patent Litigation System, 11 WASH. U. GLOBAL STUD. L. REV. 171 (2012); Silvia Beltrametti, Evaluation of the Design Piracy Prohibition Act: Is the Cure Worse Than the Disease? An Analogy with Counterfeiting and a Comparison with the Protection Available in the European Community, 8 NW. J. TECH. &amp; INTELL. PROP. 147 (2010).\n\nClass 7-Judicial Interpretation and Application of IP Treaties in Taiwan I: 智慧財產法院民事判決99年度民商上字第1號（英國籍權利人的訴訟能力）；智慧財產法院民事判決101年度民著上字第2號（日本籍權利人）；智慧財產法院行政判決100年度行專訴字第10號（PCT）；智慧財產法院民事判決99年度民專上字第21號（Paris Convention）；智慧財產法院民事判決99年度民專訴字第159號（方法專利的保護）。\n\nClass 8-Judicial Interpretation and Application of IP Treaties in Taiwan II: 智慧財產法院民事判決100年度民著訴字第31號（外國著作的專屬授權）；智慧財產法院民事判決99年度民著訴字第69號（中國籍權利人）；智慧財產法院民事判決99年度民著上再易字第1號（中國香港籍著作）；智慧財產法院民事判決98年度民著訴字第42號（TRIPs第46條）。\n\nClass 9-ECFA: ECFA; CSAIPRPC; Pasha L. Hsieh, The China—Taiwan ECFA, Geopolitical Dimensions and WTO Law, 14 J. INT’L ECON. L. 121 (2011); Chi-An Chou, Comment, A Two-Edged Sword: The Economic Cooperation Framework Agreement between the Republic of China and the People’s Republic of China, 6 B.Y.U. INT’L L. &amp; MGMT. REV. 1 (2012); 陳秉訓（2012年12月），”Why the Economic Cooperation Framework Agreement Cannot Have Provisions Related to Intellectual Property?”，2012企業及財經法律學術研討會，張麗堂文教助學基金會和南台科技大學財經法律研究所主辦，2012年12月14日，台南市。\n\nSix Classes: Sponsored by the Taiwn Law Society \n\nClass 16-Oral presentation I\nClass 17-Oral presentation I\nClass 18-Term paper due","scorePolicy":"Term Paper: 60%; Presentation 30%; Participation: 10%.\n\nGrading curve:\n-- 90&gt;: 1-2 people\n-- &lt;89: other students","materials":"Treaty texts; Taiwan court decisions; and journal articles.","foreignLanguageTextbooks":false}]
