[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2013-02-19 14:16:01","objective":"本課程的目的是複習英語的句子結構，以獲得對語法形式更深層的瞭解，包含各種描述性或理論性的分析方法。藉著採用不同英語教學方法，這種瞭解與知識有助於解答在英語教學上所遭遇的各種學習歷程的問題，尤其是寫作和翻譯的學習過程中。","schedule":"February 18 Introduction and Metalanguage\nFebruary 25 Phrase Structure 　　　　　　　　Corpus 1 (Conrad 2000)\nMyers, James L. and Shu-fen Chang. 2009. A multiple-strategy-based approach to word and collocation acquisition. International Review of Applied Linguistics in Language Teaching 47.2:179-207.\nConrad, Susan. 2000. Will corpus linguistics revolutionize grammar teaching in the 21st century? TESOL Quarterly 34.3: 548-560.\nMarch 4 TAM (Riddle 1986)　　　　　　　　　　Chs 3/4 (Hunston)\nHunston, Susan. 2002. Corpora in Applied Linguistics. Cambridge: Cambridge University Press. \nRiddle, Elizabeth. 1986. The meaning and discourse function of the past tense in English. TESOL Quarterly 20: 267-286.\nMarch 11 Individual research　　　　　　　　　　\nMarch 18 TAM　　　　　　　　　　　　　　Corpus 2\nMarch 25 Questions (Holmes 1988)　　　　　　Corpus 3 \nHolmes, Janet. 1988. Doubt and certainty in ESL textbooks. Applied Linguistics 9.1: 21-43.\nBiber, Douglas. 2009. A corpus-driven approach to formulaic language in English: Multi-word patterns in speech and writing. International Journal of Corpus Linguistics 14.3: 275-311.\nApril 1 Negation and Imperatives 　　　　　　　　Corpus 4 \nFord, Cecilia E. 2001. At the intersection of turn and sequence: negation and what comes next. In Couper-Kuhlen, Elizabeth and Margret Selting, eds., Interactional linguistics, 51-79. Amsterdam: John Benjamins.\nGibbs, Raymond W. Jr., Paula Lenz Costa Lima, Edson Francozo. 2004. Metaphor is grounded in embodied experience.Journal of Pragmatics 36: 1189-1210.\nPerales, Susana. 2010. The status of the auxiliary do in L1 and L2 English negative clauses. International Review of Applied Linguistics in Language Teaching 48:1-23.\nApril 8 Passives and Indirect Objects 　　　　　　Corpus 5\nHinkel, Eli. 2002. Why English passive is difficult to teach (and learn). New perspectives on grammar teaching in second language classrooms, ed. by Eli Hinkel and Sandra Fotos, Lawrence Erlbaum Associates, 234-259.\nTao, Hongyin. 2003. A usage-based approach to argument structure: ‘Remember’ and ‘forget’ in spoken English. International Journal of Corpus Linguistics 8.1: 75-95.\nApril 15 Topic Presentations\nApril 22 Nouns 　　　　　　　　　　　　　　Corpus 6 (Meyer 2007)\nFox, Barbara and Sandy A. Thompson. 1990: A discourse explanation of the grammar of relative clauses in English conversation.Language 66: 297-316.\nFox, Barbara and Sandy A. Thompson. 2007. Relative clauses in English conversation: relativizers, frequency and the notion of construction. Studies in Language 31: 293-326.\nMeyer, Charles. 2007. Functional grammar and discourse studies. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 276-291.\nApril 29 Modifiers 　　　　　　　　　　　　Corpus 7 (McCarthy 2007)\nKamoen, Naomi, Bregje Holleman, Rick Nouwen, Ted Sanders, Huub van den Bergh. 2011. Absolutely relative or relatively absolute? The linguistic behavior of gradable adjectives and degree modifiers. Journal of Pragmatics 43: 3139-3151.\nMcCarthy, Michael. 2007. Talking back: “small” interactional response tokens in everyday conversation. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 292-319.\nMay 6 It, There, and Focus　　　　　　　　　　Corpus 8 (Poos Simpson 2007)\nPoos, Deanna and Rita Simpson. 2007. Cross-disciplinary comparisons of hedging: Some findings from the Michigan Corpus of Academic Spoken English. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 73-91.\nMay 13 Prepositions　　　　　　　　　　　　Corpus 9 (Carter 2007)\nCarter, Ronald. 2007. Common language: Corpus, creativity and cognition. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 251-275.\nMay 20 Coordination 　　　　　　　　　　　　Corpus 10 (Coxhead 2000)\nCozijn, Reinier, Leo G. M. Noordman, and Wietske Vonk. 2011. Propositional integration and world knowledge: Discourse Processes 48: 475-500\nCoxhead, Averil. 2000. A new academic","scorePolicy":"Oral Presentations 40%\n  Chapter Presentations\n  Application in Teaching (lesson planning and test design)\nDiscussion and Participation 30%\nFinal Paper (around ten pages, single-spaced) and Presentation 30%","materials":"O’Keeffe, Anne, Michael McCarthy, and Ronald Carter. 2007. From corpus to classroom. Language use and language teaching. Cambridge: Cambridge University Press.\nCelce-Murcia, Marianne and Diane Larsen-Freeman. 1999. The grammar book: An ESL/EFL Teacher’s Course. Heinle and Heinle.\n\nOther readings:\nCarter, Ronald and Michael McCarthy. 1995. Grammar and the spoken language. Applied Linguistics 16.2: 141-158.\nCelce-Murcia, Marianne. 2002. Why it makes sense to teach grammar in context and through discourse. New perspectives on grammar teaching in second language classrooms, ed. by Eli Hinkel and Sandra Fotos, Lawrence Erlbaum Associates, ???.\nCrowdy, Steve. 2007. Spoken corpus design. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 320-333.\nDickins 1988\nDurrant, Philip and Norbert Schmitt. 2009. To what extent do native and non-native writers make use of collocations? International Review of Applied Linguistics in Language Teaching 47.2: 157-177.\nHalliday, Michael. A. K. 2007. The spoken language corpus: A foundation for grammatical theory. Corpus linguistics: Critical concepts in linguistics, ed. by Wolfgang Teubert and Ramesh Krishnamurthy, London: Routledge, 334-363.\nHinkel, Eli. 2002. Teaching grammar in writing classes: tenses and cohesion. New perspectives on grammar teaching in second language classrooms, ed. by Eli Hinkel and Sandra Fotos, Lawrence Erlbaum Associates, ???.\nHolme, Randal. 2010. A construction grammar for the classroom. International Review of Applied Linguistics in Language Teaching 48.4: 355-377.\nLiu, Dilin. 2011. The most frequently used English phrasal verbs in American and British English: A multicorpus examination. TESOL Quarterly 45.4:661-688.\nMaster, Peter. 2002. Relative clause reduction in technical research articles. New perspectives on grammar teaching in second language classrooms, ed. by Eli Hinkel and Sandra Fotos, Lawrence Erlbaum Associates, 201-231.\nMaster, Peter. 2002. Relative clause reduction in technical research articles. New perspectives on grammar teaching in second language classrooms, ed. by Eli Hinkel and Sandra Fotos, Lawrence Erlbaum Associates, 201-231.\nYamashita, Junko and Nan Jiang. 2010. L1 influence on the acquisition of L2 collocations: Japanese ESL users and EFL learners acquiring English collocations. TESOL Quarterly 44.4: 647-668.\nZhu, Yunxia. 2006. Understanding sociocognitive space of written discourse: Implications for teaching business writing to Chinese students. International Review of Applied Linguistics in Language Teaching 44.3: 265-285.","foreignLanguageTextbooks":false}]
