[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2013-02-19 20:37:18","objective":"以顧客為重心已蔚為目前市場行銷的重要潮流。了解顧客決策過程也成為行銷領域研究的主流。一般而言，顧客的購買決策制定過程決定產品與服務的購買結果，主要包括五個階段：(1)問題察覺、(2)資訊搜尋、(3)方案評估、(4)購買選擇、(5)購後過程。消費者的購買決策制定過程深受各種不同因素之影響。這些因素大抵可分為兩個類別：個人內在因素（知覺、資訊處理與學習、記憶、知識、動機與涉入、價值觀、自我與人格、生活形態、態度、與情感等）與環境因素（行銷環境、購買情境、文化、團體與人際影響、家庭等）。本課程主要目標在使學生了解顧客決策過程與相關心理學、社會學、行銷學與廣告學原理之間的關係。本課程強調如何藉由理論概念、實例討論與實作方式進一步了解消費者，並將此知識應用於行銷策略上。此外網際網路為一整合媒體,有別於傳統之行銷環境,在網際網路上消費者與媒體可以產生高度的互動,並且也可能產生虛擬經驗.本課程也從顧客行為理論出發,探討在網際網路環境下之消費者行為。課程以哈佛式個案討論為主。","schedule":"週次　　主題\nText Book　　內容與個案\n1.　　(耿慶瑞)\n課程介紹\n消費行為概論補充資料\n課程主軸：\n 消費行為理論\n 顧客行為個案(哈佛個案)\n 互動行銷個案(光華個案)\n\n\n\n2　　(汪志堅)\nCh2-3　　Chapter 02 知覺\n第一節　感官刺激\n第二節　暴露階段\n第三節　注意階段\n第四節　解釋階段\nChapter 03 學習與記憶\n第一節　行為學習理論\n第二節　認知學習理論\n第三節　記憶\n\n3. 　　(汪志堅)\nCh4-5　　Chapter 04 動機與價值\n第一節　動機\n第二節　價值觀\nChapter 05 人格特性與生活型態\n第一節　人格理論\n第二節　生活型態\n第三篇　消費行為\n\n4. 　　(汪志堅)\nCh6　　Chapter 06 態度\n第一節　態度構成的三要素\n第二節　態度的衡量\n第三節　多重屬性態度模式\n第四節　態度的功能\n第五節　態度的承諾\n第六節　態度的形成與變遷\n\n5. (汪志堅)\nCh7-8　　Chapter 07 資訊搜尋\n第一節　消費者購買決策的類型\n第二節　問題確認\n第三節　資訊搜尋\n第四節　影響資訊搜尋的原因\nChapter 08 方案評估與購買行動\n第一節　評估準據\n第二節　評估的模式\n第三節　購買行動\n\n6. 　　(汪志堅)\nCh9-10　　Chapter 09 購買情境與購後行為\n第一節　購買情境\n第二節　購後行為\n第三節　產品的處置\nChapter 10 群體影響與意見領袖\n第一節　參考群體\n第二節　口碑\n第三節　意見領袖\n\n7.　　(汪志堅)\nCh16　　Chapter 16 消費者創新與網路消費行為\n第一節　創新的種類\n第二節　創新的特性\n第三節　創新採用者的類型\n第四節　創新擴散的影響因素\n第五節　科技接受模式\n第六節　網路消費行為\n第七節　各種網路行為研究\n\n8.　　(耿慶瑞)\n哈佛商學院HBS Case1: IKEA\n1.請分析採購家俱的消費者行為,通常消費者會有哪些困難?\n2.家俱業者提供哪些服務來解決困難?\n3.分析美國的家俱市場\n4.IKEA提供給消費者什麼價值?商業模式為何?\n5.IKEA如何在美國拓展市場?\n\n9. 演講(2小時)\n\n10. 　　(耿慶瑞)\n哈佛商學院HBS: Case2: Colgate‐Palmolive Precision Toothbrush\n1. What changes are occurring in the toothbrush category? Assess Colgate‐Palmolive’s competitive position.\n2. How is the toothbrush market segmented? Compare consumer behavior for toothbrushes and toothpaste.\n3. What are the arguments for launching precision as (a) a niche product and (b) a mainstream brand?\n4. What recommendations would you make to Steinberg?\n\n11. 　　(耿慶瑞)\n哈佛商學院HBS Case3: Tivo in 2000\n1. Analyze the situation from the consumer's standpoint. What is TiVo? What factors facilitate its adoption? What factors make adoption difficult? Who is TiVo best suited for?\n2. Now adopt the standpoint of the networks, the advertisers, and the cable/satellite\ncompanies: what do they want TiVo to be? Thinking about the competition: What are Microsoft’s potential strengths and weaknesses in this market?\n3. How would you describe and characterize TiVo’s action plan as given at the end of the case? How do you evaluate the planned communication campaign? Does your situation analysis suggest an alternative plan?\n12. (4/23)　　(耿慶瑞)\n　　哈佛商學院HBS Case4 : Snapple\n1. In the period of 1972 to 1993, why do you thing that Snapple flourished when so many small startup premium fruit drinks stayed small or disappeared? Explore each of the four Ps. \n2. Now look at the period from 1994 to 1997. Did Quaker make an error in buying Snapple or did they manage it badly? \n3. Roll forward to 1988. What can Triarc's managers learn from Quaker's experience? What can they apply from their own experience? Is the Snapple target market \"anyone with lips?\" Is it ok that Snapple \"ends up meaning lots of different things to lots of different people?\" What are the risks and rewards of leaving \"what the brand stands for\" open the consumer's interpretations rather than a strong positioning on it?And what does it mean to say that Snapple is a fashion brand?","scorePolicy":"13. (4/30)　　(耿慶瑞)\n　　哈佛商學院HBS: Case5:Avon.com\n1.　　Should Edwards recommend to Jung that Avon sell directly to consumers? What would the other elements of this strategy look like? Would the commission levels change? Which product would be sold online and which would not?\n2.　　What would Edwards hope to gain from such a strategy?\n3.　　How should Avon manage the conflict that such a strategy would create?\n4.　　Are there other strategies that would take advantage of the Web without creating this conflict? What would their principal objectives be?\n\n14. 5/7　　(江拕先)\n　　行銷贏家競賽\n15. 5/14　　(江拕先)\n　　光華個案Case1\n匯豐汽車eMentor\n1.匯豐汽車為何要開發eMentor系統?\n 2.eMentor系統的效益為何?\n 3.eMentor系統開發與推廣的關鍵成功因素有哪些?\n 4.匯豐汽車是否需要強制業務代表使用eMentor系統?\n 5.面對使用率不高的狀況，匯豐汽車之知識平台是否有必要推行繼續推行？有什麼要點是匯豐汽車可以在知識管理平台上進行改進？\n 6.eMentor系統是否必要在如此經濟不景氣的環境下繼續投入資金進行開發與推動？\n 7.給李總經理的建議\n16. 5/21　　(江拕先)\n　　行銷贏家競賽\n16. 5/28　　(江拕先)\n　　光華個案Case2\n西基動畫\n1. 動畫產業未來有潛力的發展方向？動畫產業朝向自製可能產生的困難點為何？ \n2.   各類型動畫廠商未來可發展的價值活動？各價值活動未來整合的可能性？\n3.   動畫的製作過程與電影的製作過程有何差異？最關鍵的作業活動為何？\n4.   西基動畫公司的策略(自製、代工)的演變？\n5.   系西基動畫公司資訊系統開發動機？\n6.   系統開發的困難點？以及如何解決？\n7.   Spider系統能帶來哪些效益？\n8.   施總經理的人格特質與組織文化為何？是否對西基的成功帶來影響？是否還有其他內部或外部的因素影響其未來的發展\n9.   西基動畫公司目前主要以代工為營收來源，與台積電相似，台積電是全球專業晶圓代工的龍頭廠商，也是全球首先選擇以晶圓代工為經營策略的半導體廠商。這兩家公司營運模式中，是否有其相似之處，西基的策略是否適當？下一步該怎麼走？\n17. 6/4　　(江拕先)\n　　光華個案Case3\n燦坤3C:CRM\n1. 消費者考量3C產品的因素為何?燦坤在這些因素當中有何優勢?\n2.      燦坤集團是如何多角化經營?吳燦坤是何種決策者?\n3.      2001年前燦坤行銷模式有何問題?\n4.      燦坤為何要導入CRM?\n5.      燦坤為CRM的功能及效益為何?\n6.      成功導入CRM的關鍵有哪些?燦坤具備了多少?\n7.      未來燦坤CRM還要如何改進與應用?\n18. 6/11　　(江拕先) \n　　行銷贏家競賽\n\n\n一、教材:\n課本:\n消費者行為(第三版) \n‧　　作者：汪志堅\n‧　　出版社：全華圖書\n‧　　出版日期：2010年03月29日\n‧　　語言：繁體中文 ISBN：9789572174623 \n‧　　裝訂：平裝\n\n個案：\n哈佛商學院HBS Case(須購買版權)\n光華個案(須購買版權)\n\n二、評分方式:\n個案討論(40%)  個案心得報告(60%) \n\n\n個案討論: 共8個，所有同學需任選繳交3個心得(2個哈佛商學院HBS個案1個光華個案)報告\n\n\n上課規則如下：\n第一節 相關教材補充說明\n第二節 休息時間與小組討論(分4組,每組上課時抄兩個個案筆記)\n80分鐘個案討論(請準時入座)","materials":"一、教材:\n課本:\n消費者行為(第三版)\n‧　　作者：汪志堅\n‧　　出版社：全華圖書\n‧　　出版日期：2010年03月29日\n‧　　語言：繁體中文 ISBN：9789572174623\n‧　　裝訂：平裝\n個案：\n哈佛商學院HBS Case(須購買版權)\n光華個案(須購買版權)","foreignLanguageTextbooks":false}]
