[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2013-02-07 11:55:29","objective":"本課程強調全方位的國際商用英語溝通。現今各領域上之商業活動多以英語進行，因此本課程注重發展學生以英語文進行流暢之溝通的關鍵能力，特別強調商業組織內外部常見的正式溝通之形式，包括商用英語寫作、簡報與會議技巧。課時也納入非正式溝通技巧，指導學生學習應對職場情境，因應相關之溝通需求。Course Title:　　    Business Communication in English \nCredit Hours:　　　　3\nTerm Offered:　　　　Spring, 2013\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw \nOffice 　　　　　　General Education Building Rm#805\nOffice Hours:　　　　By Appointment \nRequired Text:    (1) Collins CoBuild Business Vocabulary in Practice  \n                (2) Harvard Business Essentials on Communication \n(3) Business Writing: Skills, Applications, and Practices \nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice to facilitate effective business communication. Business content vocabulary incorporating several main business categories / disciplines will be introduced. \nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\n(1)　　learn about business through the medium of English \n(2)　　promote high level of awareness of the business climate \n(3)　　improve reading comprehension of articles relating to business\n(4)　　develop functional business language in English","schedule":"Weekly Syllabus\nWeek / Date 　　Main Course Activities\n(Task-Based) 　　Business Vocab.\n(Content-Based)　　Quiz / Note\nWk 1 　　Orientation 　　Business VQ test　　\nWk 2　　Presentation Unit 2\nCareers　　Management　　\nWk 3　　Presentation Unit 3\nChange　　Management　　\nWk 4　　Presentation Unit 4\nRisk　　Marketing 　　Quiz 1\nWk 5　　Presentation Unit 5\nTeamwork　　Marketing 　　\nWK 6　　Special Topic: Marketing (Tentative)　　*Marketing 　　Wharton Business School / HBS \nWK 7　　Special Topic: Marketing (Tentative)　　*Marketing　　Wharton Business School / HBS\nWK 8　　Presentation Unit 6\nProgress　　Production &amp; Operation Management　　Quiz 2\nWK 9　　Midterm Week　　Midterm Week 　　\nWK 10　　Presentation Unit 7\nLearning 　　Production &amp; Operation Management 　　\nWK 11　　Presentation Unit 8\nPerformance　　Money &amp; Banking　　Quiz 3\nWK 12　　Presentation Unit 9\nResources 　　Money &amp; Banking　　\nWK 13　　University Evaluation　　University Evaluation 　　\nWK 14　　Presentation Unit 10\nLeadership　　Trade &amp; Commerce　　Quiz 4\nWK 15　　Presentation Unit 11\nValues 　　Trade &amp; Commerce　　\nWK 16　　Current Business Topics　　Company Finance　　Quiz 5\nWK 17　　Current Business Topics 　　Company Finance　　\nWK 18　　Final Exam","scorePolicy":"Course requirements:\nEach student must complete the following requirements:  \n1)　　attendance* noted for grading details\n2)　　reading all materials assigned \n3)　　taking lecture notes \n4)　　in-class oral quizzes (Q&amp;A) based on the reading materials *see note   \n\nGrading Policy:　　1) Final Exams 30%\n　　　　　　　　2) In-class oral quizzes and presentations 20%\n　　　　　　　　3) Notes and assignemnts  20%\n　　　　　　　　4) Attendance  30%　　\nLeaves and Absences: 　　1) Any AWOL will result in the penalty of 10% semester grade deduction.\n　　　　　　　　  　　2) Penalty-waiver can be granted for any absence w/ official document at the \n　　　　　　　　　　   　　 instructor’s discretion. It is only limited for one time in the entire semester. \nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \n\nOral Quizzes Guideline(s): 1) Each class session will begin with a few oral quiz questions. Students will be selected randomly by the course instructor to provide brief answers to the questions. Each question asked and answer will be rewarded 2 percent of semester grade (2 points on the percentage scoring scale). Failure will result in proportionate deduction.  2) Students will be divided into 10 to 15 groups, responsible for preparing questions based on the previous and current materials read and discussed. Students are also required to provide possible answers or interpretations to all questions asked, distributed by paper or electronic means. 1) Each presentation will be delivered by students as assigned. The time duration for each is 40-50 mins, which will be followed by the presentation commentators for another 10 mins. Both presenters and commentators need to work collaboratively prior to class delivery. \n　　2) All presentations will be delivered by PPT, and need to include the unit components assigned. Main emphasis needs to be contributed to the analysis of the unit case study. (See textbook)\n　　3) Each presentation group is responsible to provide a list of unit content vocabulary edited bilingually, which later will be tested. \n　　4) Both the draft and revised PPT files, and the unit vocabulary list need to be submitted on the compact disc to the instructor a week after the presentation.\n\nQuizzes &amp; Tests:　　1) Each quiz comprises 2-3 parts: unit vocabulary &amp; business concept vocabulary, and current business issues. \n2) Unit vocabulary will be prepared by student presenters. Business concept vocabulary by fields and disciplines will be introduced by the class instructor. \n3) Students will be assigned to read current business articles to develop essential business intelligence.","materials":"Required Text:    (1) Collins CoBuild Business Vocabulary in Practice  \n                (2) Harvard Business Essentials on Communication \n(3) Business Writing: Skills, Applications, and Practices","foreignLanguageTextbooks":false}]
