[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2013-03-22 16:52:31","objective":"本課程旨在培養學生創作能力，寫作文類包括詩、小說和戲劇，乃至任何別出心裁的新類型，如以非小說類型呈現的多媒體創作。學生經由本課程所學的教巧訓練和寫作策略的運用，不但將具備寫作的能力和深度，更可直接將此能力學以致用，發揮在專業寫作上，包括新聞、設計、廣告以及藝術管理行政。","schedule":"SYLLABUS\n\nCircumnavigate your mind!  Assassinate time!  In a single blinding flash five-thousand years of human culture comes down to a limitless now. What are you going to do about it?  Jump ship just when things are getting interesting?  Why not join us on a voyage over the edge of the ocean to the place where chimeras first see the sun’s light?  Or how about flapping your arms and taking flight?  Consider yourself invited on a unique, experiential journey!  No longer will you be standing outside of literature, on the sidewalk of both slim and fat chances (you can take your choice!), weighty suitcase of criticism in hand, looking on forlornly as if through the window of a very expensive department store.  This course offers a unique opportunity to experience literature from the inside, to participate in writing as a professional writer or critic does, directly tapping into language through a mysterious fusion of inner and outer, subjective with objective, the nonsensical, whimsical and dreamlike with the factual, the actual, the real.  For the purposes of this course, we will broaden our definition of creative writing from its major genres, poetry and fiction, to include emergent cross-disciplinary forms such as creative non-fiction, performance art and autobiographically-","scorePolicy":"GRADING\n\nOne-half of your participation score in the class will be based on your weekly experiments within the many genres of creative writing at your command.  To receive full credit, you must also bring enough copies so that every class member (and the professor) can read along with you as you read your work aloud.\n\nI WOULD ALSO LIKE FOR YOU TO TRY TO RECORD AS MANY DREAMS AS YOU CAN.  I WILL NOT FORCE YOU TO READ THESE IN CLASS BUT WILL DISCUSS THEM PERSONALLY WITH YOU, PERHAPS SHOWING HOW THEY CAN BE MINED FOR BOTH PSYCHIC AND ARTISTIC MATERIAL.  IDEALLY YOU SHOULD RECORD AT LEAST ONE DREAM PER WEEK, AND MEET WITH ME IN MY OFFICE TO DISCUSS THEM EVERY THREE WEEKS, MINIMUM.\n\nFormal grades will be based on a short (3-5 page, depending on the genre employed) piece of writing handed on at midterm, which may be a development of combination of a previous experiment or experiments (INCLUDING YOU DREAMS); and another, longer, work of collection of works due at the conclusion of the semester.\n\nIt is also a mandatory requirement that students participate in the creation of a collaborative site-specific performance work which will recorded on film for our department archives as it is presented before the public.  Your work on this piece will constitute the other  ½ of your participation score.\n\n\n20%　　Homework Assignments　　　　　　　　20%　　Midterm\n20%　　Collaborative Performance Work　　　　　　40%　　Final","materials":"COURSE READER (Works By:)\n\n　　Poetry:  Diana Saenz. Frank O’Hara, John Ashbery, Gertrude Stein\n\n　　Fiction/Creative Non-Fiction:  James Cone, J.G. Ballard, Helene Cixous, G. I. Gurdjieff,  William S. Burroughs, Kathy Acker and others\n\n　　Performance Texts (and Site-Specific Works): Cecilia Vicuña, Samuel Beckett, Jerome 　　Rothenberg, John Cage, Futurist Texts, Dylan Thomas, Leslie Scalapino","foreignLanguageTextbooks":false}]
