[{"name":"簡良翰","email":"lhchien@ntut.edu.tw","latestUpdate":"2013-02-20 15:40:15","objective":"熱交換器設計方法、單向對流熱傳計算、壓差計算、冷凝器與蒸發器分析、殼管式熱交換器分析、密集式熱交換器分析、濕盤管理論分析","schedule":"壹　　Course introduction; Application of heat exchangers.Heat exchanger classification;\n貳　　Holiday\n參　　 Review of Heat Transfer fundamentals.Fin efficiency; Dimensional groups; sizing and rating problems; Calculation of UA; Discussion of plate-and-fin H-X.\n肆　　Geometric factors of H-X; rating calculation; laminar flow surfaces; laminar flow; j, f vs. Re similarity.\n伍　　Finned tube H-X; Fin efficiency calculation; Row effect; Staggered and inline tubes.\n陸　　Plate finned tubes; Sizing calculations.\n柒　　Effect of property variation; Petukhov eq. for turbulent flow.\n捌　　Heat transfer surface fouling\n玖　　Mid-term Exam\n拾　　Shell-and–tube heat exchangers;\n拾壹　　Codes and standards, Delaware method.\n拾貳　　Stream analysis; Rod baffle H-X\n拾參　　Computer code for Shell-and-tube heat exchanger\n拾肆　　Introduction of plate-type heat exchangers\n拾伍　　Analysis of plate-type heat exchangers\n拾陸　　Evaporator, Two phase flow, Fundamentals of condensation; Condensation on integral-fin tubes\n拾柒　　Heat and mass transfer of evaporatively cooled Heat exchangers\n拾捌　　Final Exam","scorePolicy":"期中考 (30%) + 作業 (35%)  + 期末考 (20%) + 學期報告 (15%)\n註:作業須於規定期限內繳交。逾期一週以內者以所得成績之80%計算；逾期一週以上者以零分計算。","materials":"教科書:　　　　自編講義 ＋ 王拕川，「熱交換設計」，五南圖書出版公司，民國九十六年。\n參考書:\nArthur, P. Fraas, Heat Exchanger Design, 2nd Ed., Joln Wiley and Sons Inc, New York, 1989.\nEric M. Smith, Thermal Design of Heat Exchangers, John Wiley and Sons Ltd, New York, 1997.\nHewitt, G. F., Shires, G. L., and Bott, T. R., Process Heat Transfer, CRC Press Inc., Florida, 1993.\nKakac, S. and Liu, H., Heat Exchangers, Selection, Rating, and Thermal Design, CRC Press, 1997.\nMills, A. F., Heat Transfer 2nd Ed., Prentice Hall, 1999.\nShah, R. K., and Sekulic, D. P., Fundamentals of Heat Exchanger Design, John Wiley and Sons, Inc., Hoboken, New Jersey, 2003.\nWebb, R. L, and Kim, N.-H., Principles of Enhanced Heat Transfer, 2nd Ed., John Wiley and Sons Inc., New York, 2005.\nT. Kuppan, Heat Exchanger Design Handbook, Marcel Dekker, Inc. 2000.\nWilliam M. Kays &amp; A. L. London, Compact Heat Exchangers, 3rd Ed., McGraw-Hill Co, 1984.\n王拕川，「熱交換器設計」，五南圖書出版公司，民國九十年。","foreignLanguageTextbooks":false}]
