[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2013-02-22 11:19:47","objective":"課程專為欲深度瞭解英文文學史的中學教師與研究所學生而設計。課程將引領學生研讀17世紀至今的英國文學文本，種類包含詩、戲劇、小說與自傳。學生需利用課內與課外的時間研讀文本，以利學生跳脫其熟悉之課程框架，於實務教學思維上有所創新發想。本課程之評分將以實際的教學示範、短篇寫作作業，以及學生參與程度為主要標準，論文報告次之。","schedule":"Week         Reading and Topic\n1 2/20        Course Introduction\n                  Old English\n                  Caedmon’s Hymn\n                  Deor\n                  Beowulf aloud.　　\n\n2 2/27　　Out of town—no class\n                  On your own: \n                  Read “How to Make Lectures More Effective”\n                  Read the introductions to The Miller’s Tale (pages 5–7 of the PDF), The Pardoner’s Tale (p. 4–7 of the PDF), and The Wife of Bath’s Prologue and Tale (p. 2–3 of the PDF). Then write me to tell me which one you would like to read in class the following week (presumably because you might be able to teach something about it to your own class or because you have an interest). We will read the one that receives the most votes. (If you choose The Wife of Bath, we will only read the prologue, which is the same length as the prologue and tales for the others.)\n                  Other Assignment•Send me an e-mail introduction that includes (1) information on which works you have read and which you haven’t, (2) what you hope to get from the course, and how (if you are a teacher) you plan to incorporate the things you learn in this course into your teaching. Do you think it will be difficult or easy to incorporate more literature into your classes? Why? (3) The three most useful points (to you) from “How to Make Lectures More Effective”\n                 •In the same e-mail, give me your vote for which Chaucer tale we read in class on 3/6. \n\n3 3/6　　Read “Supplements and Alternatives to Lecturing: Encouraging Student Participation.” \n                  Read “Motivating Students”\n                  In-class reading of one of Chaucer’s Canterbury Tales. 　　\n4 3/13　　Read “Leading a Discussion” and “Encouraging Student Participation in Discussions.” \n                  In class: Shakespeare (Twelfth Night film)\n　　\n5 3/20　　In class: Shakespeare (Othello film)　　\n                  Other Assignment Teaching a scene from Twelfth Night.\n\n6 3/27　　Read Shakespeare (Sonnet 116, 130, 138, Milton “When I consider How My Light is Spent,” Donne, “Death Be not Proud,” Marvell “To His Coy Mistress,” Christopher Smart, “[My Cat Jeoffrey]” from Jubilate Agno. \n                   (In class) Burns: “To a Mouse,” “To a Louse,” “Auld Lang Syne,” “A Man’s a Man for A’ That.” \n　　Other Assignment Teaching a scene from Othello. \n                                              Teaching Demonstrations. \n7 4/3　　No class.\n\n8 4/10　　Read Frankenstein excerpts\n                   Read “Asking Questions.” Come up with three different types of questions that you could ask a class about Frankenstein. \n                  In-class reading of Romantic poetry: Shelley: “Ozymandias,” Blake: “Little Lamb Who Made Thee?” “The Tyger,” “The Chimney Sweep,” Wordsworth: “Simon Lee,” “French Revolution,” 　　\n                    Other Assignment Teaching Demonstration\n\n9 4/17　　Read excerpts from Pride and Prejudice (TBA)\n                   In class: Watch Pride and Prejudice (film)　　\n                   Other Assignment Teaching Demonstration\n\n10 4/24　　Read “Teaching Large Classes (You Can Still Get Active Learning)”\n\nIn class: Finish Pride and Prejudice (film)　　Two-page reflection paper due.\n\n11 5/1　　Read Alice in Wonderland Ch. 1–7 (Lewis Carroll)\nEdward Lear Limericks　　Teaching Demonstration\n\n12 5/8　　Read Alice in Wonderland ch. 8–12 and from Through the Looking-Glass, ch. 6–7\n                   In-class: “The Lady of Shalott.” Tennyson. (In class)\n                   Other Assignment　　Teaching Demonstration\n\n13 5/15　　Read “The Speckled Band” (Sherlock Holmes) and chapter one and two from The Story of the Treasure Seekers (Nesbit)　　Teaching Demonstration\n\n14 5/22　　In class: The Importance of Being Earnest (Oscar Wilde)\n　　\n15 5/29　　Read The Hobbit (TBA)\n　　Teaching Demonstration\n\n16 6/5　　Read The Hobbit (TBA)　　Teaching Demonstration\n\n17 6/12　　Read The Hobbit","scorePolicy":"Grade Percentages:\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nTeaching Reflections and Reading Quizzes: 30%\nInformal Teaching Presentations and Class Participation: 30%\nFormal Teaching Presentations: 25%\nFinal Teaching Reflection Paper: 15%","materials":"　","foreignLanguageTextbooks":false}]
