[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2013-01-08 14:50:40","objective":"This course is a research-based course. Students will be exposed to various legal issues involving U.S. patent litigation. The procedural issues are mainly explored. Each student will be assigned with one research topic.","schedule":"Three-module cirriculum\nModule I: Procedural issues in patent ligitation\nModule II: In-depth research\nModule III: Four Lectures\n\nClass 1 Introduction; research project assignments; indirect infringement: 陳秉訓（2012年11月），”The Days After Global-Tech Appliances, Inc. v. SEB S.A., 131 S. Ct. 2060 (2011): A Survey of Federal District Courts’ Decisions”，2012年第十六屆全國科技法律研討會，國立交通大學科技法律研究所主辦，2012年11月21-22日，新竹市。\n\nClass 2 Cease and desist letters: PDLFA s 3.02[A] (cease and desist letters); IPTPP s 3.02 (declaratory judgment actions); 3M Co. v. Avery Dennison Corp., 673 F.3d 1372 (Fed. Cir. 2012); Innovative Therapies, Inc. v. Kinetic Concepts, Inc., 599 F.3d 1377 (Fed. Cir. 2010).\n\nClass 3 Complaint and Rule 12(b)(2) motion: PDLFA s 3.03[A] (complaints for patent infringement); PDLFA s 3.04[A] (answers); McZeal v. Sprint Nextel Corp., 501 F.3d 1354 (Fed. Cir. 2007) (direct infringement); Juniper Networks, Inc. v. Shipley, 643 F.3d 1346 (Fed. Cir. 2011) (false marking).\n\nClass 4 Personal jurisdiction and Rule 12(b)(6) motion: PDLFA s 4.03[A] (Motions to Dismiss); ASUSTeK Computer Inc. v. AFTG-TG LLC, 2011 WL 6845791 (N.D. Cal. 2011) (personal jurisdiction); 陳秉訓（2012年7月），「論美國專利訴訟中對台灣籍被告的對人管轄權—以2010至2011年間聯邦地方法院判決為中心」，智慧財產權月刊，第164期，台灣，頁5-36。\n\nClass 5 Venue: IPTPP s 3.03 (venue); IPTPP s 3.04 (the first to file rule); Motion to transfer venue-In re Princeton Digital Image Corp., 2012 WL 5899325 (Fed. Cir. 2012); In re HTC Corp., 2012 WL 4198258 (Fed. Cir. 2012); MobileMedia Ideas LLC v. HTC Corp., 2012 WL 1570136 (E.D. Tex. 2012); In re Biosearch Techns., Inc., 452 F. App’x 986 (Fed. Cir. 2011). \n\nClass 6 Discovery: IPTPP s 7.02 (overview of discovery rules); IPTPP s 7.03 (timing considerations under discovery rules); IPTPP s 7.04[B] (electronic record-making and keeping in today's patent environment); IPTPP s 7.06 (sanctions and other possible consequences of discovery tactics); IPTPP s 8.02 (general note on burdens of proof); IPTPP s 8.03 (protective orders); In re Deutsche Bank Trust Co. Americas, 605 F.3d 1373 (Fed. Cir. 2010) (protective order); JS Prods., Inc. v. Kabo Tool Co., 2012 WL 5288175 (D. Nev. 2012) (motion to compel); Elan Microelectronics Corp. v. Apple, Inc., 2011 WL 3443923 (N.D. Cal. 2011) (motion to compel).\n\nClass 7 Attorney-client privilege and work product immunity: In re Seagate Tech. LLC, 497 F.3d 1360 (Fed. Cir. 2007); IPTPP s 9.02 (attorney-client privilege: historical tension); IPTPP s 9.03 (which law controls); IPTPP s 9.04 (who may assert the attorney-client privilege); IPTPP s 9.07[A] (business advice); IPTPP s 9.07[B] (business advice based on technical information and data); IPTPP s 9.08 (waiver of attorney-client privilege); Mondis Tech., Ltd. v. LG Elecs., Inc., 2011 WL 1714304 (E.D. Tex. 2011).\n\nClass 8 Rule 11 sanction and patent trolls: Intamin Ltd. v. Magnetar Techs., Corp.,483 F.3d 1328 (Fed. Cir. 2007); Raylon, LLC v. Complus Data Innovations, Inc., 700 F.3d 1361 (Fed. Cir. 2012); Dianne Brown Elderkin &amp; Domingo Manuel LLagostera, Case Management Issues in Patent Infringement Litigation, 13 SEDONA CONF. J. 77 (2012).\n\nClass 9 One-to-one meeting\n\nClasses 10-13 (scheduled from 6:40 PM to 9:00 PM): Guest lecturer\nClass 10 Expert witness: Daubert v. Merrell Dow Pharms., Inc., 509 U.S. 579 (1993); Kumho Tire Co., Ltd. v. Carmichael, 526 U.S. 137 (1999); Meyer Intellectual Properties Ltd. v. Bodum, Inc., 690 F.3d 1354 (Fed. Cir. 2012) (expert testimony and lay testimony).\n\nClass 11 Technical expert and infringement analysis: James Ware, Patent Rules of Evidence, 23 Santa Clara Computer &amp; High Tech. L.J. 749 (2007); Liquid Dynamics Corp. v. Vaughan Co., Inc., 449 F.3d 1209 (Fed. Cir. 2006); Air Turbine Tech., Inc. v. Atlas Copco AB, 410 F.3d 701 (Fed. Cir. 2005); Centricut, LLC v. Esab Group, Inc., 390 F.3d 1361 (Fed. Cir. 2004).\n\nClass 12 Technical expert and 35 U.S.C. § 103: John B. Sganga, Jr., Litigatin","scorePolicy":"Term Paper: 60%; Presentation 30%; Participation: 10%.","materials":"Class materials: (1) cases and articles; (2) Pat. Disputes Litig Forms &amp; Analysis [PDLFA]; (3) Expert Witnesses: Intellectual Property Cases [EXPWIT-IP]; (4) Intell. Prop. Litig. Pretrial Prac. [IPTPP].","foreignLanguageTextbooks":false}]
