[{"name":"劉天一","email":"liut@csus.edu","latestUpdate":"2013-03-08 23:58:34","objective":"簡介，人工智慧語言介紹及工業應用，專家系統。\n\nModern concepts, principles, languages, and algorithms of artificial intelligence (AI) will be introduced. Topics include neural networks, fuzzy logic, expert systems (ES), and hybrid systems. Industrial applications of AI and ES in design, manufacturing, and automation for efficiency, quality, and safety will be illustrated, including design and manufacturing using expert systems; intelligent control and automation; applications of artificial intelligence in sensing, monitoring, and diagnosis of machines, tools, and manufacturing processes; etc. Case studies will be demonstrated in detail. Furthermore, future developments will be discussed as well.","schedule":"WEEK           TOPICS\n\n1      Introduction to Artificial Intelligence \n2　　Neural Networks\n3　　Neural Network Structures\n4　　Various Kinds of Neural Networks     \n5　　Learning Processes and Algorithms \n6　　Introduction to Manufacturing Condition Monitoring\n‧　　Key to precision, high quality, and automated manufacturing \n7　　Applications of Artificial Intelligence to Manufacturing Process Monitoring \n8　　Applications of Artificial Intelligence to Machine and Tool Condition Monitoring \n9　　Fuzzy Logic\n10　　Reasoning Processes and Algorithms\n11　　Applications of Artificial Intelligence in Control and Automation\n12　　Introduction to Expert Systems   \n13　　The Inference Engine\n14　　Knowledge Base\n15　　Applications of Expert Systems in Design and Manufacturing\n16　　Hybrid Systems\n17　　Applications of Hybrid Systems in Automation","scorePolicy":"Graduate students’ performance in this course will be assessed by exams, quizzes, and a semester project as follows:\n\nQuizzes                      15% (Three quizzes)\nExams                        60% (Two exams)\nSemester Project         25% (Presentation and report)","materials":"Teaching Methodology:\n\nThis course will be taught in an interactive manner.  Graduate students’ performance in this course will be assessed by exams, quizzes, and a semester project. The semester project will give graduate students the experience of doing a thorough literature review or a complete engineering project in the field of applications of AI and ES in engineering. Semester project is required to be presented and the project report is mandatory so as to educate graduate students to work more independently and to communicate more effectively.  In addition, teaching language of this course is English.  Therefore, English proficiency of graduate students will also be enhanced. \n\nReferences:\n\nBooks\n1.　　Tien-I Liu, “Tools for Intelligent Manufacturing Processes and Systems:  Neural Networks, Fuzzy Logic, and Expert Systems,\" The CRC Handbook of Mechanical Engineering, 2nd Edition, CRC Press, New York, USA, pp. 13-91 – 13-95, 2010 \n2.　　Stuart Russell, Peter Norvig, “Artificial Intelligence: A Modern Approach,” 3rd Edition, Prentice Hall, Pearson Education, Inc., New Jersey, USA, 2010\n3.　　Ben Coppin, “Artificial Intelligence Illuminated,” Jones and Bartlett Publishers, Inc., Massachusetts, USA, 2004\n4.　　Joseph Giarratano, Gary Riley, “Expert Systems: Principles and Programming,” 3rd Edition, PWS Publishing Company, New York, USA, 2004\n\nJournal Papers\n1.　　Tien-I Liu, Junyi Lee, George Liu, and Zhang Wu, “Monitoring and Diagnosis of Tapping Process for Product Quality and Automated Manufacturing,” International Journal of Advanced Manufacturing Technology, DOI 10.1007/s00170-012-4058-7, 2012\n2.　　T.I. Liu, A. Kumagai, Y.C. Wang, S.D. Song, and J. Lee, \"On-Line Monitoring of Boring Tools for Control of Boring Operations,\" International Journal of Robotics and Computer Integrated Manufacturing, Volume 26, Issue 3, pp. 230-339, 2010\n3.　　Tien-I Liu, Waqqas H. Khan, and Chong T. Oh, “A Knowledge-based System of High Speed Machining for the Manufacturing of Products,” International Journal of Knowledge-based and Intelligent Engineering Systems, Vol. 14,     No. 4, 2010\n4.　　Akihiko Kumagai, Tien-I Liu, and Paul Hozian, “Control of Shape Memory Alloy Actuators with A Neuro-Fuzzy Feedforward Model Element,” Journal of Intelligent Manufacturing, Volume 17, pp. 45-56, 2006  \n5.　　“Intelligent Design for Disassembly,” International Journal of Agile Manufacturing, Volume 8, Issue 1, pp. 123-130, 2005\n6.　　W. He, Y.F. Zhang, K.S. Lee, and T.I. Liu, “Development of a Fuzzy Neuro System for Parameter Resetting of Injection Molding,” ASME Journal of Manufacturing Science and Engineering, Vol. 123, No. 1, pp. 110-118, 2001","foreignLanguageTextbooks":false}]
