[{"name":"黃品堯","email":"parergonalite@gmail.com","latestUpdate":"2013-02-17 11:56:44","objective":"本課程涵蓋建築美學和環境美學兩大部分，旨在培養學生建築與環境的美學鑑賞力與美感能力、最終能對建築專業有所提升。\n課程分為四部分：\n1 中西方美學知識論\n2 建築美學發展脈絡\n3 環境美學發展脈絡\n4 當前建築美學課題與專業的拕發\n\nOn the second half of the twentieth century, the human being finally acknowledges,on a global scale and besides the importance of the ecology, the aesthetic value of “environments”, including the \"nature\" itself. This semester, we will start by dedicating the first four lessons to explaining the (re)discovery of the aesthetic value of the nature, characteristics of its appreciation, as well as challenges it raises to traditional aesthetics dominated by appreciation of art particularly since the time of Hegel. The course will then progress in applying successively the conclusions gained in this first stage, to related fields such as aesthetic education, environmental art, landscape, architecture and human environments (urbanism and everyday aesthetics), and present finally the idea of functional beauty recently rediscovered and developed in environmental aesthetics. Students will be asked to apply the knowledge imparted in the classroom to appreciation and/or improvement of one district of Taipei City each team chooses to be its object of study. The oral presentation will take place in the two weeks right before the final exam.","schedule":"1. Environmental aesthetics and the aesthetics of nature\n2. Formalism and cognitivism\n3. Positive aesthetics\n4. Requirements for appreciation of nature\n5. Dilemma of aesthetic education\n6. Environmental art and nature\n7. The aesthetic appreciation of Japanese gardens\n8. Appreciation of agricultural landscapes\n9. Midterm exam\n10. Appreciation of architecture (1)\n11. Appreciation of architecture (2)\n12. Appreciation of human environment (1)\n13. Appreciation of human environment (2)\n14. Functional beauty (1)\n15. Functional beauty (2)\n16. Presentation of teamworks(1)\n17. Presentation of teamworks(2)\n18. Final exam","scorePolicy":"Midterm exam 30%\nFinal exam 30%\nTeamwork and presentation 40%","materials":"Textbook:\n\n  Carlson, A., 2000, Aesthetics and the Environment. London,   \n    Routledge.\n\nReferences:\n\n  Aldrich, V., 1963, Philosophy of Art. London, Pentice-Hall.\n  Carlson, A., 2009, Nature and Landscape. New York, Columbia   \n    University Press.\n  Carlson, A. 2012, and Parsons, G., Functional Beauty. Oxford \n    University Press.","foreignLanguageTextbooks":false}]
