[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2022-01-24 14:23:34",
    "objective": "This course is an introduction to statistical computing and will be taught in Minitab. Minitab is widely used not only in engineering, but also in sciences, medicine, biology, physics, and business. It is assumed students have exposure to basic statistics and knowledge of calculus (i.e., differential and integral calculus). The main focus of the class will be on statistical analysis and graphics in Minitab. Students will cover basic statistical concepts and various statistical methods such as estimation, hypothesis tests, regression analysis, ANOVA, and factorial designs.",
    "schedule": "Week 1 Introduction to probability distribution, sampling distribution, and estimation\nWeek 2 Decision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\nWeek 3 Decision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\nWeek 4 Decision making for two samples – Inference on the means of two populations, paired t-test\nWeek 5 Decision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\nWeek 6 Simple linear regression – Part I\nWeek 7 Simple linear regression – Part II\nWeek 8 Other aspects of simple linear regression\nWeek 9 Midterm exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 10 Multiple linear regression – Part I\nWeek 11 Multiple linear regression – Part II\nWeek 12 Other aspects of multiple linear regression\nWeek 13 Factorial design, replication, center points – Part I\nWeek 14 Factorial design, replication, center points – Part II \nWeek 15 Blocking, confounding, fractional factorial designs X-bar and R control chart\nWeek 16 Factorial experiments with more than two levels - Part I\nWeek 17 Factorial experiments with more than two levels - Part II\nWeek 18 Final exam (In-Class, 1 Cheat sheet, Calculator)",
    "scorePolicy": "1. Midterm Exam: 30 %\n2. Final Exam: 30 %\n3. Team project: 15 %\n4. Individual homework: 20 %\n5. Attendance: 5 %",
    "materials": "Textbook: Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)\nSupplementary references: Meet Minitab 15",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. The online course platform is MS teams.\n2. The announcement will be informed via email.\n3. The way to reach the instructor is email.</div></b></b>"
  }
]
