[
  {
    "name": "曹先紹",
    "email": "dwx07@zoo.gov.tw",
    "latestUpdate": "2022-02-17 11:48:03",
    "objective": "本課程係以生物多樣性保育及其對現代設計理念的跨領域思考為主軸，說明地表重要生態體系的功能與結構，及其所蘊育的生物，在物種演化、環境適應與生活史策略上的特色，輔以國內外案例介紹，探討如何將生態體系的運轉模式與永續理念，有效整合到人為工程的規劃、設計、施作、乃至後續監測維護過程中。此外，並將深入剖析近代動物園與水族館設計理念的發展，及討論既有公共工程，如道路、橋樑、護坡、農田水圳、攔水堰等設計，對環境與生物的影響，另搭配臺北近郊的生態工法案例介紹與研擬討論，期能激發同學對相關議題的興趣與實務經驗。\n　　This course will be focusing on biodiversity conservation and multidisciplinary thinking on modern design concepts. The functions and structures of important ecological systems on earth, and the organisms inhabit with their evolution, adaptation and life history strategies will be introduced. With domestic and foreign cases, how to effectively integrate the operation mode and sustainable concept of the ecological system into the planning, design, construction, and subsequent monitoring and maintenance of human engineering will be discussed. In addition, the development of modern zoo and aquarium design concepts, or the impact of existing public construction works, such as roads, bridges, slope protection, farmland canals, and weirs, to our environment will also be involved in a hope to stimulate students' interest in related topics and practical experience.",
    "schedule": "1. 課程簡介\n2. 休假（和平紀念日）\n3. 生態設計導論與分組\n4. 野生動物存續方略\n5. 動物園與水族館設計的發展\n6. 臺北市立動物園專業參訪\n7. 休假（兒童節、清明節連假）\n8. 生物多樣性取決於你我 Biodiversity is Us\n9. 翻轉物種瀕危趨勢 Reverse the Red\n10. 臺北市立動物園專業參訪討論\n11. 里山精神與保育產業\n12. 棲地改善與復育案例現勘\n13. 棲地改善與復育案例現勘討論\n14. 整合保育\n15. 仿生設計\n16. 創意與 ESG 行銷\n17. 環境教育與設計\n18. 設計案報告與討論",
    "scorePolicy": "課堂參與（佔 1/3）；研討報告（佔 1/3）；個案成果報告（佔 1/3）",
    "materials": "Beattie, A. and P.R. Ehrlich. 2004. Wild solutions: how biodiversity is money in the bank. Yale University Press. 276 pp.【中譯：生態存摺－生物多樣性是地球的寶藏、2007、貓頭鷹出版社】\nBenyus, J.M. 2002. Biomimicry: innovation inspired by nature. Harper Perennial. 320 pp.【中譯：人類的出路－探尋生物模擬的奧妙、2003、胡桃木文化事業有限公司】\nBradshaw AD, DA Goode and EHP Thorp. 1986. Ecology and design in landscape. Blackwell.\nForbes, P. 2005. The gecko’s foot- bio-inspiration:engineered from nature. Harper Collins Publishers, Ltd. 292 pp.【中譯：學蜘蛛人趴趴走、2007、遠流出版事業股份有限公司】\nHsieh C. and E. Tsao. 2019. Pangolin Dome, zoomorphic green building at Taipei Zoo. WAZA News. P. 30-32.\nMcDonough W. and M Braungart. 2002. Cradle to cradle: remaking the way we make things. North Point Press 208 pp.【中譯：從搖籃到搖籃－綠色經濟的設計提案、2008、野人出版社】\nProctor, R. 2009. 1000 new eco designs and where to find them. Laurence King Publishers. 352 pp.【中譯：生態經典設計、2010、臉譜出版社】\nSimonds JO. 1997. Landscape architecture: a manual of site planning and design. McGraw-Hill. 405 pp.\nVan der Ryn S and S Cowan. 1996. Ecological Design. Island Press. 201 pp.\nGusset M. and SA. Chin 2016. Future of Zoo and Aquarium Design.  WAZA Magazine Vol. 17. 48 pp.\nWilliams JK, CA Wood and MP Dombeck. 1997. Watershed Restoration: Principles and Practices. American Fisheries Society. 561 pp.\n洪得娟、顏家芝（譯）  1997  生態設計和規劃  六合出版社  268 頁  譯自 Thompson GF and FR Steiner  (editors) Ecological design and planning. JJohn Wiley &amp; Sons, Inc.\n林大元、沈克毅編著  1994  生態設計參考手冊  台北市七星生態基金會\n林憲德  2000  城鄉生態  詹氏書局  238 頁\n後藤武、佐佐木正人、深澤直人 2004. The ecological approach to design. Jia-Xi Books Co., Ltd.【中譯：不為設計而設計 = 最好的設計：生態學的設計論、2008、漫遊者文化出版：大雁出版基地】\n野性再現－臺灣保育動物與域外保育行動 2009 陳建志等撰文、彭仁隆主編 臺北市立動物園 184 頁\n破解動物忍術：如何水上行走與飛簷走壁？動物運動與未來的機器人 2020 胡立德 三民書局 280 頁",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 與學生溝通管道：Email、Line</div></b></b>"
  }
]
