[
  {
    "name": "黃博全",
    "email": "pchuang@ntut.edu.tw",
    "latestUpdate": "2022-02-12 10:23:00",
    "objective": "太陽能熱能工程應用，是一門利用太陽能之能量來提供人類能源之科學，太陽能為取之不盡用之不絕，且為乾淨又穩定之來源，在油價高漲且地球環境保護需求日益殷切的今日，太陽能之能源應用，已成為今日最熱門之學科。本學科之教學目標，在使學生了解基本之太陽能轉換為熱能、電能及照明之基本原理，並且經實際之能量轉換過程，以及熱力學之運用，使學生對以太陽能為熱源之機械設備，如太陽能熱水器、太陽能冷凍空調設備、太陽能發電機、太陽能電池、太陽能照明設備等之應用，作深入之瞭解與認識，並可對相關產品做能量之計算及規劃設計，以使學生日後能為相關產業提供基礎人才。\n本科目將由認識太陽、地球與太陽互動關係、地球上太陽能之基本熱輻射理論，結合各種不同形式之利用太陽能源有效裝置，討論太陽能之有效利用方式及相關系統技術。以期在既有太陽能利用技術上，發揮更有效率的太陽能源工程系統設計，奠定未來 21 世紀太陽能源利用之高效率化基礎。本門課主要為太陽能應用的原理分析及系統設計，課程內容包括太陽熱能系統的熱力熱傳及流體力學分析與系統設計、成本分析 (為主)；太陽能光電系統的組成與設計分析 (為輔)。\n\nThe application of solar thermal energy engineering is a science of using solar energy to provide human energy. Solar energy is inexhaustible, and it is a clean and stable source. Today, when oil prices are rising and the demand for environmental protection is increasing, The energy application of solar energy has become the most popular subject today. The teaching goal of this subject is to enable students to understand the basic principles of the conversion of solar energy into heat, electrical energy and lighting, and through the actual energy conversion process and the application of thermodynamics, to enable students to understand mechanical equipment that uses solar energy as a heat source, such as solar energy. In-depth understanding and understanding of the application of water heaters, solar refrigeration and air conditioning equipment, solar generators, solar cells, solar lighting equipment, etc., and energy calculation and planning and design of related products, so that students can provide for related industries in the future Basic talents.\nThis subject will discuss the effective use of solar energy and related system technologies by understanding the sun, the interaction between the earth and the sun, and the basic thermal radiation theory of solar energy on the earth, combining various effective devices for using solar energy sources. It is hoped that in the existing solar energy utilization technology, more efficient solar energy source engineering system design will be used to lay the foundation for the high efficiency of solar energy source utilization in the future 21st century. This course is mainly for the principle analysis and system design of solar energy applications. The content of the course includes thermal heat transfer and fluid mechanics analysis of solar thermal energy system and system design, cost analysis (mainly); composition and design analysis of solar photovoltaic system (secondary)",
    "schedule": "周次　　授課內容　　作業\n1  Ready week - Overall introduction　　\n2  Chap. 1 Introduction to Solar Energy and Its Conversion for Use on Earth　　    \n3  Chap 1 Introduction to Solar Energy and Its Conversion for Use on Earth  Homework 1\n4  Chap. 2 Fundamentals of Solar Radiation (I)　　\n5  Chap. 2 Fundamentals of Solar Radiation (II)　　\n6  Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (I)　　Homework 2\n7  Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (II)  Homework 3\n8  Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (III)　　\n9  Chap. 4. Methods of Solar Collection and Thermal Conversions (I)　　\n10  Chap. 4. Methods of Solar Collection and Thermal Conversions (II)  Homework 4\n11  Chap. 5 System Analysis, Component and Economics of Solar System (I)　　\n12  Chap. 5 System Analysis, Component and Economics of Solar System (II)  Homework 5\n13  Chap. 6 Solar-Heating Systems (I)　　\n14  Chap. 6 Solar-Heating Systems (II)  Homework 6\n15  Chap. 7 Solar Cooling and Dehumidification (I)　　\n16  Chap. 7 Solar Cooling and Dehumidification (II)  Homework 7\n17  Chap. 8 Solar Electric Power and Process Heat (I)　　\n18  Chap. 8 Solar Electric Power and Process Heat (II)　　Homework 8\n19  Chap. 9 Natural Solar Conversion Systems (I)　　\n20  Chap. 9 Natural Solar Conversion Systems (II)  Homework 9\n21  Research report presentation　　\n22  Research report presentation　　\n23  Research report presentation　　\n24  Research report presentation",
    "scorePolicy": "作業、平時考、上課表現出席率 (30%)\n期中考 (或研究報告)(40%)，\n期末考 (30%)\n註：作業須於規定期限內繳交，逾期一週以內所得成績打 80% 計算，逾期一週以上者，以零分計算。",
    "materials": "教科書: \nKreith and Jan F. Kreider, Principles of Solar Engineering, Hemisphere Publishing Corporation, 1978 \n參考書:.\n1.Duffie and Beckman, Solar Engineering of Thermal Processes, 2nd Ed\n2.Michael F. Modest, “Radiative Heat Transfer”, McGaw-Hill Inc., 1993.\n3.Edward E. Anderson, Fundamentals of Solar Energy Conversion, Addison Wesley Publishing Company.\n4.Edward E. Anderson, Fundamentals of Solar Energy Conversion, Addison-Wesley Publishing Company, 2000\n5. 太陽能系統分析與設計\n6. 太陽能工程，全華科技圖書，2003。燃料電池，全華科技圖書，2003\n7. 黃文雄，太陽能之應用及理論，協志工業叢書。\n8. 羅運俊、何梓年、王長貴，太陽能發電技術與應用，新文京開發出版股份有限公司。\n9. 張鶴飛，太陽能熱利用原理與計算機模擬，. 大陸西北工業大學出版社。\n10.Handouts based on recently published articles (含碩博士論文)",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">1. 請加入本班 line 群組 (https://line.me/R/ti/g/s1o34J2VP2)，以利課程聯繫與討論。\n2. 因應疫情可能會調整授課方式、進度與評量方式。如果無法實體上課時，將使用 Google Meet 於原定上課時間進行遠距上課，會議網址將公告於本班 line 群組。\n3. 如有加退選或課程問題請 email 給老師 (pchuang@ntut.edu.tw) 或來電 0922746198</div></b></b>"
  }
]
