[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2013-09-13 17:25:07","objective":"本課程以提升學生英文能力，至全民英檢中級以上的程度為目標。教學內容以加強學生日常生活中，如：購物、旅遊、定餐等用語之溝通、運用、表達及閱讀寫作等能力為主。\nCourse Title:　　　　English in Practice\nCredit Hours:　　　　1\nInstructor’s Name:　　Dr. Yun-Hua Yang\nTerm Offered:　　　　Fall, 2013\nRequired / Recommended Texts: TOEIC Online Tests \nCourse Description: 　　This course aims to provide non-English majors with practical English training by introducing new topics and issues in English. It is also the purpose of this course to help students prepare for standardized English test, in particular TOEIC reading and listening, as stipulated by the university. \nCourse Requirements:　　Students enrolled in this course will be required to:\n1)　　take online tests \n2)　　take class notes \n3)　　attend all scheduled class sessions\n4)　　take TOEIC vocabulary quizzes\n5)　　take university joint exams (midterm/ final) \nAttendance:  Students are required to attend the class as scheduled and to arrive on time. Full attendance and punctuality are prioritized. \n 　　　　　　　　　　 1) Any AWOL will result in the penalty of 10% semester grade deduction.\n2) Penalty-waiver can be granted for any absence w/ official document at the instructor’s discretion. Should there be any major incidents and issues under extreme circumstances, special considerations will be given after thorough discussion with the student(s), and the class advisor(s), if necessary.","schedule":"Week 1-2 Orientation / Intro Activity\nWeek 3-5 Unit 1 / TOEIC  Test Bank \nWeek 6-8 Unit 2 / TOEIC Test Bank\nWeek 9 Midterm\nWeek 10-12 Unit 3 / TOEIC Test Bank\nWeek 13-15 Unit 4 / TOEIC Test Bank\nWeek 16-18 Unit 5 / TOEIC Test Bank\nWeek 19 Final Exam\n(Syllabus is subject to necessary modification.)","scorePolicy":"Evaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their attendance, presentations, assignments and quizzes / exams. (*Note that the grading policy may be subject to change as the class proceeds.) Please also refer to the university’s grade policy for this course. Such information is now available at http://www.cc.ntut.edu.tw/~wwwoaa/oaa-nwww/oaa-ed/oaa-ed.html \nThe grading of the current class, duly constituted under the aforementioned policy, consists of the following components (1) Attendance 20 % + Class Notes / Vocabulary quizzes (if needed) 20% (2) TWO in-class TOEIC tests 30% (3) TWO university joint exams 30%","materials":"ＴＯＥＩＣ Test Bank","foreignLanguageTextbooks":false}]
