[{"name":"曾添文","email":"f10403@ntut.edu.tw","latestUpdate":"2015-08-29 14:38:21","objective":"介紹單位換算與有效數位，元素的原子結構、化學方程式平衡與計算，反應熱，氣體與氣體定律，大氣層與環境污染，週期表，化學鍵，化合物的分子結構，熱力學，動力學，反應機構，平衡常數，氧化與還原，酸鹼反應，電化學，混合物的分離及現代科技材料，奠定良好化學基礎。","schedule":"1~2週. Introduction to chemistry: scientific method, atom, isotopes, periodic table, essential elements, significant figures, learning to solve problems systematically, dimensional analysis.\n3~4週. Atoms, ions, and chemical formulas: chemical compounds, formulas, naming compounds, acids and bases, industrially important chemicals, introduction to periodic table, using the mole concept in calculations.\n5~6週. Chemical reactions:  counting by weighting, atomic masses, the mole, molar mass, percent composition of compounds, determining the formula of a compound, chemical equations, chemical equations, stoichiometry, mass relationships in chemical equations, classifying chemical reactions, chemical reactions in the atomosphere.\n7~8週. Reactions in aqueous solution: Aqueous solution, stoichiometry of reactions in solution, precipitation reactions, acid-base reactions, balancing oxidation-reduction reactions in solution, oxidation-reduction reactions, quantitative analysis using titrations.\n9~10週. Energy changes in chemical reactions: Energy and work, enthalpy, calorimetry, thermochemistry and nutrition, energy sources and the environment.\n11~12週.The Structure of atoms: Waves and electromagnetic radiation, the quantization of energy, the Bohr atom, quantum numbers and electron orbitals, atomic spectra and models of the atom, atomic orbitals and their energies, electron sin, electron configurations, building up the periodic table.\n13~14週. The periodic table and periodic trends: The history of the periodic table, sizes of atoms and ions, energetics of the ion formation, the chemical families, trace elements in biological system.\n15~16週. Structure and bonding (I): An overview of chemical bonding, ionic bonding, Lewis electron structure, exceptions to the octet rule, Lewis acids and bases, Properties of covalent bonds, polar covalent bonds. \n17~18週. Structure and bonding (II): Predicting the geometry of molecules, localized bonding and hybrid orbitals, delocalized bonding and molecular orbitals, combining the valence bond and molecular orbital approaches.","scorePolicy":"一學期中共考八次加以平均","materials":"Chemistry- An Atoms First Approach\nSteven S, Zumdahl; Susan A. Zumdahl\nBrooks/Cole Inc., 2012.","foreignLanguageTextbooks":false}]
