[{"name":"蕭玄逸沂","email":"siyihau@ms4.hinet.net","latestUpdate":"2013-11-05 22:08:59","objective":"使學生瞭解國際金融之理論與國際金融市場之概況：1.國際金融市場形成之基礎和背景2.介紹中央銀行及國際公營金融中介機構3.外匯市場、國際債券市場、國際股票市場、衍生性金融商品市場4.國際利率套利與利率均衡論5.國際金融市場與金融創新","schedule":"1. 第一週：導論、外匯市場（Ch.1、Ch.2）\n2. 第二週：匯率與匯率制度（Ch.3）\n3. 第三週：遠期外匯理論（Ch.4）\n4. 第四週：國際收支（Ch.5）\n5. 第五週：外匯存底的管理、國際金融市場的最新發展（Ch.6、Ch.7）\n6. 第六週：我國金融國際化的發展策略（Ch.8）\n7. 第七週：匯率決定的理論與實務（Ch.9）\n8. 第八週：開放經濟的總體政策（Ch.10）\n9. 第九週：國際性貨幣協議（Ch.11）\n10. 第十週：歐洲貨幣整合（Ch.12） \n11. 第十一週：國際性貿易暨金融組織簡介（Ch.13）\n12. 第十二週：國際金融危機（Ch.14）\n13. 第十三週：國際貨幣制度面臨的課題與改革意見（Ch.15）\n14. 第十四週：全球化的挑戰（Ch.16）\n15. 第十五週：學生專題報告（一、二、三）\n16. 第十六週：學生專題報告（四、五、六）\n17. 第十七週：學生專題報告（七、八、九） \n18. 第十八週：期末考試","scorePolicy":"1.期中報告：30%。\n2.期末考：40%。\n3.平時成績：30%。（出缺席紀錄）","materials":"1. 現代投資學－分析與管理，五版，謝劍平著，智勝文化，民國100年。\n2. 期貨與選擇權—策略型交易與套利實務，三版修訂，廖四郎、王昭文著，新陸書局，民國99年。\n3. 選擇權：理論、實務與風險管理，再版，陳威光著，智勝文化，民國99年。\n4. 衍生性商品：選擇權、期貨、交換與用風險管理，再版，陳威光著，智勝文化，民國99年。\n5. 國際金融學，李榮謙編著，智勝文化，民國98年。\n6. 國際金融：理論與應用，三版，王銘政編譯，學富文化，2011年，Joseph P. Daniels and David D. VanHoose著。（課本）\n7. 國際金融概論，黃志典著，前程文化，2011年。\n8. 國際金融，五版，萬哲鈺著，雙葉書廊，2011年。\n9. 期貨與選擇權－財務工程的入門捷徑，四版，謝劍平著，智勝文化，民國99年。\n10. 投資學—理論與實務，七版，徐俊明著，新陸書局，民國100年。\n11. Bodie, Z., Kane, A., and Marcus, A. J., Investments, McGraw-Hill Com., 7th ed., 2008。\n12. Damodaran, A., Investment Valuation, John Wiley &amp; Sons Inc., 2nd ed., 2002。\n13. Elton, E. J., Gruber, M. J., Brown, S. J., and Goetzmann, W. N., Modern Portfolio Theory and Investment Analysis, John Wiley &amp; Sons Inc., 6th ed., 2003。\n14. Fabozzi, F. J., Bond Markets, Analysis and Strategies, Prentice-Hall International, 5th ed., 2003。\n15. Galitz, L. C., Financial Engineering, Pitman Publishing, 1995。\n16. Hull, J. C., Options, Futures and Other Derivatives, Prentice-Hall International, 7th ed., 2008。\n17. Jarrow, R., and Turnbull, S., Derivative Securities, South-Western College Publishing, 2nd ed., 2000。\n18. Kolb R. W., and Overdahl J. A., Futures, Options and Swaps, Blackwell Publishers, 5th ed., 2007。\n19. Murphy, J. J., Technical Analysis of the Futures Markets, Prentice-Hall Inc., 1986。\n20. Reilly, F. K., and Brown, K. C., Investment Analysis and Portfolio Management, Thomson, 9th ed., 2009。\n21. Smithson, C. W., Managing Financial Risk: A Guide to Derivative Products, Financial Engineering, and Value Maximization, McGraw-Hill Com., 3rd ed., 1998。","foreignLanguageTextbooks":false}]
