[{"name":"廖熒虹","email":"yhliauh@takming.edu.tw","latestUpdate":"2013-10-16 11:18:20","objective":"透過本課程，使學生：\n1.能瞭解英文科核心能力及專業知能。 \n2.能編製教材與教案。 \n3.能依據教材與教案執行教學。 \n4.能建置個人學習檔案與教學心得報告。 \n5.能熟知相關領域最新發展趨勢，並收集資訊以輔助教學及進行教材編修。","schedule":"1.課程內容簡介，本課程之內容與教學方法，師生自我介紹及需求分析\n2.\n(1)建立個人中英文履歷、自傳及學習檔案\n(2)中學課程發展與實施組織架構與流程\n(3)英語科課程目標與實施\n3.個人檔案與履歷分享，英語（文）科課程內容與教材\n4.教學計畫安排，教學流程與教案撰寫\n5.英語教學方法(一)：概述\n6.英語教學方法(二)：與1960年代前之教學法\n7.英語教學方法(三)：1960年代後至1980年代之前的英語教學法\n8.英語教學方法(四)：1980年代之後的英語教學法\n9.期中考試\n10.高職英文教材評析與試教（一）\n11.高職英文教材評析與試教（二）\n12.高職英文教材評析與試教（三）\n13.高職英文教材評析與試教（四）\n14.高職英文教材評析與試教（五)\n16.教學演示(1~5)、教師講授、師生討論，互相觀摩個人學習檔案\n17.教學演示(6~10)、教師講授、師生討論，繳交個人學習檔案紙本\n18.\n討論：\n(1)未來實習學校的選擇\n(2)與本學期初相比，你的學科教學知識管理系統是否更加完備？\n(3)介紹個人學習檔案，並互相觀摩\n作業：\n(1)確定教學實習學校\n(2)繳交個人英語（文）科教學實習計畫\n(3)評估畢業後教育實習學校","scorePolicy":"主要依據以下標準：\n(一) 出席課內的情形：20%\n(二) 課前閱讀、平時日誌作業及學習檔案：30%\n(三) 請踴躍提出看法，口頭報告及討論之質與量：20%\n(四) 上台教學演示：30%\n(五) 特殊表現：10%，若有特殊表現（例如，於期刊發表英語教學專文、參加英語教學研討會或研習、參加英語教學營隊活動等），請於學期末提出證明資料，將額外加分\n\n*作業備註:\n本課程之作業與試教原則上以個別方式進行，並請同學將每次教學電子檔及同學試教電子檔上傳給任課老師：\n(一) 課前作業\n1.每位同學針對前一週指定主題（大致如教學進度表中所列，可能酌加其他問題）分配作業，並於上課時繳交（A4格式，以兩頁之內為原則），教師批閱後，請同學將作業歸入學習檔案。教師將閱讀書面作業並評分後發回，各組可於下週提出回應，再將所有版本資料彙整建立檔案，並於第18週（1/8）時繳交完整檔案。\n2.上課時教師將酌情請同學針對該次作業內容提出簡要說明。\n3.作業之寫作，請注意引用時務必清楚註明資料來源（以APA格式為原則）、切勿涉及抄襲或其他有違學術倫理與著作權之情形。\n(二) 個人學習檔案電子檔\n1. 首次上課後開始建立個人學習檔案。\n2. 各項作業與教學演示資料請整理成學習檔案，學習檔案之整理宜完整、清晰且有系統。\n3. 學期末（第18週，1/8）之前由班長以光碟一式兩份，彙整所有修課同學之電腦資料夾（每人的資料夾名稱：102上英文科教材教法_姓名_學習檔案），並於第17週上課時繳交紙本學習檔案，互相觀摩。\n\n*注意事項:\n(一) 請準時出席，切勿遲到。\n(二) 請假請以A4書面方式辦理，註明系級、姓名、實際請假日期與辦理請假手續日期、請假事由等，以確保個人權益。","materials":"*參考書目:\n佳音事業(股)公司 (2008)。英語教學的理論與實踐 : An EFL TEACHER’S  Guidebook。臺北市：佳音。\n周中天 (審校) (2006)。英語教學新論。臺北市：文鶴。\n\n各版國中英語、高中與高職英文課程綱要及教材:\n1. Brown, H. D. (2001). Teaching by Principles: An interactive approach to language pedagogue, Second Edition. White Plains, NY: Pearson Education. \n2. Brown, H. D. (2000). Principles of Language Learning and Teaching, Fourth Edition. White Plains, NY: Pearson Education.    \n3. Freeman, L.D.,&amp; Anderson, M. (2011).Techniques &amp; Principles in Language Teaching. Oxford, UK: Oxford University Press. (敦煌書局代理)\n4. Lightbown, P. M., &amp; Spada, N. (2006). How Language are Learned (Third Edition). Oxford, UK: Oxford University Press. (敦煌書局代理) \n5. Nunan, D. (2004). Syllabus Design. Oxford, UK: Oxford University Press. (敦煌書局代理)\n6.  毛佩琦 (譯) (2003)。英語教學法大全。臺北市：師德。(D.L. Freeman 著，2000)\n7.  廖美玲（2003）。如何利用故事書來教英語。輯於陳秋蘭、廖美玲（主編）（2003），嶄新而實用的英語教學：國中國小英語教學指引（頁203-228）。臺北市：敦煌。\n8.  廖美玲（2003）。第二語言教學理論與方法的沿革。輯於陳秋蘭、廖美玲（主編）（2003），嶄新而實用的英語教學：國中國小英語教學指引（頁15-39）。臺北市：敦煌。\n9.  廖曉青（2004）。英語教學法（第二版）。臺北市：五南。\n10. 廖曉青（2007）。英語教育學。臺北市：心理。\n11. 劉顯親（2002），專業發展及終身學習。輯於劉顯親（著）（2002），英語教學，創意滿行囊—一位教師專業場長及跨文化交流的心路歷程（頁79-88）。臺北市：敦煌。","foreignLanguageTextbooks":false}]
