[{"name":"吳南葳","email":"ms.nw.wu@gmail.com","latestUpdate":"2013-09-06 20:32:12","objective":"本課程主要在教導學生對西方(歐洲及西亞)認識歷史建築之演進過程與思考涵構，並使學生具備西方文化歷史與思想的相關知識，其主要授課內容如下：1.在範圍上--自古埃及、西亞、古典建築、基督教建築、中世紀的大教堂時代以至文藝復興及17、18世紀的建築歷史。2.在思想上--自希臘的文化與哲學思想談起，以至各時代之政治、宗教與社會文明之演進，瞭解歷史涵構及其對建築的表現。3.在建築上─針對每一時期的建築表現，瞭解其構造方法、材料應用及相關細部特徵。\n透過認識西方建築發展以及其背景，學習鑑賞西方歷史建築之能力、同時充實建築設計之背景知識，期能藉由了解過去建築之形成與演變，推及今後建築之趨勢。","schedule":"第一週（9月9日）、課程介紹：歷史的觀念＆史前文明\n第二週（9月16日）、古埃及建築（金字塔）\n第三週（9月23日）、古埃及建築（陵墓與神廟）與西亞建築\n第四週（9月30日）、希臘建築：史前克里特島與邁錫尼文明、希臘神廟與古典柱式 \n第五週（10月7日）、希臘建築：奧林匹亞與特耳菲 \n第六週（10月14日）、希臘建築：雅典衛城與希臘化時期\n第七週（10月21日）、羅馬建築之共和與帝國時期，劇場、圓形競技場及馬車競賽場\n第八週（10月28日）、羅馬建築之哈德連皇帝與萬神殿\n第九週（11月4日）、（期中考週）羅馬建築之羅馬浴場與帝國晚期\n第十週（11月11日）、中世紀之早期基督教、拜占庭、仿羅馬\n第十一週（11月18日）、中世紀之哥德\n第十二週（11月25日）、文藝復興之布內勒奇與亞伯提\n第十三週（12月2日）、文藝復興之達文西與布拉曼德\n第十四週（12月9日）、文藝復興之米開朗基羅與帕拉底歐\n第十五週（12月16日）、文藝復興在歐洲其他地方與矯飾主義\n第十六週（12月23日）、巴洛克\n第十七週（12月30日）、洛可可＆期末考前複習\n第十八週（1月6日）、期末考","scorePolicy":"平常成績（出席率與課程參與）　　30%\n期中報告　　　　　　　　　　40%\n期末考試　　　　　　　　　　30%\n\n參觀體驗一棟指定列表中之日治時期西洋歷史風情建築，於十月至十二月間擇一天（10分鐘）口頭報告介紹該建築給修課同學認識，並繳交心得書面報告。書面報告必須包括報告人之參觀心得以及一張報告同學本人與參觀建築物之合照。","materials":"參考書目\n傅朝卿，2009，《圖說西洋建築發展史話》\n傅朝卿，2009，《圖說台灣建築文化資產日治時期篇》\nMusgrove, John (ed.) (1987). Sir Banister Fletcher’s A History of Architecture. London: Butterworths.\nPevsner, Nikolaus (1960). An Outline of European Architecture. Baltimore, Mayland: Penguin Books.\nWatkin, David (ed.) (1986). A History of Western Architecture. London: Laurence King.Allsopp, Allsopp, Bruce (1970). The Study of Architectural History. London: November Books.\nLawrence, A W (1996). Greek Architecture. 5th Edn, London: Yale UP.\nWad-Perkins, J B (1981). Roman Imperial Architecture. Harmondsworth: Penguin.\nColdstream, Nicola (2002). Medieval Architecture. Oxford: Oxford University Press.\nKrautheimer, Richard (1965). Early Christian and Byzantine Architecture. London: Yale University Press.\nCalkins, Robert (1998). Medieval Architecture in Western Europe: from AD 300 to 1500. Oxford: Oxford University Press.\nConant, Kenneth J (1992). Carolingian and Romanesque Architecture, 800-1200. Harmondsworth: Penquin.\nBranner, Robert (1961). Gothic Architecture. New York: G. Braziller.\nThompson, M.W. (1991). The Rise of the Castle, Cambridge: Cambridge University Press.\nThompson, M.W. (1987). The Decline of the Castle, Cambridge: Cambridge University Press.\nKing, Ross (2000). Brunelleschi's Dome: The Story of the Great Cathedral in Florence, London: Penguin.\nFanelli, Giovanii and Michele Fanelli (2004). Brunelleschi’s Cupola: Past and Present of an Architectural Masterpiece, Firenze: Mandragora.\nMurray, Peter (1969). The Architecture of the Italian Renaissance, Thames &amp; Hudson.\nTavernor, Robert (1962). Palladio and Palladianism, London: Thames &amp; Hudson.\nSummerson, J (1993). Architecture in Britain 1530-1830, London: Harmondworth.\nGlendinning, Miles, Ranald MacInnes and Aonghus MacKechnie (1996). A History of Scottish Architecture: from the Renaissance to the Present Day, Edinburgh: Edinburgh University Press.\nBlunt, Anthony (1953). Art and Architecture in France 1500-1700, Yale University Press.\nVidler, Anthony (1989). The Writing of the Walls, Oxford: Butterworth Architecture.","foreignLanguageTextbooks":false}]
