[{"name":"雷貝利","email":"barry.lee.reynolds@gmail.com","latestUpdate":"2013-09-09 18:53:27","objective":"研究方法-應用語言學\nCourse Policies and Syllabus　　Fall 2013\n\nDepartment:　　應用英文所　　　　　　　　Meeting Place: 　　共同301-1教室\nInstructor:  　　Dr. Reynolds  雷老師　　　　　　Class Time:　　　　四18:30-21:10\nE-mail:　　drbarryleereynolds@gmail.com　　Class:　　　　　　碩士在職專班\n\nMy Facebook Page:　　　　http://www.facebook.com/ProfessorLei\nClass Facebook Page:　　link to研究方法-應用語言學from My Facebook Page\n　　　　　　　　\nCourse Title:　　Research Methods in Applied Linguistics\n\nCourse Description:　　This course familiarizes students with the procedures of research in education and applied linguistics. Topics will include the nature and process of research; survey research; experimental research; correlational research; case study; grounded theory research; ethnographic research; narrative research; action research; data collection and data analysis; descriptive statistics; and sampling and inferential statistics.\n\n本門課之目的是讓學生熟悉研究方法設計。主題涵蓋研究計劃之準備及撰擬 ;主要研究方法，如調查研究法、相關研究法、實驗研究法、個案研究法、人種誌研究法，行動研究法，觀察研究法和內容分析研究法；質性和量化資料之搜集與分析；敘述統計和推論統計。\n\n\nContent Outline: Students will mainly use two text—one covering second language research methods and another on critiquing second language research.  Students will read these texts in conjunction with research articles from the field of applied linguistics to gain an understanding of various research genres.  After a foundation of understanding has been established, students will design and execute their own applied linguistics research projects.  \n\nCourse Objectives:  By the end of the course students will have:\n‧　　Become familiar with theoretical concepts/models and terminology in applied linguistics.\n‧　　Analyzed research in applied linguistics for assumptions and hypotheses about second language learning and teaching to allow them to become “critical consumers” of future research in applied linguistics.\n‧　　Designed and conducted original research in the field of applied linguistics.\n‧　　Acquired skills that will allow them to be active contributors to the field of applied linguistics.\n\nInstructional Activities:  The primary format of instruction shall be group discussion over assigned class readings.  Students are expected to have finished all the readings prior to coming to class so that they may participate fully in discussion and be ready to ask questions regarding any sections of the reading they did not understand.   \n\nTwo Article Critiques will be written on two primary research studies related to English teaching or Applied Linguistics.  The first article must be a quantitative study or experiment, and the second article must be a qualitative study or experiment.  Articles must be related to your research project.  Students must get final approval after selecting an article for the critique before writing the critique.  \n\n\nAn Original Research Project will be planned, developed, conducted, and reported on.  In your Project Proposal you will write research questions and design a project that will answer these research questions.  You will collect a minimum of 10 primary research and theoretical articles related to your research and present them in an Annotated Bibliography. These articles will assist you in the writing of the literature review section of your project.  You may not include any review articles in this bibliography.  You will carry out the research that you proposed in your original research project proposal and you will write up your findings in an article that will be submitted for publication in an academic journal.  Publication is not required, instead submission to the journal allows for learning about the entire process of conducting research from initial idea development to writing up results until finally publishing those results.  Your Project Presentation will consist of a 10-minute conference style presentation concerning your research project.  \n\nBooks:　　\n必須買課本； 學生價705元\nBrown, J.D. &amp; Rodgers,","schedule":"Weekly Schedule:\nWeek　　Date　　Class Work　　Homework\nWeek 1　　9/12　　課程大綱簡介　　‧　　買課本\n‧　　Brown &amp; Rodgers pp. xi-xiv and pp. 3-20\n‧　　Porte pp.ix-xx\nWeek 2　　9/19　　老師生日－停課一次 \n(也是中秋節－hahaha)　　‧　　Brown &amp; Rodgers pp. 21-52\n‧　　Reynolds \nWeek 3　　9/26　　Brown &amp; Rodgers pp. 21-52\nReynolds 　　‧　　Brown &amp; Rodgers pp. 53-78\n‧　　Deegan \nWeek 4　　10/3　　Brown &amp; Rodgers pp. 53-78\nDeegan 　　‧　　Brown &amp; Rodgers pp. 79-156\n‧　　Reynolds, Wang, &amp; Kao\nWeek 5　　10/10　　國慶日－臺灣No. 1－停課一次　　\nWeek 6　　10/17　　Brown &amp; Rodgers pp. 79-156\nReynolds, Wang, &amp; Kao　　‧　　Brown &amp; Rodgers pp. 157-194\n‧　　Reynolds &amp; Bai\nWeek 7　　10/24　　Brown &amp; Rodgers pp. 157-194\nReynolds &amp; Bai　　‧　　Brown &amp; Rodgers pp. 195-226\n‧　　Project Proposal\nWeek 8　　10/31　　Brown &amp; Rodgers pp. 195-226\nReynolds &amp; Bai\nProject Proposal Due　　‧　　Brown &amp; Rodgers pp. 227-256\nWeek 9　　11/7　　Brown &amp; Rodgers pp. 227-256　　‧　　Porte pp. 1-34\nWeek 10　　11/14　　Porte pp. 1-34　　‧　　Porte pp. 35-94\n‧　　Article Critique #1\nWeek 11　　11/21　　Porte pp. 35-94\nArticle Critique #1 Due　　‧　　Porte 95-138\nWeek 12　　11/28　　Porte 95-138　　‧　　Porte 139-150\n‧　　Article Critique #2\nWeek 13　　12/5　　Porte 139-150\nArticle Critique #2 Due　　‧　　Annotated Bibliography\nWeek 14　　12/12　　Research Project Discussion\nAnnotated Bibliography Due　　\nWeek 15　　12/19　　Research Project Discussion　　\nWeek 16　　12/26　　Research Project Discussion　　\nWeek 17　　1/2　　Research Project Discussion　　‧　　Project Presentation\n‧　　Research Project\nWeek 18　　1/9　　Project Presentation\nResearch Project Due","scorePolicy":"Grading Procedures:  Course grades will be calculated in the following manner:\n\n出席率　　　　　　　　　　　　　　　　10%\nTwo Article Critiques　　　　　　　　　　　　　　20%.\n　　Project Proposal　　　　　　　　　　　　　　10%\n　　Annotated Bibliography　　　　　　　　　　　　20%\n　　Original Research Project　　　　　　　　　　　　30%\n　　Project Presentation　　　　　　　　　　　　　　10%\n　　　　　　　　　　　　　　　　　　Total:　　100 pts.\n\nA　　90-100\nB　　80-89\nC　　70-79\nD　　60-69\nF　　59 &amp; BELOW","materials":"上課規則:\n1.　　Graduate level performance is expected from all students. At the graduate level, it is assumed that students are, to a great extent, responsible for their own learning. Therefore, all readings and assignments are to be completed PRIOR to the class for which they are assigned in a thorough and timely manner. Class attendance and quality in-class participation is expected. If you are absent, you should call a classmate to get class notes and assignments.\n2.　　Students are expected to complete all assignments on time. All out-of-class assignments should be typewritten, unless otherwise stated, following standard academic conventions and the APA style manual.\n3.　　Late work will be accepted only with prior instructor consent and WILL BE PENALIZED a letter grade for each 24 hours that the assignment is late. If you are absent the day when a homework assignment is due, you are still required to hand it in on time. Receiving permission to submit an assignment late will not remove the penalty. Special exceptions for emergencies.\n4.　　Students are expected to participate fully in all class discussions.\n5.　　老師授課時，請同學保持安靜，不要與同學交頭接耳。\n6.　　上課中請勿製造噪音(例如隨意講話，大聲整理東西，摔門，等等) 。\n7.　　上課時不可以吃東西（兩堂課中間休息時可以）。飲料沒問題。\n8.　　不來上課的同學注意喔！要補考（小；期中；期末）的學生必須出示醫生開立之證明或訃聞才可以補考。","foreignLanguageTextbooks":false}]
