[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2013-07-16 13:57:59","objective":"讓學生瞭解製造業與服務業行銷的觀念和趨勢。主要包括以下課題：（1）消費者行為（2）市場區隔（3）產品策略（4）行銷通路（5）網路行銷（6）促銷（7）關係行銷。","schedule":"次    　　主題　　內容與個案\n\n1      　　課程介紹　　個案介紹\n消費者行為概論\n\n2　　消費者行為(講義,與客戶互動VCD)　　消費者行為概論投影片\n消費者決策過程\n體驗行銷\n\n3 　　行銷個案：行銷策略、\n　　哈佛商學院HBS Case1: Cola Wars Continue: Coke and Pepsi in the Twenty- First Century\n\nQ1. Why is the soft drink industry so profitable?\nQ2.Compare the economics of the concentrate business to the bottle business: why is the profitability so different?\nQ3.How has the competition between Coke and Pepsi affected the industry’s profit?\nQ4.Can Coke and Pepsi sustain their profits in the wake of flattening demand and the glowing popularity in non-carbonated drink?\n\n4　　行銷個案：行銷通路衝突(雄獅協同平台DVD,個案)\n　　光華Case 2: 雄獅旅行社\nQ1：當面臨產業到大環境改變，雄獅旅行社調整價值核心，將營運方向開始轉向直客方面發展。若公司考慮朝直客發展有哪些優勢，還需要哪些配套？ \nQ2：為什麼雄獅要建立協同運籌平台，在管理通路當中扮演何種角色？\nQ3：協同運籌平台未來的延伸？是否繼續推旺來卡？\n\n5　　行銷個案：服務行銷(CEO高峰會DVD,個案)\n　　哈佛商學院HBS Case 3: Starbucks: Delivering Customer Service\nQ1.請解釋StarBucks在1990年成功的因素?在這段期間他所提供的顧客價值與品牌形象為何?\nQ2.為何StarBucks滿意度下滑?\nQ3.2002年的StarBucks與1990年的StarBucks有何不同?\nQ4.StarBucks應該要投資$40Million的labor提升方案嗎?\n\n6　　行銷個案：時尚全球行銷與電子企業模式\n　　哈佛商學院HBS Case 4: Zara: Fast fashion\n1. How well does Zara’s advantage travel globally? \n2. What do you think of Zara’s past international strategy? Evaluate, in particular, its past strategy for (product) market selection, its mode of entry, and its standardization of its marketing approach. \n3. What is the best way to grow the Zara chain? How, specifically, do you see prospects in the Italian market? And more broadly, what do you think about the strategy of focusing on Europe versus making a major commitment to a second region?\n\n7　　行銷個案：新產品發展與STP\n　　哈佛商學院HBS Case 5: Aqualisa Quartz: Simply a Better Shower\nQ1: What is the Quartz value proposition to plumbers? To consumers?\nQ2. Why is the Quartz shower not selling?\nQ3. Aqualisa spent three years and €5.8 million developing the Quartz. Was the product worth the investment? Is Quartz a niche product or a mainstream product?\nQ4. Aqualisa currently has three brands: Aqualisa, Gainsborough, and ShowerMax. What is the rationale behind this multiple brand strategy? Does it make sense?\nQ5. What should Rawlinson do to generate sales momentum for the Quartz product? Should he change his marketing strategy to target consumers directly, target the DIY market, or target developers? Should he lower the price of the Quartz? Or should he do something different altogether?","scorePolicy":"個案要寫一頁A4心得(針對問題回答): 請在下課時交給助教,任選2個個案","materials":"　","foreignLanguageTextbooks":false},{"name":"廖森貴","email":"skliao@ntut.edu.tw","latestUpdate":"2013-08-20 19:50:57","objective":"讓學生瞭解製造業與服務業行銷的觀念和趨勢。主要包括以下課題：（1）消費者行為（2）市場區隔（3）產品策略（4）行銷通路（5）行銷創新（6）促銷（7）品牌。","schedule":"第一週　　  09/14 調整放假\n第二週　　  09/21行銷概論\n第三週　　  09/28行銷道德、市場區隔\n第四週　　  10/05消費者行為\n第五週　　  10/12 產品\n第六週　　  10/19 定價策略\n第七週　　  10/26行銷創新\n第八週　　  11/02行銷創新個案\n第九週         11/09行銷個案研討\n第十週　　  11/16 行銷個案研討\n第十一週     11/23品牌1\n第十二週     11/30品牌2\n第十三週     12/07 行銷個案研討\n第十四週     12/14行銷個案研討         \n第十五週     12/21行銷個案研討\n第十六週     12/28行銷通路\n第十七週     01/04行銷報告\n第十八週     01/11期末考","scorePolicy":"出席、平日表現 30% \n個案研討、期末報告、期末考70%","materials":"曾光華，行銷管理：理論解析與實務應用，民101年。","foreignLanguageTextbooks":false}]
