[{"name":"王聰榮","email":"tjwang@ntut.edu.tw","latestUpdate":"2013-09-07 21:47:08","objective":"Course description\nThrough close reading and analysis of students’ Thesis application and through other readings (see below), we will study what the “intellectual advancement of innovation sustainability” might mean and how we might participate in it, through the THESIS application process, and through the study and composition of scholarly texts. The final paper will demonstrate students’ understanding of the course content and may be submitted for publication.\n\n本課程主要針對永續建築設計創意進行探討。宇宙萬物瞬息變化，在全球既有之永續建築觀念中，研究者如何在不違背這些觀念的前提下，整合各種不同觀念並提出符合其專業道德之創意思維，以確實滿足符合目前及未來國際潮流對於永續理念的看法；研究者在學習過程中會發現：永續建築設計創意對應永續議題時，那將不只是理論而已，它更必需是融合建築專業實務、技術、道德等因素之結晶。永續建築設計創意不容被挑戰，卻也經常被挑戰；然而，永續建築設計創意如何能夠經得起不同的挑戰與看法，這關乎研究者對於永續建築與設計創意之理解程度；因此，研究者除必需提供相關資訊說明其創意與永續之關係外，更必需提出其創意如何與永續應對，以使所提之創意理念不是空談。換言之，本課程期望透過討論與辯證，進而傳授研究者學習如何整合問題並提出新的思維，而此思維將會符合未來實務所需，以使研究者在學時已具備未來進入職場解決問題之能力。","schedule":"Calendar (tentative)\nSept 12: Introduction\nSept 19: Research presentations (15 minutes in duration).\nSept 26: Commentaries on ICTs.\nOct 3: Commentaries on ICTs\nOct 10: National Holiday\nOct 17: Commentaries on ICTs\nOct 24: Commentaries on ICTs\nOct 31: Commentaries on ICTs\nNov 7: Commentary #3\nNov 14: Commentary #3\nNov 21: Commentary #3\nNov 28: Research presentations\nDec 5: Research presentations\nDec 12: Research presentations\nDec 19: Research presentations\nDec 26: off-campus study.\nJan 2: off-campus study\nJan 9: Conclusion. (Final paper due)","scorePolicy":"Assignments\nIn addition to presenting the THESIS proposal and the final paper (15-25 pp., drawing on course readings but focused on a book of one’s choosing), students prepare three commentaries (5-7 pp.), two on ICTs (#1 and 2) and one on the articles book chosen from the three listed below (#3). A mix of summary and critique, the commentary will be a subject of discussion at the Sept. 19 session.\n\nGrades\nScholarship, originality, and precision will determinative: 5% for research presentation, 15% for each of the three commentaries, 50% for final paper.","materials":"Readings\nRequired:\n1)　　Wang, James (2013). Challenging ICT Applications in Architecture, Engineering, and Industrial Design Education. Hershey, PA: IGI Global.\n2)　　A book of one’s choosing, to be approved by instructor.\nChoose one:\n1)　　Adrian Smitha,∗, Jan-Peter Vosb, John Grinc. (2010). Innovation studies and sustainability transitions: The allure of the multi-level. Research Policy, 39, 435–448.\n2)　　Elizabeth Shovea,∗, Gordon Walkerb. (2010). Governing transitions in the sustainability of everyday life. Research Policy, 39, 471–476.\n3)　　Jochen Markarda,∗, Rob Ravenb, Bernhard Truffera. (2010). Sustainability transitions: An emerging field of research and its prospects. Research Policy, 41, 955-967.","foreignLanguageTextbooks":false}]
