[{"name":"郭佳雯","email":"98551503@nccu.edu.tw","latestUpdate":"2013-10-26 03:10:04","objective":"This course looks at films and newspapers. Visual material will be presented to the students for their analysis concerning this media. Basic film theory is concluded in the course for understanding this media. Films will be used as a way to provoke students’ linguistic fluency and musings of Western cultures. The course will also take a look at the articles from TIME magazine and The Telegraph to bring in a complete view of global conditions.\n\nThis course will take a look at the latest issues of TIME magazine and The Telegraph so that the students could have a more advanced understanding of the world. Also, to deepen students’ sensibility of Western cultures, this course will also take a look at (English speaking) Western Cinema, such as Alfred Hitchcock, who has inspired many contemporary western films like The Shutter Island and slasher horror-cinema. Through the media of popular culture, students could have a more immediate grasp of Western cultures.","schedule":"1. Course begins, introduction.\n2. Reading of Harvard Business Review and discussion\n3. Reading of TIME and reviewing\n4. Film-viewing of part of Alfred Hitchcock’s Psycho and discussion on its influences\n5. Lecture on the film as a cultural study\n6. Reading of Sight and Sound and reviewing.\n7. BBC broadcasting.\n8. Reviewing the course before mid-term.\n9. Mid-term.\n10. Reading of The Telegraph and discussion \n11. Reading of TIME and reviewing\n12. Film-viewing of part of Alfred Hitchcock’s Rope and discussion on its influences\n13. Lecture on the film as a cultural study \n14. Reading of Sight and Sound and reviewing.\n15. BBC broadcasting.\n16. Reading of New York Times.\n17. Reviewing the course before final-term.\n18. Final-term","scorePolicy":"This course requires student’s participation in class.\n(1) 10% of the final score will depend on attending the class. \n(2) Another 10% the student’s score will depend on assignments of writing in class or given as homework. \n(3) 20% of the score will be based on presentations in class. \n(4) 30% for mid-term.\n (5) 30% for final.","materials":"Textbook &amp;references\nTIME magazine\nHarvard Business Review\nNew York Times\nThe Telegraph\nSight and Sound\nCourse related links\nhttp://www.bbc.co.uk/radio/","foreignLanguageTextbooks":false}]
