[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2013-09-06 11:52:32","objective":"本課程旨在訓練學生公開表達之能力，內容包括語言表達基本原則與技巧、肢體語言與演講要領，備題演講及即席演講演練。\nCourse Title:　　　　Public Speaking and Debates\nCredit Hours:　　　　2\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nOffice: 　　        General Education Building Rm.805 / Extension: 3941, 3901\nTerm Offered:　　　　Fall, 203\nCourse Description: 　　This course aims to establish the foundation for English-major students to deliver public speeches in English. Students learn to select topics, collect essential information, analyze the audience, organize materials, improve delivery skills, distinguish different types of speeches, and further to evaluate their own and others’ speeches. Each student is expected to deliver at least 4 individual speeches, and 2-3 debates. Speech topics will be assigned to students. Any modifications of the speech topics will have to be approved by the instructor. All student speech sessions must be videotaped.(*1) \nCourse Requirements: 　　Students’ responsibilities in this class include:\n(1)　　Attending class regularly and to arrive on time: a sign-in sheet to record attendance / a grade reduction of 10% of the semester grade for each session absence \n(2)　　Delivering speeches as scheduled: \ni.　　Students are required to present their speeches on the day scheduled; \nii.　　Make-up speech will be only allowed when the failure to perform is due to an officially excused absence or incidents under extreme circumstances\niii.　　The ideal time duration for each speech is 4 to 6 minutes. The minimum length of speech time is 3 minutes, and the maximum 6 minutes. Violation of the time limit (less than 3 and more than 6) constitutes a failure w/o points awarded. The time length for debates will vary due to the different formats employed.\n(3)　　Submitting to the instructor a speaker’s dossier with inclusion of the outlined speech as well as its full-length version, the speech evaluation card, the self-evaluating commentary of previous speech(s) and also blank A-4 size lined sheets for notes and feedbacks (see Appendix 1 &amp; 2) when presenting the speech. Students who fail to submit the dossier as scheduled and also to comply with the outline format requirements (sampled and specified below) forfeit the right to deliver the speech and hence receive zero points.  \n(4)　　Student speakers are also required to display their outline slide(s) during the speech. \n(5)　　Evaluating one’s own speech: all speeches have to be videotaped by the student speaker. Student speakers are required to watch their own videotaped performance, observe their own speeches, and compile all speech and debate evaluation for submission. Students are strongly advised to use their own videotaping devices. A complete electronic portfolio (on compact disc) needs to be established and submitted at the semester end. \n(6)　　Self-evaluation: Students are required to evaluate him/herself after delivering an in-class speech. Self-evaluation is to be submitted along with other materials in the dossier.","schedule":"2012 English Public Speaking and Debates                           Weekly Syllabus \nWeek/ Date 　　Course Content　　Class Activities\nWk1　　Orientation \n　　Instructor Lecture &amp; Discussion \nWk2　　Guidelines to Public Speaking \nSpeech Preparation　　Instructor Lecture \nClasses Merged: Students required to attend two class sessions\nWk 3 　　Introductory Speech 1 (Impromptu) 　　\nWk4　　Introductory Speech 2 (Impromptu)　　\nWk5　　Guidelines to Informative Speech \n　　Classes Merged: Students required to attend two class sessions\nWk6　　Informative Speech 1 　　Impromptu &amp; Extemporaneous \nWk7　　Informative Speech 2　　Impromptu &amp; Extemporaneous \nWk8　　Informative Speech 3　　Impromptu &amp; Extemporaneous \nWk9　　Persuasive / Analytical Speech 1　　Impromptu &amp; Extemporaneous \nWk10　　Persuasive / Analytical Speech 2 　　Impromptu &amp; Extemporaneous \nWk11　　Persuasive / Analytical Speech 3　　Impromptu &amp; Extemporaneous \nWk12　　Guidelines to Debate &amp; Debate Preparation (1) Guidelines to Debate &amp; Debate Preparation (2) 　　Classes Merged: Students required to attend two class sessions\nWk13　　Debate Preparation  　　Instructor Session \nWk14　　Debate Preparation 　　Instructor Session\nWk15　　Standardized Format Debate \nGroup 1 &amp; 2 　　Classes Merged: Students required to attend two class sessions\nWk16　　Debate Preparation 　　Instructor Session \nWk17　　Cross-Exam Debate Group 1 &amp; 2 　　Classes Merged: Students required to attend two class sessions\nWk18　　Final Debate","scorePolicy":"Grading Policy: 　　(1) Academic honesty is prioritized in this class. Students should learn that plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.  \n(2) The grading components are as follows:\n　　\nComponent　　Grade Percentage \nAttendance *2)　　20% (full attendance) (*2)\nIntroductory Speech \n(Business topics) 　　10% \nInformative Speech \n(Business, literature and linguistics Topics) 　　10% \nPersuasive Speech\n(Selling new ideas, lobbying for changes/ reforms) 　　10%                              \nAnalytical Speech\n(Settling controversial issues, clarifying political and social myths) 　　10% \nGroup Debate 1 (Standard format) \nGeneral Interest Topic 　　15% (team performance grade 40% + individual debater performance 60%) \nGroup Debate 2 (Cross-Examination format) \nPolicy Debate　　15% (team performance grade 40% + individual debater performance 60%)\nFinal Debate Match (Lincoln-Douglas format / impromptu)*4　　10%\nSpeech Assessment Portfolio (Speech outlines, scripts audios, commentary notes and peer evaluation entries) 　　Required (*5)","materials":"Notes: \n*1) Student speakers need to videotape their speeches each time and submit the digital recordings at the end of the semester. \n* 2) Students are obligated to attend all class sessions. Each absence will generate 10% point deduction of the semester grades on the 100% scale. \n*3) All extemporaneous speeches allow speakers to deliver the speech with its outline and necessary visual aids, such as flash cards, posters and PPT slides. Student speakers who use a script at speech delivery will result in the total loss of the component grade. (For each speech, students shall keep the comments/grades (on speech card) for the purpose of monitoring their performance and the final result.) \n*4) The implementation of the final debate match is likely to be subject to certain contingent occurrences as the class proceeds. Exact date, format and related matters will have to be discussed and determined later in the semester. \n* 5) Students are required to submit the speech assessment portfolio at the end of the semester. Failure to submit the portfolio will override the grades received in other grading components and thus results in a failing grade.\n(Course content and activities are to be adjusted for effective teaching and learning. The above syllabus is thus subject to modification as the class proceeds. Updated info will be provided when necessary.) \n(Special Note: Special Note: Students are given permission to devise his/her own syllabus. More details will be discussed in class at the orientation session. \n********************************************************************************\nAppendix 1 (Present this card to the instructor when giving a speech) \n------------------------------------------------------------------------------------------------------------------------\nSpeech Evaluation Card                           Date ___________\nSpeaker Name _____________________ Student ID. ________________\nSpeech Type _____________ Speech Topic _______________________\nEvaluation:\n1)　　Logos (logical argument, structure and content)   ______ (0-3)\n2)　　Ethos (speaker credibility &amp; demeanor) _____ (0-2)\n3)　　Pathos (emotional connection, effectiveness and impact) _____ (0-2)\n4)　　Language use _____ (0-3) \nTotal points earned __________ \n\n\n\n\nAppendix 2 Self-Evaluation (Submit this a week after finishing a speech) \n------------------------------------------------------------------------------------------------------------------------\nSpeech Checklist for Self-Evaluation            Date _________________\nSpeaker ____________________     Student ID. ___________________ \nSpeech Type ________________     Speech Topic: ___________________________\nQualitative Evaluation: Determine whether all items were accomplished effectively by the indicators of ‘yes” or “no” and also provide analysis.\n_____ 1. Did you capture and maintain the attention of the audience? \nAnalysis: \n_____ 2. Was the introduction effective?\nAnalysis:\n_____ 3. Was the specific goal/purpose clearly stated?\nAnalysis:\n_____ 4. Did you support the goals or purpose with facts or examples?\nAnalysis:\n_____ 5. Was the organization of the speech easy to follow?\nAnalysis:\n_____ 6. Was the conclusion effective?\nAnalysis:\n_____ 7. Did your voice vary in pitch for emphasis?\nAnalysis:\n_____ 8. Did you maintain eye contact with your audience?\nAnalysis:\n_____ 9. Did you avoid using verbal fillers such as \"uh\" and \"like?\"\nAnalysis:\n_____ 10. Was the language correct, clear, vivid, empathic and appropriate? \nAnalysis:\n_____ 11. Was the speech delivered enthusiastically, with vocal expressiveness, fluently, spontaneously, and directly?\nAnalysis:\nQuantitative Evaluation (check one)\n___ *Excellent(100-90) ___ *Good (89-80) ___ Average (79-70)___ Fair (69-60)___ Poor (59 and below)\n\n---------------------------------------------------------------------------------------------------------------------\nIn the dossier, for each speech you n","foreignLanguageTextbooks":false}]
