[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2013-09-19 15:12:42","objective":"COURSE OVERVIEW\n　　This course will help you organize and present your ideas in clear, fluent, logical paragraphs. Students will learn to analyze their own voice, style, and word choice with the goal of becoming more creative at the same time as they learn to write more clearly. We will workshop papers in small groups and as a class, helping students analyze their own and other students’ writing. Each week will also involve a review of important grammatical points.","schedule":"Date and Topic\nTopic/Reading\nOther Assignment \n(Unless I write “in-class,” the assignment is due at 1:10 on this date.)\n\nWeek 1, 9-11\n“The Writing Process”\nIn-class freewrite\n\nWeek 2, 9-18\n“Pre-writing Techniques”\n“Ten Tips on How to Write Less Badly”\nDescription due. \n\nWeek 3, 9-25\n“Finding a Voice and Style”\n\nWeek 4, 10-2\nIn-class reading from Ben Franklin’s Autobiography\nVoice Exercises due.\nIn-class freewrite on Narrative Topic\n\nWeek 5, 10-9\nLibrary Day\n\nWeek 6, 10-16\nFrom Narrative of the Life of Frederick Douglass\nLibrary Work due\n\nWeek 7, 10-23\n“The Lead” \nIn-class work on Paragraph Development, forming Main Ideas\nNarrative Essay, Draft 1—Bring two copies for peer review\n\nWeek 8, 10-30\n“The Ending”\nIn-class reading of Tolkien’s Letter\nLydia Maria Child’s Preface \nNarrative Final Draft\n\nWeek 9, 11-6\nPersuasion, Sources, and Logic\nFrom Martin Luther King’s “Letter from a Birmingham Jail.”\n\nWeek 10, 11-13\nOn Plagiarism—Case Studies\nAcademic Writing &amp; MLA\nIn-class MLA citation practice\nLetter due\n\nWeek 11, 11-20\nThey Say/I Say\nHomework: Responses to Plagiarism Powerpoint.\n\nWeek 12, 11-27\nQuiz on Plagiarism.\nParaphrasing/Analysis Exercise due\n\nWeek 13, 12-4\nRead the selected articles for your possible argument paper. \nArgument introduction due by e-mail before Monday at noon. (I will want to have read them before Wednesday’s class.)\n\nWeek 14, 12-11\nDraft 1: Argument Essay. Meet with me\n\nWeek 15, 12-18\nRead “Step 9: MLA Style”\n Signal Phrases\nPeer Review\nDraft II: Argument Essay\n\nWeek 16, 12-25\nReview for Final\nArgument Essay Due\n\nWeek 17. 1-1\nNo class\n\nWeek 18, 1-8\nFinal—MLA citation and other class material will be covered\n\nAs the semester goes on, I will assign additional readings on writing and grammar as well as some grammar homework. Be prepared for these assignments. \n\nThis syllabus may be modified at my discretion.","scorePolicy":"ASSIGNMENTS\n‧　　In order to receive credit for this course, you must complete all assignments, drafts, and revisions. \n‧　　You are expected to make substantial revisions to each draft so that you can think about your issue as deeply and specifically as possible. \n‧　　All assignments are due in hard copy at the beginning of class. (You will have technology problems. Make sure to print your paper early enough that you will not run into difficulties with non-functioning printers.) For formal papers I take off 5% if you are late to class on a paper due date (10% if you are fifteen or more minutes late), 10% if the paper is turned in within twenty-four hours after the due date (before 1:00 a.m. on Thursday) and 20% if the paper is turned in within forty-eight hours of the deadline. You will not receive any credit for a paper turned in more than 48 hours late. Late papers should be turned in both by an e-mail Word document and in an identical hard copy. (The e-mail lets me know at what time you turned in your paper. However, I only grade hard copies, and you must put the paper in my box as well.) I hope that you will turn in all papers on time, but in the event that a paper is late, bring it to my office. If I am not in my office, slip the paper under the door or put it my box. Please also immediately send me an e-mail alerting me that you have left a paper for me. If you wish to receive credit for a late paper, it is your responsibility to make sure that the paper gets to me safely. \n‧　　In addition to the paper assignments, you will have informal writing exercises, grammar homework, quizzes, peer reviews, and presentations. Informal writing assignments, homework, and quizzes are not usually listed on the syllabus. \n‧　　No credit is given for late homework. If you will be absent, get me the assignment ahead of time.\n‧　　Please bring a notebook with removable pages to every class period. Begin freewrites on a new page. (I sometimes collect them. I sometimes don’t.) \n\n\nGRADING AND OTHER POLICIES\n\nGrade Percentages:\n\nFormal Papers: 50%\nQuizzes and Homework: 20%\nInformal Writing Assignments: 20%\nPeer Review Effort and General Class Participation: 10%\n\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\n\nGrading Criteria:\n\nA　　Superior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\n\nB　　Achievement that is significantly above the level necessary to meet course requirements.\n\nC 　　Achievement that meets the course requirements in every respect. \n\nD 　　Achievement that fails to meet fully the course requirements. \n\nF 　　Achievement that is not worthy of credit. The only way to outright fail this course is through lack of effort. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.","materials":"TEXTS\n‧　　Course Packet and/or e-mailed readings and handouts. Please print these. \n\nSUPPLIES\n‧　　A journal, pens, and loose-leaf paper for in-class writing and quizzes\n‧　　A dry-erase marker and a cleaning cloth\n‧　　A pocket folder in which to submit papers and drafts\n‧　　Money, paper, and fresh ink cartridges for printing out or photocopying drafts and readings (Please always bring a copy of all readings with you to class). \n‧　　A binder in which to keep all your class readings (highly recommended)","foreignLanguageTextbooks":false}]
