[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2013-09-13 17:23:53","objective":"認識通俗科技文章及科技學術論文語法、文體、結構組織等特質，並探討技術報告及論文撰寫方式。 本課程授課包括約三分之一的時間在語言教室練習職場英語。\nCourse Title:　　　　English for Engineering and Technology\nCredit Hours:　　　　3\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nOffice: 　　        General Education Building Rm.805 / Extension: 3941, 3901\nTerm Offered:　　　　Fall, 2013\nRequired / Recommended Texts: N/A \nCourse Description: 　　This course aims to prepare graduate level engineering-major students with sufficient repertoire of English for engineering related topics and issues.  Given the rather diverse needs of in-service engineering professionals in the current class, it is deemed essential to address the common concerns of all students in the use of English in their careers. Needs analysis will be conducted to define and determine course objectives. In addition, rudimentary grammar and essential core content vocabulary and strategies for reading comprehension and content discussion will be incorporated.  \nCourse Objective:　　At the successful conclusion of this course, students are expected to \n1)　　develop a substantial vocabulary repertoire for workplace communication\n2)　　build solid skills of English writing by reinforcing learning of grammar\n3)　　strengthen English oral language fluency for presentations on a paper, technical report or TED speech (technology-related) \n4)　　achieve advanced level of English   \nCourse Requirements:　　Students enrolled in this course will be required to:\n1)　　complete all readings assigned by the instructor and selected by students themselves \n2)　　select one scholarly paper or technical report to present in class (Final Project)\n3)　　participate in all in-class activities, including reading, writing, and speaking \n4)　　complete assigned exercise tasks \n5)　　take online TOEIC tests \nAttendance:  Students are required to attend the class as scheduled and to arrive on time. Full attendance and punctuality are prioritized. An AWOL is not accepted. Should there be any incident to result in involuntary absence, special considerations will be given after thorough discussion.","schedule":"Weekly Syllabus:\nTBA","scorePolicy":"Evaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their attendance, presentations, assignments and exams. (*Note that the grading policy may be subject to change as the class proceeds.) 1) Attendance 30 %  2) Class participation 20%  3) Paper / TED speech presentation 20%  4) TWO Online TOEIC tests 30% (midterm and final)","materials":"Required / Recommended Texts: \nPackets of handouts and papers / Online TOEIC Tests","foreignLanguageTextbooks":false}]
