[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2013-09-19 15:06:35","objective":"COURSE DESCRIPTION\nThis course is designed for the high school teacher and for any graduate student who wants a thorough background in the history of American literature from 1492 to the present. Texts may include stories recorded from oral tradition, letters, autobiography, novels, poems, short stories, plays, children’s literature, and/or historical documents. Some texts will be read outside of class; others will be read/acted in class, allowing students to come away with practical teaching ideas for their own classes. This course, instead of culminating in a major seminar paper, is graded based on sample teaching demonstrations, shorter writing assignments, and student participation.\n\nCOURSE GOALS\nThe goals of this class are two-fold. First, I want you to enjoy reading (or revisiting) some of the best-known works of American literature. Thus, the first goal of the course is knowledge and art for its own sake. Secondly, if you are a teacher, I want this course to serve as a means for you to reflect on how you can integrate American literature into your teaching.","schedule":"Week 1\n9/11\nColumbus’s letter to Ferdinand and Isabel\nCabeza de Vaca\nPilgrims\nPocohantas \nNative American Tales\nSometime this week: Send me an e-mail introduction that includes (1) information on which works you have read and which you haven’t, (2) what you hope to get from the course, and (3) how (if you are a teacher) you plan to incorporate the things you learn in this course into your teaching. Do you think it will be difficult or easy to incorporate literature into your classes? Why? \n\nWeek 2\n9/18\n1776—the musical \nFrom Ben Franklin’s Autobiography\n“The Declaration of Independence”\n\nWeek 3\n9/25\nEmily Dickinson, Poetry\nEdgar Allan Poe--Poetry\nEdgar Allen Poe: “The Fall of the House of Usher,” “The Tell-Tale Heart.”  \nRead “How to Make Lectures More Effective”\n\nOptional: “Rapaccini’s Daughter” (Hawthorne)\nTeaching Demonstration\n\nWeek 4\n10/2\nFrom Walden (Thoreau)\nSlavery and the Civil War\n“Gettysburg Address” Lincoln. \nRead “Supplements and Alternatives to Lecturing: Encouraging Student Participation.” \nRead “Motivating Students”\n\nRead from Narrative of the Life of Frederick Douglass\nTeaching Demonstration\n\nWeek 5\n10/9\nNo class. Happy National Day Eve!\nKeep reading Narrative of the Life of Frederick Douglass\n\nWeek 6\n10/16\nHuckleberry Finn (read aloud)\nNarrative of the Life of Frederick Douglass\nFrom Tom Sawyer\n\nWeek 7\n10/23\nHuckleberry Finn (read aloud)\nRead “Leading a Discussion” and “Encouraging Student Participation in Discussions.” \nTeaching Demonstration\n\nWeek 8\n10/30\nHuckleberry Finn (read aloud)\nTeaching Demonstration\nAmerican Tall Tales\n\nWeek 9\n11/5\nThe Wizard of Oz (film) 101 minutes\nThe Wonderful Wizard of Oz (selections TBA)\n\nWeek 10\n11/13\n James Whitcomb Riley: “Two Sonnets to the June Bug” and selected other works. \nRobert Frost: Selected Poems\n“Archy and Mehitabel” poems, Ogden Nash selections\n\nTeaching Demonstration\nWeek 11\n11/20\nGentlemen Prefer Blondes (film—91 minutes) Perf. Jane Russell, Marilyn Monroe, Charles Coburn.\nGentlemen Prefer Blondes (TBA)\nRead “Asking Questions.”\n\nWeek 12\n11/27\nThe Crucible (read aloud in class) \nFrom The Salem Witch Trials\nMcCarthyism\nCome up with three different types of questions (from “Asking Questions” that you could ask a class about the Salem Witch Trials or McCarthyism\n\nWeek 13\n12/4\nI Love Lucy.\nA Wrinkle in Time\nTeaching Demonstration\n\nWeek 14\n12/11\nA Wrinkle in Time\nTeaching Demonstration\n\nWeek 15\n12/18\nMartin Luther King Jr. \n“I have a dream” speech\nMartin Luther King, Jr., “Letter from a Birmingham Jail”\nMaya Angelou “I know why the Caged Bird Sings” (poem), “Still I Rise”\nTeaching Demonstration \n\nWeek 16\n12/25\nMerry Christmas!\n(You may wish to begin reading Holes or to work on your reflection paper.) \n\nWeek 17\n1/1\nHappy New Year! No class\nReflection Paper due by e-mail before Saturday, January 4 at midnight. \n\nWeek 18\nPoetry—\nSharon Old’s “Alcatraz” http://www.eroonkang.com/projects/Alcatraz/\nHoles\nTeaching Demonstration on Holes\n\nThis syllabus may be modified at my discretion.","scorePolicy":"GRADING AND OTHER POLICIES\n\nGrade Percentages:\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nTeaching Reflections and Reading Quizzes: 30%\nInformal Teaching Presentations and Class Participation: 30%\nFormal Teaching Presentations: 25%\nFinal Teaching Reflection Paper: 15%\n\nGrading Criteria:\nA　　Superior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\n\nB　　Achievement that is significantly above the level necessary to meet course requirements.\n\nC 　　Achievement that meets the course requirements in every respect. \n\nD 　　Achievement that fails to meet fully the course requirements. \n\nF 　　Achievement that is not worthy of credit. The only way to outright fail this course is through lack of effort and/or plagiarism. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all. \n\n\n\nASSIGNMENTS\n‧　　Reading Quizzes. (If we have a reading assignment, you may have a quiz on it. These are open-note but not open book. Take good notes! Quizzes may not be made up, but your lowest score will be dropped.)\n‧　　Teaching Demonstrations. Each student will prepare informal teaching demonstrations (in groups—discussed in class) and formal teaching demonstrations (done individually). You will select the date and topic for your individual teaching demonstrations. \n‧　　Teaching Reflections. Students will write informal reflections on how they would teach a particular work that we study and one formal reflection at the end of the course. \n‧　　Reading Notebook. As you do the reading, jot down any questions or comments you had on the reading. Write a few quick notes about what interested you most about the text (as related to the course themes). Include page numbers and one or two passages we might look at. You might consider these questions or choose another:  \n\na).  What was the most interesting/intriguing aspect of the day’s reading?\nb).  Did you find anything about the reading disturbing, upsetting, or annoying?  Why?  Why does the text include these details?  \nc).  How does this text appear to respond to its own time, to history, and/or to the other texts we have read?  \nd).  What approaches would you use to teach this work, sections of this work, or information about this work to your class? (If you’re not a teacher, imagine an age-level and think about how you would teach the work.)","materials":"PARTICIPATION\n\nYour participation is key to the success of this course. Please try to make productive statements or ask interesting questions in class each week, and be sure to stay on task during group work. Someone with a high grade in participation shows a thorough engagement with the course readings and visual media, speaks only English in class and takes notes almost exclusively in English, jots down questions in a notebook while reading in order to bring these questions up in class discussion, develops original and creative teaching presentations, participates in the presentations of others, frequently makes thoughtful contributions that raise the level of our class discussion, takes notes in class, is trustworthy, takes academic honesty seriously, stays focused and on-task during class periods, is helpful and engaged during in-class workshops, interacts positively and tactfully with other class members, and reads with expression and enthusiasm. \n\nIf you are worried about your level of participation, please see me. Participation is not how much you say or how smart you can show me you are: contribute in ways that help you and the people around you learn. Know that thoughtful questions are quite as valuable as other kinds of participation.","foreignLanguageTextbooks":false}]
