[{"name":"陳建文","email":"a868@ntut.edu.tw","latestUpdate":"2013-06-02 22:23:39","objective":"本課程探討介紹勞工問題及勞資爭議的基本概念，同時輔以相關案例的檢討分析，以提升學生對於問題的了解，同時幫助學生學習職場溝通，以建立和諧及合作的勞資關係。","schedule":"本課程重視閱讀以及課堂主動參與討論，配合每週授課進度有相當多的指定主題閱讀報告，可以透過課前閱讀與課堂討論之交叉學習，獲得思考處理未來職場問題的能力。如不愛思考討論或是會時常缺課的同學，請勿選課。\n\n第1週  課程內容及上課方式說明\n第2週  企業與現代社會\n第3週  勞資關係的倫理思考—企業治理、企業社會責任與企業利害關係人\n第4週  勞資關係的民主思考—企業王國？企業帝國？企業民國！：企業勞資關係看待圖像的勾勒描繪\n第5週  職場規範的形成與建立-勞動法法源體系及運作原理\n第6週  定型化勞動契約約款的簽訂與爭議處理\n第7週  工作規則單方變更勞動條件的爭議處理\n第8週  團體協商誠信協商義務的爭議處理\n第9週  期中考試\n第10週  勞資關係勝任工作之倫理要求\n第11週  不能勝任工作之民主處理（一）：程序正義要求\n第12週  不能勝任工作之民主處理（一）：實體正義要求\n第13週  企業紀律要求與違紀懲戒：各種懲戒事由\n第14週  懲戒事由的審查思辨\n第15週  企業懲戒的實質正當性審查\n第16週  企業懲戒的程序保障問題\n第17週  就業歧視與不當勞動行為的救濟處理\n第18週  期末考試","scorePolicy":"本課程採3種作業方式來深化認知學生的倫理與民主，以及培養其思考習慣\n1.指定課前閱讀作業。\n2. 個別授課主題相關的判決研討： 將判決素材交給教學小組進行研討、做成簡報，再於課堂共同討論。透過判決所呈顯的「人情故事」，來引導學生尋找「人情事故」、設想「人情世故」。\n3.時事討論：利用新聞時事報導為討論素材，來提問引導討論。\n\n\n筆試（期中考.期末考）30％\n課堂報告40％\n平常分數30％（包括出席到課、參與討論、作業表現）","materials":"週次　　課程內容　　指定閱讀\n第1週  　　課程內容及上課方式說明　　\n第2週　　  企業與現代社會\n　　劉安之/策畫、江明修/主編 ，社會企業與公益創新：邁向公民社會 ， Airiti Press Inc.， 2011年12月5日出版。\n第3週　　 勞資關係的倫理思考—企業治理、企業社會責任與企業利害關係人\n　　戴銘昇譯，2004「經濟合作發展組織」公司治理原則（譯著）（2004 OECD Principles of Corporate Governance），全國律師雜誌94年7月號，頁72以下。\n黃程貫，勞動法中關於勞動關係之本質的理論，政大法學評論第59期（1998年6月）。\n第4週　　勞資關係的民主思考—\n企業王國？企業帝國？企業民國！：企業勞資關係看待圖像的勾勒描繪 　　陳建文等人合著，2011年5月，國立政治大學法叢書70社會公義：黃越欽教授紀念論文集，元照出版公司（ISBN編號：978-986-255-109-7；負責執筆：企業王國？企業帝國？企業民國！ -一個勞動基準法規範認知圖像的勾勒嘗試（頁283-335）\n第5週　　職場規範的形成與建立-勞動法法源體系及運作原理　　陳建文，「勞資雙方議定工資原則」及其操作方式／台北地院九七勞簡上七裁判簡評，台灣法學雜誌第131期（2009年7月1日），頁184-188。\n陳建文，2009年9月25日，勞動基準法第二十一條之法規則與法原則--「勞資雙方議定工資（勞動條件）原則」之探討，發表於行政院勞工委員會/主辦，台灣勞動法學會、台北大學法律學院/協辦，勞動基準法實務爭議學術研討會（台北大學台北市民生校區國際會議廳）\n陳建文，勞動基準法第八十四條之一 的「核備」要件與勞資自主規範的審查控制問題／台北高院九八訴一五四裁判簡評，台灣法學雜誌第133期（2009年8月1日），頁232-237。\n陳建文，2012年11月22日，工時除外適用規定之行政核備效力問題/最高法院101年度台上字第258號民事判決，國立臺北大學法律學院/主辦，勞動法重要判決評釋學術研討會（國立臺北大學三峽校區法學院實習法庭）。\n第6週　　定型化勞動契約約款的簽訂與爭議處理\n【校外專家協同教學:劉素吟，寰瀛法律事務所，律師】　　黃泰平，勞動契約上最低服務年限約定之研究，政治大學法律學研究所碩士論文，2004年7月。\n林更盛，離職後競業禁止約款—評台北地方法院八九年度勞訴字第七六號判決，勞動法案例研究(一)，頁135-153。\n林更盛，離職後競業禁止約款的審查:雇方值得保護的正當利益—評台灣高法院台中分院九一年度上字第三六七號判決，勞動法案例研究(二)，頁163-180。\n行政院勞工委員會勞資關係處，簽訂競業禁止參考手冊。\n陳建文，調職問題的事理結構與法理思考／台中地院九七勞訴一 ○四裁判簡評，台灣法學雜誌第141期（2009年12月1日），頁237-242。\n陳建文，職務調整及調適過程的必要溝通與協助／板橋地院九八勞訴四裁判簡評，台灣法學雜誌第150期 （2010年4月15日），頁227-232。\n第7週　　工作規則單方變更勞動條件的爭議處理　　陳建文，「工作規則合理性變更」見解的雙重「合理性」問題／高院九八勞上六二裁判簡評，台灣法學雜誌第148期（2010年3月15日），頁192-198。\n陳建文，「違反工作歸責情節重大」認定操作問題的「二階觀察（second-order observation）」／台中地院九八勞訴一二六裁判簡評，台灣法學雜誌第152期（2010年5月15日），頁203-206。\n陳建文，「勞動條件不利益變更須具備合理性、必要性」觀點的理論發想／台北地院九八勞簡上七二裁判簡評，台灣法學雜誌第158期（2010年8月15日），頁190-196。\n第8週　　團體協商誠信協商義務的爭議處理　　陳建文，2012年5月5日，拒絕團體協商之不當性與正當性思考—無正當理由拒絕團體協商機制之裁決操作探討，政治大學法學院勞動法與社會法中心、台北律師公會、台灣勞動法學會/主辦，101年度我國不當勞動行為裁決制度實施周年研討會（政治大學公企中心西棟1F大禮堂；台北市金華街187號）。\n第9週　　期中考試　　\n第10週　　勞資關係勝任工作之倫理要求　　林更盛，作為解僱事由之「勞工確不能勝任工作」，勞動法案例研究(一)，頁217-242。\n張琬如，論勞動基準法第11條第5款之「勞工對於所擔任之工作確不能勝任」，司法官第46期法學研究報告合輯（第1輯），頁547-575。\n劉士豪，因不能勝任工作而終止僱傭契約—高院九七重勞上一二，台灣本土法學雜誌第119期，頁209-210。\n劉志鵬，論「勞工確不能勝任工作」--最高法院八十四年台上字第六七三號判決評釋，勞動法理論與判決研究，頁133-151。\n鄭津津，「勞工確不勝任工作」爭議問題之研究—評最高法院九五年度上字第一八六六號判決，月旦法學雜誌第144期，頁229-244。\n第11週　　不能勝任工作之民主處理（一）：程序正義要求　　林更盛，作為解僱事由之「勞工確不能勝任工作」，勞動法案例研究(一)，頁217-242。\n張琬如，論勞動基準法第11條第5款之「勞工對於所擔任之工作確不能勝任」，司法官第46期法學研究報告合輯（第1輯），頁547-575。\n劉士豪，因不能勝任工作而終止僱傭契約—高院九七重勞上一二，台灣本土法學雜誌第119期，頁209-210。\n劉志鵬，論「勞工確不能勝任工作」--最高法院八十四?","foreignLanguageTextbooks":false}]
