[{"name":"林鳳儀","email":"fengyi@ntut.edu.tw","latestUpdate":"2013-06-18 19:44:20","objective":"課程內容包括：審計及會計專業、AICPA Top10 Technologies、AIS research methods、IT technologies、查核規劃、Risk analysis、Security management、內部控制結構等。本課程將介紹的主題如下：\n◆會計資訊系統之重要性和意義\n◆會計資訊系統與內外環境的關係\n◆資料處理作業程序中的五大功能\n◆內部控制與會計資系統\n◆資訊系統的工具與技術\n◆系統開發\n◆資料庫管理\n◆會計實務軟體的介紹與操作\n◆介紹有關AIS研究之分類及內容。\n◆新興的AIS研究課題及資訊應用。","schedule":"一、Bell, Timothy B., W. Robet Knechel, Jeff L. Payne, and John J. Willingham, “An Empirical Investigation of the Relationship Between the Computerization of Accounting Systems and the Incidence and Size of Audit Differences,” Auditing: A Journal of Practice &amp; Theory, Vol. 17, No. 1, Spring 1998, pp. 13-38.  (7)\n二、 Ezzamel, Mahmoud and Michael Bourn, “The Roles of Accounting Information Systems in an Organization Experiencing Financial Crisis,” Accounting, Organization and Society, Vol. 15, No. 5, 1990, pp. 399-424. (8)\n三、 Benbasat, I. W. and A. S. Dexter, 1979, “Value and Events Approaches to Accounting: An Experimental Evaluation,” Accounting Review, October 1979 (54:4), pp. 735-749.\n四、Dickson, G. W., J. A. Senn, and N. L. Chervany, 1977, “Research in Management Information Systems; The Minnesota Experiments,” Management Science, May 1977 (23:9), pp. 913-923. (4)\n五、 Dunn, C. and S. Grabski, “An Investigation of Localization as an Element of Cognitive Fit in Accounting Model Representations,” Decision Sciences, Vol. 32, No. 1, Winter 2001, pp. 55-94.\n六、Bailey, J. E. and S. W. Pearson, S., 1983, “Development of a Tool for Measuring and Analyzing Computer User Satisfaction,” Management Science, Vol.29, No. 5, May 1983, pp. 530-545. (15)\n七、Gurbaxani, V. and H. Mendelson, 1991, “The Use of Secondary Analysis in MIS Research,” in Kraemer, Kenneth L. (ed.) The Information Systems Research Challenge: Survey Research Methods, Volume 3, Harvard Business School Research Colloquium, Boston, MA: Harvard Business School, 1991, pp. 71-106.\n八、期中考\n九、   Ives, B. and M. H. Olson, , 1984, “User Involvement and MIS Success: A Review of Research,” Management Science, May 1984 (30:5), pp. 586-603.\n十、Ives, B., M. H. Olson, and J. J. Baroudi, 1983, “The Measurement of User Information Satisfaction,” Communications of the ACM, October 1983 (26:10), pp. 785-793.\n十一、Oliver Tamine, Rudiger Dillmann, “KaViDo-a web-based system for collaborative research and development processes. “ Computers in Industry “, (2003)  pp.29-45(6)\n十二、Swanson, E. B., 1974, “Management Information Systems: Appreciation and Involvement,” Management Science, October 1974 (2:2), pp. 178-188. (8)\n十三、 Zmud, R. W., 1978, “An Empirical Investigation of the Dimesionality of the Concept of Information,” Decision Sciences, April 1978 (9:2), pp. 187-195.\n十四、  Zmud, R. W. and A. C. Boynton, 1991, “Survey Measures and Instruments in MIS: Inventory and Appraisal,” in Kraemer, Kenneth L. (ed.) The Information Systems Research Challenge: Survey Research Methods, Volume 3, Harvard Business School Research Colloquium, Boston, MA: Harvard Business School, 1991, pp. 149-180.\n十五、 Fiedler K. D., Grover V. and Teng, J., “An Empirically Derived Taxonomy of Information Technology Structure and Its Relationship to Organizational Structure”, Journal of Management Information Systems, Summer 1996, Vol. 13 No. 1. pp9-34. (9)\n十六、Lawler, III Edward E., “The Multitrait-Multirater Approach to Measuring Managerial Job Performance,” Jouranl of Applied Psychology, Vol. 51, No. 5, Part 1 of 2 Parts, October 1967, pp. 369-381. (also in the book of “Measurement for Management Decision,” (Addison-Wesley Series on Decision Support) by Richard O. Mason and E. Burton Swanson, Addison-Wesley Publishing Company, Inc., 1981, pp. 317-333.) (5)\n十七、 Cronbach, Lee J. and Paul E. Meehl, 1955, “Construct Validity in Psychological Tests,” Psychology Bulletin, Vol. 52, No. 4, July 1955, pp. 281-302. (also in the book of “Measurement for Management Decision,” (Addison-Wesley Series on Decision Support) by Richard O. Mason and E. Burton Swanson, Addison-Wesley Publishing Company, Inc., 1981, pp. 336-359.)\n十八、 Kogan, Alexander, Ephraim F. Sudit, and Miklos A. Vasarhelyi, “Continuous Online Auditing: A Program of Research,” Journal of Information Systems, Vol. 13, No. 2, Fall 1999, pp. 87-103. (3)","scorePolicy":"平時：40%\n期中：30%\n期末：30%","materials":"無","foreignLanguageTextbooks":false}]
