[{"name":"周至如","email":"cjchou@ntut.edu.tw","latestUpdate":"2008-05-01 11:43:47","objective":".Second order circuits (RLC parallel and series circuits) analysis,\n.Applications and further solutions for more complex second order  circuit,\n.Important concepts and phasor method for sinusoidal steady state circuits analysis,\n.Analysis of various types of sinusoidal steady state circuits,\n.Introduction to three-phase balanced circuit,\n.Analysis of various types of three-phase balanced circuits,\n.Laplace transform method and its application on the circuit analysis,\n.Analysis of various types of linear-time-invariant circuits by using Laplace transform method,\n.Two-port circuit concepts and their circuit model and various types of parameters,\n. Analysis of various types of two-port circuits and their combinations.\n","schedule":"第1週:Descriptions for RLC parallel and series circuits, equations derivations, parameters definitions, and the duality between parallel RLC and series RLC circuits.\n第2週: Second order circuits natural responses analysis with respect to various damping situations.\n第3週: The root locus and state trajectory of second order circuits natural responses s with respect to various damping situations.\n第4週:Other responses analysis for second order circuits : impulse response, step response and sinusoidal response analysis.\n第5週: Applications and further solutions for more complex second order circuit.\n第6週: Concepts of phasor and complex numbers for application on the sinusoidal steady state circuits analysis.\n第7週: Concepts and calculation for impedance, admittance, current and voltage phasors, complex  power, real and reactive powers.\n第8週:Further analysis of various types of sinusoidal steady state circuits.\n第9週: Review and midterm (期中考)\n第10週: Introduction to three-phase balanced circuit with △ and Y connection scheme.\n第11週: Analysis of various types of three-phase balanced circuits.\n第12週:Further analysis and applications of more complex three-phase balanced circuits.\n第13週: .Laplace transform method and its application on the circuit analysis.\n第14週: Analysis of various types of linear-time-invariant (LTIV) circuits by using Laplace transform method.\n.\n第15週: Further application of Laplace transform method on more complex LTIV circuits analysis.\n第16週: Two-port circuit concepts and their circuit model and various types of parameters.\n第17週: Applications and analysis of various types of two-port circuits and their combinations..\n第18週:Final examination (期末考)\n","scorePolicy":"期中考(30%)\n期末考(30%)\n平常成績(40%)\n註:平常成績包括:出席率, 作業, 小考(至少二次)及課堂表現等.","materials":"The goals of this course is to discipline the students of under graduated level to erect their fundamental on the circuit theory . For this, the concepts and the analysis technique of electric circuit are learned , in which the related electromagnetic theory, physical concepts and mathematic methods for solving the circuit problems will be enhanced . The approach methods including the analytical methods and numerical methods are studied. From which, the students can realize many circuit theorems and their applications and some associated approach software. In addition to the circuit analysis techniques, the students are encouraged to solve some simple circuit synthesis problems for further study on the circuit design and its related fields in the future.\n主要教材為:\n教科書名 Electric Circuits (Seventh Edition)\n作者 James W. Nilsson &amp; Susan A. Riedel\n出版書局 Person Prentice Hall\n出版日期 西元2005年","foreignLanguageTextbooks":false}]
