[{"name":"謝佳玲","email":"clhsieh@ntut.edu.tw","latestUpdate":"2008-09-11 20:22:49","objective":"本課程以與學生日常生活相關的情境為主題，協助學生建立自然、流利的英語溝通技巧。語程側重訓練學生下列語言能力；(1)重音、縮音、連音、及語調等發音基礎訓練；(2)聆聽大意及特定資訊之能力；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式。本課程使用語言教室視聽器材實施教學。除聆聽錄音教材、配對練習、角色扮演、演說、表演短劇、及小組討論外，並佐以錄影教材，以加強實際演練與師生互動。","schedule":"1 Introduction\n2 Unit 1\n3 Unit 2\n4 Unit 3\n5 Unit 4\n6 Unit Oral test\n7 Unit Oral test\n8 Review\n9 Midterm exam\n10 Unit 5\n11 Unit 6\n12 Unit Proficiency test\n13 Unit 7\n14 Unit 8\n15 Unit Oral test\n16 Unit Oral test\n17 Unit 16\n18 Final exam","scorePolicy":"1. Participation (10%)\n(a) TWO POINTS will be taken off of your final grade for each hour of absence. Do not be absent for more than TEN HOURS, or you will fail this course.\n(b) If you are absent in case of uncontrollable situations (e.g. illness, emergency and important occasions), you need to submit a FORMAL PROOF (a leave permit or the health insurance card with correct stamp of date) through e-mail within ONE WEEK. If no formal proof is available, you need to typewrite one IN ENGLISH, with at least 300 words stating why you were absent.\n2. Exams and oral tests (90%)\n(a) Cheating on the exam is forbidden. If you are caught cheating, you will fail the exam and even the course.\n(b) There will be no make-up exam unless you have valid and official reasons for absence in advance.\n","materials":"Websites\n(a) http://www.ntut.edu.tw/~clhsieh\nThe instructor Chia-Ling Hsieh’s website.\n(b) http://elearning.ntut.edu.tw\nClass announcement.\n(c) http://www.ntut.edu.tw/~wwwmedia/eng\nQuality English learning and testing websites.\n(d) http://www.ntut.edu.tw/~wwwmedia/exam\nOnline registration for free NTUT English Joint Exam consultation.\n(e) http://www.ntut.edu.tw/~wwwmedia/contest\nOnline registration for English speech and reading/writing contests.\n(f) http://www.ntut.edu.tw/~wwwmedia/ept\nOnline registration for free English proficiency test.\n(g) http://www.ntut.edu.tw/~wwwmedia/consult\nOnline registration for free English writing consultation.","foreignLanguageTextbooks":false}]
