[{"name":"賀一平","email":"ipho@ntut.edu.tw","latestUpdate":"2008-09-10 08:45:20","objective":"The purpose of this course is to develop students into better, more mature, confident, competent, enthusiastic, reflective, independent readers. Young adult literature and children's literature are used as major reading materials together with articles dealing with controversial issues. Activities encouraging students to adopt response strategies and transact with texts actively and aesthetically are provided to motivate students to read whole authentic texts and to improve their reading skills, reading strategies, response strategies, and critical thinking skills. These response-centered activities include journal writing, group discussion, individualized independent study, and guided reading. Authentic evaluation tools including journals and portfolios are used to evaluate student performance.\nIssues and topics discussed include: designer babies, cloning,  mercy killing, the death penalty, gay marriage, abortion. The young adult novels used for common readings are: The Giver;Tuck Everlasting; The Lion, the Witch,  and the Wardrobe; A Wrinkle in Time.\n","schedule":"1st week: Orientation\n2nd week: Zodiac sgns\n3rd week: Mercy klling\n4th week: The death penalty\n5th week: Cloning\n6th week: Big brother is watching\n7th week: The Giver (Submitting journal entries on the previous topics)\n8th week: The Giver (Sharing journal entries and engaging in group discussion)\n9th week: Submission of two journal entries on The Giver; Oral test\n10th week: Gays and jobs\n11th week: Gay families\n12th week: Abortion\n13th week: Sex for sale\n14th week: Marriage; divorce\n15th week: Plastic/cosmetic surgery\n16th week: The lion, the witch, and the wardrobe; A wrinkle in time; Tuck everlasting\n17th week: Young adult novel session: Sharing journal entries and engaging in group discussion\n18th week: Oral test; portfolio","scorePolicy":"Evaluation\nDramatics and Oral Presentations and Oral Tests: 45%\nResponse and Reflection Journal Entries and Quizzes:45%\nParticipation and Attendance: 10%\n","materials":"MacAndrew, R., &amp; Matinex, R. (2002). Taboos and issues. Thomson/Heine.\nThe Giver (common reading for all students)\nChoosing one of the following to read as common reading: Tuck Everlasting; The Lion, the Witch,  and the Wardrobe; A Wrinkle in Time","foreignLanguageTextbooks":false}]
