[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2008-09-12 19:42:52","objective":"This course aims to familiarize students with some important texts in English and American literature and culture, including Benjamin Franklin's“The Way to Wealth”(1758), Charles Dickens's“A Struggle,”from Bleak House (1852-1853), and“Slavery,”from American Notes (1842), Henry David Thoreau's“Slavery in Massachusetts” (1854), Edgar Allan Poe's“The Black Cat”(1843), and F. Scott Fitzgerald's The Great Gatsby (1925). A collection of adages and advice,“The Way to Wealth”is an essay written in 1758 and presented in Poor Richard's Almanack, a yearly almanac published by Franklin from 1732 to 1758.“A Struggle”is a satirical caricature of a comic character in Dickens's Bleak House named Mr. Guppy.“Slavery”is a chapter in American Notes, a travelogue detailing Dickens's experience and observation in North America from January to June in 1842. The essay registers Dickens's anti-slavery sentiment.“Slavery in Massachusetts”is an essay based on a speech Henry David Thoreau gave at an anti-slavery rally at Framingham, Massachusetts, on July 4, 1854. Published in the August 19, 1843 edition of The Saturday Evening Post,“The Black Cat”is a short story with psychological depth. The Great Gatsby represents the post-World War I corruption in American society as well as the American dream of the historical period Fitzgerald called The Jazz Age. With these texts, we will address the work ethic, the complexity of some Anglo-American anti-slavery discourses, and the ethical issue of the American dream.","schedule":"Syllabus\n\n09/08  Introduction\n\n09/15  Benjamin Franklin's“The Way to Wealth”\n\n09/22  Charles Dickens's“A Struggle,”from Bleak House\n\n09/29  Charles Dickens's“Slavery,”from American Notes\n\n10/06  Henry David Thoreau's“Slavery in Massachusetts”\n\n10/13  Edgar Allan Poe's“The Black Cat”\n\n10/20  Biographical and Critical Essay on F. Scott Fitzgerald\n\n10/27  F. Scott Fitzgerald's The Great Gatsby (Chapter 1)\n\n11/03  F. Scott Fitzgerald's The Great Gatsby (Chapter 2)\n\n11/10  F. Scott Fitzgerald's The Great Gatsby (Chapter 3)\n\n11/17  F. Scott Fitzgerald's The Great Gatsby (Chapter 4)\n\n11/24  F. Scott Fitzgerald's The Great Gatsby (Chapter 5)\n\n12/01  F. Scott Fitzgerald's The Great Gatsby (Chapter 6)\n\n12/08  F. Scott Fitzgerald's The Great Gatsby (Chapter 7)\n\n12/15  F. Scott Fitzgerald's The Great Gatsby (Chapter 8)\n\n12/22  F. Scott Fitzgerald's The Great Gatsby (Chapter 9)\n\n12/29  Viewing the film version of The Great Gatsby\n\n01/05  Final Exam\n","scorePolicy":"Students are required to read the course materials carefully before attending each class and be ready to engage actively in class discussion. Every week, three or four of the students will each do an oral presentation on the assigned reading material, with each lasting from 12 to 17 minutes. In addition, there will be a final exam. Grading policy: attendance: 20%; oral presentation: 30%; final exam: 50%","materials":"A Collection of Course Materials prepared, edited and revised by Prof. Yu","foreignLanguageTextbooks":false}]
