[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2008-09-22 09:01:41","objective":"Course Description:　　This course is designed for university-level students with intermediate English proficiency level to prepare for the TOEIC (Test of English for International Communication) as well as to facilitate their English communication ability for future career success.  The course is geared to develop students’ listening comprehension skills through a variety of communication situations in TOEIC Listening test.","schedule":"As Scheduled by weeks.","scorePolicy":"Course Requirements &amp; Evaluation:\n　　Students will be evaluated by the following 3 components. \n1)　　Midterm &amp; Final Exams (50%)\n2)　　In-class participation and oral quizzes   (20 %)\n3)　　Attendance     (30%) \nQuizzes &amp; Assignments: 1) Each student will be required no less than ONE short in-class oral quiz based on the instruction materials. Failure to participate in or appropriately respond to questions asked will incur the loss of Grading Component (2) as indicated. \n2) Both midterm and final exams will adopt the TOEIC listening test format, with partial content covered in class sessions. \nAttendance Policy:　　1) Class attendance is mandatory in this class. Each absence will result in a reduction of 10% of the semester grade. After 3 absences, students will lose the entire 30% grade assigned in Grading Component (3) \n　　2) Students all MUST arrive in class by 9:10 A.M. Any late arrival, after 9:20 A.M. will generate a penalty of 5% reduction of the semester grade.  \nExtra Credit Policy:　　1) THREE bonus points will be accrued to semester grades for students who actively participate in class and volunteer for Q&amp;A sessions.\n2) Students who participate in the official TOEIC exam and achieve above 750 (with official test report) can legitimately waive the final exam.\n","materials":"Longman Preparation Series for the New TOEIC Test: Intermediate Listening","foreignLanguageTextbooks":false}]
