[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2008-08-25 18:24:40","objective":"都市計畫是一門新興的學術，它是就特定地區有關都市生活之經濟、交通、衛生、保安、國防、文教、康樂等重要設施作有計畫的發展，並對土地使用作合理的規劃、開發與管制。其內容涵蓋建築物配置、住宅建設、土地使用分區、公共設施與交通路線規劃、開放空間管理與景觀設計、財務籌措與產業發展等。因此，都市計畫是提供一個都市長遠發展的藍圖，在時空上無論從單棟建築的興建乃至新社區、新市鎮的開發、舊市區的更新及各項公共設施的興闢，均須以都市計畫為藍本，所以都市計畫影響環境品質與居民生活福祉甚鉅。\n台灣的都市計畫在觀念、作法、行政體制以及實質發展方向上已經走到了一個轉捩點，不論是政府官員、專業人員、甚至於一般百姓，都深切體會到近年來都市各種問題的日趨嚴重而必須於予檢討變革。睽諸諸如英美先進國家的都市計畫，一般皆以公共利益為依歸，而涉及地理、經濟及公共行政等重要學術領域，也為從事建築、都市計畫、景觀設計、都市設計、土木、環境規劃與管理工作者必修的學科。因此在這關鍵時刻，如何檢討國內現有都市計畫課題，並參採國外已有的制度與經驗，將理論應用在實務工作上，皆必須作有系統的介紹與評論。修讀本課程可使瞭解都市成長、問題、規劃思想、都市政策之發展、規劃體制變革歷程、戰後歐美之規劃歷程經驗、與規劃及規劃過程之理論與應用、國內外都市計畫課題、對策與發展方向。\n","schedule":"（一）都市計畫導論\n1. 課程介紹\n2. 賴宗裕，都市成長與土地開發管理理論與實踐，華泰，八十八年：第一篇緒論（p.1–70）.\n（二）近代都市規劃思潮\n1. 丁致成著，城市多贏策略:都市計畫與公共利益，創興，八十六年：第一章認識都市計畫（p.2–19）.\n2. 張景森，台灣的都市計畫（1895-1988），業強。\n3. American Planning Association, (2006) Planning and Urban Design standards, John Wiley, New Jersey: Part 1- Plan and Planning Making (plan making, types of plans, planning movement ).\n（三） 權利與公平觀點論都市計畫公共干預的本質\n1. 賴宗裕，都市成長與土地開發管理理論與實踐，華泰，八十八年：第一篇緒論、二篇公共利益的基本理念（p.1–90）.\n2. Healey, P., McNamara, P., Elson, M. &amp; Doak, A. (1988) Land Use Planning and the Mediation of Urban Change, Cambridge University Press, Cambridge: Chapter 1-Planning in Practice: an Approach to Analysis; Chapter 2- Policies, Instruments and Institutional Arrangements.\n（四）法制、體系與規劃實施\n1. 楊華同著，都市計畫釋義，黎明。\n2. Peng, Kuang-Hui (2006) The Spatial Planning System in Taiwan”, Complessità e Sostenibilità - Complexity and Sustainability, anno 02, numero 10, text-f0.\n（五） 民眾參與及政策規劃\n1. 自行收集諸多民眾參與於各專業領域之論文。\n2. American Planning Association, (2006) Planning and Urban Design standards, John Wiley, New Jersey: Part 1- Plan and Planning Making (participation).\n（六） 土地使用與規劃許可\n1.彭光輝，(1997,06)，英國開發許可制及開發許可在台灣實施之展望（一）及（二），住都雙月刊，第127期，pp.53-62及第128期，pp.37-63。\n2. 賴宗裕，都市成長與土地開發管理理論與實踐，華泰。\n3. 邊泰明，都市土地開發課徵與協商，華泰。\n4. New York City Department of City Planning, (2006) Zoning Handbook.\n5. Randolph, J. (2004) Environmental Land Use Planning and Management, Island Press, London\n（七）協議與都市開發\n1. 彭光輝，（2003, 9），「以規劃協議規範社區公益之計畫省思」，台灣土地金融季刊，第40卷第3期，pp.33-58。\n2. 邊泰明，都市土地開發課徵與協商，華泰。\n3. 汪明生等，衝突管理，五南。\n4. Peng, K.H. (2002), ”An Anglo-Taiwanese Comparison of Negotiating Development”, Planning Research Conference 2002, 8-10 April 2002, Dundee, UK\n5. Healey, P. et al., (1995) Negotiating for Development, E&amp;FN SPON.\n（八） 都市規劃與環境心理\n1. 危芷芬，環境心理學，五南。\n2. Bell, F. et al, (1996) Environmental Psychology, Harcourt Brace, London.\n（九） 都市規劃與古蹟維護保存\n1. 相關研究報告及論文\n2. Larkham, P. (1996) Conservation and the City, Routledge, London.\n3. Cohen, N., (1999) Urban Conservation, MIT, Massachusetts.\n（十） 都市發展與休閒遊憩規劃\n1. 相關研究報告及論文\n2. Ravenscroft, N., Recreation Planning and Development, Machillan, Reading.\n（十一） 新鎮（社區）開發與管理\n1. 彭光輝，(2000,01)，「新市鎮開發課題與挑戰」，空間，第125/126 期，pp.139-146。\n2. Hall, K.B. et al. (2001) Community by Design, McGraw-Hill.\n（十二）都市更新與再發展\n1. 彭光輝，（2004, 3），「英國都市更新經驗之探討與借鏡」，台灣土地金融季刊，第41卷第1期，pp.21-42。\n2. Brindley, T., Rydin, Y. &amp; Stoker, G. (1989) Remaking Planning: the Politics of Urban Change in the Thatcher Years, Unwin Hyman, London\n3. 中國土木工程水利學會，(2008,6)，「全球化與都市再生」專輯，台北，中國土木工程水利學會，pp25-135\n（十三） 都市環境與防災\n1. 日本東京大學都市易致災地區學術研討會網頁及論文發表 http://csur.t.u-tokyo.ac.jp/vus/vus07/index.html\n2. Coburn, A., Spence, R. (2002) Earthquake Protection, John Wiley, New Jersey.\n（十四）都市發展與都市設計\n1.American Planning Association, (2006) Planning and Urban Design standards, John Wiley, New Jersey.\n2.Punter, (1999) Design Guidelines in American Cities: A Review of Design Policies and Guidance in Five West Coast Cities, Liverpool University Press.\n3.Walters, D., Brown, L. L. (2004) Design First: Design-based Planning for Communities, Architectural Press, London.\n（十五）都市經營管理與行銷\n1.莊翰華，都市行銷理論與實務，建都文化。\n2.施鴻志編著，地區經營管理，建都文化。\n（十六）學生研究報告或閱讀心得報告\n","scorePolicy":"（一）上課互動情形（30%）：閱讀主要的參考文獻、上課聽講、參與課堂討論\n（二）課堂報告（30%）：就各人所選的主題進行文獻閱讀或專題研究，並作一次課堂報告\n（三）學期報告（40%）：依課堂報告內容以及師生所提意見，修撰學期報告完稿\n","materials":"詳見課程進度之單元主題","foreignLanguageTextbooks":false}]
