[{"name":"林峰輝","email":"double@ntu.edu.tw","latestUpdate":"2008-12-15 17:26:58","objective":"本課程在討論生醫工程之性質與應用在整形外科,骨科和牙醫界。課程內容包括生醫工程之發展,牙醫材料之應用,複合材料在生醫工程之應用,生醫陶瓷,生醫材料之腐蝕機制以及生醫材料之工程問題。","schedule":"1.　　The Problem of the Missing Organs\n\nDrugs typically replace or correct a missing function at the molecular scale; by contrast, regeneration templates replace the missing function at the scale of tissue or organ. \n\nAn organ may be lost to injury or may fail in disease: The usual response of the organism is repair, which amounts to contraction and synthesis of scar tissue. Tissues and organs in the adult mammal typically do not regenerate. There are any exceptions, such as epithelian tissue of the skin, gastrointestinal tract, genitals, and cornea, all of which regenerate spontaneously; the liver also shows ability to synthesize substantial organ mass, though without recovery of the original organ shape. There are reports that bone and the elastic ligaments regenerate. \n\nThese exceptions underscore the fact that the loss of an organ by the adult mammal almost invariably is an irreversible process, since the resulting scar tissue largely or totally lacks the structure and function of the missing organ. The most obvious examples involves losses due to injury, such as the loss of a large area of skin following a burn accident or the loss of substantial nerve mass following an automobile accident. However, irreversible loss of function can also occur following disease, although over a lengthy time: Examples are the inflammatory process, and inability of liver tissue to synthesize enzymes due to its progressive replacement by the fibrotic tissue (cirrosis).\n\n\n2. Approaches for Missing Organs\n\n　　Five approaches have been used to solve the problem of the missing organ. \n\n(1)　　Autografting\nIn autografting, a mass of similar or identical tissue from the patient is surgically removed and used to treat the area of loss. The approach can be considered to be spectacularly successful until one considers the long-term cost incurred by the patient. An example is the use of sheet autograft to treat extensive areas of full-thickness skin loss; although the patient incorporates the autograft fully with excellent recovery of function, the “donor” site used to harvest the autograft remains scarred. When the autograft is not available, as is common in cases of burns extending over more than 30% of body surface area, the autograft is meshed in order to make it extensible enough to cover the large wound areas. However, the meshed autograft porvides cover only where the graft tissue provides direct cover; where there is no cover, scar forms, and the result is one of low cosmetic value. \n\n(2)　　Transplantation (Allograft or Xenograft)\nThe donor sites is typically harvested from a donor, cadaver or animals, and the recipient has to cope with the problems of rejection and the risk of transmission of viruses from those donors. \n\n(3)　　Synthesized Tissues\nAnother approach has been based on effort to synthesize tissues in vitro using autologous cells from the paitent; this approach has yielded so far a cultured epidermis (a tissue which regenerates spontaneously provided there is a dermal substrate underneath) about 2-3 weeks after the time when the patient was injuried. In vitro synthesis of the dermis, a tissue which does not regenerate, has not been accomplished so far. \n\n(4)　　Engineered Biomaterials\nPerhaps the most successful approach from the commercial standpoint has been the one in which engineered biomaterials are used; these materials are typically required by their designers to remain intact themselves without interfering with the patient’s physiological functions during the entire lifetime; overwhelming, this requirement is observed in its breach.\n\n(5)　　Analog of the Extracellular Matrix (ECM)\nA fifthe approach is based on the discovery that an analog of ECM induces partial regeneration of the dermis, rather than of scar, in full-thickness skin wound in adult mammals where it is well known that no regeneration occurs spontaneously. This fifth approach of solving the problem of organ loss and in situ regeneration.\n\n\n3. Conclusion\n\n　　Efforts to induce rege","scorePolicy":"　","materials":"Textbook:\n\nBiomaterials Science:\nAn Introduction to Materials in Medicine\n\nEdited by\nBuddy D. Ratner and Allan S. Hoffman\nFrederick J. Schoen\nJack E. Lemons\n\n2005\nAcademic Press Inc.,\n525 B Street, Suite 1900, San Diego, \nCalifornia 92101-4495, USA\nhttp://www.apnet.com\n\n","foreignLanguageTextbooks":false}]
