[{"name":"Hannes Ber","email":"hbergtlr@ntut.edu.tw","latestUpdate":"2008-10-09 12:08:11","objective":"德國哲學家Wilhelm Schapp曾說過:「我們人類永遠糾纏在各種故事中」。我們就在這些糾結中建立了各種觀念：對與錯、成功與失敗、真實與虛假。其實這些指引我們人生的故事就具備了敘事的結構。人們彼此訴說故事，不但是以此為樂，更重要的是藉著敘事得以在社群中取得一席發聲之地，進而在更廣大的脈絡中為自己的社群找到定位。\n敘事的特質就是流動迅速，這也就成了說故事最基本的特點。雖然詩或小說的語意在轉譯成不同文化或媒介時，很容易失落，但是它們內在的敘事模式顯然比較固定恆久，而且無關乎這些詩或小說是事實或是虛構。但是敘事模式究竟有些什麼不變的元素? 例如電影「麻雀變鳳凰」或是黛安娜王妃的傳記，其中的基本敘事模式是否就是灰姑娘的翻版?\n本課程將探討敘事學的基本策略，教導學生以此作為分析故事的基本工具 (Barthes, Chatman, Genette, Herman);同時也要介紹相關的理論，討論敘事在人類經驗中的重要性 (Bruner, Ricoeur)。最後我們會將閱讀所得到的啟發和觀點，應用詮釋各式各樣的媒體敘事，包括小說、新聞報導、電影、畫片和圖像小說。","schedule":"Dr. Hannes Bergthaller                                                                               email: hbergtlr@ntut.edu.tw\n\n117728 NARRATIVE ACROSS THE MEDIA\nWednesday 9-12 AM, Fall 2008/09\n\nCOURSE OUTLINE\n1　　10/09　　Introduction\n2　　17/09　　J. Hillis Miller, “Narrative”; Roland Barthes, “Introduction to the Structural Analysis of Language”\n3　　24/09　　Marie-Laure Ryan, “Narrative Across Media: Introduction”\n4　　01/10　　Walter J. Ong, chapters from Orality and Literacy \n5　　08/10　　David Herman, “Towards a Transmedial Narratology”; Wendy Steiner, “Pictorial Narrativity”\n6　　15/10　　Patrick O’Neill, chapters from Fictions of Discourse\n7　　22/10　　Reading Week, discussion of term paper projects\n8　　29/10　　Presentations\n9　　05/11　　David Bordwell, “Neo-Structuralist Narratology and the Functions of Filmic Storytelling”; Manfred Jahn, “A Guide to Narratological Film Analysis”; Roland Barthes, “The Reality Effect”\n10　　12/11　　Paul Ricoeur, “Mimesis and Representation,” “The Function of Fiction in Shaping Reality;” Jerome Bruner, “The Narrative Construction of Reality”\n11　　19/11　　Hayden White, “The Value of Narrativity in the Representation of Reality”; “”The Question of Narrative in Contemporary Historical Theory” (in: The Content of the Form)\n12　　26/11　　Presentations\n13　　03/12　　Walter Lippman, chapters from Public Opinion; Frederick Bartlett, chapters from Remembering\n14　　10/12　　Manfred Jahn, “Frames, Preferences, and the Reading of Third-Person Narratives: Towards a Cognitive Narratology;” David Herman, “Scripts, Sequences, and Stories: Elements of a Postclassical Narratology”\n15　　17/12　　Marvin Minsky, “A Framework for Representing Knowledge”\n16　　24/12　　Espen Aarseth, “Quest Games as Post-Narrative Discourse”\n17　　31/12　　Presentations\n18　　07/01　　Paper Due\nEach presentation will count for 10%, in-class participation for 20%, and the term paper for 50% of the final grade.\n\n","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
