[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2008-09-22 09:03:31","objective":"Course Description: The course aims to develop graduate students’ scholarly strength in in-depth analysis to prepare for research in their respective disciplines. By centering its focus on critical, analytical and research-oriented development through lectures and discussions of scholarly studies, this course will thus require students to participate in lectures arranged by the Graduate Institute as well as other accredited conferences held in Taiwan and overseas.","schedule":"Class Session Schedule \n\nWeek / Date　　Session Task 　　Administered by　　Note \nW1 　　Orientation 　　Dr. Yang　　\nW3　　Special Topic 　　TBD 　　\nW5　　Paper Presentation 　　M.A. Student 　　2 presentations\nW7　　Paper Presentation 　　M.A. Student 　　2 presentations\nW10　　Paper Presentation 　　M.A. Student 　　2 presentations\nW12　　Paper Presentation 　　M.A. Student 　　2 presentations\nW14　　Paper Presentation 　　M.A. Student 　　2 presentations\nW16　　Paper Presentation 　　M.A. Student 　　2 presentations\nW18　　Paper Presentation 　　M.A. Student 　　2 presentations\n","scorePolicy":"Course requirements &amp; Assignments: 　　\n(1) Each student is required to present no less than ONE scholarly paper of studies in class.  Papers and research studies to be presented must hold high scholarly value. Approximately thirty to forty minutes will be allotted for each paper presentation, and ten to twenty minutes for Q &amp; A.\n　　(2) All paper presentation titles will be reviewed and approved by the professors in the Graduate Institute. Students must seek professor’s approval two weeks prior to the scheduled presentation date. Full-length text of the paper presented must be submitted to the course instructor with the signed approval sheet. \n(3) Students participating in in-class paper presentation, EXCEPT the current presenter, are all obligated to write a short reflective paper regarding the presentation. The current paper presenter is required to write a short critique regarding the paper. All papers are due in the next class meeting. \n　　(4) Class will meet every other week for 8 times in the fall semester. All sessions will start from 1:10 to 3:00 P.M. on Thursday afternoon. Each class meeting will allow two paper presentations.\n(5) During the 2008 Fall Semester, all M.A. students must attend a minimum of six hours of participation in conferences of their respective scholarly fields. Certificate of participation issued by the hosting institute will be required for submission along with student’s reflective paper.\nGrading Policy\nDiscussion / Presentation Sessions 　　30%　　As scheduled \nReflective papers 　　30%　　Fourteen in total \nPaper Critique  　　10%　　\nAttendance 　　20%　　10% reduction for each unexcused absence\nConference Participation 　　10%　　Certificate and reflective paper \nSemester Grade 　　100%　　\n\n","materials":"N/A","foreignLanguageTextbooks":false}]
