[{"name":"吳忠敏","email":"cmwu@ntut.edu.tw","latestUpdate":"2008-09-18 19:23:52","objective":"本課程的重點在於闡述應用統計學之基本概念，主要的內容涵蓋三個領域：敘述統計、機率理論與推論統計，其中包含資料蒐集與描述、機率論、抽樣方法與抽樣分配、假設檢定、變異數分析、迴歸與相關分析。\nThe purpose of this course is to give students an introductory of statistical thinking, methods development and the assessment of credibility and value of inferences made from data. A conceptual introduction to the field of statistics and its many applications with extensive coverage of data collection and analysis as needed to evaluate the reported results of statistical students and make a good decision will be included as well. The purpose of Statistics and its application is to give an introduction of descriptive statistics, probability, and inductive statistics. They include data collection and description, probability, sampling methods and sampling distribution, hypothesis testing, ANOVA, regression and correlation analysis. The statistical software introduction will also be introduced in the class.","schedule":"日   期　　          進     度　　備  註\n9月8日9月14日　　Introduction　　\n9月15日9月21日　　Chapter 1　　\n9月22日9月28日　　Chapter 2　　\n9月29日10月5日　　Chapter 3　　\n10月6日10月12日　　Chapter 4　　\n10月13日10月19日　　Chapter 5　　\n10月20日10月26日　　Chapter 6　　\n10月27日11月2日　　Chapter 7　　\n11月3日11月9日　　90 min Examination (25%)　　\n11月10日11月16日　　Chapter 8　　\n11月17日11月23日　　Chapter 8　　\n11月24日11月30日　　Chapter 9　　\n12月1日12月7日　　Chapter 9　　\n12月8日12月14日　　Chapter 10　　\n12月15日12月21日　　Chapter 10　　\n12月22日12月28日　　Chapter 11　　\n12月29日1月4日　　Chapter 11　　\n1月5日1月11日　　90 min Final Examination (25%)　　\n","scorePolicy":"For this course, total score is one hundred points (100%). Middle term Examination worth twenty-five points (25%) and Final Examination worth twenty-five points (25%). Homework worth forty points (50%). Homework assignment is odd number questions for each section and the answer is in the back of the textbook start from page A51 to A99.\nThe following is the required number of homework assignment for each section of every chapter you have to turn in order to get the points. The deadline to turn the homework assignment is two weeks after I finish that chapter.\n1.1　　6 題　　1.2　　3題　　1.3　　6題\n2.1　　6題　　2.2　　5題　　2.3　　7題\n2.4　　6題　　2.5　　7題　　　　\n3.1　　6題　　3.2　　4題　　3.3　　4題\n3.4　　5題　　　　　　　　\n4.1　　5題　　4.2　　4題　　　　\n5.1　　5題　　5.2　　4題　　5.3　　3題\n5.4　　5題　　　　　　　　\n6.1　　6題　　6.2　　3題　　6.3 　　4題\n7.1　　7題　　7.2　　6題　　7.3　　4題\n7.4　　3題　　7.5　　3題　　　　\n8.1　　6題　　8.2　　6題　　8.3　　3題\n8.4　　4題　　　　　　　　\n9.1　　5題　　9.2　　8題　　9.3　　5題\n9.4　　1題　　　　　　　　\n10.1　　3題　　10.2　　5題　　10.3　　3題\n10.4　　3題　　　　　　　　\n11.1　　3題　　11.2　　2題　　11.3　　1題\n11.4　　2題　　11.5　　3題　　　　\n","materials":"”Elementary Statistics – Picturing the World,” Fourth Edition, Ron Larson and Betsy Farber, 2009, 全華圖書\n請上課前先預習\n請尊重智慧財產權請用正版書籍","foreignLanguageTextbooks":false}]
