[{"name":"陳建丞","email":"ccchen@ntut.edu.tw","latestUpdate":"2008-09-11 09:19:52","objective":"本課程介紹諸多有關職場情緒研究的議題。明確地說，本課程主要焦點在探討員工在工作中的情感，如何影響到他們的工作態度，並進而影響他們的行為與績效表現。此外，本課程也將討論一些有關組織研究方法的議題。","schedule":"9/8     課程簡介與學期報告格式介紹\n9/15     情感在職場中的重要性\nBarsade, S. G., &amp; Gibson, D. E. (2007). Why does affect matter in organizations?. Academy of Management Perspectives, 21, 36-59.\n9/22     情感與工作績效\nStaw, B. M., Sutton, R. I., &amp; Pelled, L. H. (1994). Employee positive emotion and favorable outcomes at the workplace. Organization Science, 5, 51-71.\n9/29     情感與利他行為\nGeorge, J. M. (1991). State or trait: Effects of positive mood on prosocial behaviors at work. Journal of Applied Psychology, 76, 299-307.\n10/6     情感與退縮行為\nPelled, L. H., &amp; Xin, K. R. (1999). Down and out: An investigation of the relationship between mood and employee withdrawal behavior. Journal of Management, 25, 875-895.\n10/13    情感與偏差行為\nJudge, T. A., Scott, B. A., &amp; Ilies, R. (2006). Hostility, job attitudes, and workplace deviance: Test a multilevel model. Journal of Applied Psychology, 91, 126-138.\n10/20    情感與創造力\nGeorge, J. M., &amp; Zhou, J. (2007). Dual tuning in a supportive context: Joint contributions of positive mood, negative mood, and supervisory behaviors to employee creativity. Academy of Management Journal, 50, 605-622.\n10/27    員工情緒表達：情緒感染的機制\nBarger, P. B., &amp; Grandey, A. A. (2006). Service with a smile and encounter satisfaction: Emotional contagion and appraisal mechanisms. Academy of Management Journal, 49, 1229-1238.\n11/3     員工情緒表達：表達的真誠度\nGrandey, A. A., Fisk, G. M., Mattila, A. S., Jansen, K. J., &amp; Sideman, L. A. (2005). Is “service with a smile” enough? Authenticity of positive displays during service encounters. Organizational Behavior and Human Decision Processes, 96, 38-55.\n11/10    情緒勞務與員工健康\nGrandey, A. A. (2003). When “the show must go on”: Surface acting and deep acting as determinants of emotional exhaustion and peer-rated service delivery. Academy of Management Journal, 46, 89-96.\n11/17    情緒智商\nCarmeli, A., &amp; Josman, Z. E. (2006). The relationship among emotional intelligence, task performance, and organizational citizenship behaviors. Human Performance, 19, 403-419.\n11/24    團隊情感氛圍\nGeorge, J. M. (1990). Personality, affect, and behavior in groups. Journal of Applied Psychology, 75, 107-116.\n12/1     團隊情感的異質性\nBarsade, S.G., Ward, A.J., Turner, J.D. &amp; Sonnenfeld, J.A. (2000). To your heart’s content: A model of affect diversity in top management teams”. Administrative Science Quarterly, 45, 802-836.\n12/8     主管情感與領導效能\nBono, J. E., &amp; Ilies, R. (2006). Charisma, positive emotions, and mood contagion. The Leadership Quarterly, 17, 317-334.\n12/15    主管情感與團隊運作\nSy, T., Côté, S., &amp; Saavedra, R. (2005). The contagious leader: Impact of the leader’s mood on the mood of group members, group affective tone, and group processes. Journal of Applied Psychology, 90, 295-305.\n12/22    情感與人力資源管理\nFox, S., &amp; Spector, P. E. (2000). Relations of emotional intelligence, practical intelligence, general intelligence, and trait affectivity with interview outcomes: It’s not all just ‘G”. Journal of Organizational Behavior, 21, 203-220.\n12/29    期末報告問題討論 (或期末報告)\n1/5      期末報告\n","scorePolicy":"授課方式與課程要求：\n上課方式以同學報告、帶領討論為主，老師講授為輔。導讀時，請先以20分鐘介紹這篇文章，然後以事先準備的三個議題，來與現場同學作討論。每位同學的發言都列入評分，請勿保持緘默。\n每位同學必須在上課前閱讀完所有指定的教材。\n每位同學必須繳交一份期末研究報告，須打字，內文字體以12pt為限，1.5倍行高，頁數至少15頁。有兩種報告格式，同學任選一種，詳細內容如下：\n\n文獻探討報告：先選定職場情緒課程的某一重要領域(例如工作心情、情緒智商或情緒勞務等)，而後以你的主題為基礎，收集報章、雜誌(實務或學術期刊均可)或網路文章等，並將所有你找到的文獻，整理成一份報告。內容須包括：(1)前言：介紹你要探討的主題，至少一頁；(2)文獻探討：每位同學由報章雜誌或網路上，至少找到10篇以上的文章。格式部份，每篇文章起頭需介紹該文獻的作者、出處與日期，然後接上文章內文，文章下方寫上你對該文章的心得或看法(至少100字)；(3)結論與建議。將所有你找到的文章，用一個架構圖呈現出來，然後寫至少一頁的總結，以及至少一頁的實務建議。\n\n研究計畫書(博士班同學必選)：報告內容類似一份論文的前三章，主題必須與職場情緒有關。內容須包括：(1)緒論；(2)文獻探討；(3)研究方法(包括研究架構與假說、研究對象、研究程序、變數測量與統計方法等) (4)參考文獻與附錄(問卷)。\n在1/2 (五)上午9點之前，必須將書面報告印出並交給老師與負責評論你報告的同學。1/5(一)口頭報告時，每位同學必須做20分鐘的口頭報告，之後再由負責評論你報告的同學，對你的報告做5分鐘的評論。\n\n成績評量：\n課堂導讀                                     20%\n期末報告                                     60%\n課堂參與(提問題、參與討論與出席狀況等)        20%\n","materials":"教學材料：十幾篇英文期刊文章","foreignLanguageTextbooks":false}]
