[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2019-01-08 13:39:05","objective":"This course is an introduction to statistical computing and will be taught in R. R is widely used not only in engineering, but also in sciences, medicine, biology, physics, and business. It is assumed students have exposure to basic statistics and knowledge of calculus (i.e., differential and integral calculus). The main focus of the class will be on statistical programming, graphics, and elementary optimization in R. Students will cover various statistical methods such as estimation, hypothesis test, ANOVA, regression analysis, design of experiments, and statistical process control.","schedule":"Week 1　　Introduction to probability distribution, sampling distribution, and estimation\nWeek 2　　Decision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\nWeek 3　　Decision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\nWeek 4　　Decision making for two samples – Inference on the means of two populations, paired t-test\nWeek 5　　Decision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\nWeek 6　　Simple linear regression\nWeek 7　　Multiple linear regression\nWeek 8　　Other aspects of regression\nWeek 9　　Midterm exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 10　　Factorial design, replication, center points\nWeek 11　　Blocking, confounding, fractional factorial designs\nWeek 12　　Response surface methods and designs\nWeek 13　　Factorial experiments with more than two levels\nWeek 14　　Introduction to control charts\nWeek 15　　X-bar and R control chart\nWeek 16　　Control charts for individual measurements, process capability, control chart performance\nWeek 17　　Attributes control charts, measurement systems capability\nWeek 18　　Final exam (In-Class, 1 Cheat sheet, Calculator)\nNot covers all parts of the course, but covers only what has been discussed after the second midterm.","scorePolicy":"1. Midterm exam: 30 points – Test of covered topics\n2. Final exam: 35 points – Test of covered topics\n(Exam: The days and general contents of each of the two exams will be announced at least one week prior to the exams. The schedules of exams are given in tentative course schedule table. If you have an emergency or conflict, please notify me ASAP. Also, all works must be shown to receive full or partial credit. A missed exam will be assigned a grade of zero, unless a student has a university-approved excuse)\n3. Quiz: 30 points\n(Quizzes: Short, announced or non-announced in-class quizzes will be given at the beginning of some classes, to check your basic understanding of class material. No makeup quizzes will be given.)\n4. Attendance: 5 points\n(Attendance: You are expected to be present each class period except when special hardships occur, e.g. illness or emergency. For any medical issues please see the NTUT website for university policies. If there is an appropriate reason to miss class it is expected that the individual will email or discuss in person with the instructor at least one week in advance. And, students need to provide evidence for missing class (doctor’s note). If evidence is provided, the missed class is considered as an excused class. If no evidence is provided, the missed class is counted as an absence. Regular attendance is essential to the successful completion of this course and missing class can cause you to fall behind, which you definitely do not want to. If you miss a class, be sure to get the notes from another student and kindly provide me with an explanation for your absence. Attendance and class participation also affect your learning of the material as well as performance on assignments, quizzes, and exams. I expect you to arrive to class on time, pay close attention and take notes, and actively participate. An important part of class participation is asking questions if you are unsure about anything. Do not hesitate to ask me questions if you have them. I reserve the right to lower your course grade by half a letter grade (5%) if you have more than 3 absences. More than 5 absences will mean an attendance point zero.)","materials":"Engineering Statistics (3rd Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)","foreignLanguageTextbooks":true}]
