[{"name":"楊勝明","email":"smyang@ntut.edu.tw","latestUpdate":"2019-02-21 09:27:48","objective":"The objectives of this course is to learn practical control schemes and controller design methods for DC and AC electric machines through simulations. Matlab/Simulink software is used as the simulation tools. The first half of the class focuses on the DC machine controls. Controller design, estimator, digital control, pulse width modulation (PWM), and various other topics are studied with simulations. In the second half of the class, permanent magnetic synchronous machines (PMSM) is the main subject studied. Main topics include: controller design, PWM methods, position and velocity estimation with back-EMF, and shaft sensorless control.","schedule":"1. Introduction of Matlab/Simulink, DC Motor model, current control (lab1)\n2. No class\n3. Current control loop tuning, time response, frequency response, and bandwidth (lab2)\n4. Velocity and position control loop tuning, alternative position control strategies (lab3)\n5. Digital position control with analog current controller (lab4)\n6. Digital position and current control, single-phase PWM (lab5)\n7. No class\n8. Digital motor velocity estimator, digital control with estimated velocity (lab6)\n9. Mid-term exam.\n10. Digital disturbance torque estimator and torque rejection (lab7)\n11. IPM-PMSM motor model and V/H control (lab8)\n12. PMSM current and velocity control (lab9)\n13. Three-phase DC-AC Inverter with SPWM (lab10)\n14. Space Voltage Vector PWM, DC link current (lab11)\n15. Velocity and position estimation with extended back-EMF (lab12)\n16. No class\n17. Sensorless velocity control with extended back-EMF (lab13)\n18. Final exam.","scorePolicy":"Lab: 50% (For each Lab, Completion 30%, Lab. Report 20%)\nMid-term exam: 20%\nFinal exam: 30%","materials":"1.Control System Design Guide, 3th Editions, George Ellis, Elsevier-Academic Press.\n2.Observers in Control Systems, George Ellis, Elsevier-Academic Press.\n3.Permanent Magnet Synchronous and Brushless DC Motor Drives, Ramu Krishnan, CRC Press 2010.\n4.控制系統設計與模擬-使用Matlab/Simulink, 李宜達, 全華圖書, 2011.","foreignLanguageTextbooks":true}]
