[{"name":"陳維昌","email":"wcchen@ntut.edu.tw","latestUpdate":"2018-12-20 14:35:43","objective":"Orthogonal frequency division multiplexing (OFDM) and multiple-input multiple-output (MIMO) techniques are popular transmission techniques for wireless and mobile communications, because they offer several advantages such as increasing transmission data rate and enhancing error performance. In the class, we will learn about the basic principles and some advanced topics of OFDM and MIMO. All students taking this class have to study a special topic on OFDM or MIMO as a final project. Some parts of this course will be offered in English.","schedule":"Week 01. Review of communication systems\nWeek 02. Adjusted holiday\nWeek 03. Reviews of probability and random process theories\nWeek 04. Review of detection theory\nWeek 05. Review of estimation theory\nWeek 06. OFDM: Orthogonality and efficient implementation by using IFFT/FFT\nWeek 07. Qingming Festival\nWeek 08. OFDM: Equivalent discrete-time multipath channel model and equalization for CP-OFDM\nWeek 09. Midterm Exam \nWeek 10. OFDM: Equalization for CP-OFDM and ZP-OFDM\nWeek 11. OFDM: SC-FDE, DFT-S-OFDM, OFDMA and power allocation problem\nWeek 12. OFDM: PAPR problem and PAPR reduction techniques\nWeek 13. OFDM: Large OOB emission problem and OOB emission reduction techniques\nWeek 14. MIMO: Spatial multiplexing and spatial modulation\nWeek 15. MIMO: Spatial diversity\nWeek 16. Duanwu Festival\nWeek 17. Final Exam\nWeek 18. Student Oral Presentation\n\nThe schedule may be adjusted if necessary.","scorePolicy":"Midterm Exam         30%\nFinal Exam           30%\nSpecial Topic Report 40% (20% for Oral Presentation and 20% for Paper Report)","materials":"References:\n1. Y.-P. Lin, S.-M. Phoong, P. P. Vaidyanathan, Filter Bank Transceivers for OFDM and DMT Systems, Cambridge University Press, 2010. \n2. T. D. Chiueh, P. Y. Tsai, and I. W. Lai, Baseband Receiver Design for Wireless MIMO-OFDM Communications, 2nd ed., Wiley Inc., 2012.\n3. D. Tse and P. Viswanath, Fundamentals of Wireless Communication, Cambridge university press, 2005.","foreignLanguageTextbooks":false}]
