[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2018-12-24 00:58:24","objective":"The purpose of this course is, first, to clarify key concepts in the understanding and interpretation of literary/cultural texts, and secondly, to demonstrate the ways in which important steps and maneuvors should be undertaken in order to compose a piece of promising academic writing.","schedule":"I.　　Syllabus\n1.Week One: MLA style for academic writing\n2. Week Two: Introduction to keywords: plot development, rising action, conflict, (anti)climax, a turning point, etc.\nThe 1st task: Three-act structure \n3.　　Week Three: Setup, conflict, and resolution\n4.　　Week Four: Departure, adventure, and return\nThe 2nd task: Forms of narrative\n5. Week Five: linear, nonlinear, and interactive\n6. Week Six: foreshadow, flashback, and warped time/space \n The 3rd task: Modes of narration\n7. Week Seven: the first, second, and third person point of view\n8. Week Eight: omnipresent and limited point of view \nThe 4th task: Writing on great themes of life\n9. Week Nine (Midterm exam week): love, war, and death\nThe 5th task: Analyzing the narrator and main character\n10. Week Ten: reliable and unreliable narrators\n11. Week Eleven: tragic flaw, inner conflict, psyche, double\n12. Week Twelve: Wrapping-up of Tasks 1-5\nThe 6th task: Interpreting Culture and ideology\n13. Week Thirteen: Dominant, recondite, and residual culture; cultural text and cultural practice; cultural hegemony; colonization\n14. Week Fourteen: class, race, gender, ethnicity, colonization, and ecological awareness\nThe 7th task: Writing on different genres of literature\n15. Week Fifteen: novel and prose\n16. Week Sixteen: poetry and drama\nThe 8th task: Writing on arts and multi-media texts\n17. Week Seventeen: painting and sculpture\n18. Week Eighteen: TV drama and film","scorePolicy":"II.　　Percentile distribution of final grades\n1.　　Writing assignments: 4% X 15 = 60%\n2.　　Participation in classroom discussion and attendance: 40%","materials":"III. Reference books\n(1)A Glossary of Literary Terms by M.H.Abrams\n(2)Critical Terms for Literary Study eds. byFrank Lentricchia and Thomas McLaughlin\n(3)The Literature Student's Survival Kit by Ian Littlewood","foreignLanguageTextbooks":true}]
