[{"name":"范書愷","email":"morrisfan@ntut.edu.tw","latestUpdate":"2019-01-04 13:58:24","objective":"Analyzing time-oriented data and forecasting future values of a time series are among the most important problems that analysts face in many fields, ranging from finance and economics to managing production operations, to the analysis of political and social policy sessions, to investigating the impact of humans and the policy decisions that they make on the environment. This course is specially designed for graduate students who are focused on a few specific forecasting techniques. This course will address time series modeling, regression analysis, exponential smoothing methods, autoregressive integrated moving average models, transfer functions and intervention models, and other related forecasting topics.","schedule":"1　　Process monitoring (SPC) vs. process control (EPC/APC)　　Chapter 1\n2　　Process monitoring (SPC) vs. process control (EPC/APC); 　　Chapter 1 and Chapter 2\n3　　ARIMA (Box-Jenkins) time series models　　Chapter 3\n4　　ARIMA (Box-Jenkins) time series models　　Chapter 3\n5　　ARIMA (Box-Jenkins) time series models　　Chapter 3\n6　　ARIMA (Box-Jenkins) time series models　　Chapter 3\n7　　Transfer function (TF, input/output) models　　Chapter 4\n8　　Transfer function (TF, input/output) models　　Chapter 4\n9　　Midterm Exam　　in class\n10　　Review of Midterm Exam　　\n11　　Optimal stochastic controller design　　Chapter 5\n12　　Optimal stochastic controller design　　Chapter 5\n13　　EWMA controllers and the run-to-run (R2R) control problem　　Chapter 7\n14　　EWMA controllers and the run-to-run (R2R) control problem　　Chapter 7\n15　　Recursive estimation &amp; self-tuning (ST) quality control　　Chapter 8\n16　　Recursive estimation &amp; self-tuning (ST) quality control　　Chapter 8\n17　　Term Project Presentations 　　in class","scorePolicy":"Grading Policy: Homework (30%), Term Project (60%) due in part throughout the semester, participation (10%). \nA set of journal papers &amp; class notes might be provided. We will also make use of the SAS, EXCEL, Matlab, and Minitab software packages. Additional book references can be accessed at the University Library.","materials":"Textbook &amp; References\n\n[Textbook] \n\nE. del Castillo, Statistical Process Adjustment for Quality Control, John Wiley, 2002.\n\n[References]\n\n(1)　　Box, G. E. P., Jenkins, G. M., and Reinsel, G. C., Time Series Analysis, Forecasting, and Control, 4th ed., 2008. \n(2)　　Montgomery, D. C., Forecasting &amp; Time Series Analysis, 2nd ed., 1990.\n(3)　　Box, G. E. P., and Luceo, A., Statistical Control by Monitoring and Feedback Adjustment, 1997.","foreignLanguageTextbooks":true}]
