[{"name":"陳生明","email":"smchen@ntut.edu.tw","latestUpdate":"2018-12-12 14:49:01","objective":"Course Description: This course is designed to provide graduate students an advanced materials synthesis, understand different synthetic technique and analytical application to promote success in their graduate carriers. Core concepts will be presented by both students and course instructor via presentations, discussions and with real time experiments. The curriculum will be wide in scope incorporating aspects of trouble shooting, experimental result discussion, chemical measurements, modern analytical instrumentation, and determination of chemical structure via analytical techniques. Special emphasis will be put on the appropriate preparation, and meaningful presentation, of scientific results. The student is expected to dedicate significant effort both in and out of lectures to be successful.\n\nObjectives:\nSpecific goals for the course include the student learning:\n1) To understanding the innovative materials for wider application\n2) To improve the synthetic technique to find attractive materials\n3) To discuss properties and mechanism of the innovated materials\n4) To apply the advanced materials for current scientific challenges\nTexts and Materials: Available in lab, you can read at any time in lab \n\nSyllabus for the whole semester\nUnit-1\nGraphene – methodology for the novel synthesis – Graphene Oxide and different nanostructures such as nanosheets – mono and multiple layer – nanoribbon - nanobelt – 2D and 3D graphene.\nUnit-2\nInorganic Graphene – inorganic graphene-like materials such as, MoS2, WS2, BN – electronic properties- magnetic electronic sensing and energy storage devices.\nUnit-3\nFullerene and carbon nanotube – fullerene-based and carbon nanotube-based materials for advance technologies - carbon-based materials as interrelated prototypes for zero-dimensional quantum dots and one-dimensional quantum wires - electrical and mechanical properties – practical application. \n\n\nUnit-4\nConducting Polymers – polyaniline - polyvinylpirrolidone - polypyrrole - different polymer composites with metal, metal oxides and various carbon materials – synthesis of co-polymer- Phthalocyanines and porphyrins \n Unit-5\nActivated Carbon from biowastes\nBiomass derived Activated carbon (AC) - comparison with commercial activated carbon, graphene and CNT – various properties, preparation and characterization - preparation of different metal/metal oxide nanocomposites for various applications, such as electrochemical sensor, biosensors and Energy storage devices.\nUnit-6\nCarbon Fiber Composites – composites of carbon fiber - method of production, physical characteristics fabrication - properties of thermal and electrical conductivity - applications for engineered plastics.\nUnit-7\nAdvanced Carbon Electrode Materials for Molecular Electrochemistry:\nIntroduction and scope - materials chemistry of carbon electrodes - electrochemical properties of carbon materials - carbon surface modication - thermal and photochemical modications - amine and carboxylate oxidation.\nUnit-8\nActivated Carbon for Automotive Applications - two principal sources - vehicle exhaust emissions, and fuel system evaporative emissions - activated carbon technology focuses on the control of evaporative emissions - methane adsorption properties of high surface activated carbon  \nUnit-9\nCore–shell semiconductor nanocrystal - Classification of core–shell semiconductor nanocrystals - Doped Core Shell Semiconductor Nanocrystals-metal/metal oxides, bimetallic, tri metallic and polymer core-shell – synthesis, characterization, applications; biomedical, optics, LED, etc.,\nUnit-10\nQuantum Dots - semiconductor materials – colloidal synthesis – electrochemical assembly – cadmium based quantum dots; CdSe – graphene quantum dots – optical properties – application; photovoltaic, LED, photodetector devices. \nUnit-11\nAdvanced Materials and Novel Structured Metallic and Inorganic Materials – hybrid structure of metal oxides and metal nanoparticles","schedule":"Unit-1\nGraphene \nUnit-2\nInorganic Graphene\nUnit-3\nFullerene and carbon nanotube \nUnit-4\nConducting Polymers  Unit-5\nActivated Carbon from biowastes\nUnit-6\nCarbon Fiber Composites \nUnit-7\nAdvanced Carbon Electrode Materials for Molecular Electrochemistry:\nUnit-8\nActivated Carbon for Automotive Applications  \nUnit-9\nCore–shell semiconductor nanocrystal \nUnit-10\nQuantum Dots \nUnit-11\nAdvanced Materials and Novel Structured Metallic and Inorganic Materials \nUnit-12\nPhthalocyanines and porphyrins as materials for advanced technologies \nUnit-13\nGraphene and 2D Materials\nUnit-14\nnanomaterials electrochemistry\nUnit-15\nNanobiotechnology\nUnit-16\n2D Nanomaterials for Advanced Bioelectrochemistry","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":true}]
