[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2018-12-13 16:41:04","objective":"This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of interaction design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the profession of interaction design. Therefore, one of the aims of this course is to construct multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate on an interactive media design project. It may execute interaction design by working with the form of the case study or design creation.","schedule":"Design studio helps to develop student’s research abilities to identify problems, envision current and future needs, and provide validated solutions to these problems and needs through interaction design.\n\nWeek 01-03  Introduction\nWeek 04-09  Problem 1\nWeek 10-18  Problem 2","scorePolicy":"Participation &amp; Final Project","materials":"Kim Erwin, Communicating the New, Methods to Shape and Accelerate Innovation, John Wiley and Sons, Inc. 2014","foreignLanguageTextbooks":true},{"name":"吳可久","email":"kochiuwu@ntut.edu.tw","latestUpdate":"2018-12-10 19:05:06","objective":"Interaction design is \"the practice of designing interactive digital products, environments, systems, and services.” (Cooper, Alan; Reimann, Robert; Cronin, Dave (2007). About Face 3: The Essentials of Interaction Design. Indianapolis, Indiana: Wiley. p. 610.) In other words, it is to use digital technologies to create new ways of “interaction” to make a better living for human. As a result, a successful first step of interaction design lies on how to identify the new needs of interaction and then follow by how to design those interactions.\nThis studio project is therefore divided into two phases by asking interacting “what”? and then “how” to interact. You will be asked to develop a problem proposal that illustrates the new behavioral pattern from your study by the midterm; and propose a solution with techniques of interaction design of your choice to conclude this term project.","schedule":"Pattern Language: A Pattern Language is a classic book authored by Christopher Alexander, published in 1977. It details 253 different human behavioral patterns relate to different scales of built environment along with a design suggestion to accommodate those observed patterns. In this explorational phase, we will go out to examine whether if those observed patterns remain unchanged 30 years later, and what are the new emerged patterns that require design attention?\n\nThe Design of Everyday Things: Donald Norman introduces user-centered design in this book, he applied the concept of affordance proposed by J.J Gibson into the field of design. You are encouraged to read this book and understand the essence of user-centered design to help to frame the design solution for the problem you identified through human pattern studies.\n\nWeek 01 Introduction\nWeek04 Pattern Language Field trip\nWeek05 Service Design &amp; Interactive Technologies\nWeek06 HCI\nWeek09 Midterm Review\nWeek18 Show &amp; Tell","scorePolicy":"Interaction Design:\nThere are many emerging design fields relates to interaction design, such as UI, UX, Service Design, Tangible Interaction, AR, VR, Smart Environment and so on so forth. Different field of design requires different digital techniques and have different range of influence on human behavior of groups with different scales. To conclude this studio, you are expected to develop a working prototype to provide the interaction for the new pattern you proposed.","materials":"Alexander, Christopher, Sara Ishikawa, Murray Silverstein, Max Jacobson, Ingrid Fiksdahl-King, and Shlomo Angel (1977). “A Pattern Language: Towns, Buildings, Construction”. New York: Oxford University Press, 1977.\nNorman, Donald (1988). \"Preface to the 2002 Edition\". The Design of Everyday Things. New York: Basic Books.","foreignLanguageTextbooks":false},{"name":"李來春","email":"f10666@ntut.edu.tw","latestUpdate":"2019-03-05 12:01:54","objective":"This special topic is a continuous course within two semesters. This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of graduate of interactive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of interactive media design. Therefore, one of the aims of this course is to construct a multi-disciplinary learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate a interactive media design project. It may evaluate interactive media design by assignment, individual discussion, and class attendance.","schedule":"Section 1  literature review\nSection 2  Field study and in-depth interview\nSection 3 Design methodology\nSection 4 Result and Discussion","scorePolicy":"Class attendance 30%,  assignments 30%, discussion and sharing 40%","materials":"Nil","foreignLanguageTextbooks":false},{"name":"陳圳卿","email":"cceugene@ntut.edu.tw","latestUpdate":"2019-01-07 22:42:42","objective":"From the point of perception, examining the relation between human and digital media. Review its current design applications and explore the future research topics. Technologically, this course introduces the recent developments on digital representations and their related technologies. Theoretically, this course reviews the theories and methodologies of the research applications in the field of design that involves human interaction.","schedule":"Week01 Representation &amp; Faithful Picture\nWeek02 Research Methods for Design I\nWeek03 Research Methods for Design II\nWeek04 Research Methods for Interaction Design I\nWeek05 Research Methods for Interaction Design II\nWeek06 Psychophysics\nWeek07 Human Subject Research I\nWeek08 Midterm Discussion\nWeek09 Human Subject Research II\nWeek10 Research Methods for Interaction Design III\nWeek11 Research Methods for Interaction Design IV\nWeek12 Data Analysis\nWeek13 Research Methods for Interaction Design V\nWeek14 Research Abstract Development\nWeek15 Research Development I\nWeek16 Research Development II\nWeek17 Vision &amp; Visual Illusion\nWeek18 Final Week","scorePolicy":"Participation   　　20%　　　　\nExercises 　　20%　　　　\nAbstract  　　20%　　　　\nTerm Project　　40%","materials":"MacKenzie I. Scott (2013). Human-Computer Interaction: An Empirical Research Perspective. Morgan Kaufmann.","foreignLanguageTextbooks":true},{"name":"戴楠青","email":"nctai@ntut.edu.tw","latestUpdate":"2019-03-04 20:10:26","objective":"Group discussion to develop thesis topics.","schedule":"Week01 Introduction\nWeek02 Exploration: Field\nWeek03 Exploration: Topic\nWeek04 Exploration: Keywords\nWeek05 Ideas\nWeek06 Research vs Design\nWeek07 Research vs Engineering\nWeek08 Publications\nWeek09 Conference Papers\nWeek10 Journal Publications\nWeek11 Proposal Development\nWeek12 Proposal Development\nWeek13 Proposal Development\nWeek14 Proposal Development\nWeek15 Abstract\nWeek16 Outline\nWeek17 Proposal Writing\nWeek18 Final Proposal","scorePolicy":"Participation 50%\nProposal 50%","materials":"　","foreignLanguageTextbooks":false}]
