[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2019-02-15 14:32:51","objective":"As the user-center design is becoming the core of most interaction design (IxD), it has become a popular belief that it is no longer the product that leads but users and user preferences that's leading the game. This is where design thinking steps in, where IxD uses their sensibility and methods to match users' need in a way that is technologically feasible and viable enough to generate user value and tap market opportunity. Suggested by some studies, brought in vogue by the popular design firm IDEO, design thinking when combined with decision science results in an infusion of empathy with engineering. This not only ensures a practical and creative resolution of problems but also puts the user at the center of applications and at the starting point to develop new designs and solutions. Meanwhile, ensuring design in analytics projects from the initial stages can lead to the right blend of sensibility, technical feasibility, business viability, and consumer needs.\nThe idea is, design thinking puts user and their needs as the starting point of developing new product and solution and ask questions like for whom are we designing, what is the problem user is experiencing, how to improve the performance and achieve scalability, among others. Data scientist and analyst can make up for great professionals in design thinking, given the right set of tools that is at their disposal.\nThus, the main objectives of this course provide: \n1.　　Creating a vital user-centered design process.\n2.　　Work with high-quality data, design artifacts can be created, addressing the needs of the real user.\n3.　　Encourage the student to mix these two together in IxD to reap design benefits and opportunities.\nThe most important objective is to ensure the quality of user-centricity of user experience.","schedule":"Week01 \nDevelopment of Human-Centric Artificial Intelligent\n1.　　The basic of AI\n2.　　Value of Human-centered Design)\nThe trend of inter-disciplinary integration and development \n\nWeek02\nDesign Thinking and the Values of Data Collecting and Generation\n1. The five steps of design thinking \n2. Data visualization and innovation  \n\nWeek03\nData Analysis and Story Telling\n1. Data, Information and Knowledge generation\n2. Case studies and concepts of data-driven storytelling \n\nWeek04\nExploration on Data-Driven Storytelling Technologies \n1.　　Data-Driven Storytelling \n2.　　The method and structure of Storytelling\n\nWeek05\nData Processing and Data Visualization Design Data processing and analysis \n1.　　The basic principle of Data visualization\n2.     Data visualization case studies\n\nWeek06\nData Science Design Thinking Workshop (I)\n1.　　Define the problems\n2.　　User data analysis\n3.     Data plan and survey\n\nWeek07\nData Science Design Thinking Workshop (II)\n1.　　Data list and analysis methods \n2.　　User experience design and analysis\n3.　　The basic and applications of Quality Function Deployment(QFD) method \n\nWeek08\nIndustrial Field Trip：Practical Experience  and Experiment\n\nWeek09\nMidterm Project Presentation and Review \n\nWeek10\nDesign Thinking with Five Design Sheets\n\nWeek11\nDesign Thinking World Café Workshop on midterm project amendment. \n\nWeek12\nSpeech：The Integration and Practice of Spatial Analysis and Deep Learning\n\nWeek13\nCo-working with Industrial Domain Experts：\nSpatial Data Processing and Analysis\n\nWeek14\nData Science Design Thinking Workshop (III)\n1.　　Persona\n2.　　User Journey Map\n3.     Service Blueprint\n\nWeek15\nData Science Design Thinking Workshop (IV)\n1.　　The value-added analysis of innovation (Kano Model)\n2.     The Honey Comb User Experience\n\nWeek16\nData Science Design Thinking Project Prototype Demo and Evaluation \n1.　　Prototype function analysis\n2.　　User Experience Analysis\n3.     Evaluation of Innovation value created\n\nWeek17\nTerm Project presentation and Review \n\nWeek18\nFinal Report due and Panel Discussion","scorePolicy":"1. Attendance Rate\n2. Midterm Report\n3. Project Presentation\n4. Final Project Report","materials":"1. Data-Driven Storytelling, Edited by Nathalie H. Riche, Christophe Hurter, Nicholas Diakopoulos, and Sheelagh Carpendale, CRC Press, Taylor &amp; Francis, 2018.\n2. Five Design-Sheets: Creative Design and Sketching for Computing and Visualization, by Jonathan C.&nbsp;Roberts, Christopher J. Headleand,&nbsp;Panagiotis D. Ritsos, Springer, 2017.","foreignLanguageTextbooks":true}]
