[{"name":"蕭榮修","email":"rshsiao@ntut.edu.tw","latestUpdate":"2018-12-15 09:31:25","objective":"Course Overview: \nThis is a graduate course on the design and analysis of algorithms, covering several advanced topics not studied in typical introductory courses on algorithms. This course will consist of a number of major sections. The first will be a short review of some preliminary material, including asymptotics, recurrences, and analysis and design techniques. These have been covered in earlier courses, and so we will breeze through them pretty quickly. \nWe will then discuss approaches to designing optimization algorithms, including greedy algorithms, dynamic programming, linear programming, and NP-complete problems. The next major focus will be on graph algorithms. This will include a review of elementary graph algorithms. Next we will discuss minimum spanning trees and shortest paths. Finally, we will briefly introduce some important distributed algorithms arising from networked environments.\nAfter mid-term, we will survey many of the techniques that apply broadly in the design of efficient algorithms, and study their application in a wide range of application domains and computational models. The goal is for the class to be broad rather than deep. Our plan is to touch upon the machine learning areas. We will select material adaptively based on the background, interests, and rate of progress of the students.","schedule":"I.　　Foundations\n1.　　Introduction\n2.　　Analyzing and designing algorithms\n3.　　Mathematical foundations: Growth of functions and recurrences\n4.　　Data structures: Trees\n5.　　Probability and average complexity\nII.　　Graph Algorithms\n6.　　Elementary graph algorithms\n7.　　Minimum spanning trees\n8.　　Shortest paths\n9.　　Maximum flow\n10.　　Overview of distributed graph algorithms\nIII.　　Optimization Algorithms\n11.　　Greedy algorithms\n12.　　Dynamic programming\n13.　　Linear programming\n14.　　NP-complete problems\n15.　　Mid-term Exam\nIV.　　Research Topics of Term Project\n16.　　Approximation algorithms\n17.　　Machine learning algorithms\n18.　　Data mining algorithms","scorePolicy":"Grading:\n30% Assignments\n30% Mid-term Exam\n40% Term Project Presentation","materials":"Reference books: \nThere is no textbook required for the course. Lecture notes will be made available from the course web page (北科i學園). Please visit the course webpage frequently for extra reading material. Reference books for each topic are listed below. \n\n1. T. H. Cormen, C. E. Leiserson, R. L. Rivest, and C. Stein, Introduction to Algorithms, 2nd edition, The MIT Press, 2001.  (開發)\n2.  S. Dasgupta, C. Papadimitriou, and U. Vazirani, Algorithms, McGraw-Hill, 2008.  (開發)\n3. K. A. Berman and J. L. Paul, Algorithms: Sequential, Parallel, and Distributed, Thompson Publishing, 2005.\n4. N. Santoro, Design and Analysis of Distributed Algorithms, John Wiley &amp; Sons, 2007.\n5. P. Domingos, The Master Algorithm, Basic Books, 2015.\n6. E. Alpaydn, Introduction to Machine Learning, 2nd Ed., The MIT Press, 2010.\n7. Shai Shalev-Shwartz and Shai Ben-David, Understanding Machine Learning: From Theory to Algorithms, Cambridge University Press, 2014.","foreignLanguageTextbooks":true}]
