[{"name":"李易叡","email":"iammimosa@gmail.com","latestUpdate":"2019-03-13 10:56:47","objective":"This course is for students, researchers, and practitioners who design or evaluate interactive products for children. It covers evaluation methodology for supporting interaction design for products, systems, software applications, toys, games, and specialized appliances intended to be used by children. This field contains a substantial body of knowledge with regard to interaction design and the more narrowly scoped field of usability engineering (UE). Within these areas of practice, and the related research field of HCI, a host of methods are available for evaluating interactive products for children. This course provides an overview of a new and vibrant research field and exposes gaps in current methodologies that future research must address. We also hope it conveys our enthusiasm for this research area, where so much interesting work is taking place and so much still needs to be done.\n\nEvaluating Children's Interactive Products directly addresses the need to ensure that interactive products designed for children — whether toys, games, educational products, or websites — are safe, effective, and entertaining. It presents an essential background in child development and child psychology, particularly as they relate to technology; captures best practices for observing and surveying children, training evaluators, and capturing the child user experience using audio and visual technology; and examines ethical and legal issues involved in working with children and offers guidelines for effective risk management.\n1.　　Presents an essential background in child development and child psychology, particularly as they relate to technology.\n\n2.　　Captures best practices for observing and surveying children, training evaluators, and capturing the child user experience using audio and visual technology.","schedule":"CH 1: What is a child?\nCH 2: Children and interactive technology\nCH 3: The interactive product lifecycle\nCH 4: Ethical practice in evaluations\nCH 5: Planning the evaluation study\nCH 6: Before the evaluation\nCH 7: During the evaluation\nCH 8: After the evaluation\nCH 9: Recording and logging\nCH 10: Observation methods\nCH 11: Verbalization methods\nCH 12: The wizard of oz method\nCH 13: Survey methods\nCH 14: Diaries\nCH 15: Inspection methods\nCH 16: CASE STUDY 1: Game-controlling gestures in interactive games\nCH 17: CASE STUDY 2: Embedding evaluation in the design of a pervasive game concept\nCH 18: CASE STUDY 3: Using survey methods and efficiency metrics","scorePolicy":"Assignment (30%) Discussion (20%) Project Design (30) Presentation (15%) Attend (15%)","materials":"1.　　Markopoulos, P., Read, J. C., MacFarlane, S., &amp; Hoysniemi, J. (2008). Evaluating children's interactive products: principles and practices for interaction designers. Morgan Kaufmann.\n2.　　Baecker, R. M. (Ed.). (2014). Readings in Human-Computer Interaction: toward the year 2000. Elsevier.\n3.　　Read, J. C., &amp; Markopoulos, P. (2014). Evaluating children's interactive products (pp. 1043-1044). ACM.","foreignLanguageTextbooks":true}]
