[{"name":"陳文學","email":"wschen@ntut.edu.tw","latestUpdate":"2016-12-26 16:39:56","objective":"本課程將介紹工程上、物理上系統解析的相關數學工具，內容包括五大項：\n一 常微分方程式：一階，二階，及高階常微分方程，拉譜拉斯轉換，   特殊函數。\n二 向量幾何與分析：矩陣行列式及特徵問題。\n三 傅立葉級數，積分及轉換。\n四 偏微分方程及邊界值問題。\n五 複變分析及映射轉換。","schedule":"Week 1 Introduction; Vector Functions of One Variable, Velocity and Curvature\n第1週　　課程介紹；單變數之向量函數、速度、曲率\nWeek 2 The Gradient Field, Divergence and Curl\n第2週　　梯度場、散度及旋度\nWeek 3 Line Integrals, Green’s Theorem\n第3週　　線積分、格林定理\nWeek 4 An Extension of Green’s Theorem, Independence of Path and Potential Theory\n第4週　　格林定理的延伸、與積分路徑無關及位能定理\nWeek 5 Surface Integrals, Applications of Surface Integrals\n第5週　　面積分、面積分的應用\nWeek 6 The Divergence Theorem of Gauss, Stokes’s Theorem; \n第6週　　高斯散度定理、史托克定理\nWeek 7 Compensatory Holiday for Sports Day, Why Fourier Series? The Fourier Series of a Function\n第7週　　運動會補假；傅立葉級數、函數的傅立葉級數\nWeek 8 Fourier Sine and Fourier Cosine Series, Phase Angle Form, Complex Fourier Series\n第8週　　傅立葉正弦與餘弦級數、相角型式的傅立葉級數、複數型的傅立葉級數\nWeek 9 ※The Fourier Integral, Fourier Cosine and Sine Integrals, ※The Fourier \nTransform; Mid-term Exam.\n第9週　　傅立葉積分、傅立葉正弦與餘弦積分式、傅立葉轉換；期中考試\nWeek 10 Derivation of the Wave Equation\n第10週　　波動方程式的推導\nWeek 11 Wave Motion on an Interval\n第11週　　區間內波的運動\nWeek 12 Wave Motion in an Infinite Medium and Semi-Infinite Medium\n第12週　　無限介質與半無限介質中波的運動\nWeek 13 The Heat Equation and Initial and Boundary Conditions\n第13週　　熱傳方程式及初始與邊界條件\nWeek 14 The Heat Equation on [0, L]\n第14週　　在閉區間0～L的熱傳方程式\nWeek 15 Fourier Series Solutions of the Heat Equation Heat in an Infinite Medium\n第15週　　熱傳方程式在無限介質的傅立葉級數解\nWeek 16 The Potential equation and Laplace's Equation, Dirichlet Problem for a Rectangle and Disk\n第16週　　位能方程式及Laplace方程式；矩形或圓盤之Dirichlet的問題\nWeek 17 Steady-State Equation for a Sphere\n第17週　　球面的穩態方程式\nWeek 18 Final Exam.\n第18週　　期末考試","scorePolicy":"1. Homework (作業)  10%\n2. Attendance (出席)  10%\n3. Quizzes (平時考)  20%\n4. Mid-term exam. (期中考試)  30%\n5. Final exam. (期末考試)  30%","materials":"Textbook: Advanced Engineering Mathematics   7th Edition Custom Publishing\n           Peter V. O’Neil \n\nReference Book：Differential Equations with Boundary-Value Problems 7th Ed.\n               Dennis G. Zill and Michael R. Cullen","foreignLanguageTextbooks":true}]
