[{"name":"邱于芸","email":"vickiyuyunchiu@gmail.com","latestUpdate":"2017-02-18 03:04:23","objective":"儘管我們從坊間各報章雜誌與網路媒體的評論中，不時可看到傳播學者、文化菁英等意見領袖，對於現今台灣各家電視台為搶拚八點檔連續劇收視率而越演越煽情、灑狗血的手法，提出質疑與批判，並憂心這些充斥著欺淩迫害、變態復仇等扭曲人性的不當內容，直接播送到各家庭後，將會對社會風氣與道德造成負面影響。然而，對於未來文化建構與社會認同的研究來說，我們卻不能忽視在高收視率以及高娛樂經濟產值的背後，廣大觀眾群喜好煽情聳動劇情的原因與影響力。 \n\n遠在一百多年前，在還沒有電視，甚至白話文都還沒出生的時代，梁啟超就提出了小說，做為一種娛樂傳媒，與國族建設相互關係的重要。梁氏於1902年所發表的《論小說與群治之關係》中，對清末通俗小說的影響力：薰、侵、刺、提，可謂又愛又畏：「此四力者，可以盧牟一世，亭毒群倫，教主之所以能立教門，政治家所以能組織政黨，莫不賴是。文家能得其一，則為文豪；能兼其四，則為文聖。有此四力而用之於善，則可以福億兆人；有此四力而用之於惡，則可以毒萬千載。而此四力所最易寄者惟小說。可愛哉小說！可畏哉小說！」 \n\n也因此，五四運動前後，一連串對於道德建構、意識啟蒙的小說相繼出爐，大家耳熟能詳的《阿Ｑ正傳》《狂人日記》《沉淪》以及到了毛澤東1942年在延安所提出的文藝政策後所產生的小說作品，幾乎都是梁啟超所提出的語境之延續。 \n\n然而那些濫觴於清末民初，以上海為中心的所謂「海派作家」「海派文學」：標榜以娛樂大眾為目的，商業性與通俗性俱高的小說，曾隨著以上海為首的工商都市興起，掀起都市通俗小說熱潮，蔚為文壇奇觀的創作路線，卻無論在廣受庶民大眾閱讀流傳的當時，或是在日後現代文學史的編纂中，皆遭受到主流語境的批判與邊緣化影響，一直未能登上大雅之堂。 \n\n事實上，英國自工業革命興起，通俗小說出版量亦隨之大增，傳遍西歐和美國；日本自明治維新後，隨著東京和大阪等新興都市的擴展，也湧現出高娛樂性的通俗小說。而清末民初的中國也走到這個歷史的必然後，被視為「海派文學」鴛鴦蝴蝶派祖師的徐枕亞，其代表作《玉梨魂》於民國元年出版，發行達數十萬冊，遠銷至香港、新加坡，甚至於1924年被上海明星電影公司搬上銀幕，成為中國電影史上，首部改編成電影的當代小說。另位鴛蝴派代表人物張恨水於1929年創作的長篇小說《啼笑姻緣》，非但造成洛陽紙貴，數度被改編成越劇、拍成電影之外，日後更三度拍成電視連續劇，包括1974年香港無線電視版、1987年香港亞視版，與2004年大陸央視版。 \n\n由此可見，當年的「海派文學」曾經是一個作者成、讀者多、流傳廣泛，甚至經得起時間考驗的文學流派。可惜它生不逢辰，一直飽受新文學的猛烈抨，尤其自1949年中華人共和國成立，兩岸分治後，由於政治、社會意識型態的幹預，通俗文學的創作與研究更在執政者的控制之中，這些作家的創作生涯不僅中斷，連作品都遭封殺的命運。這個現 現象一直持續到上世紀70 年代，由美國漢學家Perry Link對鴛鴦蝴蝶派的研究開始，被塵封遺忘的20-40年代海派文學與文化研究，才自80年代又重新慢慢萌芽。 \n\n課程內容將以文本精讀，配合民初上海圖畫報刊、電影欣賞等輔助教材，讓學生回到歷史現況的同時，引介當今中外學界對當時文化現象的討論。\n\n文本研讀將依照編年的方式，關注的焦點將以現代都市文學和民族/文化/現代建構為基底，以東西現代文學以來的總體概述為起始的一個發現之旅。課程將以夏志清的中國現代小說史為起點，進而以李歐梵對於民國初年出版商和作家和他們的貢獻作為對照，來做為現代城市文化風景的呈現。課程中將以安德森「想像的共同體」為背景，解釋它被各種文化論述所引用的觀點，以各種面向來看待文學作品對於民族建構的貢獻。","schedule":"週　　日期　　課程　　                 內容\n1　　2/23　　開學週　　                        課程大綱\n2　　3/02　　課程介紹　　                        現代文學的興起 白話文運動\n3　　3/09　　知識分子中的模範生　　魯迅 (阿Q正傳)\n4　　3/16　　個案欣賞　　                        他們在島嶼寫作\n5　　3/23　　太陽花般慘綠少年   　　郁達夫 (沉淪)\n6　　3/30　　知識分子與無產階級　　老舍（駱駝祥子）\n7　　4/06　　專題演講　　\n8　　4/13　　還是鄉下人　　               沈從文 (建設、新與舊)\n9　　4/20　　期中考週　　\n10　　4/27　　新感覺派　　          施蟄存 (將軍底頭)七等生 (我愛黑眼珠)\n11　　5/04　　蒼涼與世故　　          張愛玲(傾城之戀)(色戒)\n12　　5/11　　落寞的貴族　　          白先勇《花橋榮記》\n13　　5/18　　中國先派　　　　  余華《許三觀賣血記》\n14　　5/25　　新派武俠　　                  金庸 《神雕俠侶》\n15　　6/01　　父子情仇　　　　           王文興 《家變》\n16　　6/08　　現代的憂鬱　　　　《三峽好人》賈樟柯 電影欣賞\n17　　6/15　　九把刀現象        　　 那些年我們一起追的女孩\n18　　6/22　　期末考　　\n\n\n培養學生文學底蘊，以精讀中西方故事經典，配合批評理論，檢視時代與社會變遷對於故事原形轉化的影響原素，啟發學生的故事力與創作力的文化底蘊，以及創意轉化時的視野與氣度 。發掘文學作品對於社會文化生活經驗建構，並藉由空間（建築與街道）作為連結與呈現手法。把文學作品內的生活經驗與故事，連結到當代工業與後工業意象的論述，變成國族建構的元素之一。","scorePolicy":"評量標準　　\n1.　　出席率與課堂參與:10%\n2.　　期中報告40%\n3.　　期末報告50%","materials":"　","foreignLanguageTextbooks":false}]
