[{"name":"林宜玄","email":"yishyuan@ntut.edu.tw","latestUpdate":"2017-01-23 13:04:34","objective":"教學目標：\n（一）增進批判、分析、統整與應用之相關能力\n（二）確定學術論文之研究問題與題目並進行相關文獻分析\n（三）完成研究設計及論文計畫構想書\n三、授課方式：\n（一）教師講授：研究問題與論文題目之探索、文獻探討方法、待答問題或研究假設之確定、研究變項之界定、研究設計之類型、研究問題轉變為研究計畫、論文寫作方法與APA格式講解。\n（二）教育議題辯論：請依據指定之教育相關議題，組隊進行辯論比賽並繳交專題報告。\n（三）論文計畫構想書撰寫與討論：請自行探索研究問題與論文題目、分析相關文獻、確定待答問題或研究假設、界定研究變項、進行研究設計、撰寫論文計畫構想書，進行報告與討論並繳交報告。","schedule":"四、授課內容及進度：\n        ※第一週（2/22）\n說明授課內容及進行方式，討論本學期教育議題辯論題目，分組及抽籤決定辯論組別與順序，論文題目與研究問題、相關文獻分析報告之配對與順序。\n        ※第二週（3/01）\n講授研究問題與論文題目之探索、文獻探討方法\n※第三週（3/08）\n講授待答問題或研究假設之確定、研究變項之界定、研究設計之類型、\n研究問題轉變為研究計畫、論文寫作方法與APA格式\n※第四週至第五週（3/15、3/22）\n  1.每週2隊（7人組成一隊）進行教育議題辯論\n  2.辯論隊員全隊共同繳交一份報告\n  3.非辯論隊員每人繳交1-2頁報告\n※第七週（4/05）運動會補假\n※第九週（4/19）期中考試（停課）\n※第十週（4/26）專題演講\n※第六週、第八週、第十一週、第十二週（3/29、4/12、5/03、5/10）\n1.　　每週7人分別進行8分鐘的論文題目與研究問題、研究目的、相關文獻分析報告及討論（請用power point報告），2人一組配對相互評論計畫內容，評論時間2分鐘。\n2.報告人繳交書面報告（書面及電子檔）\n3.非報告人需參與討論\n※第十三週、第十四週、第十五週、第十六週、第十七週（5/17、5/24、\n5/31、6/07、6/14）\n1.　　每週7人分別進行8分鐘的待答問題或研究假設、研究變項、研究\n設計、論文計畫構想書報告及綜合討論（請用power point報告），2人一組配對相互評論計畫內容，評論時間2分鐘。\n2.繳交論文計畫構想書（書面及電子檔）\n3.非報告人需參與討論\n        ※第十八週（6/21）期末考試","scorePolicy":"五、成績評量：\n（一）平時成績（包括：上課出席率、專題演講心得報告及討論發言狀況）：25%\n（二）教育議題辯論（包括：辯論分數及書面報告、心得報告）：25%\n（三） 論文題目與研究問題、研究目的、相關文獻分析報告（包括：課堂報告及書面報告；口頭評論與回饋、報告評分表）：25%\n（四）待答問題或研究假設、研究變項、研究設計報告（包括：課堂報告及書面報告；口頭評論與回饋、報告評分表）：25%","materials":"六、備註：\n1.教育議題經全班討論後票選2則，7-8人組成一隊依據指定之教育時事議題，進行辯論比賽並繳交專題報告。非辯論隊員需負責場地佈置（計時器、警鈴、題目海報…），其中1人擔任會場主席、1人擔任記時員、其餘同學擔任記分員，非辯論隊員於比賽後均需參與討論並繳交1-2頁報告（書面及電子檔）。\n2.每人進行7分鐘的論文題目與研究問題、研究目的、相關文獻分析報告並繳交報告，其餘同學需參與討論。\n3.每人進行7分鐘的期末論文計畫構想書報告並繳交報告，論文計畫構想書報告內容包括：論文名稱、研究動機（問題）、研究目的、待答問題或研究假設、名詞釋義、研究範圍與限制、研究對象、相關文獻分析、研究設計與方法，其餘同學需參與討論。\n    4. 外聘演講之次週應繳交1~2頁報告，報告內容包括學理上的評論、補充資料，心得感想等，有引用他人觀點時，仍應依APA格式，註明文獻。如因時間安排致不能參與演講，應經教師同意，於二週內以參加其他相當份量之學術研討會或演講之心得報告替代。\n5. 所有應繳交之報告，請提供書面及電子檔，由班長彙整轉交；所有報告將掛網，所以務請留意學術倫理及智慧財產權問題。\n\n\n七、參考書目：\n    1.畢恆達（2005）。教授為什麼沒告訴我。臺北:學富。\n    2.潘慧玲主編（2004）。教育研究方法論。臺北:心理。\n    3.潘慧玲主編（2006）教育研究的取徑-概念與應用。臺北:高等教育。\n    4.蔡今中(2008)。社會科學研究與論文寫作：成功發表秘笈。臺北:高等教育。\n    5.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(一) \n      總論與量化研究。臺北:東華。\n    6.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(二)\n      質性研究法。臺北:東華。\n    7.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(三)\n      資料分析。臺北:東華。","foreignLanguageTextbooks":false}]
