[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2017-02-17 14:39:07","objective":"本課程將對第二語言習得的主要議題進行深入地探討論與分析。上課的內容包括，但不限於，下列主題: 語言天賦、跨語言影響、人格特質、學習動機、學習風格、學習策略、外語焦慮和外語學習信念等。\nCourse Title:　　　　Graduate Seminar on Second Language Acquisition \nCredit Hours:　　　　3 \nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw \nTerm Offered:　　　　Spring, 2017\nScheduled Class Hours: Friday 6:30-9:00 PM\nOffice Hours:      By appointment \nRequired Texts:  (1) Ellis, Rod. Understanding Second Language Acquisition, Oxford Applied Linguistics Series, Oxford University Press, 2003. \n               (2) Ellis, Rod. The Study of Second Language Acquisition, Oxford Applied Linguistics, Oxford University Press, 2008\nCourse Description: This course will look at the process of acquiring / learning and using a second language. It provides theoretical and experimental insights to examine the phenomenon of language development from multi-disciplinary perspectives.  \nCourse Objectives:  This course aims to help in-service teachers / graduate students to\n　　　　　　(1) understand the principles and processes governing L1 &amp; L2 \n               acquisition and learning\n　　　　　　(2) examine how non-native language ability develops\n            (3) become familiar with SLA theories to account for many aspects of non-native discourse \n            (4) conduct SLA-based research studies","schedule":"1) Introduction and Key Issues in SLA\n2) The role of the first language\n3) Interlanguage and the natural route of development\n4) Variability in interlanguage\n5) Individual learner differences and SLA\n6) Input, interaction and SLA\n7) Learner strategies\n8) The role of formal instruction in SLA","scorePolicy":"Evaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, in-class discussions, and attendance. Chapters to be presented will be assigned by the instructor. Topics for term papers have to be based on principles, theories and studies of SLA in regard to English language teaching and learning. Main components for semester evaluation are as follows:  (1) Chapter Presentation(s) 30%  (2) Term paper(s) 40%  (3) Attendance 30%","materials":"(1) Ellis, Rod. Understanding Second Language Acquisition, Oxford Applied Linguistics Series, Oxford University Press, 2003. \n               (2) Ellis, Rod. The Study of Second Language Acquisition, Oxford Applied Linguistics, Oxford University Press, 2008","foreignLanguageTextbooks":true}]
