[{"name":"黃世孟","email":"meng@nuk.edu.tw","latestUpdate":"2017-02-08 14:33:58","objective":"課程目標：\n　　　開授在職專班授課內容、主講方式，教師必須考量實際助益選課學生的學習與事業的發展。授課教師規劃授課講題之外，選擇具有實用性的主題且能實踐專題演練更重要，也許授課教師比較費時，而且比較難準備教材，但選課學生一旦經歷過有意義的專題演練，如同學會游泳、學會騎腳踏車，肯定終生實用受益，選讀在職專班寓意深遠。\n　　　物業管理之專業與實務課程內容劃分「教師主講」與「學生簡報」兩部分，教師主講內容包括物業管理範疇的三領域：（第一類）建築與環境維護，（第二類）生活與商業服務，（第三類）資產經營與管理。學生簡報的主題與方式，規定「期中作業」簡報及自選「期末作業」專題，收集日常生活物業新聞，以報導物業新聞事件的方式，表達對於物業管理學習的成果，如此進行物業管理理論與實務之學習。","schedule":"課程進度：\n　　講題一：建築策劃啟動價值的物業\n　　講題二：從物業管理談建築策劃、規劃與設計\n　　講題三：建築規劃結合物業管理要領\n　　講題四：物業管理的專業領域與發展趨勢\n　　講題五：建築與環境維護（第一類）建築維護管理、健診、保存與再用\n　　講題六：生活與商業服務（第二類）生活資訊平台與網購之物業服務\n　　講題七：資產經營與管理（第三類）公私部門別設施資產管理系統與案例\n　　講題八：從物業管理前期介入檢視不動產開發建築設計品質\n\n2017年\n週次　　日期　　授課講題　　\n第一週　　2/20　　學期第一堂課 : 開課動機、授課內容、課程要求、作業評量與問卷調查。講題一：建築策劃啟動價值的物業　　\n第二週　　2/27　　停課：和平紀念日連假　　\n第三週　　3/6　　講題二：從物業管理談建築生命週期之策劃、規劃與設計　　\n第四週　　3/13　　停課：出席法國國際會議　　\n第五週　　3/20　　講題三：物業管理的專業領域與發展趨勢　　\n第六週　　3/27　　講題四：建築與環境維護（第一類）維護管理、健診保存與再用　　\n第七週　　4/3　　停課：春假清明節　　\n第八週　　4/10　　新聞報導：物業管理【第一類新聞】建築與環境維護（第一類）　　\n第九週　　4/17　　講題五：生活與商業服務（第二類）生活資訊與網購之物業服務　　\n第十週　　4/24　　新聞報導：物業管理【第二類新聞】生活與商業服務（第二類）　　\n第十一週5/1　　講題六：資產經營與管理（第三類）公私部門設施資產與管理　　\n第十二週5/8　　新聞報導：物業管理【第三類新聞】資產經營與管理（第三類）　　\n第十三週5/15　　講題七：從物業管理前期介入檢視不動產開發建築設計品質　　\n第十四週5/22　　專題演講：居家健檢之物業管理服務(朱貴章)　　\n第十五週5/29　　專題演講：公寓大廈管委會運作與物業管理公司之評選(張建榮)　　\n第十六週6/5　　專題演講：智慧建築結合物業管理之建築設計(林世俊)　　\n第十七週6/12　　「期末作業」：自選專題報告（製作簡報、分享心得）分組報告","scorePolicy":"成績計算方式：\n學期成績以「期中作業」及「期末作業」兩項成績合計之。\n期中作業由授課教師指定參考文獻閱讀、報導物業新聞，限期內提出作業心得分享，期中作業成績佔60％。\n期末作業題目由選課學生自訂，二人為一組，期末提交合作學習成果報告書，同時製作簡報檔專題報告，期末作業成績佔40%。","materials":"參考資料：其他參考文獻存置於授課教師黃世孟個人網站內，選課學生自行下載閱讀。\n陳維東等著，物業管理概論（土木營建組），台灣物業管理學會\n杜功仁等著，物業管理概論（建築設施組），台灣物業管理學會\n小林清周、梨本幸男（著）、黃世孟（監修），『大樓的經營企劃、經營管理、管理技術』，三久出版社，1995年9月\n黃世孟等編著，『物業管理專業用語』，台灣物業管理學會，2007年10月（初稿）出版\n尤建新、孫繼德（主編），『物業管理實務』，中國建築工業出版社，2003年7月\n陳品著，『買房也要買幸福』，推手文化創意有限公司出版，2014年3月\nPeter Barrett, “Facility Management(toward best practice)”, Blackwell Science\n台灣建築醫院網站：http://118.163.18.222/index.asp\n台灣物業管理學會網站：http://tipm.org.tw/\n台灣物業管理學報http://tipm.org.tw/publication_1.html\n其他","foreignLanguageTextbooks":false}]
