[{"name":"郭無患","email":"kuoberlin@gmail.com","latestUpdate":"2017-03-25 20:02:49","objective":"本課程旨在讓學生具備國際新聞編譯之相關知識，並透過實務演練培養新聞編譯之能力。課程內容主要含括(一)國際新聞編譯之介紹（如新聞編譯現況、製作流程、專業條件與譯者相關知能）；（二）新聞編譯之策略與技巧（如刪除、重組、整合新聞訊息）；（三）新聞編譯之模擬與實務練習。","schedule":"國立台北科技大學應用英文系\n課號: 229071\n教學課程名（中文） 國際新聞編譯及實務\n科目名稱(英文)　　 TRANS—Editing of International NEWS  　　\n學分數（Credit）　　 3\n授課教師(Instructor)　　 郭無患 \n\n一、教學目標（Teaching Objectives）\n本課程旨在讓學生具備國際新聞編譯之相關知識，並透過實務演練培養新聞編譯之能力。課程內容主要含括(一)國際新聞編譯之介紹（如新聞編譯現況、製作流程、專業條件與譯者相關知能）；（二）新聞編譯之策略與技巧（如刪除、重組、整合新聞訊息）；（三）新聞編譯之模擬與實務練習。\n本課程提供閱讀新聞英語的練習機會，藉著閱讀報紙、雜誌英文新聞報導、評論、專欄、社論等，了解其中新聞字彙、文體，訓練閱讀新聞。\n促使學生透過媒體識讀教學過程、瞭解新聞編採實務、國際現勢、配合原本的英文能力利基，強化國際觀，落實並活用英文。\n本課程重要目標並包含著重加強應用英文系學生對國際新聞編譯實務的能力，培養學生敏銳的觀察力及組織力、並訓練學生對國際時事的新聞陳述與課堂討論，達到不同觀點的看法。有系統引導學生閱讀國際新聞，述說新國際聞編譯之寫作方式與要點，以及編譯技巧。 \n\n二、授課內容（Teaching content）\n第1週 主題：課程說明、初探新聞英文與新聞編譯、教學討論分組與遴選課堂小幫手。\n第2週 主題：本週作業討論與同學分組報告（兩岸關係與美中台）、國際新聞編譯實務之國際藝文與影劇新聞編譯與報導¬—奧斯卡獎編譯報導之前置準備與當日執行。\n第3週 主題：本週作業討論與同學分組報告（兩岸關係與美中台）、國際新聞編譯實務之國際政治新聞、朝鮮半島緊張情勢、薩德與美中互動。\n第4週 主題：本週作業討論與同學分組報告（項莊舞劍，志在沛公）、國際新聞編譯實務之國際政治新聞歐洲部分之1：英國脫歐談判與蘇格蘭獨立公投。\n第5週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、國際新聞編譯實務之司法新聞編譯注意事項—從Led Zeppelin’s Stairway to Heaven 遭提訟談起。\n第6週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、國際新聞編譯實務之國際政治新聞、歐洲部分之2：德、法、西等國家倡導Multi Speed Europe 之策略與阻力。\n第7週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、國際新聞編譯實務之恐怖攻擊事件編譯與報導，兼論國際重大社會新聞編譯與報導。\n第8週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、新聞媒體參觀訪問。\n第9週 期中考\n第10週：國內新聞媒體國際新聞編譯作業實況及其未來。\n第11週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、國際新聞編譯實務之國際體育新聞編譯與報導。\n第12週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論）、國際新聞編譯實務之國際財經新聞編譯與報導。\n第13週 主題：國際新聞馴化過程初探\n第14週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論），Cyberspace資訊收集處理與應用初探。\n第15週 主題：縱觀數位呈現技術應用與國際新聞編譯實務之交互運用。\n第16週 主題：本週作業討論（外電譯稿要領與同學作業訂正討論），國際新聞編譯實務之科技新聞編譯與報導。 \n第17週 主題：各學習分組提報期末專題內容與執行計畫\n第18週 期末專題分組報告與討論。本學期課程結束。\n\n三、使用教材：AP、Cable News Network、Economist、Time、Wall Street Journal、Washington Post、Financial Times 等國際主流新聞媒體，對國際重大新聞之最新報導及分析，形式包含文字、圖像、及影音。\n參考書目，指定閱讀書籍\n“補上一堂國際關係課”  楊永明博士著 \n    捷徑文化出版\n“新聞英語精粹選讀“    莊克仁博士譯著\n    亞太圖書出版社\n\n四、學生學習方式與過程：\n1、每週指定作業：交付閱讀內容，並要求下周完成新聞譯稿或讀書心得，隨堂討論。\n2、分組討論與報告：此為分組書面報告，由同學就授課主題與閱讀資料進行相關資料的收集整理，於指定日期在堂課繳交文字報告，並以分組為形式在課堂上台ppt報告分析。","scorePolicy":"成績評量及標準\n1、每周作業與出席（15%）。\n2、上課主動參與、討論、提問（15%）\n3、期中考試（20%）\n4、期末專題報告（50%）","materials":"使用教材：AP、Cable News Network、Economist、Time、Wall Street Journal、Washington Post、Financial Times 等國際主流新聞媒體，對國際重大新聞之最新報導及分析，形式包含文字、圖像、及影音。\n參考書目，指定閱讀書籍\n“補上一堂國際關係課”  楊永明博士著 \n    捷徑文化出版\n“新聞英語精粹選讀“    莊克仁博士譯著\n    亞太圖書出版社","foreignLanguageTextbooks":true}]
