[{"name":"陳玉敏","email":"yumchen@umail.iu.edu","latestUpdate":"2020-12-07 17:54:37","objective":"本課程將閱讀並討論西方重要之現代與後現代詩、小說、及戲劇。在第一次與第二次世界大戰期間，國際藝術運動如達達、未來、和超現實主義者，以及美國作家如費茲爵羅、歐尼爾、賀思騰等人，皆有助於定義西方文學中之現代主義脈動。第二次世界大戰之後，後現代作家如Beat詩人和紐約學派運動、劇作家貝克特、和小說作家歐康納、包德溫、和茉莉森接續現代主義而起，卻面對更複雜的美學、藝術、和精神的挑戰，本課程將討論這一系列作家和著作，以及其反映之時代精神。\nThis survey course examines key Modernist and Post-Modern poetry, fiction and drama from the West.  In the period between WWI and WWII, international artistic movements such as the Dadaists, the Futurists and the Surrealists, as well as American writers such as F. Scott Fitzgerald, Eugene O'Neill and Zora Neale Hurston helped to define a new Modernist impulse in Western literature; after WWII, post modern writers such as the poets of the Beat and New York School movements, playwright Samuel Beckett, and fiction writers Flannery O'Connor, James Baldwin and Toni Morrison took up where the Modernists had left off, but were faced with still more complex aesthetic, political and spiritual challenges.","schedule":"Week 1 Introduction\n\nAmerican Literature 1914- 1945 \n\nWeek 2 Gertrude Stein “The Making of Americans” Robert Frost “After Apple-Picking” “The Road not Taken” “Fire and Ice” “Stopping by Woods on a Snowy Evening”  Sherwood Anderson “ Winesburg Ohio.”\n\nWeek 3  Carl Sandburg “ Chicago” “Fog” “Grass” Wallace Stevens “ The Snow Man” “ The Emperor of Ice Cream” “ Disillusionment of Ten O’clock” “ Sunday Morning” “Anecdote of the Jar” “The Idea of Order at Key West” “ Of Modern Poetry”  \n\nWeek 4 William Carlos Williams “The Red Wheelbarrow” “This is Just to Say” “The Dance” “ Landscape with the Fall of Icarus”  Ezra Pond “In a Station of the Metro” “ Potrait d’une Femme” “ The Cantos” \n\nWeek 5 The Modernist Manifestos:  F. T. Marinetti “From Manifesto of Futurism” Mina Loy “Feminist Manifesto” Ezra Pond “From Perspective” William Carlos \n\nWeek 6 Langston Hughes “From the Negro Artist and the Racial Mountain” H.D “Leda” “Helen” Marianne Moore “Poetry” “To a Snail” “The Mind is an Enchanting Thing” \n\nWeek 7 T.S Eliot “The Love Song of J. Alfred Prufrock” “The Wasteland” “Four Quartets” \n\nWeek 8 Eugene O'Neill “ Long Day’s Journey into Night” Film\n\nWeek 9 Mid-term Exam \n\nWeek 10  Nora Neale Hurston “Sweat” “How it feels to be Colored Me” E.E.Cumming “O Sweet spontaneous” “next to of course god America i” “somewhere I have never traveled, gladly beyond.” F.Scottt Fitzgerald “Winter Dreams” Film: The Great Gatsby.\n\nWeek 11 William Faulkner “ A Rose for Emily” Hart Crane “Chaplinesque” Langston Hughes “Song for a Dark Girl” “Note on Commercial Theatre” “Democracy”\n\nAmerican Literature since 1945 \n\nWeek 12 Elizabeth Bishop  “Sestina” “In the Waiting Room” “One Art”\nTennessee William “ A Streetcar Named Desire.” Film  \n\n\nWeek 13  Ralph Ellison “Invisible Man” Robert Lowell “For the Union Dead” \n\nWeek 14  James Baldwin “Sonny’s Blues” ”Sonny’s Blues” Flannery O’Connor “Good Country People” “A Good Man is Hard to Find” Allen Ginsberg “Howl”\n\nWeek 15  Anne Sexton “The Starry Night” “Sylvia’s Death” Adrienne Rich “ A Valediction Forbidding Morning? “ Transcendental Etude”  Toni Morrison “Racitatif”\n\nWeek 16. Sylvia Plath “ Lady Lazarus” “Daddy” ＂” Child” “Morning Song” John Updike “Separating” \n\nWeek 17 Kingston “No Name Woman” Alice Walker:” Everyday Use” Li-Young Lee poems.  \n\nWeek 18 Final Project Due","scorePolicy":"Attendance  20% \nFour Quizzes 40 %\nMid-term Exam 20%\nFinal Project 20%","materials":"The Norton Anthology of American Literature 1865 to the Present","foreignLanguageTextbooks":true}]
