[{"name":"秦自強","email":"ccchin@mail.mcut.edu.tw","latestUpdate":"2021-02-18 11:43:13","objective":"練習設計構想草圖速繪法；從基本幾何形體至複雜產品、空間循序漸\n進；常用材質（木質、金屬、透明材質、石材及皮革等）之表現技法\n；產品精描、透視圖法、三視圖、爆炸圖、組立圖等之精描，說明圖\n板及各種畫材（麥克筆、粉彩、色鉛筆及水彩）等之應用。\nThis course put emphasis on offering students having enough skills on :1.Abilities to sketch their idea visible to the others.2.Coloring design sketches to let the drawings have better comprehensibility.3.Good skill for Renderings. Medias for this course shall include markers, pastels water colors and color pencils.\n練習設計構想草圖速繪法；從基本幾何形體至複雜產品、空間循序漸進；常用材質（木質、金屬、透明材質、石材及皮革等）之表現技法；產品精描、透視圖法、三視圖、爆炸圖、組立圖等之精描，說明圖板及各種畫材（麥克筆、粉彩、色鉛筆及水彩）等之應用。\n1. 物體形狀由輪廓、明暗、與質地等三元素組成，教授產品設計表現技法之目標，在於培養個人眼、手、意間之感覺統合能力，透過造形結構與透視原理的介紹，學習透過鉛筆、色鉛筆、與麥克筆等媒材，嘗試繪製各式各樣的物品，體悟各種材料、加工的特質，進而能夠掌握繪製精確的創新構想圖像，達到正確的形體透視、傳達完整的材質感覺、與適宜的明亮立體感效果。\n2. 依據課程需求，將針對理論與實務兩方面同時進行授課，強調工業設計為人類謀取福祉的根本設計表達實力，用以培養學生充分發揮材料與構成特性，展現創新實力，為產品設計的創新價值加分。","schedule":"1. 教學進度、課程導論 / 筆觸感的表情與表達---備A3麥克筆專用紙、2B鉛筆\n2. 造形與透視原理 / 立方體輪廓線與7公分正方體製作 / A3紙、2B鉛筆\n3. 正立方體的輪廓明暗 / 課堂、課後交圖各一 / A3紙、2B鉛筆\n4. 正立方體與延伸線、線的應用 / 透視、陰影的表現/ A3紙、2B鉛筆\n5. 正立方體與鉛筆組合/正立方體與鉛筆構成　　/  質感的表現-- A3紙-、色鉛筆\n6. 正立方體與枝葉組合/正立方體與枝葉層次　　/ 層次、明度的表現--- A3紙、色鉛筆\n7. 正立方體與手掌關係/正立方體與手掌構成　　/ 曲線、細緻的表現--- A3紙、色鉛筆\n8. 虛擬創意構想的表現/精靈與手掌的故事篇　　/ 快速、精準、達意--- A3紙、硬質筆\n9. 作業補繳與畫冊提交評量成績 \n10.設計構想圖的表現1/單色鉛構想圖構成--- A3紙、自由筆\n11.設計構想圖的表現2/木材家具製品構成--- A3紙、自由筆\n12.設計構想圖的表現3/塑膠類產品構成------ A3紙、自由筆\n13.設計構想圖的表現4/玩具類產品構成------ A3紙、自由筆\n14.設計構想圖的表現5/玻璃類產品構成------ A3紙、自由筆\n15.設計構想圖的表現6/3C類型產品構成------A3紙、自由筆\n16.設計構想圖的表現7/輕金屬製品構成-------A3紙、自由筆\n17.設計構想圖的表現8/亮金屬製品構成-------A3紙、自由筆\n18.期末檢定 / 作業評量 / 快速、精準、達意 /","scorePolicy":"1. 每週作品發表與繪製佔40%\n2. 每週家庭作業繪製佔40% \n3. 出席與學習態度10% \n4. 期末檢定測驗10%\n5. 作業評量標準 : 透視、陰影、背景、質感、創意、美感、圖面整體編排等綜合考量","materials":"指定教材：\n自編透視光影圖學與表現技法實務教材\n參考教材：\n1. Mark &amp; Marry Willenbrink，33個輕鬆學會畫畫的小練習，初版，木馬文化，台北，2011。 \n2. Koos eissen,Sketching，roselien steuv &amp; BIS publishers，Singapore，2007。 \n3. 秦自強，產品表現技法與設計素描作品，1975-2021。\n4. 秦自強，設計與生活、文化、創意的關係電子數位圖檔與簡報，2000-2021。\n師資簡介：\n    秦自強，2015年2月從明志科技大學工業設計系副教授退休，成立吉時六感設計工作室，擔任專業講師、公益講座、工業設計教學、專案計畫主持人與企業產品開發設計顧問等新任務，期許「去框架、尋哲理、求改變、開拓無限生命」。\n    1970年畢業於明志工業專科學校工業設計科，專長於產品設計實務、造形研究、創新設計、表現技法與設計管理實務等，曾擔任學校課外活動組長、設計服務中心主任、訓導主任、工業設計科主任、系主任與32年專任副教授等職；近年來投入橘色為善設計、積極創新設計、藍海產品設計策略研究，與盛和塾稻盛和夫的經營之道導讀，透過不斷跨越領域的學習以開拓減法設計新思維。\n    1972年度教學之外開始嘗試從Logo、商標、名片、商品型錄、包裝、印刷等領域導入設計實務工作，隨後持續學習模具射出與沖壓製造等加工技術運用於產品設計，1976年起參與台塑企業包裝改善專案、長庚醫院系列床架設計等，1980年辦理華人第一本工業設計期刊復刊，1986年起曾經擔任系內設計服務中心主任10年，與周邊產業建教合作產品研發計畫，協助廠商完成產品創新開發案計兩百餘件，累計產值約計五千萬元，並將研發成果與心得融入專題設計教學案，落實實務教學與教材研究開發，已發表之學術論文和專書約200餘篇。","foreignLanguageTextbooks":false}]
