[{"name":"朱憲國","email":"","latestUpdate":"2020-12-28 16:49:13","objective":"半導體廠營運管理及製造技術這門課分為兩個部分；營運管理部分的課程內容主要是以IE的角度，探討IE在半導體廠中可以參與什麼樣的營運活動，其內容包含如供應鏈管理、產能規劃、成本分析、預算管理、建廠專案管理及策略規劃等。第二部分介紹晶圓廠相關製造技術，包含晶圓廠概論、製程開發、模組技術、資訊技術、智慧製造、先進製程控制及錯誤偵測等。\n\n講師期藉分享自身在半導體業多年之實務工作經驗，幫助學生建立在未來進入半導體製造業之相關背景知識。\n\nThis lecture includes two segments. For “Semiconductor Operation Management”, a few popular topics will be addressed from I.E. point of view in a semiconductor company such as “Supply Chain Management”, “Capacity Planning”, “Cost Analysis”, “Budget Management”, “Construction and Project Planning” and “Strategic Planning” etc. For “Wafer Manufacturing Technology”, some state-of-the-art topics will be addressed. Included are “Introduction of wafer fab”, “Process Technology Development”, “Module Process Technology” , “IT Technology”, “Smart Manufacturing” and “Fault Detection and Classification” etc. \n\nInstructors will share their personal experiences in practice and help students to establish background knowledge before entering the industry.","schedule":"1. 半導體概論-1 (IE觀點)  Basic Concept of Semiconductor     2月25日 \n2. *半導體概論-2 (IC如何被製造出來?)  How IC is built?　　       3月4日 \n3. *半導體概論-3 (晶圓廠簡介) Introduction of wafer fab　　       3月11日 \n4. 供應鏈產銷管理-1 Demand and Production Management in SCM -1　　3月18日 \n5. 供應鏈產銷管理-2 Demand and Production Management in SCM -2　　3月25日 \n6. 標準工時與產能規劃-1  Standard Cycle Time and Capacity Planning -1　　4月1日 \n7. 標準工時與產能規劃-2  Standard Cycle Time and Capacity Planning -2　　4月8日 \n8. *製程開發及模組技術-1 Introduction of TD/Integration/Photo/Etch　　4月15日 \n      \n期中報告　　4月22日 \n\n9. *製程開發及模組技術-2 Introduction of Thin Film/Diffusion/Wet　　4月29日 \n10. 成本分析及預算管理-1   Cost Analysis and Budget Management -1　　5月6日 \n11. 成本分析及預算管理-2   Cost Analysis and Budget Management -2　　5月13日 \n12. 建廠規劃及專案管理  Fab Construction Planning and Project Management　　5月20日 \n13. 半導體資訊技術 Information Technology　　5月27日 \n14. 半導體智慧製造 Smart Manufacturing　　6月3日 \n15. * 先進製程控制與錯誤偵測及分類技術 \n         Advanced Process Control and Fault Detection and Classification　　6月10日 \n16. 策略規劃與績效管理 - Strategic Management by Objective 　　6月17日 \n\n期末報告　　6月24日","scorePolicy":"半導體專題研究, 小組期中及期未書面報告及presentation","materials":"無","foreignLanguageTextbooks":false},{"name":"簡文勝","email":"wschien@seed.net.tw","latestUpdate":"2021-03-05 18:15:26","objective":"半導體廠營運管理及先進製造技術這門課分為兩個部分；營運管理部分的課程內容主要是以IE的角度，探討IE在半導體廠中可以參與什麼樣的營運活動，其內容包含的課題如供應鏈管理、產能規劃、成本分析、預算管理、建廠及設施規劃、專案管理、策略規劃、技術移轉及開發管理以及合約及商業談判等。講師以其自身的經歷，提供給同學不同於教科書上的實務經驗。第二部分將以先進製造技術專題的方式講授，包含批次控制、虛擬量測、錯誤偵測、高混線生產等議題。\nThis lecture includes two segments. For “Operation Management”, a few popular topics will be addressed from I.E. point of view in a semiconductor company such as “Supply Chain Management”, “Capacity Planning”, “Cost Analysis”, “Budget Management”, “Construction and Facility Planning”, “Strategic Planning”, “Management in Technology Transfer and Development” and “Agreement and Business Negotiation”, etc. Instructor will share his personal experiences in practice which are quite different from the textbooks. For “Advanced Manufacturing Technology”, some state-of-the-art APC topics will be addressed. Included are “R2R Control”, “Virtual Metrology”, “Fault Detection”, “High-Mix Product Control”, among others.","schedule":"1. 半導體概論-1 (IE觀點)  Basic Concept of Semiconductor     2月25日 \n2. *半導體概論-2 (IC如何被製造出來?)  How IC is built?　　       3月4日 \n3. *半導體概論-3 (晶圓廠簡介) Introduction of wafer fab　　       3月11日 \n4. 供應鏈產銷管理-1 Demand and Production Management in SCM -1　　3月18日 \n5. 供應鏈產銷管理-2 Demand and Production Management in SCM -2　　3月25日 \n6. 標準工時與產能規劃-1  Standard Cycle Time and Capacity Planning -1　　4月1日 \n7. 標準工時與產能規劃-2  Standard Cycle Time and Capacity Planning -2　　4月8日 \n8. *製程開發及模組技術-1 Introduction of TD/Integration/Photo/Etch　　4月15日 \n      \n期中報告　　4月22日 \n\n9. *製程開發及模組技術-2 Introduction of Thin Film/Diffusion/Wet　　4月29日 \n10. 成本分析及預算管理-1   Cost Analysis and Budget Management -1　　5月6日 \n11. 成本分析及預算管理-2   Cost Analysis and Budget Management -2　　5月13日 \n12. 建廠規劃及專案管理  Fab Construction Planning and Project Management　　5月20日 \n13. 半導體資訊技術 Information Technology　　5月27日 \n14. 半導體智慧製造 Smart Manufacturing　　6月3日 \n15. * 先進製程控制與錯誤偵測及分類技術 \n         Advanced Process Control and Fault Detection and Classification　　6月10日 \n16. 策略規劃與績效管理 - Strategic Management by Objective 　　6月17日 \n\n期末報告　　6月24日","scorePolicy":"半導體專題研究, 小組期中及期未書面報告及presentation","materials":"【遵守智慧財產權觀念，請使用正版教科書，不得使用非法影印教科書】\n\n使用外文原文書：否","foreignLanguageTextbooks":false}]
