[{"name":"汪建民","email":"jimwangs@ms19.hinet.net","latestUpdate":"2020-12-14 10:18:56","objective":"本「材料分析」課程主要建構於晶體繞射學(含分子對稱)、顯微術、光譜學(含群論)三大基礎原理，旨在闡釋固態材料內部與表面的晶體結構、顯微結構和化學成分之分析技術。現代科技探究精密、準確與高解析度，本課程逐步精要剖析X光繞射儀、各式光學和電子顯微鏡、掃描探針顯微鏡、歐傑電子能譜儀、二次離子質譜儀、核磁共振波譜儀、各式光譜儀，以及其他如熱分析、同步輻射與中子分析等分析儀器，特別應用案例解析與討論，以增進對先進新穎材料的認識，使學生得以了解並深入各種常見材料分析的原理、方法及其應用。\nThis \"characterization of materials\" course is mainly based on three fundamental principles of crystal diffractometry (molecular symmetry), microscopy and spectroscopy (group theory); and aims to illustrate the characterization techniques of crystal structure, microstructure and chemical composition inside and on the surface of solid materials. Exploring precision, accuracy and high resolution of modern science and technology, this course gradually analyzes X-ray diffractometer, various optical and electron microscopy, scanning probe microscope, AES, XPS, SIMS, NMR, all kinds of spectrometers, as well as other analytical instruments such as thermal analysis, synchrotron radiation and neutron analyses. Special application case study and discussion are provided to enhance the understanding of advanced and novel materials, so that students can know well and fully utilize a variety of important materials analysis technique and their principles, methodology and proper applications.","schedule":"第1週　　Chapter 1材料分析簡介-\"Characterization of Materials\" Overview\n第2週　　Chapter 2幾何光學與顯微鏡分析-Optics, Microscopy, and OM\n第3週　　Chapter 3晶體結構分析-Structure, Diffractometry, and XRD\n第4週 　　Chapter 4微結構分析-SEM, WDS/EDS, and EBSD\n第5週 　　Chapter 5微結構分析- EPMA and FIB\n第6週 　　Chapter 6微結構分析- Analytical TEM, SAED, &amp; CBED\n第7週 　　Chapter 7表面分析-SPM (STM, AFM…) \n第8週 　　Chapter 8表面分析-AES and ESCA\n第9週 　　期中考\n第10週 　　Chapter 9表面分析-SIMS/MS and Quantum Selection Rule\n第11週 　　Chapter 10-12儀器化學分析-Spectroscopy, AAS and ICP-OES/UV-Vis \n第12週 　　Chapter 13-14儀器化學分析-Group Theory for Molecular Spectroscopy\n第13週　　Chapter 15儀器化學分析-IR, FTIR and Raman Spectroscopy /SERS\n第14週　　Chapter 16儀器化學分析-NMR Spectroscopy\n第15週 　　Chapter 17 綜合分析-Thermal Analysis (DTA, DSC, TGA….)\n第16週 　　Chapter 18-20 綜合分析-同步輻射與中子材料分析/其他\n第17週 　　Chapter 21 綜合分析-粉體材料及元件的檢測與分析  \n第18週 　　期末報告和簡報","scorePolicy":"1. [習題 + Quiz]、期中考與期末考各30%，出席與討論10%。\n2. 期末報告及簡報方式如下：\n 【期末報告：(1) 2~4人為一組，團隊合作分工：實驗(但不限) + ＞8000 字Word報告 + PowerPoint簡報；(2)文獻搜尋---與材料分析相關(不能只與單一分析XRD或SEM有關，如表面或綜合分析可)；(3)每組以碩士/博士研究論文材料為主，找相關之材料分析文獻2~4篇；(4)技術報告和上台簡報15分鐘：含前言，實驗，分析結果與討論，結論】","materials":"Lecture Note (I) &amp; (II) 和汪建民主編，“材料分析”，第二版，中國材料科學學會出版， 2014年7月。\nReference:\n1. J.H. Richardson and R.V. Peterson, Systematic Materials Analysis, Vol. I,  \n  II, III, IV, Academic Press, New York and London (1974).\n2. Materials Characterization, Metals Handbook Ninth Edition, Vol.10, Am. \n  Soc. Metals, Ohio (1986).\n3. J.P. Eberhart, Structural and Chemical Analysis of Materials, John Wiley &amp; \n  Sons, New York (1991).\n4. J. B. Wachtman and Zwi H. Kalman, Characterization of Materials, \n  Butterworth- Heinemann, Boston (1993).\n5. F. Albert Cotton, Chemical Applications of Group Theory, 3nd Ed., John \n  Wiley &amp; Sons, Inc., 1990.\n6. 汪建民編著，“ 材料分析教師手冊 ”，中國材料科學學會出版，2014年 8 月。","foreignLanguageTextbooks":true}]
