[{"name":"蒲利亞","email":"pourya@ntut.edu.tw","latestUpdate":"2021-03-31 09:57:29","objective":"此課程旨在說明決策理論之基本觀念，及其在真實世界裡相關決策問題之分析。使學生具備了解並建構決策問題，建構並推估決策之不確定性，以及建構並評估效用模式之能力。\nThis course provides an overview of the basic concepts of decision theories and their applications to real-world decision problems. The objective of this course is to help graduate students to understand the fundamentals of decision analysis. Students will learn about the problem identification and modeling, modeling and evaluation of the utility function, and conducting research in the management context. Including lectures, projects, and presentations, this course elaborates on the soft and hard Decision Analysis techniques, i.e., Multiple-criteria Decision-making (MCDM) and Optimization, which are of high significance in modern business management. By the end of the course, students should be able to apply a variety of decision analysis tools to analyze and solve real-world decision-making problems.","schedule":"Week 1: Introduction to MCDM;\nWeek 2: Structuring unknown decision scenarios using Decision-Making Trial and Evaluation Laboratory;\nWeek 3: Optimum Selection using Analytic Hierarchy Process;\nWeek 4: Optimum Selection using Analytic Network Process and the Super Decisions software;\nWeek 5: Measuring Attractiveness by a Category-Based Evaluation Technique;\nWeek 6: The concept of Fuzzy set theory and Fuzzy Inference Systems;\nWeek 7: Optimum Selection using the Technique for Order of Preference by Similarity to Ideal Solution;\nWeek 8: Peer evaluation using Data Envelopment Analysis;\nWeek 9: \nWeek 10: Term project - proposal presentation;\nWeek 11: Modeling;\nWeek 12: Linear programming – Simplex method;\nWeek 13: Linear programming – Big M;\nWeek 14: Linear programming – Dual;\nWeek 15: Final evaluation; \nWeek 16: Term project - final presentation;","scorePolicy":"Presentation, assignments, and participation in the learning activities (20%)\nFinal exam (30%)\nTerm project (50%)","materials":"1. Gwo-Hshiung Tzeng, and Jih-Jeng Huang. Multiple attribute decision making: method and applications. CRC, 2011; Mokhtar S. Bazaraa, John J. Jarvis, Hanif D. Sherali, Linear Programming, and Network Flows, 4th Edition.\n2. The relevant academic papers.","foreignLanguageTextbooks":true}]
