[{"name":"楊神珠","email":"Pearlinself@gmail.com","latestUpdate":"2021-02-05 01:25:22","objective":"本課程探討產業發展歷程中，產業文化資產的出現、保存與再利用等課題。\n透過文獻研讀、議題討論、國內外個案研討、實地參訪、參與學術研討會、作業報告等方式。\nThis course introduces the issues of the appearance, preservation, and reuse of industrial Cultural Heritage in the process of industrial development. Through the literature study, discussion topics, domestic and foreign case studies, field visits, participation in academic seminars, job reports, etc.,","schedule":"Week 1:     Class Introduction (prepare for paper publishing)\nWeek 2:     Understanding the definition of Creative Industry (including Cultural Heritage)\nWeek 3:     The Development of Creative Industry (including Cultural Heritage)\nWeek 4:     Why the Creative Industry Matter to Economic Evolution?\nWeek 5:     Review Unit\n\nWeek 6:     The Paradigm Shift from Cultural Industry to Cultural Creative Industry (Value Chain ) \nWeek 7:     The Paradigm Shift from Cultural Industry to Cultural Creative Industry (Organizational Units, and Creative Management) \nWeek 8　　Management and Creativity: How to manage Creative Deviants\nWeek 9　　Management and Creativity: The Balance of Creativity and Rationality\nWeek 10　　Review Unit\n\nWeek 11　　Cultural Heritage Marketing Strategy\nWeek 12　　Cultural Heritage Recreation Development\nWeek 13　　How to Apply Cultural Heritage Intellectual Property\nWeek 14　　Site Visit: NPM\n\nWeek 15　　Group Presentation for NPM tour\nWeek 16　　Planned Published Case Study (Real case)\nWeek 17　　Discussion on published paper (Theory-based)\nWeek 18　　Final Exam","scorePolicy":"1. 3-4people in a group.\n2. Absence / Leave notice is required in advance, the document is provided by the company or by the school. Sick leave notice by a doctor provided later.\n3. Group presentation will be required for each class for the wrap-up of the previous class.\n4. 360 degrees evaluation at the end of the class by peers\n\nScores:\nMid Term 25%　　Group presentation\nFinal        25%　　Paper Exam + Group presentation \nParticipation 50%　　\nAsking a question for gaining more participation scores\nAbsence w/o notice 2.5% if 10 times absence = 25%\nAllow for 2 times work or school business. (proof needed)\nClass Quiz + Presentation = 25%,","materials":"楊神珠 (2015). 創意產業研究主分析與趨勢發展. 中國文化產業評論, 2 期, 43-60. \n楊神珠 (2016). 創意產業中數位經濟授權策略模式之探討與參考:以國際LIMA組織為例. Peking University Cultural Industries Review, 4 期(13), 264-277. \nBilton, C. M. M. (2007). \"Management and creativity. \nKotler, N. G., Kotler, P., and Kotler, W. I. (2008). Museum marketing and strategy: designing missions, building audiences, generating revenue and resources. New Jersey: John Wiley &amp; Sons.\nLampel, J., and Germain, O. (2016). Creative industries as hubs of new organizational and business practices. In. UK: Elsevier.\nThrosby, D. (2001). Economics and Culture. New York: Cambridge university press.","foreignLanguageTextbooks":true}]
