[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2020-12-22 10:51:31","objective":"‘Analysis and decision making using data’ course deals with various analysis and decision-making techniques using data. Recent years have seen an explosion of the amount of data available to everyone, and making sense of that data has become an operational imperative. The tools of statistics are one of the ways we can make sense of the data and use it to make more effective decisions. So, this course focuses on information and data engineering, computational reasoning applied, and enterprise decision management to the design of decision support systems, information extraction, and data mining. It implements the use of computers to discover patterns in data. Thus, in this course we will introduce the concepts of descriptive and inferential statistics, several efficient prediction techniques such as regression analysis, and their use in decision making.","schedule":"Week 1 Introduction to data analysis for decision-making\nWeek 2 Basic statistics Part I: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 3 Basic statistics Part II: Random variables, mean, median, standard deviation, variance, correlation, covariance \nWeek 4 Basic statistics Part III: Hypothesis tests\nWeek 5 Basic statistics Part IV: Hypothesis tests\nWeek 6 Simple linear regression – Part I\nWeek 7 Simple linear regression – Part II\nWeek 8 Simple linear regression – Part III\nWeek 9 Interim presentation of individual project and submission of interim report\nWeek 10 Multiple linear regression – Part I\nWeek 11 Multiple linear regression – Part II\nWeek 12 Multiple linear regression – Part III\nWeek 13 Paper discussion – Part I\nWeek 14 Paper discussion – Part II\nWeek 15 Paper discussion – Part III\nWeek 16 Presentation I\nWeek 17 Presentation II\nWeek 18 Presentation III","scorePolicy":"1. Attendance: 10%\n2. Assignment : 30 %\n3. Individual or group projects: 60%","materials":"(1) Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)\n(2) Data analysis and decision making , 4th Ed. by Albright, Winston, and Zappe\n(3) Introduction to Linear Regression Analysis 5th Edition by Douglas C. Montgomery, Elizabeth A. Peck, G. Geoffrey Vining","foreignLanguageTextbooks":true}]
