[{"name":"曹筱玥","email":"sytsau@ntut.edu.tw","latestUpdate":"2020-12-23 22:46:32","objective":"有鑒於國內的教育制度主張男女擁有平等的權利，但實際結果卻是女學生在理工科系方面成為少數族群，本課程以增進女性參與人機互動為主要目標，結合一連串的研習營教學與展示技術的引入，教導有關互動科技技術等相關應用，並透過了解性別研究的主要流派與其理論，來確認性別研究與互動設計的性質與功能，期待學生能再了解性別研究的主要理論後，能把它應用於互動設計以及創意發想上，以因應未來女性經濟力的快速掘起。\nThe education system of Taiwan claims that men and women are equal. The truth is that female students are only a minority of the department of the science and engineering, not to mention the percentage of the further education in this field. Based on this concept, we plan the interactive curriculum. We will go to give instruction about the interactive technology. In order to test the spot reaction and track the reaction after the exhibition when the exhibition is ongoing, we will apply Radio-frequency identification. The outdoor education and the indoor education; the two complement each other and expecting this exhibition to encourage more female students to discovery the science and have better achievements in this field.","schedule":"第一週：課程概述 + 閱讀導論與分配作業 + 購買指定書籍 \n\n第二週：參觀展覽\n\n第三週：閱讀心得報告＿女性主義理論與流派\n            1.自由主義女性主義-------------- \n            2.馬克思主義女性主義 -----------\n            閱讀心得報告＿夏娃經濟學\n            1.第一章：麥當勞 --------------- \n            2.第二章：家庭倉庫 --------------\n\n第四週：閱讀心得報告＿女性主義理論與流派\n            1.存在主義女性主義 ------------- \n            2.基進女性主義 ----------------\n            閱讀心得報告＿夏娃經濟學\n            1.第三章：寶鹼公司-------------- \n            2.第六章：耐吉 ----------------- \n \n第五週：論文分享＿楊元綺: 女性的GPS介面設計\n\n第六週：閱讀心得報告＿女性主義理論與流派\n            1.精神分析女性主義 ------------ \n            2.當代社會主義女性主義 --------\n            閱讀心得報告＿夏娃經濟學\n            1.第四章：鑽石 ------------------\n            2.第五章：柯達 ------------------\n\n第七週：性別議題研究題目報告 （一人一頁A4大綱）\n\n第八週：論文分析與批判，共五篇(一人一頁A4分析)\n\n第九週：參觀 珠寶設計工作室 + 金工手作\n\n第十週：演講＿廖祈羽-我的女性錄像裝置創作\n\n第十一週：Her Room 攝影展參訪\n\n第十二週：期末報告初稿~ ppt報告\n               學姊 黃詣絜分享交換學生心得\n\n第十三週：演講：徐玟玲-草間瀰生的精神分析論述\n\n第十四週：參觀女性藝術家工作室\n\n第十五週：論文撰寫\n\n第十六週：繳交期末報告","scorePolicy":"1.出席並有閱讀指定書籍（20％）\n2.師生共同討論其理論產生背景、主要論點及其理論優點與限制。（30％）\n3.各自尋找研究主題，以互動設計或數位藝術作品為例，提出分析之期末報告（50％）","materials":"1.女性主義理論與流派，顧燕翎主編，女書店出版\n2.夏娃經濟學，法拉.華納著，邱如美譯，天下文化出版\n3.She Maker: 女力創客的自造年代，曹筱玥著，全華出版\n4.碩士論文\n5.部分英文期刊","foreignLanguageTextbooks":false}]
