[{"name":"鄭建文","email":"ondinecomposer2@hotmail.com","latestUpdate":"2021-04-02 01:48:34","objective":"本課程主要介紹聲音設計與電子音樂的製作技巧，透過介紹音訊編輯的技術、相關聲音設計工具的使用，學習創意的聲音設計與電子音樂製作。課程當中，除了聲音設計的工具介紹之外，並教導學生使用 Ableton Live 序列器軟體，搭配 Max for Live 的聲音設計工具，讓使用者可以在序列器中使用自己所設計的軟體合成器與數位位效果器，進而可延伸至多媒體、遊戲、新媒體展演等之音樂與音效應用。此外，本課程亦將結合「自適性音樂」的技術，透過中介軟體 FMOD 與遊戲引擎 Unity 進行結合，建立自適音樂的雛形架構，作為互動設計的音樂設計依據。\n\nThis course mainly introduces sound design and electronic music production tools and skills. Through the introduction of audio editing technology and the use of related sound design tools, students can learn creative sound design. In the course, students are taught to use the Ableton Live sequencer software, combined with its sound design tools in Max for Live, to design their own software synthesizers and digital effects to be used in the sequencer. These skills may be used in multimedia design, game audio, new media performances, and etc. In addition, this course will also cover the concept and technology of \"adaptive music\", integrating the middleware FMOD into the game engine Unity to establish a prototype framework of adaptive music for interactive design.","schedule":"第一週：課程導論、數位音樂簡介、自適音樂簡介\n第二週：Ableton Live 簡介、session view、quantization\n第三週：旋律的設計原則、大調音階與和弦。Session View to Arrangement View、quantization、隨機播放（follow）。\n第四週：小調音階與和弦、音樂製作軟體流程、效果器串接法、延遲效果器、MIDI 效果器\n第五週：合成器架構簡介\n第六週：drum rack、macro 自動化控制\n第七週：drum rack 練習、wavetable synthesis、自動編曲軟體簡介\n第八週：進階和弦進行理論（一）、自動編曲軟體之整合運用\n第九週：進階和弦進行理論（二）、自動編曲軟體之整合運用\n第十週：期末製作企劃提案、期中作業\n第十一週：Max for Live 簡介（一）\n第十二週：Max for Live 簡介（二）\n第十三週：Max for Live 簡介（三）\n第十四週：Adaptive Music 簡介、FMOD 與 Unity 遊戲引擎之安裝設定\n第十五週：Adaptive Music 之雛形建構 - Vertical Re-sequencing\n第十六週：Adaptive Music 之雛形建構 - Horizontal Re-sequencing\n第十七週：期末專案製作實務\n第十八週：期末作品呈現","scorePolicy":"課堂參與 30%,  期中報告與作品呈現 30 %，期末自適性遊戲音樂作品呈現 40 %。","materials":"參考書目：\n1. Writing Interactive Music for Video Games: A Composer's Guide\nhttps://www.amazon.com/Writing-Interactive-Music-Video-Games/dp/0321961587\n2. Principles of Game Audio and Sound Design\nhttps://www.amazon.com/Principles-Game-Audio-Sound-Design/dp/1138738972/ref=sr_1_1?dchild=1&amp;keywords=game+audio&amp;qid=1607837479&amp;s=books&amp;sr=1-1","foreignLanguageTextbooks":false}]
