[{"name":"張文中","email":"wchang@ntut.edu.tw","latestUpdate":"2020-12-09 12:04:08","objective":"This Advanced Robotics and Automation Applications (ARAA) course is offered only for upto 28 graduate students with programming experience.  In addition to lectures on robotic manipulation, ARAA also focuses on projects with mobile robots and manipulators in the topics of interest related to:\n高等機器人與自動化應用(ARAA)適合研究生修習，因設備因素以28人內為宜，須具備程式能力。除教授機器人學外，亦聚焦於移動式機器人與機械手臂專題，相關主題如下：\n1. Spatial descriptions and transformations 空間描述與數學轉換 \n2. Manipulator kinematics 機械手臂運動學 \n3. Manipulator inverse kinematics 機械手臂反向運動學\n4. Linear control of manipulator 機械手臂之線性控制 \n5. Project topics: manipulator and mobile robot control, and robot control system based on visual sensing 專題項目：機械手臂及移動式機器人操控、結合視覺感測之機器人控制系統。","schedule":"The order of lectures and projects may be adjusted according to course needs.  \n下列授課內容及專題得視實際狀況調整順序\n1st Week 第1週. Introduction 簡介\n2nd Week 第2週. Spatial Descriptions &amp; Transformations 空間描述與轉換\n3rd Week 第3週. Representations for Orientation 方位取向表示\n4th Week 第4週. Forward Kinematics 順向運動學\n5th Week 第5週. Inverse Kinematic 逆向運動學\n6th Week 第6週. Jacobian &amp; Static Force 賈可比矩陣及靜力\n7th Week 第7週. Manipulator Dynamics 機械手臂動力學 (offered if needed and time is allowed)\n8th Week 第8週. Trajectory Generation and control of manipulators 軌跡規劃與機械手臂控制  (offered if needed and time is allowed)\n9th Week 第9週. Project: Vision-Based Control of Mobile Robots #1 移動式機器人視覺控制專題 #1\n10th Week 第10週. Project: Vision-Based Control of Mobile Robots #2  移動式機器人視覺控制專題 #2 \n11th Week 第11週. Project: Manipulator Control #1 機械手臂操控專題 #1\n12th Week 第12週. Project: Manipulator Control #2 機械手臂操控專題 #2\n13th Week 第13週. Project: Manipulator Control #3 機械手臂操控專題 #3\n14th Week 第14週. Final Project (1/3)  期末專題 (1/3)\n15th Week 第15週. Final Project (2/3)  期末專題 (2/3)\n16th Week 第16週. Final Project (3/3)  期末專題 (3/3)\n17th Week 第17週. Final Presentation and Demo 期末簡報及展示","scorePolicy":"The final grade will be a weighted average of attendance and homework and quiz 40%, projects 40%, and final project 20%.","materials":"Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company.\n\nRobotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke\nPublication Year: 2013 | ISBN 3642201431 | 1st Edition","foreignLanguageTextbooks":true}]
