[{"name":"林榮禾","email":"rhlin@ntut.edu.tw","latestUpdate":"2021-02-15 12:18:53","objective":"本課程旨在探討供應鏈管理相關之基本議題。供應鏈管理係從供應商、製造商到最終顧客，對整個製造與配銷通路的整合性管理策略。本課程內容包含供應鏈管理之策略發展、供應鏈管理之相關功能、及供應鏈管理之主要困難點。本課程將同時探討與供應鏈管理相關之議題，如存貨理論、資訊系統整合、及供應契約等。本課程理論與實務並重、案例研討也將為本課程重要之一環。\nThis course intends to introduce fundamental issues regarding supply chain management. Supply chain management is an integrated approach to manage the total flow of manufacturing and distribution channel from supplier to ultimate customer. The contents of this course include the development of supply chain management strategies, supply chain management functions, and major challenges of supply chain management. Certain topics related to supply chain management, such as inventory policy, information system integration, and supply contract will also be addresses. This course focuses on both theoretical and practical issues. Real world case study will be an important part of this course.","schedule":"1~2　　供應鏈管導\n3~4 存貨管理與風險共擔\n5~6　　供應鏈網路規劃 \n7~8　　資訊的價值\n9　　供應鏈整合\n10　　期中考\n11　　配銷策略\n12　　策盟\n13　　採購及外包策\n14　　全球物流與風險管理\n15　　協同產品與供應鏈設計\n16　　顧客價值\n17~18　　期末報告","scorePolicy":"出席　　           15\n課堂討論/小考  15\n期中考　　           25\n作業　　           15\n期末報告           30\n■分數調整：於期末做適度地分數調整，調整幅度以整體學生分數分布狀況及參與率調為準，每一項目(1~4項評分準則)調整範圍以±5%為原則。","materials":"1.呂錦山等， 國際物流與供應鏈管理，滄海書局\n2. 陳世良審訂，2010，供應鏈管, 4rd Edition, Prentice Hall.\n3. 課堂講義","foreignLanguageTextbooks":false},{"name":"莊淳淩","email":"clchuang@mail.knu.edu.tw","latestUpdate":"2021-02-15 12:40:18","objective":"在現今產業激烈競爭與利潤微薄之階段，落實執行\"系統化創新\"是企業不可或缺的競爭策略及唯一的生存之道，但鮮少有企業真正瞭解與實際地應用。本課程以TRIZ創新方法為基礎，詳細的介紹系統性創新理論及實務的解題手法及落實創新方法之實務應用，可以很有系統地帶領學生們拓展革新思維，有效及系統化之應用於各種產業。讓學生也有機會應用於生活問題的解決。","schedule":"1~2　　供應鏈管導\n3~4 存貨管理與風險共擔\n5~6　　供應鏈網路規劃 \n7~8　　資訊的價值\n9　　供應鏈整合\n10　　期中考\n11　　配銷策略\n12　　策盟\n13　　採購及外包策\n14　　全球物流與風險管理\n15　　協同產品與供應鏈設計\n16　　顧客價值\n17~18　　期末報告","scorePolicy":"出席　　           15\n課堂討論/小考  15\n期中考　　           25\n作業　　           15\n期末報告           30\n■分數調整：於期末做適度地分數調整，調整幅度以整體學生分數分布狀況及參與率調為準，每一項目(1~4項評分準則)調整範圍以±5%為原則。","materials":"1.呂錦山等， 國際物流與供應鏈管理，滄海書局\n2. 陳世良審訂，2010，供應鏈管, 4rd Edition, Prentice Hall.\n3. 課堂講義","foreignLanguageTextbooks":false}]
