[{"name":"陳文學","email":"wschen@ntut.edu.tw","latestUpdate":"2021-03-04 20:55:52","objective":"This course intends to introduce the mathematical principles and practices that today\\'s engineers need to know. The course contents are: Ordinary Differential Eqs: 1st order, 2nd order and higher order ODEs. Laplace transform, series solution, special function, vector analysis, Fourier analysis and partial differential equations.\n本課程將介紹工程上、物理上系統解析的相關數學工具，內容包括：\n一 常微分方程式：一階、二階及高階常微分方程，拉譜拉斯轉換，特殊函數\n二 級數解\n三 向量幾何與分析\n四 傅立葉級數\n五 偏微分方程式","schedule":"Week 1 Introduction; Vector Functions of One Variable, Velocity and Curvature\n第1週　　課程介紹；單變數之向量函數、速度、曲率\nWeek 2 The Gradient Field, Divergence and Curl\n第2週　　梯度場、散度及旋度\nWeek 3 Line Integrals, Green’s Theorem\n第3週　　線積分、格林定理\nWeek 4 Independence of Path and Potential Theory\n第4週　　與積分路徑無關之線積分及位能定理\nWeek 5   Surface Integrals, Applications of Surface Integrals, Gauss’s Divergence Theorem, Stokes’s Theorem\n第5週　　面積分、面積分的應用；高斯散度定理、史托克定理\nWeek 6  Compensatory Holiday for  Children's Day\n第6週　　兒童節補假\nWeek 7  Fourier Series on [–L, L], Fourier Sine and Fourier Cosine Series\n第7週　　區間–L～L的傅立葉級數、傅立葉正弦與餘弦級數\nWeek 8 Properties of Fourier Coefficients, Phase Angle Form, Complex Fourier Series\n第8週　　傅立葉係數、相角型式的傅立葉級數、複數型的傅立葉級數\nWeek 9 ※The Fourier Integral, Fourier Cosine and Sine Integrals, ※The Fourier \nTransform; Mid-term Exam.\n第9週　　傅立葉積分、傅立葉正弦與餘弦積分式、傅立葉轉換；期中考試\nWeek 10 Diffusion Problems in a Bounded Medium\n第10週　　有界介質的擴散問題\nWeek 11 The Heat Equation with a Forcing Term F(x, t) and on the Real Line\n第11週　　具有強迫項F(x, t)與實數線上的熱傳方程式\nWeek 12 The Two-Dimensional Heat Equation\n第12週　　二維度的熱傳方程式\nWeek 13 Wave Motion on a Bounded Interval\n第13週　　有界區間之波的運動\nWeek 14 Wave Motion in an Unbounded Medium\n第14週　　無界介質之波的運動\nWeek 15 The Wave Equation with a Forcing Term K(x, t)\n第15週　　具有強迫項K(x, t)的波動方程式\nWeek 16 The Dirichlet Problem for a Rectangle and Disk\n第16週　　矩形與圓盤之Dirichlet的問題\nWeek 17 The Dirichlet Problem for a Rectangle and Disk\n第17週　　矩形與圓盤之Dirichlet的問題\nWeek 18 Final Exam.\n第18週　　期末考試","scorePolicy":"1. Homework 作業  20%\n2. Attendance 出席  20%\n3. Mid-term exam.  期中考試  30%\n4. Final exam.  期末考試  30%","materials":"Textbook: Advanced Engineering Mathematics   8th SI Custom Solutions Edition\n           Peter V. O’Neil \nReference Book：Differential Equations with Boundary-Value Problems 7th Ed.\n               Dennis G. Zill and Michael R. Cullen","foreignLanguageTextbooks":true}]
