[{"name":"林榮禾","email":"rhlin@ntut.edu.tw","latestUpdate":"2020-12-22 17:22:14","objective":"近年來企業為面對市場競爭的挑戰與快速改變，其經營管理活動多以專案方式來執行，以致企業各部門工作皆與專案管理息息相關，如：產品研發、行銷規劃、生產製造、教育訓練及企業經營管理等活動，多以專案方式來執行。 本課程將對於企業內全方位專案管理流程做一概述，並安排企業實例做為案例探討。課程針對研發、採購、行銷及行政專案管理等之五大流程 (起案、規劃、執行、監控、結案)及十大知識領域 (整合、範圍、時間、成本、品質、人資、溝通、風險、採購、關係人) 與各流程中所使用的技能與工具做說明與介紹。此課程之內容包含全面專案管理觀念知識的建立與應用，並著重企業全方位的相關專案實務案例講解。使其瞭解專案管理在產業界重要性，企業研究發展的正確方向，以達產學合一，並分享最新觀念與實務。\nRecently, facing the marketing challenges and rapid changes, the company's business management activities are mostly carried out in a project-based manner, all departments are closely related to project management and carried out on a case-by-case basis. This course will provide an overview of the full-scale project management process within the company, and arrange enterprise practice as a case study. The course covers five major processes and ten areas of knowledge (integration, scope, time, cost, quality, human resources, communication, risk, procurement). The content of this course is based on the concept knowledge and focuses on the company's comprehensive (product R&amp;D, marketing planning, manufacturing, and training program) case study. To make attendants understand the importance of project management in the industry to achieve the unity of production and learning, and to share the newest concepts and practices.","schedule":"一般活動專案\n行銷專案\n研發專案\n採購專案","scorePolicy":"■平時作業成績：30% ■課堂討論報告： 25％ \n■期中報告：15％ ■期末報告：30％","materials":"暫定\n\n魏秋建 1. 專案管理知識體系，2. 行銷專案管理知識體系，3. 研發專案管理知識體系，4. 採購專案管理知識體系，五南書局","foreignLanguageTextbooks":false},{"name":"黃乾怡","email":"jayhuang@ntut.edu.tw","latestUpdate":"2020-12-24 20:35:24","objective":"近年來企業為面對市場的競爭與快速改變，其多以大型專案方式同時來執行幾個專案，如：產品研發、行銷規劃、生產製造及教育訓練等專案活動。大型專案管理要如何才能在企業統一的願景和策略下展開，來提升企業的競爭優勢與創造價值。因大型專案的時程較長且範圍較多，其不確定性和混淆性也較高，以致其成功的關鍵除須具備專案的執行的效率外，還須具有在於對變化的反應能力。\n本課程內容將著重於介紹大型專案規劃流程中所使用的技能與工具說明外，並安排學生企業內大型專案實務案例做為課堂內探討。其目的在訓練學生如何面對高混淆性和高不確定性的大型專案，使企業內大型專案管理有系統的方法執行與圓滿完成。\nRecently, in order to face the challenges and rapid changes of the competition, enterprises often need have a large-scale project to execute several projects at the same time, such as product development, marketing planning, manufacturing, and education and training. How can large-scale project management be carried out under the unified vision and strategy of the enterprise? New capabilities and cultural consensus are needed to enhance the enterprise's competitive advantage and create value. Due to the long duration and large scope of large-scale project, its uncertainty and confusion are also high, so that the key to its success must be not only the efficiency of project execution, but also the ability to respond to changes.\nThis course will focus on introducing the skills and tools used in the large-scale project, and arranging large-scale project practical cases in student companies as classroom discussions. Its purpose is to train students how to deal with large-scale project wit","schedule":"專案選擇\n考量財務相關準則進行評估\n預估專案時間及成本\n了解專案之不確定性\n進行風險管理\n探討可能影響專案的風險清單\n作專案排程\n取得資源確保專案的可行性及效益，俾使專案如期完成。","scorePolicy":"作業","materials":"自編講義","foreignLanguageTextbooks":false}]
