[{"name":"王謹誠","email":"chincwang@ntut.edu.tw","latestUpdate":"2021-01-13 14:05:04","objective":"本課程涵蓋通過傳導，對流和輻射傳熱的熱傳輸過程。 本課程強調適用於工程熱分析的基本工程科學原理。學生將學習如何應用能量守恆來使用控制體積，並通過數學公式（包括穩態和暫態分析）來表達能量守恆，重點是與傳熱相關的基礎物理學和基礎數學。\nThis course covers thermal transport processes via conduction, convection, and radiation heat transfer. This course stresses fundamental engineering science principles applied to engineering thermal analysis. Students will learn to apply the conservation of energy to control volumes and express the conservation of energy through mathematical formulations, including both steady state and transient analyses, with emphasis on the fundamental physics and underlying mathematics associated with heat transfer.","schedule":"第01週 計算流體力學\nWeek01 CFD basics and ANSYS Fluent Introduction\n第02週 熱傳簡介\nWeek02 Introduction to heat transfer and rate laws\n第03週 傅立葉定律\nWeek02 Fourier’s Law and heat diffusion equation\n第04週 能量守恆\nWeek04 Rate equations and conservation of energy\n第05週 熱傳導簡介\nWeek05 Introduction to conduction\n第06週 一維熱傳導\nWeek06 One-dimensional steady-state conduction\n第07週 二維熱傳導:有限差分法\nWeek07 Two-dimensional steady state heat transfer: Finite difference method\n第08週 暫態熱傳導\nWeek08 Transient conduction, lumped capacitance method\n第09週 期中報告\nWeek09 Midterm \n第10週 邊界層簡介\nWeek10 Introduction to boundary layers\n第11週 外部流熱傳\nWeek11 Introduction to external flow heat transfer\n第12週 內部流熱傳\nWeek12 Introduction to internal flow heat transfer\n第13週 自然熱對流\nWeek13 Introduction to natural convection\n第14週 相變化熱傳\nWeek14 Introduction to phase change heat transfer\n第15週 熱輻射簡介\nWeek15 Introduction to radiation heat transfer\n第16週 輻射熱交換\nWeek16 Radiation exchange between surfaces\n第17週 輻射熱交換\nWeek17 Radiation exchange between surfaces\n第18週 期末報告\nWeek18 Final","scorePolicy":"出席 Attendance  20%\n作業 Homework 40%\n期中報告 Midterm  20%\n期末報告 Final  20%","materials":"教科書: Principles of Heat and Mass Transfer, F.P. Incropera, D.P. DeWitt, T.L. Bergman, and A.S. Lavine, Global Edition (John Wiley &amp; Sons, 2017), ISBN: 978-1-119-38291-1\n\n參考書: 熱傳遞, 侯順雄;林松浩;張仲卿, 高立圖書, 2006, ISBN 986-412-272-X","foreignLanguageTextbooks":true}]
