[{"name":"曾俊儒","email":"ktseng@pddlab.org","latestUpdate":"2020-12-18 16:22:26","objective":"本課程主要是要讓學生對醫學設計之基本理論及實務內容有所認識。了解一個健康醫療產品/系統/服務從醫學及使用者需求的思維、如何發展到設計理念之形成、設計內容之導入實現、工程技術之開發、原型機製作、臨床前測試、臨床試驗、醫療認證、及工業管理等層次。讓學生能掌握跨領域之醫學設計原理，並教導如何藉由創新產品設計與開發方法引導醫學背景與設計背景之專業人士合作以瞭解開發市場上成功之健康醫療產品之關鍵課題、針對臨床服務需求，提出健康醫療創新解決方案。進而產生創新健康醫療產品。\nThis course aims to teach postgraduate students to understand the basic theory and practice of medical design. Learn about the health and medical products/ systems/ services from the discovery of medical and user needs to the design of innovative healthcare products, which include the topics of how to generate the design concepts, understand the user and market needs, develop the engineering technologies and prototype, design pre-clinical testing and clinical trials, obtain medical certification and plan industrial management. To enable students to master the principles of interdisciplinary medical design, and teach them how to use innovative product design and development approach to guide professionals in medical backgrounds and design backgrounds to understand the key issues in developing successful health medical products in the market and address the needs of clinical services, propose innovative solutions for health care, and develop innovative health and medical products.","schedule":"針對學生在修習本課程後的主要教學目標及進度總結如下：\n•　　了解醫療設備，系統和服務所對應組合療法的產品開發過程。\n•　　了解新設備、系統和服務組合的監管批准程序和主要監管機構。\n•　　了解臨床前開發，臨床開發和擴大生產規模的過程在產品開發中的作用。\n•　　了解在醫療領域成功開發產品所必需的技術因素和商業因素。\n•　　認知新穎醫療產品的倫理，社會和文化考慮。\n•　　了解新興的醫療產品類別。\n•　　學習分析和批判當代醫療產品開發的真實案例。\n•　　在課程結束時，學生將為新的醫療產品提出有遠見的概念和商業化策略。\n\nThe primary learning goals of the course are summarised as follows:\n•　　to learn the product development process for medical devices, systems and services combination therapies.\n•　　to learn the regulatory approval process and key regulatory agencies for new devices, systems, and services combinations.\n•　　to understand the roles of preclinical development, clinical development, and manufacturing scale-up processes in product development.\n•　　to appreciate the technical factors and business factors that are necessary for successful product development in the medical sector.\n•　　to appreciate ethical, social, and cultural considerations for novel medical products.\n•　　to understand emerging medical product categories.\n•　　to learn to analyze and critique contemporary real-world cases of medical product development.\n•　　By the end of the course, students will generate visionary concepts and commercialization strategies for new medical products.","scorePolicy":"課程參與：25%；課程報告：50%；課程發表：25%。\n\nAssignments:　　50%\nClass participation:          　　25%\nFinal presentation:　　25%","materials":"•　　Reading pack.\n•　　Paul G. Yock, Stefanos Zenios, Josh Makower, Todd J. Brinton, Uday N. Kumar, F. T. Jay Watkins, Lyn Denend, Thomas M. Krummel, Christine Q. Kurihara (2015) “Biodesign: The Process of Innovating Medical Technologies,” 2ND Edition, Cambridge University Press.","foreignLanguageTextbooks":true}]
