[{"name":"周國村","email":"gtjou.0219@ttri.org.tw","latestUpdate":"2020-12-14 18:54:43","objective":"本課程主要在介紹天然纖維如棉花或羊毛與人造纖維紗線製程技術；因應國際環保永續趨勢，也會結合功能性與永續纖維材料，以降低對環境衝擊，減少二氧化碳溫室氣體排放，減緩全球暖化現象。此外，因應數位轉型，智慧科技與人工智慧(AI)產業化的應用，本課程亦將介紹最新國內外智慧紡織科技導入成功案例。另，本課程也會讓學生針對全球知名品牌如Nike, Adidas, UA, Patagonia等，進行高科技功能性紗線與紡織品相關文獻研讀，於課堂上分享心得報告，互相評分。本課程希望藉由教學相長，使學生的學習與實際生活結合。\n\nThe course is designed to introduce natural fibers such as cotton and wool, and man-made fiber yarn spinning technology. To align with global environmental sustainability issue, the application of sustainable materials in the process will be addressed, to lower the environmental impacts, to reduce the CO2 emission, and to mitigate the phenomena of global warming effect. Additionally, to catch up with the trends of digital transformation, industrialization of internet of things (IoT), and artificial intelligent (AI), the course is intended to introduce some of success companies who have demonstrated their state-of-art machinery or products in international exhibition fairs. The students are also asked to study the literature of the hi-tech functional textiles developed by the global brands such as Nike, Adidas, UA, Patagonia etc., and to present in the class to share their insight and findings. The aim of this course is to inspire students to apply what you learn in the course to the practice.","schedule":"Week 1         課程介紹\nWeek 2-3      紡織概論與趨勢\nWeek 4-5      棉系工程\nWeek 6-7      毛系工程\nWeek 8-9      環保回收工程\nWeek 10-11  考前複習與期中考\nWeek 12-13  專題報告\nWeek 14-15  新式紡紗工程\nWeek 16-17  假撚加工\nWeek 18        期末考","scorePolicy":"評量標準：\n上課          20 %\n期中考      30%\n專題報告  20%\n期末考      30%","materials":"1.　　紡紗工程基礎，蔡宜壽編，國彰出版社\n2.　　新式紡紗學導論，姚興川 編譯，永大書局\n3.　　紡織品入門手冊第三版，紡織產業綜合研究所出版發行\n4     Peter R. Lord, Handbook of Yarn Production, Technology, Science and economics, Textile Institute, Woodhead Publishing Limited, 2003.\n5.　　J.W.S. Heard, L. Hollick and D.K. Wilson, Yarn Texturing Technology, The Textile Institute, Woodhead Publishing Limited,,2001.","foreignLanguageTextbooks":true}]
