[{"name":"吳景龍","email":"michaelwu@ntub.edu.tw","latestUpdate":"2020-12-10 20:47:55","objective":"本課程著重教導學生閱讀文章，並藉由文章訓練學生字彙建構、語言解析及聽力會話、思維啟發能力。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。\n\nThe course provides students with explicit skills-based instruction in learning how to process, and decipher the readings that serve as springboards for reading skills development, vocabulary building, language analysis, and thought-provoking discussions. The readings include a variety of viewpoints on global topics centered around social issues, the environment, psychology, business, and technology. Extension activities are designed to encourage students to go beyond the reading text, and to put what they acquire from the readings into listening, speaking and writing practices.","schedule":"Syllabus 課程表:\nWeek 1: Introduction \nWeek 2: Inventions and Inventors: Lesson 1-2\nWeek 3: Inventions and Inventors: Lesson 2-3 \nWeek 4: Sports: Lesson 1-2\nWeek 5: Sports: Lesson 2-3 \nWeek 6: Food: Lesson 1-2\nWeek 7: Food: Lesson 2-3\nWeek 8: Review\nWeek 9: Midterm Exam or Report.\nWeek 10: Mysteries: Lesson 1-2\nWeek 11: Mysteries: Lesson 2-23\nWeek 12: Money: Lesson 1-1\nWeek 13: Money: Lesson 2-3\nWeek 14: Business: Lesson 1-2 \nWeek 15: Business: Lesson 2-3\nWeek 16: People: Lesson Lesson 2\nWeek 17: Out and About: Lesson 2\nWeek 18: Final Exam or Report.","scorePolicy":"Percentile of final grades 成績配分:\n1. Midterm exam:  20 %\n2. Final exam or report: 20%\n3. Attendance: 20%\n4. Assignmnets and participation in the classroom discussions: 20 % (Note: five absences leading to failure)\n5. English proficiency test: 20%\n備註:本課程十八周之教學內容、進度、方法及成績評量方式等，除了校定不可更改之內容外，均為預期計畫。實際之教學內容、進度、方法及成績評量方式等，會依教師實際授課狀況及同學學習成效而定，教師保留彈性調整之權力。(Adjustments are made according to instructor's actual teaching schedule and students’ classroom performance and learning outcomes.)","materials":"Textbook: Reading and Vocabulary Development 2\nAuthors: Patricia Ackert; Linda Lee; Harry Haynes; Jessica Beck\nPublisher: National Geographic Learning, a Cengage Company (文鶴出版有限公司代理)\nISBN: 978-981-48-9657-3","foreignLanguageTextbooks":true}]
