[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2021-02-19 12:14:55","objective":"本課程將帶領學生學習英文文法、型態、及段落的基本技巧。學生可以運用這些技巧來寫出關於新聞及網路時事的短評。學生在本課程中需要寫出多種英文句型正確的語句以及各種類型的短評，如其他國家、全球化、商業、政治等。學生可以運用這些技巧而獨立寫出任何主題的英文文章。\nIn this course students will be introduced to fundamental rules of English grammar, style, and paragraphing; students will apply those skills to short writings about current events in the news and from the internet. The course will require students to write a variety of syntactically sound English sentences and types of paragraphs about other countries, globalism, business, politics, and so on. These skills will then be useful for the student to be able independently to produce English prose on any subject.","schedule":"Tentative Schedule\nW1 February 22 Course Orientation and Punctuation Exercises\nW2 March 1 Holiday\nW3 March 8 AWL 1 and Punctuation Exercises; Writing a topic sentence\nW4 March 15 AWL 1 and Punctuation Exercises; Making an outline and Structuring a paragraph\nW5 March 22 AWL 1 and Adverbs; Using examples to clarify and explain\nW6 March 29 AWL 2 and Adverbs; Using examples to clarify and explain\nW7 April 5 Holiday\nW8 April 12 AWL 2 and Conditionals; Drawing analogies\nW9 April 19 (Joint Mid-terms) AWL 2 and Conditionals; Drawing analogies\nW10 April 26 AWL 3 and Subordination; Writing an opinion essay\nW11 May 3 No classes\nW12 May 10 AWL 3 and Subordination; Writing an opinion essay\nW13 May 17 AWL 4 and Inversion; Writing a definition\nW14 May 24 AWL 4 and Inversion; Writing a definition\nW15 May 31 AWL 5 and Modals; Writing a complaint email\nW16 June 7 AWL 5 and Modals; Cover letter and Hedging\nW17 June 14 Holiday\nW18 June 21 Final Exam and Final paper due\nEND","scorePolicy":"Students who do NOT have any interest in writing are advised not to take the course.\n每週均有指定寫作作業，對寫作毫無興趣的同學，請勿選修此課程。\n\nQuizzes and Seatwork: 30%\nWriting assignments: 30%\nMid-Exams: 20%\nFinal paper: 20%\nEND","materials":"Handouts are uploaded to i學園.","foreignLanguageTextbooks":true}]
