[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2020-12-23 00:15:52","objective":"你熱愛文學嗎?你對社會及社會影響世界的方式好不好奇?你想不想探索社會政治事件表面背後的意涵?你喜不喜愛語言? 你是否會對許多故事的力量和神奇之處著迷?如果你的答案是否定的，透過這門課程，你會發現文學提供了既有價值又發人深省的社會觀點。反之，如果你熱愛文學，並且早已深受文學語言的吸引，你在這門課程裡將可從文學間接獲取豐富的生活經驗，進而學會如何理解世界。具體而言，藉由探索文學和社會的互動關係，透過研究社會如何促成文學的產生、賦之予脈絡，並加以型塑，以及文學如何反映、影響、塑造、及改變社會，你將會瞭解文學及語言的力量，更重要的是能在所處之世界裡變得安然自在。我們可能研讀的作品包括，但不限於，Things Fall Apart, Anthills of the Savannah, Uncle Tom’s Cabin, 1984, Extremely Loud and Incredibly Close等書。\nDo you have a passion for literature? Are you curious about society and the way it influences the world around us? Would you like to explore the facade of sociopolitical events? Do you love language and are you fascinated by the power and magic of stories? If not, you will nevertheless learn in this course that literature provides a valuable and inspiring perspective on society. On the other hand, if you have already had a strong passion for literature and if you are already fascinated by literary language, you will learn in this course how to make sense of your world by enriching your vicarious experiences of it through literature. Specifically, by exploring the interaction between literature and society, by studying not only how society gives rise to, contextualizes, and molds literature, but also how literature mirrors, influences, shapes, and changes society, you will realize the power of literature and language and, more importantly, become at home in the world. The texts we will","schedule":"02/24　　Introduction\n03/03　　An Artist of the Floating World\n03/10　　An Artist of the Floating World \n03/17　　An Artist of the Floating World \n03/24　　An Artist of the Floating World \n03/31　　An Artist of the Floating World \n04/07　　No class\n04/14　　An Artist of the Floating World \n04/21　　Never Let Me Go \n04/28　　Never Let Me Go \n05/05　　Never Let Me Go\n05/12　　Never Let Me Go \n05/19　　Never Let Me Go \n05/26　　Never Let Me Go \n06/02　　Never Let Me Go \n06/09　　Never Let Me Go \n06/16　　Final Exam\n06/23　　Review and Discusssion","scorePolicy":"Grading policy: attendance and presentation: 20%; quizzes: 30%; final examination: 50%","materials":"Kazuo Ishiguro’s An Artist of the Floating World (1986) and Never Let Me Go (2005).","foreignLanguageTextbooks":true}]
