[{"name":"杜敏誠","email":"mtu@ntut.edu.tw","latestUpdate":"2020-12-28 09:39:11","objective":"隨著衛星資料的取得變得更為容易，衛星遙測在各領域的應用在近年來變得更為廣泛。本課程將從遙測之基本概念開始介紹，接著介紹常用的衛星資料來源，最後本課程將簡介在土木與環工領域的衛星遙測應用。本課程一半以上的時間將為實作，學生將熟習在遙測分析軟體上分析真正的衛星資料，並在學期末遞交對自選主題之一研究報告。\nThe applications of satellite remote sensing data in various fields have been popular with the increase of selections of satellite data sources in recent years. This course will start with basic concepts of remote sensing, then introduce popular satellite data sources. In the end, the course will introduce applications of satellite data in the field of civil and environmental engineering. More than 50% of the class time will be hands-on. Students will have the opportunity to work on actual satellite data. At the end of the semester, students will need to submit a research report on topics chosen by students.","schedule":"2/26: 自我介紹與釋疑 Self-introduction, Q&amp;A\n3/5: 遙測技術簡介 Introduction to remote sensing\n3/12: 衛星遙測感測器簡介 Introduction to satellite remote sensors\n3/19-3/26: 衛星遙測感測器基礎 Basics of satellite remote sensors\n4/2: 兒童節/清明節補假 Make-up holiday \n4/9-4/16: 遙測資料處理技術 Processing of remotely sensed data\n4/23: 衛星遙測資料之應用 – 環境監測 Application of satellite data – environmental monitoring\n4/30: 衛星遙測資料之應用 – 環境工程 Application of satellite data – environmental engineering\n5/7: 衛星遙測資料之應用 – 熱島效應 Application of satellite data – urban heat island effect\n5/14: 衛星遙測資料之應用 – 用地判別 Application of satellite data – land use determination\n5/21: 衛星遙測資料之應用 – 災害評估 Application of satellite data – disaster evaluation\n5/28:  衛星遙測資料之應用 – 長期變化評估 Application of satellite data – long-term development evaluation\n6/4: 期末測驗 FINAL EXAM\n6/11-6/18: 期末口頭報告 Oral presentations\n6/25: 書面報告期限 Deadline for written reports","scorePolicy":"本課程之進行方式將混合傳統課堂授課，短片，課堂討論，文獻討論，課堂實作，期末計畫，與口頭報告。課堂討論之表現將作為期末加扣分之依據，故請準備好加入討論。本課程之書寫語言將以英文材料為主。所有授課與口頭溝通將混合英文與中文進行。\n5%　　期限前繳交題目與簡介\n20%　　文獻回顧\n20%　　期末測驗\n25%　　期末口頭報告 (5%版面設計，10%內容完成度，10%報告技巧)\n20%　　期末書面報告 (10%符合學術論文格式，10%內容完整度)\n10%　　不定時點名\nThe class will be taught by the combination of traditional lecturing, short movies, in-class discussions, literature review, hands-on labs, projects, and oral presentations. In-class discussion will be the basis to add/subtract the final grade, so please be prepared to participate in the discussions. The written language of the course will be mainly English. All lecturing and conversation will be a mixture of English and Mandarin. \n5%　　Submission of project topic and summary\n20%　　Literature review\n20%　　Final exam\n25%　　Final oral report (5% Slide design，10% Details of contents，5%Presentation skills)\n20%　　Final written report (10% Conformity to academic formats，10% Completeness of contents)\n10%　　Attendances","materials":"教師整理之資料\nMaterials summarized by the lecturer","foreignLanguageTextbooks":false}]
