[{"name":"林威玲","email":"rita33@ntut.edu.tw","latestUpdate":"2020-12-28 15:41:33","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"一、綜合目標:\n(一)瞭解自我體適能狀況及限制。\n(二)了解與規劃適合個人的運動方法。\n(三)養成終身體適能，維持自我鍛鍊與規律運動的習慣，亦提升為運動適能。\n(四)了解基礎食品營養與保健，幫助獲得熱能和營養素，以修護身體。\n(五)了解基礎運動安全常識。\n\n二、體適能五大要素/單項目標與內容:\n(一)身體組成分析:測量INBODY\n1.代表一個人現在的「狀態」。了解現況後，才會知道要針對哪一個部分進行改進。第一次測量後，你會知道自己是「哪一款人」，下一步就是「怎麼積極改變」，邁向健康體適能，亦提升為運動適能。\n2.瞭解身體質量指數:評估體內脂肪與非脂肪所佔比率，身體質量指數簡稱BMI。身體脂肪比率越高，肌肉負擔越大，罹患心血管疾病的危險性越高。\n(二)肌肉適能[瞬發力] 、[肌 力]:重量訓練/阻力訓練\n了解並增進身體動作的反應力與敏銳性。\n能跑得快、跳得高、跳得遠、提得動、擲得遠。在生活與工作中達到肌肉運用的最佳狀況。瞭解若肌肉無法發出適當力量時，使肌肉產生疲勞、工作效率降低、姿勢不良，甚而導致運動傷害、下背痛或坐骨神經痛等疾病。\n(三)肌肉適能[肌耐力]: 重量訓練/阻力訓練\n增進肌肉在動作時耐久能力。於生活、工作或休閒，都需要靠肌耐力來支持，與肌力一樣都能維持肌肉的年輕與預防傷害發生。\n(四)心肺適能:有氧運動如跑步、跑步機、腳踏車、飛輪\n增強心肺血管耐力，以長時間的耐力運動改善，並提供身體所需的養份與氧氣，及排除有害之代謝物質；有效率從事工作及活動，且不易罹患心血管疾病。\n(五)柔軟度:伸展運動\n了解靜性及動性肌肉與關節活動的伸展運動。\n增強活動範圍可以屈、轉、彎、扭轉，不會因柔軟度不足造成身體傷害，幫助身體動作的協調性與靈活度。 \n\n三、教學進度\n第一週02月22日　　\n1-教學規劃詳細說明，含目標、內容、進度、應備知識基礎、評量方式。\n2-InBody與體適能前測。\n第二週03月01日和平日補假\n第三週03月08日　　\n身體評估、人體解剖基礎認識\n1.日常姿勢評估。\n2.脊椎評估。\n3.腿部結構評估。\n第四週03月15日[學科] \n1.體適能基礎概念\n2. INBODY解說。\n3.基礎營養學。\n第五週03月22日　　\n1.體適能訓練原則與健身運動DIY規劃\n(依個人INBODY前測結果設計運動處方)。\n2.運動安全與傷害防護。\n3.體適能器材使用介紹。\n第六週03月29日　　\n1.Pilates彼拉提斯彈力帶VS重量訓練\n2.伸展運動與滾筒運動(或網球)放鬆介紹\n第七週04月05日校慶補假\n第八週04月12日實務操作第一組四週課表:體適能訓練DIY計畫\n第九週04月19日實務操作第一組四週課表:體適能訓練DIY計畫\n第十週04月26日實務操作第一組四週課表:體適能訓練DIY計畫\n第十一週05月03日實務操作第一組四週課表:體適能訓練DIY計畫\n第十二週05月10日實務操作第二組四週課表:體適能訓練DIY 計畫\n第十三週05月17日實務操作第二組四週課表:體適能訓練DIY 計畫\n第十四週05月24日實務操作第二組四週課表:體適能訓練DIY 計畫\n第十五週05月31日實務操作第二組四週課表:體適能訓練DIY 計畫\n第十六週06月07日\n1.InBody與體適能後測\n2.訓練成果測驗:划船訓練後測\n第十七週06月14日體適能訓練DIY計畫結果分析報告與檢討。\n第十八週06月21日補考周","scorePolicy":"一、出勤考核50%\n(一)學習態度25%\n   1.服裝儀容，著適宜之運動服裝。\n   2.安全考量，長髮者勿披頭散髮及不要穿戴飾品，亦影響自己與他人活動。\n   3.未經老師許可切勿使用手機，並關靜音。\n (二)出缺席狀況25%\n   1.一次曠課扣總成績5分。\n   2.遲到30分以上，無特殊原因者曠課論。\n   3.事病假以學校正式請假為主，超過三次以上依情況扣總成績1-5分。\n   4.參加學校體適能相關運動比賽，無特殊原因者曠課論。(得名者加總成績5分)\n二、運動DIY規劃報告15%\n三、學習成果報告15%\n四、划船訓練成果測驗20%\n*報告一律上傳至【北科i學園】數位教學平台","materials":"終身體適能教育\n編著:Suzan F. Ayers、Mary Jo Sariscsany\n總校閱:林貴福\n譯者:柳家琪、李佳倫、李凌純、朱貞儀\n出版:禾楓書局","foreignLanguageTextbooks":false}]
