[{"name":"陳盈君","email":"ycc85@ntut.edu.tw","latestUpdate":"2021-03-04 17:09:45","objective":"步態分析已廣泛運用於神經骨骼肌肉系統疾病患者之臨床診斷以及治療的規劃與評估。本課程將簡述解剖學接續從生物力學、動作分析的角度來學習動作特徵及分析方法。修畢本課程，期待工程背景的學生會對步態分析的力學原理以及相關量測設備(如三維紅外線動作分析儀與測力板等)之原理與技術有所了解，並學會相關的逆向動力學計算。增進未來機械背景的同學投入相關的研究。本課程須自備電腦，三小時的課程及一小時的程式練習課程。\n\nGait analysis has been widely applied to evaluate, diagnose, and plan the treatment of patients with musculoskeletal diseases.  This course will first teach some basic knowledge of anatomy and learn how to analyze the gait features from the aspect of biomechanics and motion analysis. After this course, the students from engineering backgrounds are expected to have a fundamental knowledge of motion analysis and the related measuring equipment and also know how to apply inverse dynamics analysis to analyze human motion. This course will help to build up the knowledge for those students who want to involve in the field of motion analysis. The course will be divided into three-hour lectures and one-hour programming practice.","schedule":"2/25　　Brief introduction of the course\n3/04　　Basic knowledge of anatomy \n3/11　　Introduction: gait basics\n3/18　　Basic and Total Limb function\n3/25　　Pathological Mechanisms\n4/01　　Basic knowledge of kinematic and kinetic\n4/08　　Kinematic and kinetic measurement techniques\n4/15　　Inviting lecturer – Dr. Huang\n4/22　　Mid-term exam\n4/29　　Analysis of kinematics data: Defining coordinate system and coordinate transformation (HM_RV)\n5/06　　Forceplate data analysis /Analysis of center of pressure (HM_COP)\n5/13　　Visiting gait laboratory\n5/20　　Kinematic analysis of the human movement I (joint angles and helical axis) \n5/27　　Kinematic analysis of the human movement II (angular velocity and angular velocity EP)\n6/03　　Methods for the determination of internal forces / Inverse dynamics analysis of movement (HM_AngularMomentum)\n6/10　　Posture and balance control Anthropometric measurement and analysis/ Electromyography\nInviting lecturer – Dr. Fu\n6/17　　Final exam\n6/24　　Final report","scorePolicy":"期中考(20%)，期末考(20%)， 期末報告(30%)，平時成績(作業與出席30%)","materials":"1. Perry, J., Gait Analysis: Normal and Pathological Function, SLACK, 1992.\n2. Zatsiorsky, V.M., Kinematics of Human Motion and Kinetics of Human Motion, Human Kinetics, Leeds, 1998, 2005.\n3. Craik, R.L. and Oatis, C.A., Gait Analysis: Theory and Application, Mosby, 1995.","foreignLanguageTextbooks":false}]
