[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2020-12-23 00:54:03","objective":"莎翁與通俗文化有什麼關係呢？莎翁的作品不是難以理解嗎？欣賞莎翁的作品不需要特別的訓練、時間、與長期的投資嗎？這些問題的答案可以同時是肯定和否定的。不論您喜歡與否，在當代的文化裡，莎翁無所不在。Paul Prescott已經指出：「莎翁的蹤影並不局限於教室、大學、劇場等正式場合，而是在電影、電視、新聞小報、電玩、流行音樂、連環漫畫、及廣告等大眾媒體上到處可見。」確實，莎翁早已是無可迴避的圖像。他的語言文字、人物、劇本情節已經在通俗的大眾媒體上受到廣泛的挪用。「通俗文化中的莎士比亞」是為了有意於為了各種目的而挪用莎翁作品內容之學生，包括以「通俗莎士比亞」作為英語文教材之中小學教師，而設計之英文課程。為了瞭解，甚至挪用莎翁作品內容的複雜性與其中蘊含之永恆不變、舉世皆然的真理，我們將透過電影、科幻故事、與肥皂劇等媒介，以異於傳統的反向方式間接研習莎翁作品的珍貴特質與內容，以瞭解社會大眾為了有效達成商業、文化、及政治的目的，是如何挪用莎翁作品。修習本課程的學生亦可推薦有助於未來透過通俗莎翁進行英語文教學之電影、科幻故事、與肥皂劇，作為上課教材。\nWhat has Shakespeare to do with popular culture? Are his writings not difficult and more or less inaccessible? Does it not require special training, time and long-term investment to appreciate Shakespeare? Well, the answer might be yes and no. Like it or not, Shakespeare is everywhere in contemporary culture. As Paul Prescott has pointed out, “His presence is not confined to the ‘official’ locations of classrooms, universities and theatres, but permeates popular mass media such as cinema, television, tabloid journalism, computer games, pop music, comics and advertisements.” Indeed, Shakespeare has long been an inescapable icon. His words, characters, and plots have been widely appropriated to appear across a range of popular mass media. This course is designed to introduce Shakespeare to those who are interested in appropriating Shakespeare for various purposes, including teaching and learning English through what Douglas Lanier has called “Shakespop.” To appreciate the complexit","schedule":"02/22　　Introduction\n03/01　　Katherine Duncan-Jones, Introduction. Shakespeare’s Sonnets. By William Shakespeare. 3rd Series. Ed. Katherine Duncan-Jones. London: Arden Shakespeare, 1997. 1-107. [NTUT 822.33 S527s] [Reading pp. 9-14; 50-58 (The Dark Lady is not Mary Fitton; the Pembrokian hypothesis: conjecture about the identity of the fair youth as William Herbert); [appropriation of Shakespeare’s sonnets for personal purposes (78-82)]\nA Waste of Shame and The Sonnets (1609) (129, 60, 20)\n03/08　　A Waste of Shame and The Sonnets (1609) (127, 130, 80)\n03/15　　A Waste of Shame and The Sonnets (1609) (108, 137, 147)\n03/22　　A Waste of Shame and The Sonnets (1609) (57, 94, 134, 142)\n03/29　　A Waste of Shame and The Sonnets (1609) (154, 129, 123, 115)\nSense and Sensibility and sonnet 116)\n04/05　　No class\n04/12　　Shakespeare’s Hamlet\n04/19　　Shakespeare’s Hamlet\n04/26　　Shakespeare’s Hamlet\n05/03　　Shakespeare’s Hamlet\n05/10　　Shakespeare’s Hamlet\n05/17　　Shakespeare’s Hamlet\n05/24　　Claire McCarthy’s Ophelia\n05/31　　Claire McCarthy’s Ophelia\n06/07　　Oral Presentation: Position Paper Due\n06/14　　Holiday\n06/21　　Review and Discussion","scorePolicy":"attendance and participation in class discussion: 25%; oral presentation: 35%; position paper: 40%","materials":"Shakespeare, William. Shakespeare’s Sonnets. 3rd Series. Ed. Katherine Duncan-Jones. London: Arden Shakespeare, 1997.\n\nShakespeare, William. Hamlet. Ed. Robert S. Miola. New York: Norton, 2011.","foreignLanguageTextbooks":true}]
