[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2021-02-23 17:48:02","objective":"本課程的目的是複習英語的句子結構，以獲得對語法形式更深層的瞭解，包含各種描述性或理論性的分析方法。藉著採用不同英語教學方法，這種瞭解與知識有助於解答在英語教學上所遭遇的各種學習歷程的問題，尤其是寫作和翻譯的學習過程中。\nThis course reviews the sentence structures in English for a deeper understanding of grammatical constructions, including various descriptive and theoretical approaches to representing them. By applying various English teaching methods, such knowledge can be helpful in dealing with problems that are frequently encountered when carrying out various learning activities in the classroom, especially essay writing and translation activities.","schedule":"Tentative Schedule\nW1 February 23\n1 Introduction\nWhat is grammar and how can it be described?\nLarsen-Freeman. The grammar of choice\n\nW2 March 2\nHinkel and Fotos. From theory to practice: A teacher’s view\nRichards. Accuracy and fluency revisited\nEllis. The place of grammar instruction in the second/foreign language curriculum\nLarsen-Freeman and DeCarrico. Grammar\nPedagogical grammar: A framework for language teachers\n\nW3 March 9\nConrad. Will corpus linguistics revolutionize grammar teaching in the 21st century?\n　　A corpus-informed revolution in L2 grammar teaching (What is grammar …)\nInvestigating grammar use through online corpora\nCorpus analysis workshop (Dr. Chan-Chia Hsu, Asso Prof, Nat Taipei Univ of Business)\n\nW4 March 16 (online)\n2 Grammatical metalanguage\nCelce-Murcia. Why it makes sense to teach grammar in context and through discourse\nCan syntax be taught? A study of the effects of formal instruction on the acquisition of WH questions by children\n11 Yes-No questions\n13 WH- questions\n14 Other structures that look like questions\n\nW5 March 23\n7 The tense and aspect system\n9 The TAM system in discourse\n\nW6 March 30\nVP 8~10 Tense, Aspect, and Modality\n\nW7 April 6 Holiday\n\nW8 April 13\n8 Modal auxiliaries and related phrasal forms\nHolmes. Doubt and uncertainty\n\nW9 April 20\n18 Passive voice\nBiber. Passive\nHinkel. Why English passive is difficult to teach (and learn)\n\nW10 April 27\n3 The lexicon\nThe lexis-grammar interface\nNation and Meara. Vocabulary.\nCoxhead. A new academic word list\nCoxhead. The academic word list 10 years on: Research and teaching implications\n\nW11 May 4 No classes\n\nW12 May 11 \nBrown. Count/Mass distinction\nNP 4 Kinds of things\n17 Partitives, collectives, and quantifiers\nNP 6 Quantifiers\n\nW13 May 18\n15 Articles \n16 Reference and possession\nNP Grounding things: Reference\n\nW14 May 25\nGundel. Information structure and referential givenness/newness: How much belongs in the grammar?\nGundel, Hegarthy, and Borthen. Information structure and pronominal reference to clausally introduced entities\nGundel, Hedberg, and Zacharski. Cognitive status and the form of referring expressions in discourse.\n20 Adjectives\nNP 7 Modifiers\n\nW15 June 1\n28 Introduction to relative clauses\n29 More on relative clauses\nMaster. Relative clause reduction in technical research articles\n\nW16 June 8 \nEllis. Methodological options in grammar teaching materials\nEvaluating and adapting existing materials.\nHinkel. Grammar teaching in writing classes: Tenses and cohesion\nMcCarthy and Carter. Grammar and the spoken language\nPennington. Grammar and communication: New directions in theory and practice.\n\nW17 June 15 \nOral presentations\n\nW18 June 22 Final paper due\nEND","scorePolicy":"Weekly presentations 30%\nWeekly homework 30%\nCorpus project 20%\nFinal report 20%\nEND","materials":"Celce-Murcia and Larsen-Freeman. 1999.\nHinkel and Fotos. 2002.\nRadden and Gunter. 2007.","foreignLanguageTextbooks":true}]
