[{"name":"林侑民","email":"ozargar@ntut.edu.tw","latestUpdate":"2020-12-29 11:57:26","objective":"This course will discuss the principal concepts of thermal fluid science. The four intersecting fields of thermodynamics, fluid mechanics, heat transfer and combustion will be explored. Topics such as energy transfer by heat, work and mass, laws of thermodynamics, entropy, power and refrigeration cycles, Bernoulli, energy and momentum equations, internal and external flows, flow in pipes, flow over bodies, swirling flow, mechanism of heat transfer, conduction, convection and radiation heat transfer, steady and transient heat conduction analysis, heat transfer from extended surfaces, forced and natural convection, heat transfer with phase change: boiling and condensation, heat exchanger, laminar premixed flames, laminar diffusion flames, turbulent premixed flames and turbulent non-premixed flames and their corresponding industrial applications will be discussed. Prospective students need to have a prior understanding of the fundamental principles of thermal and fluid sciences. A better understanding of thermal fluid science can be beneficial to a student’s future career whether in industry or academic research.","schedule":"Energy transfer by heat, work and mass\nFirst law of thermodynamics\nSecond law of thermodynamics\nEntropy\nPower and refrigeration cycles\nLaminar and turbulent flow\nInternal and external flows\nBernoulli, energy and momentum equations\nFlow in pipes\nFlow between two concentric rotating cylinders\nFlow over bodies\nSwirling flow\nMechanism of heat transfer\nConduction heat transfer\nConvection heat transfer \nRadiation heat transfer\nSteady and transient heat conduction analysis\nHeat transfer from extended surfaces\nForced convection\nNatural convection\nHeat transfer with phase change: boiling and condensation.\nHeat exchanger\nLaminar premixed flames\nLaminar diffusion flames\nTurbulent premixed flames \nTurbulent non-premixed flames","scorePolicy":"Homework 30%\nClass participation 10%\nPresentation 10%\nMidterm exam 20%\nFinal exam 30%","materials":"Fundamentals of thermal-fluid sciences, Y. A. Cengel and R. H. Turner, 2015. \nIntroduction to thermal and fluid engineering, D. A. Kaminski, M. K. Jensen, 2005. \nAn introduction to combustion concepts and applications, second edition, S. R. Turns, 2006.","foreignLanguageTextbooks":false}]
