[{"name":"艾必得","email":"ebedendi@gmail.com","latestUpdate":"2021-02-08 16:07:49","objective":"行銷英文是為商業人士及學習商業英語的學生而安排的一種多位階的商業英文課程。課程教本已經與世界領先企業資源之一的美國\"經濟時代\"期刊合作完成。課程單元都是為了讓學生具備好的工具和應用技巧以便他們可以在國際企業和行銷上有成功的表現而設計。課程結束後，學生將有能力在全面的商業環境下用英文去充分的溝通;能夠在商業的世界中去發揮他們的知識，更流利而且有自信的運用商業語言，進而增加他們服務公司的繁榮與發展。\nMarketing English is a multi-level business English course for businesspeople and students of business English. The course book has been developed in association with the Financial Times, one of the leading sources of business information in the world. The units are designed to equip students with the tools and skills they need to succeed in marketing and international business. At the end of this course, students will be able to communicate in English in a wide range of business situations; they will also enlarge their knowledge of the business world; and they will be more fluent and confident in using the language of business and should increase their companies’ prospects.","schedule":"Week 1 (2/25/2021): Talk about your career plan/談談您的生涯規劃\n\n(1.) Ability, requests and offers. Telephoning: making contact. \n(2.) Listening and reading (videos and audio): An interview with the finance director of a tv company, and the effect of Facebook profile on your job prospect. \n*Assignments: Read the book and handout.\n\nWeek 2 (3/4/2021): Presenting your company/如何介紹您的公司\n\n(1.) Describing companies. Presenting your company. \n(2.) Listening and reading (videos and audio):  An interview with a CEO company.\n*Assignments: Read the book and handout.\n\nWeek 3 (3/11/2021): Negotiating skills/談判的技巧\n(1.) Making sales Negotiating: reaching agreement. \n(2.) Listening and reading: Interview with the director of a marketing company and the role of gender in marketing.  \n*Assignments: Read the book and handout.\n\n\nWeek 4 (3/18/2021): What makes a great idea?/ 怎樣產生好點子?\n(1.) Successful meetings \n(2.) Listening and reading: An interview with a researcher. Web articles: Who needs translators? –; Safer cycling; Going for gold.\n*Assignments: Read the book and handout. Discuss Final Paper\n\n\nWeek 5 (3/25/2021): Preparing for an Interview/準備面試\n(1.) Participating in discussions \n(2.) Listening and reading: An interview with the Director of Marketing at a health consultancy. \n\n*Assignments: Read the book and handout.\n\n\nWeek 6 (4/1/2021): Socializing with business partners/企業間的社交活動\n(1.) Socializing: greetings and small talk \n(2.) Listening and reading: An interview with the Chief Executive of a corporate entertainment company.\n*Assignments: Read the book and handout.\n\nWeek 7 (4/8/2021): New business and business sectors/新的產業和產業別\n(1.) Dealing with numbers. \n(2.) Listening and reading: Interviews with the CEO of a money-transfer company and the CEO of a food company.\n*Assignments: Read the book and handout.\n\nWeek 8 (4/15/2021): Marketing mix and marketing campaigns/ 市場要素與競爭\n(1.) Telephoning: exchanging information \n(2.) Listening and reading: An interview with the European Marketing manager of a pharmaceutical company.\n*Assignments: Read the book and handout.\n\nWeek 9 (4/22/2021): Midterm Oral Presentations/期中口試\n\nWeek 10 (4/29/2021): Qualities of a good manager/ 好經理人的素質\n(1.) Verbs and prepositions. Reported speech. Socializing and entertaining. \n(2.) Listening and reading: We will discuss an interview with the author of a management book.\n*Assignments: Read the book and handout.\n\nWeek 11 (5/6/2021): Managing conflicts/解決衝突\n (1.) Word-building. Conditionals. Negotiating: dealing with conflict. \n(2.) Listening and reading: An interview with an expert in dispute resolution.\n*Assignments: Read the book and handout.\n \nWeek 12 (5/13/2021): Presenting a product/呈現一個產品\n(1.) Describing products.  Presenting a product. \n(2.) Listening and reading: An interview with the editor of a news network. \n*Assignments: Read the book and handout.\n\nWeek 13 (5/20/2021): Competition/競爭手法 \nWe will discuss different scenarios in marketing transactions.\nReadings: read the book and handout, videos and audio \n\nWeek 14 (5/27/2021): Advertising and promotion/產品廣告與促銷\nWe will learn how to present an idea to colleagues or associates and persuade them to support the proposal.\nFocus: listening comprehension, vocabulary, and speaking\n\nWeek 15 (6/3/2021): Branding/品牌呈現\nWe will discuss famous brands and learn key branding vocabulary.\nFocus: listening activity on branding\n\nWeek 16 (6/10/2021): Case study 1/個案討論1\nWe will learn useful vocabulary for talking about competition in business.\nFocus: listen to talks about rivalries, learn collocations with the word ‘competition’ and study competition idioms.\n\nWeek 17 (6/17/2021): Case study 2/ 個案討論2\nWe will learn useful words and phrases for talking about advertising methods and promotional strategies.\nFocu","scorePolicy":"Evaluation/成績評量:\nAttendance/Participation in class/課堂表現  　　   佔20% \nMidterm exam/期中口試                                           佔40% \nFinal exam/期末筆試                                                 佔40% \nTotal grade/總成繢","materials":"Text:  The required book for this class is “Market Leader 3rd edition (Pre-intermediate)”\nChinese: 教科書: “Market Leader 3rd edition (Pre-intermediate)”","foreignLanguageTextbooks":true}]
