[
  {
    "name": "陳家興",
    "email": "biabobo@icloud.com",
    "latestUpdate": "2023-07-10 11:16:25",
    "objective": "互動智慧空間設計著重虛實整合，再加上智慧代理人觀念，結合使用者經驗，促使程式專業人員與互動設計師合作，來發展使用者與環境隨時互動之智慧介面。本課程結合電子、資工、互動領域，針對無人機 (大疆 / Parrot)、生成對抗網路、軟體開發應用 (Open source SDK)、APP 開發、介面設計、小型企業創新研發等主題，由學習者發想設計，並深入發展程式與開發實務。課程內含空間認知與視覺化、空間資訊與介面設計、機器學習、類神經網路、SCRUM、軟體開發測試。相關程式與應用包括 JavaScript、JSON、Firebase、D3.JS、Apache ECharts、CNN、Python.\nThis course is integrated with AR、VR、MR, smart agent concepts, and user experiences study.  The purpose is to incorporate programmer and designer in designing a mixed-reality space which is actually a physical space considered as a real-time interface to trig many human-environment interactions. Based on Electronic Engineering, Computer Science and Information Engineering, and Interaction Design, we set study topics as Drones (Dji /Parrot), gan, Open source SDK, APP development, interface design, small business innovation. Students are encouraged to create their own concepts then develop programming. Course contents included of spatial perception and information visualization, spatial information and interface, machine learning, neural network, Scrum, software development and testing. The program and application included of JavaScript、JSON、Firebase、D3.JS、Apache ECharts、CNN、Python.",
    "schedule": "周次 日期 課程內容\n1\t0916 課程介紹、Project 簡介與開發環境安裝\n2\t0923 無人機空間定位與導航系統架構與 Echarts 繪圖程式庫\n3\t0930 Python 基礎、JSON 簡介與以及雲端資料庫 Firebase\n4\t1007 Scrum 簡介、JavaScript 變數和運算元\n5\t1014 JavaScript 流程控制，包含邏輯判斷和迴圈\n6\t1021 JavaScript 陣列和函式\n7\t1028 第一次評圖\n8\t1104 無人機試飛與系統介面\n9\t1111\t 設計思考 - 破冰 - 設計思考類型與程序 - 設計工作坊 (1)\n10\t1118\t 智慧空間介面理念與應用案例\n11\t1125 空間認知與資訊視覺化人因、認知、格式塔、視覺化\n12\t1202 第二次期中評圖\n13\t1209 無人機群飛表演工作坊 (2): 小蜂鳥無人機的飛行與燈光控制\n14\t1216 機器學習與深度學習簡介：類神經網路的基本架構 \n111\t1223 抵工作坊\n16\t1230 抵工作坊\n17\t0106 無人機群飛表演工作坊 (3)\n18\t0113 繳交期末學習紀錄 - 期限為該日 13:10 前",
    "scorePolicy": "1.\t基礎能力界定條件：建議先修 Python \n2.\t點名 10% + 三次學期作業 20%@3 = 60% + 繳交期末報告 30%",
    "materials": "自編 PPT",
    "consultation": "陳家興 biabobo@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "賴冠廷",
    "email": "ktlai@ntut.edu.tw",
    "latestUpdate": "2023-05-30 20:49:55",
    "objective": "空間設計可以將實體空間視為一個人與環境隨時互動之介面，再加上智慧代理人觀念，將促使設計者以新的介面設計觀念探索實體空間之各項設計發展可能性。課程含科技發展與哲學、智慧空間設計方法、智慧空間互動與感知技術、空間資訊控制與介面、空間資訊流與應用。\nPhysical space could be considered as a real-time interface included of many human-environment interactions when designing space. While the concept of intelligent agent co-jointed with spatial interface, new opportunities opened to designers to explore interactive interface designs and developments of physical space. Course contents included of development and philosophy of science and technology, design method of intelligent space, intelligent interaction and spatial perception technology, spatial information control and interface, and spatial information flow and application.",
    "schedule": "1\t課程介紹 互動智慧空間設計發展與思維\n2\tJavaScript 基礎：開發環境安裝、變數和運算\n3\tJavaScript 流程控制與遊戲設計\n4\tJavaScript 的陣列和函式，以及 JSON 與雲端資料庫 Firebase 等。\n5\tUnreal 程式設計\n6\tUnreal 程式設計\n7\tUnreal 程式設計\n8\t使用 Unreal 設計 VR/AR 互動程式 \n9\t空間設計與動態系統介面整合\t無人機智慧校園、空間定位與導航尋書系統\n10\t機器學習與深度學習和類神經網路基本架構\n11\t無人機群飛程式開發 (1)\n12\t無人機群飛程式開發 (2)\n13\t期末學習成果發表整理與未來研究建議",
    "scorePolicy": "點名 10% + 三次學期作業 20%@3 = 60% + 繳交期末報告 30%",
    "materials": "老師自製講義。建議先修 Python",
    "consultation": "ktlai@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
