[
  {
    "name": "王李吉",
    "email": "richwang@ntut.edu.tw",
    "latestUpdate": "2023-09-12 22:06:21",
    "objective": "近年來網頁技術的快速發展，網頁設計也從傳統的後台 PHP 進展到以 HTML5+CSS3+Javascript 技術為主的前端工程。此外，UI／UX 的協同設計也是建立一個好的網頁的重要部分。 本課程旨在教導學生使用 HTML5+CSS3+Javascript 技術進行現代化的網頁設計，課程內容以靜態網頁的版面設計為主，包含 RWD 的響應式跨平台網頁設計。其中也涵蓋了 UI／UX 的概念建立。期待同學能經由這門課建立前端工程需要的基本技能。\nIn recent years, the rapid development of web technology, web design has also progressed from the traditional platform- PHP to HTML5+ CSS3 + Java script technology-based, front-end engineering. In addition, the collaborative design of the UI/UX is an important part of building a good Web page. This course is designed to teach students to modernize web design using HTML5-CSS3-Javascript technology, with a focus on static web layout and responsive cross-platform web design with RWD. It also covers the concept building of UI/UX. Expect students to establish the basic skills needed for front-end engineering through this course.",
    "schedule": "This course introduces HyperText Markup Language (HTML), Cascading Style Sheets (CSS), JavaScript.\nBased on the understanding of the above, we will develop some applications of interactive action, web animation, data visualization, and more.\n\nThe topics in this course include:\n1. Basics of HTML, \n2. CSS syntax, \n3. JavaScript and its application,\n4. jQuery\n5. CSS3 animation,\n6. HTML5 APIs syntactic features,   \n7. Scalable Vector Graphics (SVG),   \n8. HTML5 Canvas API",
    "scorePolicy": "Attendance: 20%\nHomeworks: 20%\nAssignments or Pop quizzes: 20%\nMidterm exam: 20%\nFinal exam or project: 20%",
    "materials": "The materials provided in this course, and\nthe tutorials and resource from the Internet.",
    "consultation": "For any inquiry, please use the following contact information:Email: richwang@ntut.edu.tw;, or 12347@cc.ntut.edu.tw (Microsoft Teams)Line ID: richwang.line",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) In case of the need for distance learning, the on-line teaching will be given during the official class hours using Microsoft Teams.",
    "foreignLanguageTextbooks": true
  }
]
