[
  {
    "name": "莊澤光",
    "email": "s2300072ray@gmail.com",
    "latestUpdate": "2023-05-26 16:04:33",
    "objective": "The major goal of this class aims to give students advenced 3d modeling and rendering techniques meanwhile help them to have abilities to realize the design from concept to final output. In the class we will provide the tutorial of Blender. Blender now is the most useful tools for interior design and have been widely used in different practices. Through practicing the commands and techniques with multiple exercises and animation working flow, students will have general understanding about how the industry pipeline works meanwhile get the advanced abilities to get into design industries.\n  Student will be asked to finish a complete animation project in the end of semester, including renderings, animations and one 3d model included. Students’ learning outcome must be showed in this package and will be the critical criteria of semester grading.",
    "schedule": "For the student who want to choose this class must pass the fundamental CAD class first.\n\nLesson01: \nIntroduction of the class.\nLesson02: \nIntroduction of Blender armature_1\nLesson03: \nIntroduction of Blender armature_2\nLesson04: \nIntroduction of Blender armature_3\nLesson05: \nIntroduction of Blender Constrains_1\nLesson06: \nIntroduction of Blender Constrains_2\nLesson07: \nIntroduction of Blender Driver\nLesson08: \nAvanced Character Modeling_1/ Home Work\nLesson10: \nRigging_1\nLesson11: \nRigging_2\nLesson12: \nRigging_3/Animating\nLesson14: \nRigging_4/Animating\nLesson15: \nScene Setting.\nLesson16: \nScene Setting.\nLesson17: \nAnimation/ Render/ Post-Production.\nLesson18: \nSemester End.",
    "scorePolicy": "Attendance and Attitude  in class 30%\nMidterm 30%\nFinal Project 40%\n\nFor the one who has been absent for more than 6 times without reasons and day off application on school system will lose all the points on the Attendance and Attitude in class.",
    "materials": "Self-made hangout and tutorial.",
    "consultation": "Email: s2300072ray@gmail.com",
    "remarks": "FB Group_https://www.facebook.com/groups/226842116327396",
    "foreignLanguageTextbooks": false
  }
]
