[
  {
    "name": "陳起鳳",
    "email": "cfchen@ntut.edu.tw",
    "latestUpdate": "2023-09-04 13:52:25",
    "objective": "In this course, not only professional fields of civil engineering including structural engineering, geotechnical engineering, construction management, ecological engineering and disaster prevention, water resources and hydraulic engineering, and spatial information are introduced, but also environmental, ecological, societal, and cultural issues are emphasized. The most important point is focused on the relationship between civil engineering and environment such that students who take this course can understand environment, appreciate ecology, and pursue sustainable development when they are engaged in civil engineering construction in future. In addition, training of team works and ability to think, design, and carry out a plan by hand are emphasized. Students can plan, design, fabricate, and test a structural model using available material, equipment, and computer-aid software based on knowledge learned from fundamental civil engineering courses.",
    "schedule": "Week 1 Introduction \nWeek 2-3 Construction and environment  \nWeek 4-5 Land use and environment \nWeek 6-7 Water resource use and environment \nWeek 8 Transportation and environment\nWeek 9 Midterm exam\nWeek 10-11  Geographical engineering and environment \nWeek 11-12 Ocean engineering and environment \nWeek 13-14 Environmental engineering \nWeek 15-16 Environmental impact assessment \nWeek 17-18  Work exhibition",
    "scorePolicy": "Attendance and in-class performance 20%\nMidterm exam 20%\nConstruction making 60% (bridges and buildings)",
    "materials": "PPT slides\nReference: 土木與環境，中國土木水利工程學會編著，科技圖書，2005。ISBN：9576553997",
    "consultation": "Email: cfchen@ntut.edu.twTel: 02-27712171 ext 2662Office hour",
    "remarks": "The class could be linked to some SDGs, such as SDG6 environmental quality, SDG11 sustainable city, and SDG13 climate actions. Civil engineers should be aware that all the constructions being built on the earth should be in harmony with nature. 因二教施工，周二改到土木館 201 上課。Because of the construction in the Second Teaching Building, the Tuesday classroom changes to Room 201 in the Civil Engineering Building.",
    "foreignLanguageTextbooks": false
  }
]
