[
  {
    "name": "吳冠毅",
    "email": "kywu@ntut.edu.tw",
    "latestUpdate": "2023-08-09 23:38:46",
    "objective": "This course is an introductory course designed to provide undergraduate students with a foundation in the fundamental principles of chemistry. This course covers atomic and molecular structure, chemical reactions, stoichiometry, thermochemistry, the physical state of matter, thermodynamics, and kinetics. In the course, students will explore the properties of matter, the behavior of elements and compounds, and the laws governing chemical reactions. They will also develop an understanding of the scientific method and the role of experimentation in the study of chemistry. By the end of the course, students should have a solid understanding of the principles and concepts of chemistry since General Chemistry is a prerequisite for many higher-level courses in chemistry.",
    "schedule": "First week: Overview of Chemistry\nSecond week: Chemical foundations & Periodic Table (Ch. 1)\nThird week: Atoms, Molecules, and Ions (Ch. 2)\nFourth week: Atoms, Molecules, and Ions Ch. 2)\nFifth week: Atomic Structure and Periodicity (Ch. 7)\nSixth week: Atomic Structure and Periodicity (Ch. 7)\nSeventh week: Bonding: General Concepts (Ch. 8)\nEighth week: Bonding: General Concepts (Ch. 8)\nNinth week: Mid-term exam\nTenth week: Covalent Bonding: Molecular orbitals (Ch 9.)\nEleventh week: Covalent Bonding: Molecular orbitals (Ch 9.)\nTwelfth week: Stoichiometry (Ch. 3)\nThirteenth week: Stoichiometry (Ch. 3)\nFourteenth week: Types of Chemical Reaction and Solution Stoichiometry (Ch. 4)\nFifteenth week: Types of Chemical Reaction and Solution Stoichiometry (Ch. 4)\nSixteenth week: Thermochemistry (Ch. 6)\nSeventeenth week: Thermochemistry (Ch. 6)\nEighteenth week: Final exam\n\nThe schedule is dependent on the actual progress of lesson.",
    "scorePolicy": "Quiz: 15 \nAttendance: 20 \nMid-term exam: 30\nFinal exam: 35",
    "materials": "Textbook: Chemistry 11th Edition, Steven S. Zumdahl, Susan A. Zumdahl, and Donald J. DeCoste (滄海圖書)",
    "consultation": "Office hour",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
