[
  {
    "name": "吳冠毅",
    "email": "kywu@ntut.edu.tw",
    "latestUpdate": "2023-08-27 12:26:54",
    "objective": "This course is an introductory course designed to provide undergraduate students with a foundation in the fundamental principles of chemistry. This course covers atomic and molecular structure, chemical reactions, stoichiometry, thermochemistry, the physical state of matter, thermodynamics, and kinetics. In the course, students will explore the properties of matter, the behavior of elements and compounds, and the laws governing chemical reactions. They will also develop an understanding of the scientific method and the role of experimentation in the study of chemistry. By the end of the course, students should have a solid understanding of the principles and concepts of chemistry since General Chemistry is a prerequisite for many higher-level courses in chemistry.",
    "schedule": "First week: Overview of Chemistry\nSecond week: Chemical foundations \nThird week: The quantum world: Describe atoms in the microscopic scale \nFourth week: The quantum world: \nFifth week: The Chemical Bonds: Describe the way that atoms connect together\nSixth week: The Chemical Bonds: \nSeventh week: Molecular structures: Describe how atoms connect in 3D space \nEighth week: Molecular structures: Ninth week: Mid-term exam\nTenth week: The States of Matter I: Gases (a group of atoms or molecules) \nEleventh week: The States of Matter I: Gases \nTwelfth week: The States of Matter II: Liquids and Solids (a group of atoms or molecules)\nThirteenth week: The States of Matter II: Liquids and Solids Fourteenth week: First law of Thermodynamics and Thermochemistry (Describe the Energy stored in the matters)\nFifteenth week: First law of Thermodynamics and Thermochemistry \nSixteenth week: Thermodynamics: The Second and Third Laws First law of Thermodynamics and Thermochemistry (Describe how Energy transfers)\nSeventeenth week: Thermodynamics: The Second and Third Laws (Describe how Energy transfers)\nEighteenth week: Final exam\n\nThe schedule is dependent on the actual progress of the lesson.",
    "scorePolicy": "Quiz: 15 \nAttendance: 20 \nMid-term exam: 30\nFinal exam: 35",
    "materials": "Textbook: University Chemistry, International  Edition, Brian Laird., McGraw-Hill (東華書局)\n\nReference book: Chemistry 11th Edition, Steven S. Zumdahl, Susan A. Zumdahl, and Donald J. DeCoste (滄海圖書)",
    "consultation": "Office hour",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
