[
  {
    "name": "林惠勇",
    "email": "lin@ntut.edu.tw",
    "latestUpdate": "2023-05-30 17:22:35",
    "objective": "本課程在介紹電腦視覺的基本概念與使用技術。課程內容包含: 1.introduction to computer vision 2.geometric camera calibration 3.illumination 4.geometry of multiple view 5.structure from motion 6.segmentation by clustering 7.tracking models 8.model-based vision 9.image-based rendering.\nThe goal of this course is to introduce the basic concepts and techniques of computer vision. The outline of this course includes: 1.introduction to computer vision 2.geometric camera calibration 3.illumination 4.geometry of multiple view 5.structure from motion 6.segmentation by clustering 7.tracking models 8.model-based vision 9.image-based rendering.",
    "schedule": "Digital Image Formation\tImage Geometry, Sampling and Quantization, Image Definition\t3\t\t\t\t\nOptics, Digital Image Acquisition\tLens Equation, Image Resolution, Depth of Field, View Volume\t6\t\t\t\t\nImage Manipulation\tImage Filtering, Image Enhancement, Image Restoration in Spatial and Frequency Domain\t9\t\t\t\t\nBinary Image Processing\tThresholding, Geometric Properties, Projections, Run-Length Encoding, Binary Algorithms, Morphologic Operators, OCR\t9\t\t\t\t\nRegion and Edges\tRegion Segmentation, Region Representation, Split and Merge, Region Growing\t6\t\t\t\t\nImage Features\tGradient, Edge Detection, Corner Detection, Image Approximation, Subpixel Location Estimation, Edge Detector Performance\t9\t\t\t\t\nHough Transform, Ellipse Fitting\tHough Transform, Line Detection, Circle Fitting, Ellipse Fitting\t6\t\t\t\t\nActive Contours\tActive Contour Models\t3\t\t\t\t\nTerm Project Presentation\tStudent Term Project and Presentation\t\t\t3",
    "scorePolicy": "Homework, Project, Exam",
    "materials": "E. Trucco and A. Verri, Introductory Techniques for 3-D Computer Vision, Prentice Hall, 1998.",
    "consultation": "Office Hours.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
