[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2023-05-26 14:41:02",
    "objective": "Statistical design of experiments is a wide subject that treats a large number of methods for planning experimental investigations in a manner that ensures statistically valid conclusions. This course introduces students to concepts and techniques of classical and applied experimental design and covers the statistical design of experiments for systematically examining how a system functions. Topics covered will include: introduction to fundamentals and principles of experiments, blocking designs, completely randomized designs (CRD), randomized completely block designs (RCBD), full factorial designs with two levels, fractional designs with two levels, Latin square designs, 3-leval designs (CCD, BBD, Cuboidal designs), and response surface methodologies.",
    "schedule": "Week 1 Introduction to fundamentals of engineering statistics and principles of experimentation\nWeek 2-3 Simple comparative experiments: CRD (Completely randomized design)\nWeek 4-5 RCBDs (Randomized complete block designs)\nWeek 6-8 Factorial designs and 2-level factorial designs\nWeek 9 Midterm or assignment\nWeek 10-13 2-level fractional factorial design and resolution\nWeek 14-15 3-level (fractional) factorial designs and multi-factor designs (Latin square design, CCD, BBD, Cuboidal designs)\nWeek 16-17 Fitting regression model including GLM: Estimation, diagnostics \nWeek 18 Final exam or assignment",
    "scorePolicy": "1. Attendance: 10%\n2. Exam or assignment: 90%",
    "materials": "Montgomery, D. C. (2017), Design and Analysis of Experiments, 9th Ed., Wiley. \nSupplementary references: Will be noticed if necessary.\nAdditional materials will be covered from other texts and/or from recent literature.",
    "consultation": "Email or i-school system.Office hour: Thursday 11:00 ~ 12:00",
    "remarks": "First and second weeks (09/12 - 09/21) we will take distance learning on the Microsoft teams. The course link will be sent by the school E-mail.",
    "foreignLanguageTextbooks": true
  }
]
