[
  {
    "name": "張仁家",
    "email": "jc5839@ntut.edu.tw",
    "latestUpdate": "2023-05-28 00:23:25",
    "objective": "本課程邀請 OSU 的 Zirkle 博士於國立臺北科技大學技術及職業教育研究所（以下簡稱北科大技職所）開設 1 學分之專題講座課程「生涯與技術教育」，以及參與協助指導研究生之學術研究，而專題講座課程分為工作坊、北部技術型高中參訪、演講及講座課程等模式進行，總計 18 小時教學計畫，本課程之目的為促進技職教育及人力資源學術之國際交流，提升技職教育及人力資源學術之國際力。\nThis course invites Dr. Zirkle from OSU to offer a one-credit seminar course \"Career and Technical Education\" at the Institute of Technical and Vocational Education, National Taipei University of Science and Technology (hereinafter referred to as the Institute of Technical and Vocational Education, NTUST), and to assist in supervising graduate students' academic research. The purpose of this course is to promote international exchange and enhance the international strength of technical education and human resources academics.",
    "schedule": "(一)\t授課期間\n計劃實施日期為 2023 年 11 月 16 日至 2023 年 12 月 20 日，為期 1.5 個月，規劃 Zirkle 博士於北科大技職所開設 1 學分專題講座課程「生涯與技術教育」，其包含北科大授課、北部技術型高中參訪及演講等，預規劃生涯及技術教育與人力資源等兩大領域之專題講座課程，共計 18 小時專題講座課程之教學計畫。(配合 Zirkle 的時間，本課程採機動彈性的時間進行)\n(I) Course Period\nDr. Zirkle is planning to offer a one-credit special lecture course \"Career and Technology Education\" at the Technical Vocational Institute of NUST from November 16, 2023 to December 20, 2023, which includes lectures at NUST, visits to northern technical high schools, and lectures. A total of 18 hours of lecture courses are planned. (The course is conducted in a flexible schedule to meet Zirkle's schedule)\n\n(二)\t授課內容\n專題講座課程分為兩大課程領域，第一部為生涯及技術教育專題講座課程，包含美國生涯及技術教育的發展與現況；生涯及技術教育課程 / 教學和評估；美國二年制大學等 3 堂講座課程主題，第二部為人力資源專題講座課程，包含美國勞動力發展與教育系統分析；人力資源發展；美國師徒制度等 3 堂講座課程主題，詳細之專題講座課程對應授課時間如 (三) 所式，共計 6 堂課程主題，18 小時專題講座課程之教學計畫，並規畫至北部技術型高中參訪。\n(2) Course Content\nThe first part of the seminar course is a career and technical education seminar course, which includes the development and current status of career and technical education in the U.S.; career and technical education courses/teaching and assessment; two-year college in the U.S. and other three seminar course topics; the second part is a human resources seminar course, which includes an analysis of the U.S. workforce development and education system; human resources development; and the U.S. mentorship system. The second part of the course is a human resources seminar course, which includes the analysis of U.S. workforce development and education system, human resources development, and U.S. mentorship.\n\n(三) 課程單元與時間\n生涯及技術教育專題講座課程\t\t\n  美國生涯及技術教育的發展與現況\t演講\t3 小時\n  生涯及技術教育課程 / 教學和評估\t工作坊\t3 小時\n  美國二年制大學           \t講座課程\t3 小時\n人力資源專題講座課程\t\t\n  美國勞動力發展與教育系統分析\t工作坊\t3 小時\n  人力資源發展                 講座課程\t3 小時\n  美國師徒制度                 演講\t3 小時\n\n(3) Course Units and Duration\nCareer and Technology Education Seminar Course\t\t\n  Development and Current Status of Career and Technology Education in the U.S. Lecture 3 hours\n  Career and Technology Education Curriculum/Teaching and Assessment Workshops 3 hours\n  Lecture course at a two-year university 3 hours\nHuman Resources Seminar Course\t\t\n  U.S. Workforce Development and Education Systems Analysis Workshop 3 hours\n  Human Resource Development Seminar 3 hours\n  American Mentorship Lecture 3 hours",
    "scorePolicy": "1. 期末報告 --30%，繳交期末報告，擇定課程中的任一主題，撰寫至少 5000 字的文稿，字型 12P，標楷體，並參考相關文獻，依 APA 格式撰寫。\n2. 課堂討論 ---20%，參與討論及提問。\n3. 出席與學習態度 ----40%(無故缺課扣 10 分 / 次，請假兩次以上第二次起扣 5 分 / 次）\n4. 繳交心得 -----10% (不超過 1000 字，中英文皆可)\n\n1. Final Report - 30%, submit a final report of at least 5,000 words on any topic chosen for the course, in 12-point font, in italics, with references to relevant literature, in APA format.\n2. Class discussion - 20%, participation in discussion and questions.\n3. Attendance and learning attitude ----40% (10 points/time for unexcused absence from class, 5 points/time from the second time of absence for more than two times)\n4. Submission of thoughts -----10% (no more than 1000 words, both Chinese and English are allowed)",
    "materials": "教育部（2019）。技術及職業教育政策綱領。行政院。https://ws.moe.edu.tw/001/Upload/3/　relfile/6315/52872/8e95fa4b-84a9-4656-938b-1a8de94cf5e2.pdf\n張仁家（2018）。全美第一技職教育如何煉成？看俄亥俄州怎麼做。技職 3.0。https://www.tvet3.info/ 20181105-3/\n俄亥俄州立大學（2020）。Christopher Zirkle 博士個人網站。https://u.osu.edu/zirkle.6/\n技術及職業教育研究所（2020）。設立沿革與發展。https://wwwtve.ntut.edu.tw/p/ 412-1090-13086.php?Lang=zh-tw",
    "consultation": "There are three channels for course consultation: 1.line  2.email: jc5839@mail.ntut.edu.tw  3. face to face(please make an appointment previously) google meet course website  https://meet.google.com/hzy-yjfn-cxx",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
