[
  {
    "name": "吉塔",
    "email": "sangeetha@mail.ntut.edu.tw",
    "latestUpdate": "2023-06-02 11:40:15",
    "objective": "THE FUEL CELL is an important component in Energy Engineering and can be defined as an electrochemical system that converts chemical energy in the fuel into electrical energy with the help of electrodes and redox electrochemical. There are many kinds of fuel cells that help us in meeting the energy demands of this modernizing world. Understanding them theoretically is very significant for research advancements in the field of Energy. \nThis course ' THE FUEL CELL’ is a basic course taught entirely in English. \nThe aim of this course is to provide introductory knowledge to students about the basics, types, working mechanism, applications and advancements in the field of fuel cells.\nThis class will also deal with sustainable fuel cells for producing clean energy and thereby preventing hazardous environmental issues through significant energy efficiency improvements and sustainable use of resources.\nThis course enables students to fully understand the basics of professional disciplines of the fuel cell, and to further inspire and enhance the knowledge of students about future energy technology. \nThis course also has an important objective of motivating non-native English students to improve their English language skills like conversing, discussing and writing assignments in English.\nThese practices will help them deliver better English presentations and also enhance their thesis and paper writing abilities.",
    "schedule": "Week 1: Fuel cells - Introduction \nWeek 2: Types of Fuel cells\nWeek 3: Basic overview of Fuel cells \nWeek 4: Polymer electrolyte membrane fuel cells \nWeek 5: Direct methanol fuel cells \nWeek 6: Alkaline fuel cells\nWeek 7: Microbial Fuel Cells\nWeek 8: Solid oxide fuel cells\nWeek 9: Midterm Exam (Nov 8, 2023)\nWeek 10: Reversible fuel cells\nWeek 11: Molten carbonate fuel cells\nWeek 12: Phosphoric acid fuel cells \nWeek 13: Fueling of fuel cells \nWeek 14: Microbial Electrolysis cells\nWeek 15: Hydrogen energy\nWeek 16: Delivering fuel cell power \nWeek 17: Biological Fuel cells \nWeek 18: Final Exam (Jan 10, 2024)\n1. The students of this class will be separated into groups for weekly presentation purposes and every week the Teacher will assign a topic for the presentation.\n2. In every class, the Teacher will initially finish the teaching\n3. Then one person from every group has to give his/her presentation\n4.The students can use Powerpoint and YouTube videos to make their presentations interesting",
    "scorePolicy": "1.The Teacher will conduct one Midterm exam and one Final exam throughout the semester\n2. The total score of exam will be for 100 marks, in which the Teacher will consider the assignment marks, class attendance and the weekly presentation of every student.\n3.The final score will be for 100% and it will be a sum of evaluations as 50% (from the final written exam) 25% (from the Midterm exam score) 15% (from the class presentations) 10% (from class attendance and attentiveness).",
    "materials": "1.\tThe Teacher will use some related textbooks/bibliography materials for the class.\n2.\tThe Teacher will also prepare some appropriate PowerPoints for some classes.",
    "consultation": "1.\tThe Teacher of this course will follow all rules and practices which will make the class interesting to the students.2.\tThe students will have a new experience in learning and improving English skills.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
