[
  {
    "name": "楊景德",
    "email": "jyang@ntut.edu.tw",
    "latestUpdate": "2023-08-29 08:49:11",
    "objective": "Creativity Quotient” refers to the quotient one has for her ability of creativity. The course covers at least the following topics relevant to “Creativity Quotient”: its scientific basis, its psychological methods, its epistemic foundation, the development of the gene of creativity, the difference between individual creativity and creativity in a group, etc. The course will proceed with a series of close surveys of western theories and accounts of creativity and practical cases so that the participants of the course will cultivate their “creativity quotient. ”",
    "schedule": "1\tIntroduction: What is the \"creativity quotient\"？\n2\tCreative Butterfly Thinking I\n3\tCreative Butterfly Thinking II\n4\tCreative Butterfly Thinking III\n5\tCreativity CEO I\n6\tCreativity CEO II\n7\tCreativity CEO III\n8\tCreativity Method: Toothache Tree\n9\tMid-term Exam Week\n10\tCreativity Method: Observation I\n11\tCreativity Method: Observation II\n12\tCreativity Method: Analogy I\n13\tCreativity Method: Analogy II\n14\tCreativity Method: Association I\n15\tCreativity Method: Association II\n16\tCreativity Method: Creativity Box\n17\tCreativity Method: Painting I\n18\tCreativity Method: Painting II",
    "scorePolicy": "The average scores of both in-class and take-home feedback assignments. Nevertheless, no work done by ChatGPT is allowed.",
    "materials": "Required textbooks:\n1. Olivia Fox Cabane &Jubah Pollack, The Net and the Butterfly The Art and Practice of Breakthrough Thinking，2017.\n\n2. Dorte Nielsen & Sarah Thurber: The secret of the highly creative thinker， \n  2017.\n\n3. Mario Pricken: CLOU: Strategisches Ideenmanagement in Marketing, Werbung, Medien und Design,Verlag Hermann Schmidt, 2009.\n\n4. Mario Pricken: CLOU II: Strategisches Ideenmanagement in Marketing, Werbung, Medien und Design,Verlag Hermann Schmidt, 2010.\n\n\n\n\n\n\n\nRecommend textbooks:\n\n1. Keri Smith: How To Be An Explorer Of The World，2009.\n\n2. Betty Edwards: Drawing on the Artist Within: A guide to innovation, invention, imagination, and creativity. Published by Simon& Schuster, 1987.\n\n3. Tina Seelig: in Genius: A Crash Course on Creativity: HarperOne, 2012.",
    "consultation": "course instructorWe shall set up a class line group during the first two weeks, followed by joining a Google Meeting discussion room should we take a remote class. My E-mail: jyang@ntut.edu.tw",
    "remarks": "N/A",
    "foreignLanguageTextbooks": true
  }
]
