[
  {
    "name": "王聖銘",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2023-05-25 12:40:32",
    "objective": "Principle of Interaction Design: Autumn 2022 - Syllabus\nMeeting Times and Location: Wednesday, periods: 5-6, \nCredit Hours: 2.0\nInstructors: Ryan Sheng-Ming Wang\nInstructor Office Location and Hours: Room705-2, Design College bldg., Tuesday, periods: 7-9 and Monday 3-4.\nInstructor Contact Information: E-mail: ryan5885@mail.ntut.edu.tw\n\nCourse Description: \n\"Interaction Design\" blends theoretical and practical perspectives in the areas of visualization and interactivity into several focused aspects using interactivity for education, entertainment, interactive media design and industrial design purposes. \nAn interface is the link between a user and a design that communicates how a design will be used, creating an experience for the people who will use it. It provides the framework, elements, and resources for a “conversation” to take place between users and design.\n In this course, we will explore the fundamentals of interfaces and the interaction design process. Students will be introduced to and have opportunity to practice the fundamental concepts, methods, and practices of interaction design. They will explore the ideas of \"User Experience Observation \", \"Form Follows Function\" and \"User Interaction Analysis and Evaluation\". They will explore how interactive media create experiences, and understand the role that interaction with contents and installment fulfills in human existence. Finally and most importantly, students need to learn how to improve their ability to present their design ideas.\nThis is a class with time devoted to lecture, discussion, practice activities, design work sessions, and critique of practical work. \n\n\nCourse Objectives/Goals: \nAt the conclusion of the course, students will be able to: \n1.\tIdentify how increasingly complex technologies are integrated into designs, services and events. \n2.\tDefine how digital or physical artifacts behave in response to user-centric interaction. \n3.\tDescribe, test and evaluate the usability and sustainability of user interfaces. \n4.\tApply iterative cycles of research, testing and development based on the understanding of user needs, goals and experiences. \n5.\tDevelop solutions and processes to common or known interface problems. \n6.\tBuild and test rapid prototypes for look and feel and usability. \n7.\tUtilize client based concept development to develop the strategy, information architecture, human-computer interaction and interface design. \n8.\tDemonstrate competency in information architecture, human-computer interaction and interface design.",
    "schedule": "W1.\tWhat is Interaction Design\nW2.\tEvolution of HCI in Interactive Media Design (Assignment: Project I Content with HTML5 and CSS) \nW3.\tUnderstanding and Conceptualizing Interaction and Information Visualization \nW4.\tUnderstanding Users and What is User Experience\nW5.\tProject I Presentation and Critique (Assignment: Project II Mobile Device UI)\nW6.\tResponsive and Natural UI Design\nW7.\tDesigning for Collaboration and Communication \nW8.\tProject II Presentation and Critique (Assignment: Midterm Project Proposal Draft)\nW9.\tService Design I, Brainstorming, POG and SET (Assignment: Midterm Project Proposal Final) \nW10.\tService Design II, QFD, AHP, and Data Gathering\nW11.\tMidterm Project Presentation, Judge and Critique \nW12.\tData Analysis, Interpretation and Presentation (Assignment: Term Project and Paper I)\nW13.\tThe Process of Interaction Design (Assignment: Term Project and Paper II)\nW14.\tIdentifying Needs, Establishing Requirements, Designing, Prototyping, and Construction \nW15.\tIntroducing Evaluation and  Evaluation Framework\nW16.\tTerm Project and Paper Presentation and Critique I\nW17.\tTerm Project and Paper Presentation and Critique II\nW18.\tFinal Exam and Term Paper and Project Submission",
    "scorePolicy": "Participation \t20%\nProject I HTML 5 and CSS \t10%\nProject II MOBILE UI \t10%\nMidTerm Project  \t15%\nTerm Project and Paper TANGIBLE \t35%\nFinal Exam 10%",
    "materials": "1.\tMoggridge, B, Designing interactions, MIT press, (2007). (Chapter \"Designing Interactions\" pp. 647-662) \n2.\t As We May Think, Vannevar Bush, The Atlantic Monthly, July 1945 \n3.\tRich Gold, The Plenitude: Creativity, Innovation, and Making Stuff (Simplicity: Design, Technology, Business, Life) (Chapter 2: The Four Creative Hats I've Worn, pp 5-31) \n4.\tJon Kolko (2011), Exposing the Magic of Design: A Practitioner's Guide to the Methods and Theory of Synthesi\n5.\tJon Kolko (2010), Thoughts on Interaction Design\n6.\tDunne, A, & F Raby, Design Noir: The secret life of electronic objects, Birkhauser, 2001. (Sec 2 \"Hertzian Space\" pp. 15-43).\nDunne, A, & F Raby, Design Noir: The secret life of electronic objects, Birkhauser, 2001. (Sec 5 \"The Secret Life of Electronic Objects\" pp. 75-90).\n7.\tRittel, Horst, and Melvin Webber; \"Dilemmas in a General Theory of Planning,\" pp. 155-169, Policy Sciences, Vol. 4, Elsevier Scientific Publishing Company, Inc., Amsterdam, 1973. [Reprinted in N. Cross (ed.), Developments in Design Methodology, J. Wiley & Sons, Chichester, 1984, pp. 135-144.]\n8.\tBillinghurst, M., Kato, H. and Poupyrev, I. (2001). MagicBook: Transitioning between Reality and Virtuality. \n9.\tKuniavsky, Mike (2010), Smart Things: Ubiquitous Computing User Experience Design (Chapter 10)\n10.\tPhysical Computing: Sensing and Controlling the Physical World with Computers by Tom Igoe and Dan O'Sullivan (2004). (SELECTIONS) \n11.\tPast, Present, and Future of User Interface Software Tools, Brad Myers, Scott E. Hudson, Randy Pausch, ACM Transactions on Computer-Human Interaction, March 2000, pp. 3 - 28.\n12.\tStacey Kuznetsov and Eric Paulos, Rise of the Expert Amateur: DIY Projects, Communities, and Cultures, ACM NordiCHI, Reykjavik, Iceland, October 2010\n13.\tVoyagers and Voyeurs: Supporting Asynchronous Collaborative Information Visualization, Jeffrey Heer, Fernanda Viegas, Martin Wattenberg, CHI 2007: ACM Conference on Human Factors in Computing Systems, pp. 1029 - 1038.\n14.\tJohn Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI '07). ACM, New York, NY, USA, 493-502.\n15.\tTracee Vetting Wolf, Jennifer A. Rode, Jeremy Sussman, and Wendy A. Kellogg. 2006. Dispelling \"design\" as the black art of CHI. In Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 521-530 \n16.\tUniversal Principles of Design, Revised and Updated: 125 Ways to Enhance Usability, Influence Perception, Increase Appeal, Make Better Design Decisions, and Teach through Design - William Lidwell (SELECTIONS )\n17.\tKuniavsky, Mike (2010), Smart Things: Ubiquitous Computing User Experience Design (Chapter 19)\n18.\tPaul Dourish, Where the Action Is (chapters 1 & 2)\n19.\tNorman, D. Emotional Design: Why We Love (Or Hate) Everyday Things. Basic Books, 2004. (SELECIONS)",
    "consultation": "1. 線上建置的課程社群平台 2. 以電子郵件寄信預約諮詢時間 ryan5885@mail.ntut.edu.tw3. 依公告教師諮詢時間，事先排定諮詢時間 ryan5885@mail.ntut.edu.tw。",
    "remarks": "Once the lecture needs to go online, lecture materials/assignments/course works will use google classroom as the interactive platform.",
    "foreignLanguageTextbooks": true
  }
]
