[
  {
    "name": "鍾建屏",
    "email": "thomas6311@mail.ntut.edu.tw",
    "latestUpdate": "2023-05-31 09:13:39",
    "objective": "本課程將介紹數位金融理論以及介紹代表性的實務案例，課程中除了學習數位金融及人工智慧專業知識外，並結合實作來了解如何應用 APP 及聊天機器人於智慧金融及金融行銷等領域。在實作過程中，將鏈結進駐金融科技創新園區金融機構及新創公司所有業師資源，共同創建教學大綱和案例研究，並導入業師進行課程教學或講座或協同教學 (Co-teaching)，在授課過程中，學生不僅可以學習到 APP 的應用程式開發以及最有系統的方式學會如何設計並建立一支經過用戶體驗設計（介面設計與互動設計）的 Chatbot，同時教導學生如何透過實證場域驗證進行串接 API，發想創意，鼓勵金融創新實證之共創生態發展、降低金融科技創新實證門檻、同時兼顧創新風險控管與不影響市場運作機制，並將科技導入進行創新創業。課程內容包括：創業思維、設計思考、數位金融創新商業模式、無現金社會新興平台與行動支付的發展趨勢、保險科技 (InsurTech) 的應用及發展趨勢、籌資模式演進與 P2P 貸款、金融科技的新興資訊工具應用發展趨勢、虛擬貨幣與區塊鏈專題探討、及機器人理財與 AI 的創新應用等，並探討數位新科技與人工智慧發展對金融產業衝擊、新典範的反思與影響。\nThis course will provide students with the latest empowering and practical knowledge on Digital Finance enabling them to understand some of the FinTech changes taking place currently in the financial services industry and, most importantly, the trends that will impact the industry in the future. The course content will include peer to peer lending platforms and crowdfunding, internet finance, online finance, bitcoin, digital currencies, digital payments, big data, insurtech, machine learning and its applications in FinTech such as robo-advising. etc. and their practical impact on global banking and finance.",
    "schedule": "教學進度規劃如下：\n\n1. 課程主題：金融科技的發展演進\n課程內容包括：金融科技之起源與發展、金融科技對傳統金融業之衝擊、國際銀行業金融科技之因應趨勢、我國金融科技之發展政策、數位新科技對金融理論衝擊、新典範的反思與影響\n\n2. 課程主題：雲端運算\n課程內容包括：雲端運算的定義與特色、雲端運算的三大服務模式、雲端運算佈署的三種模型、雲端運算的應用、雲端運算的安全問題\n\n3. 課程主題：大數據與新市場平台\n課程內容包括：數據資料的基本單位、大數據的定義及特性、大數據資料類型、大數據資料分析的五步驟、金融業大數據應用方向、大數據發展的困難與挑戰、新市場平台\n\n4. 課程主題：人工智慧\n課程內容包括：人工智慧簡介、人工智慧於金融之應用發展、人工智慧的風險與挑戰、人工智慧發展對金融產業發展衝擊、反思與影響\n\n5. 業師專題演講：互聯網金融創新模式發展與應用\n課程內容包括：互聯網金融定義、互聯網金融的應用、互聯網金融的發展趨勢及應用案例\n\n6. 課程主題：Blockchain (區塊鏈) 的發展與應用\n課程內容包括：區塊鏈定義、區塊鏈的形成、特性、制度類型、優點以及在金融上與商業上的應用\n\n7. 課程主題：生物辨識技術\n課程內容包括：生物辨識的緣起、生物辨識技術種類現況、導入何種最適生物辨識技術之評估、生物辨識在金融創新之運用現況與趨勢\n\n8. 課程主題：保險科技創新模式及發展趨勢\n課程內容包括：保險科技定義、保險科技簡介、保險科技之應用與發展、保險科技的影響與挑戰\n\n9. 業師專題演講：金融科技園區 Open API 資源介紹、應用及串接實作\n課程內容包括：金融科技園區 Open API 資源介紹、Open API 應用案例、金融科技園區 RESTful API 串接實作等，並透過「數位沙盒」驗證環境試行國內第一個「場域限定」金融科技創新實證 API 數位共通環境\n\n10.\t課程主題：聊天機器人介面設計與 AI 簡介 (學生實作)\n課程內容包括：什麼是人工智慧？人工智慧發展的歷史、聊天機器人介面設計、人工智慧應用與實作\n\n11. 課程主題：聊天機器人於金融商品數位行銷之應用 (學生實作)\n課程內容包括：建置智能聊天機器人學生實作、數位行銷功能導入 Line Bot 應用\n\n12. 業師共授與學生實作：聊天機器人串接 Open API 應用工作坊\n課程內容包括： Chatbot 建置與 Open API 串接、LINE Chatbot Open API 案例介紹、Jupyter 實作\n\n13. 業師共授與學生實作：APP 製作與串接 API 之應用\n課程內容包括：使用軟體 Thunkable 及 APP Inventor 資源介紹、APP 製作及開發技巧、股市資料庫資料 API 之串接實作\n\n14. 業師共授與學生實作：股市資訊查詢 APP 之製作與開發\n課程內容包括：股市資料查詢 APP 製作、選股 APP 介面開發及應用、APP 上架 Google Play 商店實作\n\n15. 課程主題：創新創業資源與創業計畫書之撰寫\n課程內容包括：政府創新創業資源簡介、創業計劃書撰寫技巧、創業簡報架構\n\n16. 課程主題：如何與投資人共創價值與專利佈局\n課程內容包括：投資人的類型與屬性、募資計畫撰寫、新創估值評價方法、專利佈局實務簡介\n\n17. 分組專題期末報告 (一)\n課程內容包括：分組專題的科技應用應分為兩個部分，一是導入通用式 AI 透過串接 Line 及 Facebook 的 API 建置聊天機器人；二是透過 Thunkable 製作 App，以及應用 App 串接外部的 API，來發揮 App 所應包含之功能     。首先將透過競賽篩選出具有發展潛力及可行性最高的學生團隊；其次，參與本校與金融科技創新園區合作開展「金融科技 API 數據應用培育計劃」，內容包括：金融科技 API 介紹、技術指導與實際操作應用、學生小組討論主題實作，最後是成果發表。     \n\n18. 分組專題期末報告 (二)\n課程內容包括：分組專題的科技應用應分為兩個部分，一是導入通用式 AI 透過串接 Line 及 Facebook 的 API 建置聊天機器人；二是透過 Thunkable 製作 App，以及應用 App 串接外部的 API，來發揮 App 所應包含之功能首先將透過競賽篩選出具有發展潛力及可行性最高的學生團隊；其次，參與本校與金融科技創新園區合作開展「金融科技 API 數據應用培育計劃」，內容包括：金融科技 API 介紹、技術指導與實際操作應用、學生小組討論主題實作，最後是成果發表。",
    "scorePolicy": "個案分析報告 (Case Report) 30 %\n課堂參與 (Class Participation) 及作業 (Assignments) 20 %\n數位金融創新創業專題實作團體報告 (Group Presentation) 50 %",
    "materials": "金融科技力 (FinTech 測驗參考用書)",
    "consultation": "Office Hours: 星期三 13：00～17：00",
    "remarks": "學生會被要求參加 2023 年臺北金融科技展以及金融科技競賽",
    "foreignLanguageTextbooks": false
  }
]
