[
  {
    "name": "蘇威豪",
    "email": "weihao.su@ntut.edu.tw",
    "latestUpdate": "2023-05-29 19:51:13",
    "objective": "顧客關係管理主要目的是了解企業與顧客之關係，促使顧客滿意及忠誠回應而產生終身價值，進而提昇企業獲利，其內容包括顧客關係管理的概念與本質、顧客行為、顧客資料探勘、顧客關係管理系統、顧客關係管理專案之規劃與管理、顧客關係管理的績效衡量、顧客關係管理實務研討。商業智慧 (Business Intelligence, BI)，是企業利用現代資訊技術收集、管理和分析結構化與非結構化的企業資料與資訊，創造和累積企業知識與見解，以改善企業決策品質與採取有效的企業行動，進而提升企業各方面績效。由基本現場管理 (Shop Floor Control) 需求談起，然後介紹製造資訊分類與收集技術（包括 RFID），也將包括資料庫與資料倉儲觀念，最後介紹 BI 於顧客關係管理之應用。課堂中也將輔以目前市面上商用 BI 套裝軟體，並將其專業上相關資訊在此系統上實際應用，體驗 BI 對企業之重要性。\nThe objectives of Customer Relationship Management (CRM) are to study the relationship between corporation and customer, to increase the profit by customer lifetime value through customer satisfaction and royalty. The topics of this course includes concepts and context of CRM, consumer behavior, customer data mining, CRM system, planning and management of CRM projects, performance measurement of CRM. Business intelligence (BI) systems refer to applications and technologies which gather and analyze data about company operations. It then provides a comprehensive correlation of those factors, such as metrics on sales, production, internal operations, and helps managers to make better business decisions. This course focuses on applications of BI in CRM, with the introduction of shop floor control concepts and data collection techniques such as RFID, along with database and data warehouse concepts. Hands-on experience in BI software implementation is also emphasized.",
    "schedule": "WK#01 第 1 章 顧客關係管理本質 \nWK#02 第 2 章 了解顧客差異 \nWK#03 第 3 章 資訊科技與蒐集顧客資料 \nWK#04 第 4 章 CRM 資料倉儲 \nWK#05 第 5 章 顧客忠誠度 \nWK#06 第 6 章 顧客保留策略 \nWK#07 第 7 章 贏回顧客及獲得的策略 \nWK#08 第 8 章 銷售力自動化及自動化客服中心 \nWK#09 期中考\nWK#10 第 9 章 基本的資料探勘、線上分析處理、資訊呈現\nWK#11 第 10 章 衡量顧客的滿意度及忠誠度 \nWK#12 第 11 章 執行顧客關係管理系統的議題\nWK#13 期末報告 (一) (Final project presentation – 1)\nWK#14 期末報告 (一) (Final project presentation – 2)\nWK#15 期末報告 (一) (Final project presentation – 3)\nWK#16 期末報告 (一) (Final project presentation – 4)\nWK#17 期末報告 (一) (Final project presentation – 5)\nWK#18 期末考",
    "scorePolicy": "平時成績 (含出席、課堂表現、個案報告與作業) 40%\n期中考 30%\n期末考 30%",
    "materials": "李勝祥等譯 (2005), 顧客關係管理，滄海書局 (1 版)",
    "consultation": "e-mail:weihao.su@ntut.com.twline id:wh-su",
    "remarks": "課程對應 SDGs 指標：8. 就業與經濟成長因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 若授課方式改線上教學，則以 google me 作為線上教學用軟體，期中、期末報告以線上方式進行",
    "foreignLanguageTextbooks": false
  }
]
