[
  {
    "name": "徐昕煒",
    "email": "hwhsu@ntut.edu.tw",
    "latestUpdate": "2023-05-25 17:46:43",
    "objective": "本課程教導學生學習如何基於系統和邏輯概念進行定量分析方法以解決管理上的問題，並進行生產與實務上的分析與決策。透過將實務問題經假設，將其轉化為的數學模式，進而優化決策品質並對資源做有效運用。課程除最佳化理論外，亦教授如何運用相關軟體解決最佳化模型求解問題。\n任何一個實務問題，原則上都可以透過不同的作業研究方法轉換成一個數學問題，然而轉換的過程是否符合真實，則取決於對於方法學與實務問題的認知！實務問題在做的就是「將有限的資源做最有效的利用」，而本課程的宗旨就是透過作業研究方法達成上述之目的。解決問題的方法很多，然作業研究方法是一個有系統的求解過程。\n本學期的課程主要教授最佳化方法中的線性規劃 (linear Programming) 以及其相關衍生之問題，亦包含 Transportation problem。目標是讓學生具有將實際所面對問題，轉化為最佳化問題，寫成一數學規劃的能力；並了解球解最佳解的原理以及對結果的進一步分析的能力。本課程以教授原理為主但鼓勵學生使用相關軟體。\nIn this course, students will learn how to perform quantitative analysis methods based on system and logical concepts to solve management and decision-making problems usually seen in real world, especially in production and logistics. Through assumptions, practical problems are transformed into mathematical models to optimize the quality of decision-making and make effective use of resources. In addition to optimization theory, the course also teaches how to use related software to solve optimization model.\nIn principle, any practical problem can be converted into a mathematical problem through different OR research methods. However, whether the result is true or not depends on the knowledge of methodological and practical problems! The practical problem is to \"make the most effective use of limited resources\", and the purpose of this course is to achieve the above-mentioned purpose through the OR method.\nIn this semester, we will learn the topic of optimization including linear program and its related derivative problems, as well as transportation problems. The objective is to train students to have the capabilities to model the corresponding optimization problem after observing the real case problem; to let them know the mathematics in solving the optimization problem and the ability to further analyze the results of the optimal solutions.",
    "schedule": "Week 1 課程簡介\nWeek 2 線性規劃建模與圖解法 / 線性規劃假設\nWeek 3 線性規劃建模 / 案例計算\nWeek 4 講授 Excel 規劃求解之操作 / Simplex method 理論 / Simplex method (Algebra Form): 以代數的方式講解球求解線性規劃問題 simplex 方法。 強調在觀念上對 simplex 方法的了解。\nWeek 5 Simplex method (Tabular Form): 以表格的方式講解 simplex 方法。 強調 simplex 方法的解法觀念。\nWeek 6 後最佳化分析 / Big-M Simplex Method\nWeek 7 Two-Phase Simplex Method/ The Revised Simplex Method\nWeek 8 Sensitivity Analysis (Graphical)/ 以圖形討論如果參數波動下最佳解的波動 / The Revised Simplex Method\nWeek 9 期中考\nWeek 10 Sensitivity Analysis (Applications): 藉由參數波動下，討論最佳解的經濟意義 / The Revised Simplex Method\nWeek 11 Duality Theory I: 從另一對偶 (Duality) 的角度表達線性規劃問題。\nWeek 12 Duality Theory II: 從 Duality 的角度說明線性規劃問題所呈現在經濟層面的解釋如 shadow price。\nWeek 13 Duality Theory III: 討論 Duality 與線性規劃問題在 simplex 方法上的對應性。\nWeek 14 Sensitivity Analysis I: 以 Duality 的觀點深入討論討論如果參數波動下最佳解的波動。\nWeek 15 Sensitivity Analysis II: 用更廣義的方法 (Fundamental Insight) 討論在參數波動下，再以量化的方式討論最佳解的波動。\nWeek 16 Sensitivity Analysis III: 用更廣義的方法 (Fundamental Insight) 討論在參數波動下，再以量化的方式討論各參數的範圍。\nWeek 17 Dual simplex method/ Parametric programming\nWeek 18 期末考",
    "scorePolicy": "平時考：25% [取最高分 10 次，約考 14 次]\n期中考 35%\n期末考 35%\n出席  5%",
    "materials": "【外文參考書籍】 Introduction to Operations Research, Hiller and Lieberman, 2021, McGraw-Hill, ISBN- 9781260575 873, 11th\n\u000b【中文參考書籍】作業研究 Hillier 10/e, 喻奉天，2019, 東華，ISBN-9789863414285, 10th\n\n每週固定上傳個人講義",
    "consultation": "授課老師資訊 \t授課老師：徐昕\t辦公室：宏裕大樓 1134 室\t辦公室電話: 02-27712171 ext.2323\thwhsu@ntut.edu.tw 課程辦公室時間 \t星期二 13:00-16:00        星期三 10:00-12:00\t或者事先預約",
    "remarks": "小考規則＃禁止使用手機\u000b方案一：Open Book 考當天上課內容方案二：Close Book 考上週上課內容",
    "foreignLanguageTextbooks": true
  }
]
