[
  {
    "name": "陳生明",
    "email": "smchen@ntut.edu.tw",
    "latestUpdate": "2023-05-23 14:38:31",
    "objective": "The aim and purpose of this course is to introduce and expand the electrochemistry to develop the biofuel cells. Generally the catalysts of biofuel cell are composed by enzymes, microbial, creature cells and the bio-reduction process. In the biofuel cells the reaction process can be distinguished into mediator less and mediator transfer process. In this course, we will introduce the principle, reaction process and the application of biofuel cells. Especially, a detailed study about the utilization of film modified electrodes and different electrolyte solutions for the development of biofuel cells.",
    "schedule": "First week: Mid-Autumn Festival holiday\nSecond week: Introduction of fuel cells and biofuel cells \nThird week: Applications of biofuel cells\nFourth week: Enzyme-based biofuel cells\nFifth week: Enzyme-based biofuel cells\nSixth week: Microbial-based biofuel cells & Photomicrobial fuel cells\nSeventh week: Enzyme electrodes, Enzyme Electrochemistry\nEighth week: Chemically modified Electrodes and biofuel cells applications\nNinth week: Mid-term presentation\nTenth week: Voltammetry and biofuel cells\nEleventh week: Scanning probe microscopy\nTwelfth week: Mediated Electron Transfer (MET) and biofuel cells\nThirteenth week: Direct Electron Transfer (DET) and biofuel cells\nFourteenth week: AC voltammetry, AC impedance, EIS and biofuel cells\nFifteenth week: Mass spectroscopy in detailed study\nSixteenth week: Polarizable behavior and biofuel cells\nSeventeenth week: Presentations Q&A\nEighteenth week: Final presentations",
    "scorePolicy": "Group discussions: --------------------15%\nExams (including final):-------------- 15%\nClass Presentations: -------------------15%\nWritten Reports:------------------------ 25%\nExperimental results:-------------------20%\nIn Class Participation:----------------- 10%",
    "materials": "SCI Paper",
    "consultation": "Sun Yat-Sen Memorial hall (Environmental Engineering) Room 404",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
