[
  {
    "name": "莊淳淩",
    "email": "clchuang@mail.ntut.edu.tw",
    "latestUpdate": "2023-05-27 09:59:37",
    "objective": "本課程旨在介紹供應鏈管理中之相關問題及議題 。其中包含產業分析、e 化概念、需求及供應管理、長鞭效應、存貨管理、延遲理論、及供應鏈管理實務。\nThe purpose of the course is to offer student a sound introduction of supply chain management relative issues. It includes industry analysis, E-business concept, demand and supply management, bullwhip effect, inventory management, postponement, and supply chain management practice.",
    "schedule": "COURSE OUTLINE / CALENDAR\nUnderstanding the Supply Chain (Chapter 1) \nAchieving Strategic Fit in a Supply Chain (Chapter 2) \nSupply Chain Drivers and Metrics (Chapter 3) \nDesigning Distribution Networks and Applications to Omni-Channel Retailing (Chapter 4) \nNetwork Design in the Supply Chain (Chapter 5) \nDesigning Global Supply Chain Networks (Chapter 6) \nSales and Operations Planning in a Supply Chain (Chapter 9)\nManaging Economies of Scale in a Supply Chain Cycle Inventory (Chapter 11)\nTransportation in a Supply Chain (Chapter 14)",
    "scorePolicy": "COURSE GRADING\n\tThe final course grade will be calculated based on the following:\nInterim report\t10%\nExams\t50% (Midterm Exam: 25%, Final Exam: 25%)\nQuizzes\t  10%\nAttendance \t  30%",
    "materials": "Supply Chain Management: Strategy, Planning, and Operation, Seventh Edition, Global Edition by Sunil Chopra, 2019, Pearson Education, Ltd.   ISBN : 978-1292-257891-9",
    "consultation": "Course consultation:  Course consultation need to make an appointment via clchuang@mail.ntut.edu.tw in advance.",
    "remarks": "If this semester’s courses are planned according to the epidemic alert level, the principles are as follows. For the actual implementation date and class method, please follow the information announced on the school website:(https://istudy.ntut.edu.tw/teach/index.php)●Evaluation method:Mid-term and final exams take physical paper-and-pencil tests; final reports take online reports",
    "foreignLanguageTextbooks": true
  }
]
