[
  {
    "name": "梁誠",
    "email": "lcheng@ntut.edu.tw",
    "latestUpdate": "2023-08-10 13:40:08",
    "objective": "材料『機械行為』也稱『固體行為』。為有效選用固體材料（包括金屬、陶瓷、高分子）在機械及結構上可負載荷重及應力，並防止斷裂，確保安全。從固體彈性變形，應力應變，合應力 屈服強度，塑性變形模型，應力、應變 疲勞、缺口疲勞觀念、裂紋成長、高溫潛變及振動等逐項學習。介紹各種材料機械性質的基礎知識及各種塑性成形的方法，打好 材料成形之基礎.\nThe mechanical behavior of material is also called solid behavior.In order to select\na solid material (including metal, ceramics and polymer) which is able to bear the objective load and stress at the mechanics and structure, and to prevent rupture for safety. It depends on the elastic deformation of solid, the fluid model of stress strain, the yield strength of synthetic stress, plastic deformation model, stress fatigue, strain fatigue, cleavage fatigue, destructive dynamics, crack growth, high temperature creep and alleviate vibration to learn the subject. It also introduces all kinds of fundamental knowledge and theory of material mechanic property.",
    "schedule": "1\t介紹材料機械性質概論 ，(包含部分製程課之未完部分)，\n2\t介紹材料力學性質與製程之關係\n3\t材料機械性質與結構之關係\n4\t各種常見的機械基礎 - 彈性行為 與塑性成形章節及講義 \n5\t材料塑性行為，金屬及陶瓷材料機械行為之基本理論                   \n6\t介紹材料試驗方法及機械冶金基礎\n7\t塑性變形理論、單晶的塑性變形\n8\t期中考\n9\t材料 強化機構理論\n10\t強化機構分述\n11\t材料的疲勞\n12\t材料的潛變\t        \n13\t材料的破壞          \n14\t材料之選用。     \n15-18  期末報告",
    "scorePolicy": "期中考 40%\n\n期末報告及 paper reading  40%\n\n平時成績 20%",
    "materials": "課本及參考書目等\n1. Dowling;  Mechanical Behavior of Materials - Engineering Methods for \n    Deformation, Fracture, and Fatigue, \"4th Ed\" ; Norman E. Dowling; Prentice-Hall, Inc.﹝滄海書局﹞; 2017\n\n2.  材料破損分析，莊東漢教授著，五南圖書\n3.  機械製造 (SI 第七版) KALPAKJIAN；STEVEN SCHMID 著  蘇春熹老師譯，高立圖書公司 (SI 七版)  ，(中文版 or 外文)，第二章中間未完之部分  及 後面章節      機械塑性成形及講義。\n\n\n參考書目:\n1.  Courtney，Mechanical Behavior of Materials，Thomas H. Courtney， \n     McGRAW-HILL INTERNATIONAL Ed.",
    "consultation": "內容及教材提供在 I - 學園平台 及 TEAMS",
    "remarks": "本學期原則採實體授課方式；因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 學生遠距上課或實體授課視疫情公告，上課時間、上課內容及教材提供在 I - 學園平台 及 TEAMS◎",
    "foreignLanguageTextbooks": true
  }
]
