[
  {
    "name": "曾昭衡",
    "email": "tsengco@ntut.edu.tw",
    "latestUpdate": "2023-05-25 17:29:37",
    "objective": "教學大綱：簡介作業研究 Systems Analysis 中的各式優選工具，並學習混沌理論。以生態族群的 Growth and Decay 模式為例，初窺混沌世界的奇妙，以提供往後解決問題時有不同的思考方向。混沌理論應用在物理、經濟、生物、數學的領域上，處理數百年來許多無法看透的問題有不錯進展 (包括紊流現象)，在環境領域上的應用則尚待開拓。只要處理的系統 (問題) 具有自我相似性，以混沌來處理是可行的。(課程中將視時間教進階數學軟體 Mathematica.)  Explore Chaos Theory from the Models of Growth and Decay (Simple Logistic Model, Logistic Model with Carrying Capacity, Logistic Model with Carrying Capacity and Migration).  Introduce important factors of Chaotic Behavior: Dynamics of species, Critical Reproduction Rate, Bifurcation, Butterfly effect.  Examples of Chaotic behavior: Single Species System, Two Species Competition System, Two Species Predator-Prey System.",
    "schedule": "1. 優選工具簡介 Mathematic tools for system analysis\n\t線性規劃\n\t時間序列、啟發式演算法、類神經網路、灰色理論 / 模糊理論\n\t賽局理論、小世界理論\n2. Models of Growth and Decay \n\tSimple Logistic Model\n\tLogistic Model with Carrying Capacity\n\tLogistic Model with Carrying Capacity and Migration\n3. Chaotic 混沌 Behavior (week 3 交 HW1)\n\tDynamics of species\n\tCritical Reproduction Rate\n\tBifurcation\n4. Examples of Chaotic behavior\n\tSingle Species System\n\tTwo Species Competition System\n\tTwo Species Predator-Prey System\n5. Butterfly effect 蝴蝶效應. Deterministic or Random? (week 5 交 HW2)\n6. Final Exam;",
    "scorePolicy": "HW 2*40%+ 1 Exam 20%",
    "materials": "PPT",
    "consultation": "tsengco@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "楊任軒",
    "email": "rxyang@ntut.edu.tw",
    "latestUpdate": "2023-05-25 14:12:12",
    "objective": "永續發展是妥善規劃與管理自然資源之最高指導原則，因此本課程﹙一﹚依此宗旨討論水資源保育、固廢管理與空氣污染控制；更將以實際例將面向擴及科技與社經整合層次，以期落實理論於實際應用之中。\nThis is intented as a brief introduction to the subject of the substainable development of natural resource. Main subject are water conservation, solid waste management and air pollution control. Many overall regional case studies will be discussed. It must be technologic, economic and social environmental change or a new factural data are developed",
    "schedule": "週次及對應主題如下 (並視上課情況適當調整)\n第一週: 1. 反應工程與反應器設計簡介\n第二週: 2. 轉化率與反應器尺寸關係\n第三週: 3. 速率定律\n第四週: 4. 化學計量\n第五週: 5. 溫度效應及複雜問題\n第六週: 6. 期中考",
    "scorePolicy": "平時成績 (60%)\n考試成績 (40%)",
    "materials": "自製 PPT 簡報；Chemical Reaction Engineering, Octave Levenspiel; Elements of Chemical Reaction Engineering, H. Scott Fogler",
    "consultation": "課程資訊將公佈於北科 i 學園及 Microsoft Teams. 若有任何問題可透過 email: rxyang@ntut.edu.tw",
    "remarks": "本課程符合聯合國永續發展目標 SDG7 (可負擔能源), SDG12 (責任生產與消費)。",
    "foreignLanguageTextbooks": true
  }
]
