[
  {
    "name": "陳彥君",
    "email": "bluekikochen@gmail.com",
    "latestUpdate": "2023-06-02 20:02:50",
    "objective": "本課程專注在探討全球組織經營策略與領導決策之關鍵議題，聚焦在不同時空的國際經營環境中，企業經營者如何因應政府的政策與財經情勢改變，能夠快速回應與彈性應變的領導思維與決策。透過本課程將能夠理解高階主管面對政經環境的調整能有效因應變化，並且提升領導才能與創造市場優勢之創新能力。\nThe course focuses investigate the global organization's management strategies and leadership decision of the key issues. It is focusing in the different time frames and fierce international environment, how changes in policy of governments and situation of economic. Business executives will be able to quick to respond with the elastic strain of the global strategy perspective and leadership thinking. This course will be able to understand top managers can achieve the decision making of leadership, and improve the leadership knowledge and innovation capabilities in market competition.",
    "schedule": "第 13 週：建構策略品牌思維走向國際市場 I\n第 14 週：建構策略品牌思維走向國際市場 II\n第 15 週：台灣製造商從代工走向自有品牌的轉型之路 (華碩個案)\n第 16 週：台灣文化創意服務業品牌走向國際市場之挑戰 (霹靂國際個案) \n第 17 週：新創事業和中小企業的創業行銷發展\n第 18 週：新創事業行銷和中小企業行銷之挑戰和發展 (吉品養生個案)\n\nWeek 13. Building the strategic brand thoughts towards international markets I\nWeek 14. Building the strategic brand thoughts towards international markets II\nWeek 15. Paths from OEM/ODM to OBM of Taiwanese manufacturers: A case study of ASUS \nWeek 16. Challenges in the internationalization of Taiwanese cultural and creative brands: A case study of PILI international multimedia\nWeek 17. Entrepreneurial marketing for new ventures and SMEs\nWeek 18. Challenges in marketing development of new ventures and SMEs: A case study of GPING",
    "scorePolicy": "1. 課程參與         50%\n2. 教學個案作業  50%\n\n1. Course participation        50%\n2. Homework of case study 50%",
    "materials": "1. 自編講義 \n2. 陳忠仁、陳彥君、劉懿萱，(2015)，[追尋卓越，再創新猷–華碩電腦]，管理教學個案，臺灣大學管理學院。\n3. 陳忠仁、陳彥君、徐哲彥，(2016)，[從廟口戲台走向國際舞台：霹靂國際]，管理教學個案，臺灣大學管理學院。\n4. 黃俊堯、陳彥君、柳秉佑，(2021)，[吉品養生的創業與品牌成長之路]，管理教學個案，臺灣大學管理學院。\n\n\n1. Case handout\n2. A case study of ASUS\n3. A case study of PILI international multimedia\n4. A case study of GPING",
    "consultation": "可電子郵件預約諮詢時間 email: bluekikochen@gmail.com",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
