[
  {
    "name": "范書愷",
    "email": "morrisfan@ntut.edu.tw",
    "latestUpdate": "2023-05-31 17:03:27",
    "objective": "EMBA 最重要核心精神為領導力與團隊合作能力，本課程希望培養在企業競爭激烈的環境之下，如何領導企業轉型，並以團隊合作模式加以執行的能力。課程設計為兩天的內容：包括創新與創業的精神、跨領域團隊建立、藉由活動達成團隊學習與互動、團隊凝聚力建立、領導力的訓練與培養、EMBA 應具備的四到 (學到、交到、做到、玩到)。\nThe core value of Taipei Tech’s EMBA program is leadership and teamwork. This course is to develop the ability to lead business transformation and team building in the dynamic economic environment. There are six parts in this course: 1. Entrepreneurship 2. Team building with cross-fields 3. Team learning and interactions 4. Leadership 5. Four must-do in EMBA ( to Learn, Make friends, play, and make it)",
    "schedule": "This extra-curriculum activity will be held off-campus for two full days.",
    "scorePolicy": "1. Activity Participation\n2. Activity Competition",
    "materials": "Teaching materials will be constructed upon the ideology of team building.",
    "consultation": "Monday 10-12AM",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "翁頌舜",
    "email": "wengss@ntut.edu.tw",
    "latestUpdate": "2023-05-30 14:02:39",
    "objective": "EMBA 最重要的核心精神為領導力與團隊合作能力，本課程希望培養在企業競爭激烈的環境之下，如何領導企業轉型，並以團隊合作模式學習執行的能力。課程設計為兩天的內容：包括創新與創業的精神、跨領域團隊建立、藉由活動達成團隊學習與互動、團隊凝聚力建立、領導力的訓練與培養、以及 EMBA 應具備的四到 (學到、交到、做到、玩到)。\nThe core value of Taipei Tech’s EMBA program is leadership and teamwork. This course is to develop the ability to lead business transformation and team building in the dynamic economic environment. There are six parts in this course: 1. Entrepreneurship 2. Team building with cross-fields 3. Team learning and interactions 4. Leadership 5. Four must-do in EMBA (to Learn, Make friends, play, and make it)",
    "schedule": "團隊經營\n問題解決\n領導能力研討",
    "scorePolicy": "活動與研習參與 35%\n問題解決能力 35%\n參與國內參訪活動 30%",
    "materials": "競賽項目材料\n領導管理講義",
    "consultation": "課程諮詢管道：(1) Email: wengss@ntut.edu.tw (2) 諮詢時間：星期三下午：5:00~7:00PM",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
