[
  {
    "name": "王正豪",
    "email": "jhwang@ntut.edu.tw",
    "latestUpdate": "2023-09-01 15:19:36",
    "objective": "本課程為教育大數據微學程之進階課程，主要介紹資料探勘概念與原理，包括：資料前處理、關聯分析、分類、分群，並運用實際工具如: Weka, Python 等，針對教育大數據進行分析。透過程式練習以及期末專題，能讓學生深入理解教育資料分析的基本原理以及實際工具的應用。\nThis course is one of the advanced courses in the Micro Courses on Educational Big Data. It introduces the basic concepts and principles of data mining, including: data preprocessing, frequent pattern mining, classification, and clustering. Also, students need to use tools such as Weka and Python for educational big data analytics. With the programming exercises and term project, students will be able to learn the fundamental ideas of educational data analysis and real applications with practical tools.",
    "schedule": "1. Course Overview\n2. Introduction to Educational Data Mining: Data Characteristics\n3. Introduction to Data Mining Software Tools: Weka, Python\n4. Data Preprocessing\n5. Case Study: Preprocessing Educational Open Data\n6. Frequent Pattern Mining\n7. Case Study: Frequent Pattern Mining on Educational Data\n8. Quiz\n9. Classification\n10. Case Study: Classifying Educational Data\n11. Midterm Exam\n12. Clustering\n13. Case Study: Clustering Educational Data\n14. Visualization and Analysis Result Interpretation\n15-18. Term Project Presentation (4 wks)",
    "scorePolicy": "Homeworks and programming exercises: 30%\nMidterm exam: 30%\nTerm project: 40%",
    "materials": "- Textbook:\nJiawei Han, Micheline Kamber, and Jian Pei, Data Mining: Concepts and Techniques, 4th edition, Morgan Kaufmann, 2022.\n\n- References:\n1. Recent academic papers, tutorials, and slides.",
    "consultation": "You can reach the teacher via e-mail or by appointment.All course materials and video recordings will be kept in Microsoft Teams and iSchool+, and the course web site at: https://chriswjh.github.io/EDM/",
    "remarks": "The course web site will be available at: https://chriswjh.github.io/EDM/",
    "foreignLanguageTextbooks": true
  }
]
