[
  {
    "name": "鄭俊雄",
    "email": "jamesflora2000@yahoo.com.tw",
    "latestUpdate": "2023-05-29 23:11:03",
    "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "第一週\n課程介紹及分組，握拍介紹，正手拍底線抽球示範及操作！\n第二週\n正手拍分組拋球交互練習，操作說明及糾正錯誤動作\n第三週\n反手拍動作示範及練習，對牆擊球加強球感練習，分組拋球練習\n第四週\n握拍介紹，正手拍連續動作練習反手拍動作示範及練習，分組練習與矯正動作\n1. 動作修正 2. 分組實務與指導回饋\n第五週\n正手拍連續動作練習分組練習，正手拍分解動作練習，分組練習與矯正動作\n球感練習 (了解球的彈性與球拍的振動感覺)\n正手拍分解動作練習，分組練習與矯正動作\n第六週\n1. 動作要點講解 2. 分組實務與指導回饋，正反手拍連續動作練習，正拍自拋球練習\n團體講授 分組練習與矯正動作\n1. 動作要點問答 2. 分組實務與指導回饋\n第七週\n反手拍分解動作修正及練習，正反手拍連續動作練習\n團體講授 分組練習與矯正動作\n1. 動作要點講解 2. 分組操作\n第八週\n隔網送球練習，期中考\n(測驗正反手拍底線抽球)\n第九週\n期中考補考\n第十週\n網前截擊動作示範及練習，正反手拍連續動作練習\n團體講授 分組練習與矯正動作\n1. 動作要點問答 2. 分組實務與指導回饋\n第十一週\n正反手拍連續動作練習，網前截擊送球練習\n團體講授 分組練習與矯正動作\n第十二週\n網前截擊動作修正講解，分組練習\n第十三週\n正反手拍對牆擊球練習，網前截擊練習\n團體講授與矯正動作\n第十四週\n發球動作說明示範及練習\n團體講授，分組練習與矯正動作\n第十五週\n截擊送球練習，分組練習與矯正動作\n(模擬測驗正反手拍網前截擊)\n第十六週\n期末考，測驗正反手拍網前截擊\n 分組練習與矯正動作\n第十七週\n期末考，測驗正反手拍網前截擊\n第十八週\n補考各項補測\nthe first week\nPlease join the line group first, class introduction and grouping, gripping introduction, forehand bottom line drawing demonstration and operation!\nthe second week\nForehand shot group throwing interactive practice, operating instructions and correcting wrong actions\nThe third week\nDemonstration and practice of backhand shots, practice of hitting the ball against the wall to strengthen the sense of the ball, practice of throwing the ball in groups\nthe fourth week\nGrip introduction, forehand continuous movement practice backhand movement demonstration and practice, group practice and corrective movement\n1. Action modification 2. Group practice and guidance feedback\nfifth week\nForehand continuous action practice group practice, forehand split action practice, group practice and corrective action\nBall feel exercise (understand the elasticity of the ball and the vibration of the racket)\nForehand pat decomposition exercise exercises, group exercises and corrective exercises\nSixth week\n1. Explanation of action points 2. Group practice and guidance feedback, forehand and backhand continuous action practice, forehand self-throwing practice\nGroup teaching, group exercises and corrective actions\n1. Action points Q&A 2. Group practice and guidance feedback\nSeventh week\nCorrection and practice of backhand shot decomposition, continuous movement practice of forehand and backhand\nGroup teaching, group exercises and corrective actions\n1. Explanation of action points 2. Group operation\nEighth week\nPractice of sending the ball across the net, mid-term exam\n(Test forehand and backhand to shoot the bottom line dribble)\nNinth week\nMid-term exam\nTenth week\nDemonstration and practice of volleys before the net, continuous practice of forward and backward hand shots\nGroup teaching, group exercises and corrective actions\n1. Action points Q&A 2. Group practice and guidance feedback\nWeek 11\nForehand and backhand continuous action practice, volley before the net to send the ball practice\nGroup teaching, group exercises and corrective actions\nTwelfth week\nModified explanation of volleys before the net, group practice\nThirteenth week\nForehand and backhand shot against the wall practice, volley practice before the net\nGroup teaching and corrective actions\nFourteenth week\nDemonstrati",
    "scorePolicy": "期中考 30%\n期末考 30%\n平時成績 40%",
    "materials": "網球運動解剖書\n楓樹林出版社\n譯者：林宴生",
    "consultation": "老師電話：0933050698",
    "remarks": "1. 老師電話：09330506982.mail:jamesflora2000@yahoo.com.tw",
    "foreignLanguageTextbooks": false
  }
]
