[
  {
    "name": "黃秀英",
    "email": "hhwang@ntut.edu.tw",
    "latestUpdate": "2023-05-26 22:12:41",
    "objective": "Basic principles of finite element method and its related applications will be introduced. Students will have chance to do hands-on practice. The course contents include: introduction to basic theory of finite element method/analysis, principle of variation, shape functions, one-dimensional, two-dimensional, and three-dimensional problems.",
    "schedule": "1\tSyllabus and Introduction (Ch1)\n2\tOne Dimensional Elements and Computational Procedures (Ch2)\n3\tBasic Elements (Ch3)\n4\tFormulation Techniques: Variational Methods (Ch4)\n5\tFormulation Techniques: Galerkin and Other Weighted Residual Methods (Ch5)\n6\tIsoparametric Elements (Ch6)\n7\tIsoparametric Triangles and Tetrahedra (Ch7)\n8\tCoordinate Transformation and Selected Analysis Options (Ch8), Define the semester project topics.  Report outline due next week\n9\tReview & Midterm Exam\n10\tError Estimation and Convergence (Ch9), Student Midterm Exam Evaluation\n11\tModeling Considerations and Software Use (Ch10)\n12\tFinite Elements in Structural Dynamics and Vibrations (Ch11)\n13\tHeat Transfer and Selected Fluid Problems (Ch12)\n14\tConstraints: Penalty Forms, Locking, and Constraint Counting (Ch13) & Solids of Revolution (Ch14)\n15\tPlate Bending (Ch15) & Shells (Ch16)\n16\tNonlinearity: An Introduction (Ch17)\n17\tProject Presentation\n18\tClass Review & Final Exam",
    "scorePolicy": "1.\tMidterm Exam：20 %\n2.\tFinal Exam: 25%\n3.\tHomework：20 %\n4.\tProject written report (15%), Project oral presentation (15%)\n5.\tIn-class discussion, participation, and attendance (5%)\n6.\tHomework is due a week away from the day assigned.  5 points would be subtracted per each single day delay.  Delaying for 2 days or more would get no point.\n7.\tThe Project report is due the day of the oral presentation.  5 points would be subtracted per each single day delay.  Delaying for 3 days or more would get no point.\n8.\tCopy and cheating are not allowed.  If one is found copy and cheating, 0 points would be given for the event.",
    "materials": "Textbook:  A First Course In the Finite Element Method\nby Daryl L. Logan\n(Publisher: Cengage Learning)\nReference: 1. The Finite Element Method\nby O.C. Zienkiewicz & R.L. Taylor (Vol. I & II)\n(Publisher: McGraw-Hill)\nInstructor: Hsiu-Ying Hwang\nOffice Hours: Tuesday 10:00-12:00, 13:00-17:00 (reference only)，please e-mail or call to reserve meeting hours prior to coming\nEmail: hhwang@mail.ntut.edu.tw\nOffice: 526-12, TEL: (02) 27712171 ext 3618",
    "consultation": "Office Hours: Tuesday 08:00-12:00, 1:00-3:00 (reference only)，please e-mail or call to make an appointment Email: hhwang@mail.ntut.edu.twOffice: Complex Building 526-12TEL: (02) 27712171 ext 3618",
    "remarks": "The classes will be adjusted according to the COVID condition:Class Time: Based on the announcementMethod: Remote ClassStudents: No need to come to the school but need to attend the online classesClassroom: Places for online in-time classesClass Material: i-School  https://istudy.ntut.edu.tw/learn/index.phpClass Link: GoogleMeet  https://meet.google.com/hbe-npat-gpuAttendance: ZUVIO",
    "foreignLanguageTextbooks": true
  }
]
