[
  {
    "name": "郭若妤",
    "email": "jyk@ntut.edu.tw",
    "latestUpdate": "2023-05-28 20:49:47",
    "objective": "This course introduces the theories and practical applications of human factors and Kansei engineering, emphasising their significant roles in product design and human machine interfaces. Students will learn how to systematically evaluate the affective aspects of products, services, and systems to meet user requirements and provide an improved user experience.",
    "schedule": "Each week, students will engage in a \"Weekly Literature Reading Sharing Discussion,\" during which they will present and discuss the key findings from their weekly assigned readings. Concurrently, students will design and execute an eye-tracking experiment throughout the course, culminating in a presentation of their findings in the final weeks.\n\nWeek 1: Course Introduction - Overview of Human Factors and Kansei Engineering\nWeek 2: Cognitive Ergonomics - Understanding the Role of Human Cognition in Design\nWeek 3: User-Centred Design - Principles and Applications\nWeek 4: Eye Tracking Methodology - Basics and Applications in Ergonomics\nWeek 5: Emotional Design - Introduction and Principles\nWeek 6: Human Factors in Systems Design - Concepts and Case Studies\nWeek 7: Work Design - Cognitive Ergonomics Considerations\nWeek 8: Introduction to Kansei Engineering - Principles and Historical Perspective\nWeek 9: Emotional Design in Kansei Engineering - Affective Design Concepts\nWeek 10: Eye Tracking in Usability Testing - Methodologies and Data Collection\nWeek 11: Kansei Engineering in Product and Service Design - Case Studies and Challenges\nWeek 12: Human-Machine Interfaces - Affective Design Considerations\nWeek 13: Eye Tracking Data Analysis - Techniques and Interpretation\nWeek 14: Advanced Topics in Human Factors and Kansei Engineering - Emerging Trends and Challenges\nWeek 15: Eye Tracking Experiment Presentation - Sharing Findings and Discussion\nWeek 16: Capstone Project Introduction - Overview and Topic Selection\nWeek 17: Capstone Project Work - Research, Design, and Planning Stage\nWeek 18: Capstone Project Presentation - Group Presentations and Feedback\n\nPlease note that the course schedule is subject to change based on the instructor's discretion, students' progress, and specific class dynamics.",
    "scorePolicy": "Attitude: Punctuality & Initiative (10%), Independence (10%)\nResearch project capability: Execution & Analysis (15%), Innovation (15%)\nFinal report: 50%",
    "materials": "Holmqvist, K., Nyström, M., Andersson, R., Dewhurst, R., Jarodzka, H., & Van de Weijer, J. (2011). Eye tracking: A comprehensive guide to methods and measures. OUP Oxford.",
    "consultation": "For all course-related enquiries, please contact jyk@ntut.edu.tw, thank you.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
