[
  {
    "name": "曾俊儒",
    "email": "ktseng@pddlab.org",
    "latestUpdate": "2023-05-21 09:57:39",
    "objective": "The purpose of this course is to provide students with a better understanding of both the theoretical and practical aspects of medical design. Through the course, students will learn how to approach the design of healthcare products, systems, and services, taking into account medical requirements and user needs. The curriculum covers topics such as developing design concepts, introducing and implementing engineering design, prototyping, preclinical testing, clinical trials, medical certification, and project management. Students will also gain a deep understanding of the principles of cross-disciplinary medical design and innovative product design and development methods. The course will teach students how to collaborate with medical and design professionals to develop successful healthcare products that meet the needs of clinical services. Ultimately, the goal is to produce innovative healthcare products that provide innovative solutions to healthcare.",
    "schedule": "Upon completion of this course, students will have achieved the following primary learning objectives:\n•\tGain a comprehensive understanding of the product, system, and service development process geared towards elderly health and medical care to promote healthy ageing.\n•\tFamiliarize themselves with the regulatory approval process and the key regulators involved in the development of new products, systems, and service portfolios.\n•\tAcquire knowledge of the technical and commercial factors essential for the successful development of ageing-related products.\n•\tDevelop an awareness of the ethical, social, and cultural considerations involved in the introduction of new ageing health medical products.\n•\tExplore emerging medical product categories for senior health.\n•\tAnalyse and critique real-life cases of the development of medical products designed for the elderly.\nAt the end of the course, students will have created a visionary concept and a commercialisation strategy for a new geriatric health product.",
    "scorePolicy": "Assignments:\t50%\nClass participation:    25%\nFinal presentation:\t25%",
    "materials": "•\tReading pack.\n•\tYork et al. (2015) “Biodesign: The Process of Innovating Medical Technologies,” 2ND Edition, Cambridge University Press.",
    "consultation": "Wednesday 10-12",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
