[
  {
    "name": "陳冠薇",
    "email": "kuanwei31433@mail.ntut.edu.tw",
    "latestUpdate": "2023-07-20 14:43:07",
    "objective": "本校科技大學的國文課程，以能力及素養之培植為導向，\n並以精深致用為授課標的，方能不負大學國文課程之名，\n並符合本校重視實務應用的優良傳統。\n依授課教師之取擇，課程可概分為兩大類。\n一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。\n二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。\n期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application.\n\nDepending on the choice of the instructor, the courses can be divided into two categories.\n1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity.\n2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability.\n\nIt is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.",
    "schedule": "1. 課程介紹\nCourse Overview\n2. 【寫作與口說】小自傳與自我介紹\nWriting and speaking： Short autobiography and self-introduction\n3. 單元一、言論自由\nUnit 1:Freedom of speech\n4. 單元一、言論自由\nUnit 1:Freedom of speech\n5. 雙十節連假\nDouble Tenth holiday\n6. 單元二、基改食品\nUnit 2:Genetic modification of food\n7. 單元二、基改食品\nUnit 2:Genetic modification of food\n8. 複習\nReview\n9. 期中考\nMidterm exam\n10. 【寫作與口說】書信與短講\nWriting and speaking： Letters and Short Talks\n11. 單元三、美的標準\nUnit 3: Beauty standard\n12. 單元三、美的標準\nUnit 3: Beauty standard\n13. 單元四、傳統與現代\nUnit 4:Traditional and modern\n14. 單元四、傳統與現代\nUnit 4:Traditional and modern\n15. 複習\nReview\n16. 期末考\nFinal exam\n17. 元旦假期 \nNew Year's holiday\n18. 期末討論時間\nMeeting time",
    "scorePolicy": "出缺席與課堂參與 30%\n寫作與口說 30%\n期中考 20%\n期末考 20%\n\nAttendance & Participation 30%\nWriting & Speaking 20%\nMidterm exam 25%\nFinal exam 25%",
    "materials": "當代中文課程課本 5（鄧守信主編，台北：聯經出版）\n* All texts will be PDF files which you can find on particular E-learning site.\nTextbook:\nA Course in Contemporary Chinese 5",
    "consultation": "* This syllabus is tentative and the instructor has rights to change throughout the semester.kuanwei31433@mail.ntut.edu.tw*112-1 為 USR 課程。",
    "remarks": "Teams will be preferred during the pandemic era.Link:https://reurl.cc/V12lZbkuanwei31433@mail.ntut.edu.tw * 課程對應 SDGs 指標：12 責任消費與生產 Courses correspond to SDGs indicators：12 Responsibility for consumption and production * 指標對應授課內容：第 6-7 週授課主題「基改食品」對應指標十二責任消費與生產中的促進綠色經濟，確保永續消費及生產模式 The index corresponds to the teaching content： In the 6th and 7th weeks, the theme of the lecture is \"GM Food\". The corresponding indicators 12 Responsibility for consumption and production to promote a green economy and ensure sustainable consumption and production mode.",
    "foreignLanguageTextbooks": false
  }
]
