[
  {
    "name": "陸元平",
    "email": "yuan@ntut.edu.tw",
    "latestUpdate": "2023-05-29 18:53:08",
    "objective": "如何藉由商務模型的分析，建置數位化協同產品設計與開發環境，並說明資料管理、構型管隨著網路時代的來臨，不但造成數位化協同產品設計與開發觀念的興起，也造成數位化協同平台技術逐漸成熟，並且將同步工程觀念的實現更往前邁進一大步。本課程是從數位化協同產品設計與開發概念之介紹開始，使學生明白數位化協同產品設計與開發在現代製造業中的重要性，接著介紹理與工作流程管理等相關實務應用觀念。\nInformation and network technologies have promoted the traditional concurrent engineering to the next generation. The collaborative e-design and e-development concept has been more popular in industries. This course is introduced from the concept of collaborative product design and development to help students understanding the importance of collaborative e-design and e-development in modern industries. Furthermore, the business model analysis method is provided to construct the collaborative environment of e-design and e-development. In addition, some real cases of data management, configuration management, and workflow management are mentioned.",
    "schedule": "第一周：課程介紹\n第二週：論 5G & TSN & IIoT 技術\n第三週：九大前瞻技術\n第四週：建構寰宇實體系統\n第五週：發展智慧鐵道系統的策略與步驟\n第六週：數位化應用系統技術與工業 4.0\n第七週：擴增實境與工業物聯網\n第八週: 資訊系統與控制技術\n第九週: IIoT 系統與軟硬體思維\n第十週：開發程序、確認機會與產品企劃\n第十一週：確認需求與規格\n第十二週：概念產生、選擇與測試\n第十三週：工業設計、產品結構\n第十四週：考量環境與製造的設計\n第十五週：製作原型、穩健設計\n第十六週：專利與智財權服務設計\n第十七週：產品開發經濟學與專案管理\n第十八週：期末考",
    "scorePolicy": "■平時成績：30％  ■心得報告：30％  ■個別口頭報告：30% ■期末考：10％\n\n翹課一次扣總成績 10 分、請假第二次開始扣總成績 1 分、遲到早退一次扣總成績 1 分、學期缺課次數過多將增加總扣分數、作弊一律以不及格論",
    "materials": "自編投影片、Line 群組閱讀資料\nUlrich, K. T. and Eppinger, S. D., “Product Design and Development,” 3rd Ed., McGraw Hill, 2003 (張書文等譯，產品設計與開發，普林斯頓，2006), Ch.1, 2, 9\nMcGrath, M. E., “Next Generation Product Development,” McGraw Hill, 2004 (陳正芬等譯，產品研發管理，麥格羅？希爾，2004), Ch. 1, 2, 15, 16\nSimchi-Levi, D., Kaminsky, P., and Simchi-Levi, E., “Managing the Supply Chain,” McGraw Hill, 2004 (陳琇玲譯，供應鏈管理創新解決方案，麥格羅？希爾，2004)\n供應鏈管理：利豐集團的實踐經驗，台灣商務印書館\nHandfield, R. B. and Nichols, E. L., Jr., Supply Chain Redesign, Prentice Hall, 2002 (智勝)\nDavid A. Taylor, “Supply Chains, A Manger’s Guide”, Addison Wesley, 2004 (智勝)",
    "consultation": "綜科館研究室 711-2 分機 2069",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
