[
  {
    "name": "陳雅玫",
    "email": "ymchen@ntut.edu.tw",
    "latestUpdate": "2023-09-14 14:32:04",
    "objective": "This course aims (1) to familiarize students with English grammatical framework in relation to reading and writing, and (2) to develop students’ rhetorical awareness. A review of grammatical ideas at the advanced level is reinforced by correcting sentence errors and revising awkward usage of words or sentence structures as well as by doing lively grammar practice exercises. The main topics covered include various parts of speech, tense, clauses, reporting, conjunction, punctuation, and the relationship between grammar and context.",
    "schedule": "Week 1\tcourse introduction\nWeek 2\tsubjects, verbs and complements// verbals and phrases\nWeek 3\tindependent and dependent clauses\nWeek 4\tsentence fragments \nWeek 5\tNational Day\nWeek 6\ttense, voice, and mood\nWeek 7\tsubject-verb agreement\nWeek 8\tpronoun-antecedent agreement// case of pronouns\nWeek 9\tgrammar infographics\nWeek 10\tmid-term exam\nWeek 11\tdangling modifiers\nWeek 12\tmisplaced modifiers\nWeek 13\tillogical comparisons and mixed constructions\nWeek 14\tpeer teaching videos\nWeek 15\tadjectives and adverbs\nWeek 16\tsubordination  \nWeek 17\tparallelism\nWeek 18\tfinal exam\n\n******* \n Generative AI Use Policy\n(1) Uses Permitted:\n* The use of generative AI tools in our course is intended to improve your learning experience, foster critical thinking, and bring new views on grammar and rhetoric. It is not a substitute for human intellect and collaboration but an extra resource.\n\n* It is encouraged to apply generative AI tools in novel ways to enhance in-class group activities and assignments. While AI may be a beneficial collaborator by making recommendations, creating material, or correcting language, most of the content and ideas should come from group members. AI is a tool, not a substitute for your insights and creativity. You must briefly explain how you interacted with the AI when using AI-generated content in group activities or assignments.\n\n(2) Prohibited Uses:\n* Using generative AI to complete graded quizzes or exams is prohibited. All work submitted should be the student’s original work.\n\n* Directly copying AI-generated content and presenting it as one’s own without proper citation is considered plagiarism.\n\n* Students should be aware of the ethical implications of AI and its potential biases. When it comes to interpreting AI-generated information, critical thinking is encouraged.\n\n* Misusing generative AI tools will result in academic consequences such as mark decrease, assignment failure, or course failure.",
    "scorePolicy": "1. Attendance and participation: 15%\n2. In-class quizzes/assignments: 20%\n3. Grammar infographics and peer teaching videos: 25%\n4. Mid-term exam: 20% \n5. Final exam: 20%",
    "materials": "Correct Writing",
    "consultation": "ymchen@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
