[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-09-04 15:28:40",
    "objective": "本課程介紹研究方法和論文寫作知識，期能培養學生獨立研究和撰寫學術報告、論文的基本能力。主要分為三部份：（一）研究內涵與步驟，（二）主要的研究方法，（三）如何撰寫英文論文及報告。涵蓋主題包括：運用圖書館資源選擇研究主題、研究計劃的撰寫、問卷調查法、訪問法、觀察法、田野工作研究方法、文獻資料分析法（內容分析法）、個案研究法、相關研究法、實驗法、文學研究法，研究報告論文格式與寫作要領，如何撰寫文獻探討，參考書目寫法等。\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers.  Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers.  The main topics for instruction include: the research process; major research methods; and the structure of a research paper.  The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.",
    "schedule": "This is the first year the literature half has been extended to 18 weeks; thus, some rearrangement of the course materials will be needed. The list of topics and times below is therefore tentative--and I'll be working to make the classes cohesive and interesting over the summer. \n\nWeek 1: Research Questions: An introduction to research on literary/cultural studies topics\n\nWeek 2: Finding a topic, Keyword searches, Identifying and Using Scholarly Sources, Google Scholar cited sources\n\nWeek 3: Types of Projects: Writing about Literature / Writing About Film / Writing about Film Adaptation / Primary-Source and Secondary-Source Work / Ideas vs. details (Deciding what kind of project best fits your style)\n\nWeek 4–5: Citation / Avoiding Patchwriting\n\nWeek 6: Initial Library Work: MLA International Bibliography, MetaCat, Google Books Advanced Search\n\nWeek 7: Two-page paper on two possible research questions due (one-page per topic)\n\nWeek 8: Communicating with Advisors\n\nWeek 9: Archival Research and Open-Access Sources\n\nWeek 10: Plagiarism and AI (Week 10 is usually the week in which students begin to seek advisors, but it depends on when the office makes the announcement.) \n\nWeek 11–13: Managing a project / Productivity / Maintaining motivation\n\nWeek 14: Taipei Tech and NTU Library Work Due: Database small-group presentations\n\nWeek 15: Research Presentations\n\nWeek 16: Citation Review: How to Revise\n\nWeek 17: Citation Quiz / Peer Review",
    "scorePolicy": "Presentations: 20%\nQuizzes: 20%\nAssignments: 25%\nProposal and Annotated Bibliography: 25%\nParticipation: 10%",
    "materials": "Bullock, Richard, et al., editors. The Little Seagull Handbook. 4th ed., Norton, 2021. (Please note that this book is helpful for all four commonly used citation styles. If you later decide to do a linguistics project, this handbook will still be useful to you in following citation rules for APA. If you do a cultural/studies literary topic, it has MLA. If you later need to know Chicago or CSE, they are there too).\n•\tCourse Packet",
    "consultation": "Tuesdays: 10:10–12:00 (by appointment only)Tuesdays: 3:00–4:00 Wednesdays: 1:10–4:00 (by appointment)",
    "remarks": "I use MS Teams as a platform for both online and in-person classes. Please be sure to check it at least three times a week.",
    "foreignLanguageTextbooks": true
  }
]
