[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2023-09-09 13:09:50",
    "objective": "As an all-encompassing term, the word culture has multiple meanings. Anything involving human activity can be included in the domain of culture. Most importantly, culture is deeply connected with our sense of identity; our culture defines who we are. And culturally-determined identification can a blessing that empowers our subjectivity, but it can also be a confinement that we strive to be free from. In this course, we will approach important topics in cultural studies from the perspectives of gender, race, and violence, the three issues that most intrinsically connected to identity, by reading theoretical texts and critical essays and viewing related films. Ideally, the course will familiarize students with key concepts in cultural studies and cultivate their critical thinking. Furthermore, the instructor hopes that the course can help students identify potential topics of their senior projects and establish valid approaches.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction: what are culture and cultural studies?\n\nUnit 1: Gender and discourse\nWeek 2: “Gender and Sexuality” by Michael Ryan\nWeek 3: “The Incitement to Discourse” from The History of Sexuality by Michel Foucault\nWeek 4: “Visual Pleasure and Narrative Cinema” by Laura Mulvey\nWeek 5: National Holiday\nWeek 6 : “Introduction: The monster and the homosexual” by Harry Benshoff\nWeek 7: Film viewing & discussion: Interview with the Vampire (1994)\n\nUnit 2: Race and Cross-cultural Issues\n\nWeek 8: “Ethnicity” by Michael Ryan\nWeek 9: “Introduction” to Orientalism by Edward Said\nWeek 10-11: film viewing and discussion: Miss Saigon & Madame Butterfly\n\nUnit 3: Violence and Horror in Popular Culture\nWeek 12: Regarding the Pain of Others by Susan Sontag\nWeek 13: “Approaching Abjection” by Julia Kristeva\nWeek 14: “Her Body, Himself” by Carol Clover\nWeek 15-16: Film viewing & discussion: The Silence of the Lamb (1979)\nWeek 17: National Holiday\nWeek 18: Group presentations",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 40%\nFinal paper: 40%",
    "materials": "All reading texts will be provided by the instructor.",
    "consultation": "Office: 共同科館 409Email: kpchen@ntut.edu.tw",
    "remarks": "*Please be aware:(1) In this course, you will have to read long and complicated theoretical texts in cultural studies. If you don't intend to spend much time reading every week, please do reconsider.(2) The examples for in-class discussion are mostly from films, especially horror films. If onscreen violence makes you feel uncomfortable, please do reconsider. Materials are uploaded to:https://drive.google.com/drive/folders/172Y6XT-krUeNkYUlrm_Ig9DaQZgVCZVJI5kQJORkcioO-_1AHuot_IVkjINeg_G5Q0dW_vAH",
    "foreignLanguageTextbooks": true
  }
]
