[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2023-06-11 10:12:31",
    "objective": "This course introduces concepts related to commerce, business and economics such as money, capitalism(s), technology, and sustainability. Students are required to read canonical and key modern texts on these topics, as well as current business news and analytic articles. In addition, expert senior professional guest speaker(s) will familiarize students with current business practices.",
    "schedule": "Week \t\tActivity\t\t\n\n1\t\tIntroduction\t\n2\t\tMoney I\n3\t\tMoney II\n4\t\tMoney III\n5\t\tCapitalisms I\n6\t\tCapitalisms II\n7\t\tCapitalisms III\n8\t\tMid-term\n9\t\tSchool Mid-Term (no class)\n10\t\tAlternative Systems I\n11\t\tTalk (details to be announced)\n12\t\tAlternative Systems II\n13\t\tAlternative Systems III\n14\t\tBusiness ethics I\n15\t\tBusiness ethics II\n16\t\tBusiness ethics III\n17\t\tFinal exam\n18\t\tConsultation",
    "scorePolicy": "Evaluation \n\nGroup presentation\t\t\t20%\nMid-term\t\t\t\t30%\t\t\nFinal exam\t\t\t\t30%\nParticipation and attendance\t\t20%\n\nAt the lecturer’s sole discretion, a makeup mid-term or exam may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of the mid-term or exam. The format of the make-up will be determined by the lecturer.\n\nAttendance policy\nYou will automatically receive a grade of zero with 8 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system.",
    "materials": "Excerpts from the following (to be finalized)\n\nMoney:\n•\tHa-Joon Chang, Economics: The User’s Guide, 2014.\n•\tGeorg Simmel, The Philosophy of Money, 1978.\n•\tNigel Dodd, The Social Life of Money, 2014.\n•\tAdam Smith, Selections from The Wealth of Nations, 1957.\n\nCapitalisms:\n•\tNick Srnicek, Platform Capitalism, 2016.\n•\tShoshana Zuboff, The Age of Surveillance Capitalism, 2019.\n•\tDavid Harvey, A Brief History of Neoliberalism, 2005.\n•\tThomas Piketty, Capital in the Twenty-first Century, 2013.\n\nAlternative systems:\n•\tJohn Ruskin, selected writings.\n•\tKarl Marx, selected writings.\n•\tEvgeny Morozov, “Critique of Techno-Feudal Reason,” New Left Review, 133/134, Jan/Apr 2022.\n\nBusiness ethics:\n•\tNigel Dodd, “The Politics of Bitcoin,” Money in Human Economy, Berghahn Books, 2017.\n•\tThomas Piketty, A Brief History of Inequality, 2022.\n•\tMichael Sandel, What Money Can’t Buy: The Moral Limits of Markets, 2012.\n\nReference:\nAsking the Right Questions: A Guide to Critical Thinking, M. Neil Browne and Keeley, Stuart M., Pearson",
    "consultation": "Students may make appointments with the lecturer for consultation.",
    "remarks": "Reduced inequalitiesResponsible consumption and productionDecent work and economic growth",
    "foreignLanguageTextbooks": true
  }
]
