[
  {
    "name": "陳柔妃",
    "email": "roufei@ntut.edu.tw",
    "latestUpdate": "2023-05-29 10:57:09",
    "objective": "本課程著重於地熱能源之探勘，以介紹臺灣地熱地質、地熱分布與開發現況為主，並教授地熱資源探勘時之所需調查、分析、實驗與鑽探技術。課程內容主要為臺灣地熱介紹、地質調查方法、地球物理探勘、地球化學分析、鑽探與井測、以及地質建模及蘊藏量估計。\nThis course introduces Taiwan's geothermal geology, geothermal distribution and development status, and teaches the survey, analysis, experiment and drilling techniques required for geothermal resource exploration. The course contents are mainly introduction to Taiwan's geothermal energy, geological survey methods, geophysical prospecting, geochemical analysis, drilling and well logging, as well as geological modeling and reserve estimation.",
    "schedule": "Ｗeek 1-2 能源概覽\n本章對所有形式的能源進行了粗略的概述，以提供地熱能如何進入能源環境的視角。此外，還回顧了有關能量和功率的關鍵概念，以便讀者了解能量和功率之間的關係和測量方式。\n\nＷeek 3-5 地熱系統的分類和用途\n在地球上，熱量主要通過傳導或對流傳遞。傳導是通過接觸傳遞熱量，而對流涉及通過運動傳遞熱量，主要是流體，例如液體或氣體。對流開始來自引起流體密度變化的熱梯度。在存在引力場的情況下，密度的變化會導致熱物質上升（浮力增大），冷物質下沉（浮力減小）。\n\nWeek 6-7 地球內部的地質學和熱能構造\n為了更全面地了解地熱資源及其在地球上的分佈，有必要回顧一下地球的成分和物理構成。地球在成分上是不均勻的，由鐵鎳核、緻密的岩石地幔和薄的、密度相對較低的岩石地殼組成。這種成分多樣化是在我們的星球形成後不久形成的，當時密度更大的物質沉入中心，低密度物質向地表上升。\n\nWeek 8 期中測驗\n\nWeek 9-11 地熱系統的基本地質要素\n地球材料的作用（岩石和礦物的熱和其他物理特性）對於確定地熱資源是否適合開發的特徵至關重要。最後，主要通過移動構造板塊的相互作用施加在岩石上的力會產生斷層等結構，這些結構通常會影響熱液的流動。。\n\nWeek 12-13  地熱流體的地下流動\n流體的流動，無論是蒸汽還是液體，對於從地球提取可供社會使用的熱量至關重要。如果不存在液體或阻止液體流動，無論岩石有多熱，獲得地熱能都會變得複雜。它需要昂貴的技術干預來引入液體或使液體流動或兩者兼而有之；這是工程或增強型地熱系統 (EGS) 的領域。要了解流體如何運動，我們需要討論岩石材料的孔隙率和滲透率的作用。\n\nWeek 14-15  地熱系統的物理及化特性\n要成功發現和開發地熱系統，了解其物理和化學屬性至關重要。本章首先討論了水的熱力學考慮因素，這些因素決定了地熱系統的行為方式及其最終利用方式。然後探討了液體和蒸汽主導的地熱系統的重要特徵，特別是熱表現和圍岩的改變。\n\nWeek 16-17 選擇地熱系統的地質和構造設置\n本章的重點是選擇地熱系統及其與形成它們的構造環境的關係。本章開頭概述了地熱系統的兩種主要地質類型 —— 岩漿和岩漿 —— 以及每種地質和地球化學特徵。地熱系統的構造環境和地質類型對地熱資源的物理化學特徵以及這些資源最終可能如何開發具有明顯的影響。\n\nWeek 18 期中測驗",
    "scorePolicy": "出席率 10%、平時成績 30%、期中成績 30%、期末成績 30%。",
    "materials": "1.Geologic Fundamentals of Geothermal Energy By David R. Boden\nCopyright 2017\nISBN 9781498708777\n425 Pages 247 Color Illustrations\nPublished October 17, 2016 by CRC Press",
    "consultation": "教師辨公室材資館 508-1 室；助教辨公室材資館 204-3 室！開學第一週請修課同學都加入即時通訊軟體之群組。",
    "remarks": "配合教育部及學校規定，授課採取Ｍicrosoft terms 遠距線上通訊軟體。",
    "foreignLanguageTextbooks": true
  }
]
