[
  {
    "name": "王甡",
    "email": "argus@sfi.org.tw",
    "latestUpdate": "2023-05-29 09:58:49",
    "objective": "本課程主要目的在於讓學生透過熟悉財金時事所使用之英文專業名詞、市場術語，以及行業慣有之英文論述結構等提升財金領域之專業英文閱讀能力；此外，本課程亦將著重於訓練學生之英譯能力。\nThe major purpose of this course is to promote learners’ reading ability by training them to understand terminologies, jargons and description structure of writings in finance news and events. In addition, this course also aims to train the learners’ ability of translating English into Chinese.",
    "schedule": "9/14\t課程簡介\n9/21\t媒體專欄 1：取材自經濟學人\n9/28\t媒體專欄 2：取材自全球金融\n10/5\t新聞稿 1：取材自美國證管會\n10/12 新聞稿 1：取材自歐洲央行\n10/19 媒體專欄 3：取材自經濟學人\n10/26 媒體專欄 4：取材自全球金融\n11/2\t新聞稿 3：取材自美國證管會\n11/9\t期中考\n11/16 新聞稿 4：取材自歐洲央行\n11/23 新聞稿 5：取材自國際證監會組織\n11/30 媒體專欄 5：取材自經濟學人\n12/7\t媒體專欄 6：取材自經濟學人\n12/14 媒體專欄 7：取材自全球金融\n12/21 媒體專欄 8：取材自全球金融\n12/28 新聞稿 6：取材自歐洲央行\n1/4 新聞稿 7：取材自國際證監會組織\n1/11\t期末考\n\n9/14\tIntroduction\n9/21\tNews column 1 clipped from the Economist\n9/28\tNews column 2 clipped from the Global Finance\n10/5\tNews release 1 from U.S. Security Exchange Commission\n10/12 News release 2 from the European Central Bank\n10/19 News column 3 clipped from the Economist\n10/26 News column 4 clipped from the Global Finance\n11/2\tNews release 3 from U.S. Security Exchange Commission\n11/9\tMid-term exam\n11/16 News release 4 from the European Central Bank\n11/23 News release 5 from the International Organization of Securities Commissions\n11/30\tNews column 5 clipped from the Economist\n12/7\tNews column 6 clipped from the Economist\n12/14 News column 7 clipped from the Global Finance\n12/21 News column 8 clipped from the Global Finance\n12/28 News release 6 from the European Central Bank\n1/4 News release 7 from the International Organization of Securities Commissions\n1/11\tFinal exam",
    "scorePolicy": "評分政策：\n期中考 40%，期末考 40% 及小考與課程參與度 20%\n\nRating policy:\nMid-term exam (40%), Final exam (40%), quiz and course participation (20%)",
    "materials": "教材：\n本課程主要針對國際金融市場與國際企業等相關外文平面媒體報導及國際組織發布之報告為素材，講授金融與財務專業領域的專業用語、撰文結構、報導觀點及評論分析等進行討論，所選用的平面媒體將以經濟學人、新聞周刊為主要選取對象；國際組織則主要美國證管會、歐洲央行及國際證監會組織等為選取對象。\n\nCourse materials:\nThis course collects the clipped news and reports from financial magazines, including the Economist and Global Finance, and international organizations, including U.S. Security Exchange Commission, European Central Bank and the International Organization of Securities Commissions.",
    "consultation": "本課程將對修習課程學生設置社群媒體群組，以便利對學生公告資訊與處理學生提問 This course will set up group in some social media to announce important information and deal with the questions from students.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
