[
  {
    "name": "陳盈君",
    "email": "ycc85@ntut.edu.tw",
    "latestUpdate": "2023-05-30 11:50:48",
    "objective": "本課程旨在建立學生於醫學工程領域相關之知識。課程將為學生建立從小至基礎分子生物理論到大至人體以期具備生物相關領域之基礎知識，接續搭配基礎光電理論的建立並探討其應用於醫學工程相關領域之儀器及設備，內容亦因應時事而帶入課程討論，以期學生能對於醫學工程領域有更深一層之了解。此課程將以概論之方式進行，歡迎對此領域有興趣之同學學習。\nStudents taking this course will develop fundamental knowledge in the biomedical engineering field. Students will increase knowledge in biology and photoelectronics. The related equipment and apparatus applied in the biomedical engineering field will de be introduced. The course will also include current news to the students for expanding their knowledge in the biomedical engineering field. This course is an introductory course. The students who are interested in this field are welcomed to attend this course.",
    "schedule": "W01\tBrief introduction of the course\nW02\tBrief introduction to molecular biology I\nW03\tBrief introduction to molecular biology II\nW04\tBrief introduction to the human body\nW06\tOptics of the eye\nW07\tIntroduction of OCT and its application\nW08\tFundamentals of microscopy and its application\nW09\tMid-term exam\nW10\tFundamentals of Optoelectronics and nanotechnology\nW11\tFundamentals of Optoelectronic equipment and its application I\nW12\tFundamentals of Optoelectronic equipment and its application II\nW13\tFundamentals of SMD in solution,TCSPC, FCS,FRET,CLSM,LTM\nW14\tBasic laser tweezers\nW15\tMicroarray and PCR\nW16\tIntroduction of medical instrument I\nW18Final presentation",
    "scorePolicy": "Mid-term (20%), final report (40%), class performance (40%)",
    "materials": "1. handouts from various sources\nThe course schedule may be changed depending on the progress of the course.",
    "consultation": "請利用周三及周四上午 8.30-10.30 時間至教師辦公室諮詢，請先寫信預約時段。Please email me in advance if you have any queries. The office hours are Wednesday and Thursday from 8.30 - 10.30",
    "remarks": "Please join the google classroom for any updated information:",
    "foreignLanguageTextbooks": false
  }
]
