[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-09-04 15:29:11",
    "objective": "電影、電視、漫畫書、視頻遊戲等其他藝術形式對於塑造人類文化和日常生活的影響力日益增加。本課程旨在藉由觀看電影、電視等其他形式的流行文化，來探索東西方流行文化在過去及現代的本質與意義。\nAlternative forms of art – movies, television, comic books, video games – have become increasingly influential in shaping our culture and our daily lives. By watching films, televisions, and other forms of pop culture, this class explores the nature and significance of pop culture in the past, modern time of the West and East.",
    "schedule": "(I may modify the schedule over the summer) \n\nWeek 1: What is Popular Culture?\n\nWeek 2: Popular Culture and Adaptation (Early film) \n\nWeeks 3–4: Film Adaptation and Jane Austen in Popular Culture (Film Adaptations / Film Transformations) \n\nWeek 5–7: Marilyn Monroe: Gentlemen Prefer Blondes and Some Like it Hot (films) \n\nWeek 8: The Music Video (Video Killed the Radio Star, Madonna, Michael Jackson, Lady Gaga, Weird Al)  \n\nWeek 9: Television: I Love Lucy Draft of Paper 1 (Peer Review) \n\nWeek 10: Television: Mary Tyler Moore\nPaper 1 due (4–5 pages)\n\nWeek 11: Genres: Mysteries (Sherlock Holmes)\n\nWeek 12: Genres: Fantasy (The Fellowship of the Ring: film) \n\nWeek 13–16: The Two Towers (film clips and text) \n\nWeek 17: Draft of paper 2 (peer review)\n\nWeek 18: Paper 2 due\n\nStudents' own short presentations on aspects of popular culture will be interspersed throughout.",
    "scorePolicy": "30% \tInformal Writing and Quizzes\n\n40%\t        Formal Papers\n\n20%\t        Presentations\n\n10% \tParticipation—Engagement in the Classes",
    "materials": "Course Packet\nSherlock Holmes stories\nJ.R.R. Tolkien: The Two Towers",
    "consultation": "Tuesdays: 10:10–12:00 (by appointment only)Tuesdays: 3:00–4:00 Wednesdays: 1:10–4:00 (by appointment)",
    "remarks": "I use MS Teams as a platform for both online and in-person classes. Please be sure to check it at least three times a week.",
    "foreignLanguageTextbooks": true
  }
]
