[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-09-04 15:15:36",
    "objective": "British and American Fiction is a fascinating and inexhaustible subject. The novels we are reading (Jane Eyre [1847], Alice’s Adventures in Wonderland [1865], parts of Huckleberry Finn [1884], and 1984 [1949]), are books that people in Britain or the U.S. would be nearly as likely to pick up for fun as they would be to read them in class. They’re also books that almost everyone knows something about—even if individuals haven’t read the book. Knowing these books and the context they came out of will give you the ability to understand many ideas that are central to British and American identity and culture. \n\nThrough informal investigations and in-class activities, you will learn the literary and historical context of the novel in each era. How has prose fiction changed over time? How has the purpose of writing changed? How have tastes changed? And why are these changes important?     \n\nOfficial Course Description: 本課程旨在引導學生如何以批評的角度閱讀小說。課程討論有兩個重點：（一）小說的技巧：如情節、結構、人物塑造、敘事者與敘事策略、背景鋪陳、象徵與意象等。（二）小說與文學理論的關係：如何將文學理論運用到小說的閱讀與分析。\nThis course will introduce students to critical approaches and principles in the study of fiction.  We will discuss such features as plot, structure, characterization, narrator, narrative strategy, setting, symbol, image, etc..  We will also examine various theoretical approaches that can be brought to bear on the study of fiction.  There will be a particular emphasis on the application of theories to hone students' critical reading skills.",
    "schedule": "We will read Alice's Adventures in Wonderland and Through the Looking-glass aloud in class, discussing it as we go. These books have lots of English language play and is great to read aloud in English in an environment where you can learn to understand all the jokes. Other novels will be read over the course of the semester and discussed in class. \n\nWe will spend 7 weeks on Jane Eyre and 5 on 1984. We will spend the remaining weeks on the last text.",
    "scorePolicy": "In-class Writing and Reading Quizzes: 30%\nClose Readings: 30%\nFinal: 25%\nPresentation: 5%\nIn-class Activities and Participation: 10%\n\nStudents will keep a reading notebook that they can use on reading quizzes. \nStudents may have one presentation. \nStudents must turn in at least 2 one-page close readings after we complete each novel, but they can turn in up to 4, with the highest two scores being counted. \nStudents will have a final exam.",
    "materials": "Jane Eyre (Charlotte Bronte)\nAlice's Adventures in Wonderland and Through the Looking-Glass (Lewis Carroll)\n1984 (George Orwell)\nHuckleberry Finn",
    "consultation": "Tuesdays: 3:00–4:00 Wednesdays: 1:10–4:00 (by appointment)",
    "remarks": "I use MS Teams as a platform for both online and in-person classes. Please be sure to check it at least three times a week.",
    "foreignLanguageTextbooks": true
  }
]
