[
  {
    "name": "郭無患",
    "email": "kuoberlin@gmail.com",
    "latestUpdate": "2023-09-12 10:00:33",
    "objective": "一、教學目標（Teaching Objectives）\n本課程旨在讓學生具備國際新聞編譯之相關知識，並透過實務演練培養新聞編譯之能力。課程內容主要含括 (一) 國際新聞編譯之介紹（如新聞編譯現況、製作流程、專業條件與譯者相關知能）；（二）新聞編譯之策略與技巧（如刪除、重組、整合新聞訊息）；（三）新聞編譯之模擬與實務練習。\n本課程提供閱讀新聞英語的練習機會，藉著閱讀報紙、雜誌英文新聞報導、評論、專欄、社論等，了解其中新聞字彙、文體，訓練閱讀新聞。\n促使學生透過媒體識讀教學過程、瞭解新聞編採實務、國際現勢、配合原本的英文能力利基，強化國際觀，落實並活用英文。\n本課程重要目標並包含著重加強應用英文系學生對國際新聞編譯實務的能力，培養學生敏銳的觀察力及組織力、並訓練學生對國際時事的新聞陳述與課堂討論，達到不同觀點的看法。有系統引導學生閱讀國際新聞，述說新國際聞編譯之寫作方式與要點，以及編譯技巧，培養未來可能於新聞職場服務的專業能力。",
    "schedule": "二、授課內容（Teaching content）\n第 1 週 主題：課程說明、初探新聞英文與新聞編譯、教學討論分組與遴選課堂小幫手。\n第 2 週 主題：台灣總統大選的外媒報導與編譯。作業交付（兩岸關係與美中台）（俄烏戰爭）。\n第 3 週 主題：國際新聞編譯實務之國際政治新聞。本週作業內容（兩岸關係與美中台）分組討論。\n第 4 週 主題：朝鮮半島緊張情勢。本週作業內容（俄烏戰爭）分組討論。作業交付：梁朝偉之威尼斯影展終身成就獎。\n第 5 週 主題：國際新聞編譯實務之司法新聞編譯注意事項 — 從 Led Zeppelin’s Stairway to Heaven 遭提訟談起。本週作業（梁朝偉之威尼斯影展終身成就獎）分組討論。\n第 6 週 主題：國際時勢編譯分析。本週作業（梁朝偉之威尼斯影展終身成就獎）分組討論）。作業交付：Osaka Naomi\n第 7 週 主題：國際時勢編譯分析。本週作業（Osaka Naomi）分組討論。\n第 8 週 主題：世界的 TSMC 與你、我。本週作業（Osaka Naomi）分組討論。作業交付：U.S. arms sales to Taiwan, Defense Security Cooperation Agency，軍事新聞編譯\n第 9 週 期中考\n第 10 週：國內新聞媒體國際新聞編譯作業實況及其未來。本週作業（U.S. arms sales to Taiwan）分組討論。\n第 11 週 主題：國際時勢編譯分析。本週作業（U.S. arms sales to Taiwan）分組討論 。\n第 12 週 主題：新聞媒體編譯作業參訪與討論。作業交付：國際新聞在台灣的馴化過程。\n第 13 週 主題：國際財經新聞編譯。本週作業（國際新聞在台灣的馴化過程）分組討論 。\n第 14 週 主題：國際媒體對台灣選舉的觀察。本週作業（國際新聞在台灣的馴化過程）分組討論。期末作業專題分組報告研討。\n第 15 週 主題：縱觀數位呈現技術應用與國際新聞編譯實務之交互運用。期末作業專題分組報告研討。\n第 16 週 主題：國際時勢編譯分析。期末作業專題分組報告研討。\n第 17 週 期末作業專題分組報告與討論。\n第 18 週 期末作業專題分組報告與討論。本學期課程結束。",
    "scorePolicy": "三、成績評量及標準\n1、每周作業與出席（15%）。\n2、上課主動參與、討論、提問（20%）\n3、期中考試（20%）\n4、期末專題報告（45%）",
    "materials": "四、使用教材：AP、Cable News Network、Economist、Time、Wall Street Journal、Washington Post、Financial Times 等國際主流新聞媒體，對國際重大新聞之最新報導及分析，形式包含文字、圖像、及影音。\n參考書目，\n“補上一堂國際關係課” 楊永明博士著 \n    捷徑文化出版\n“新聞英語精粹選讀 “    莊克仁博士譯著\n    亞太圖書出版社\n\" 永遠的圈外人，冷若水回憶錄 “，冷若水著\n    三民書局",
    "consultation": "五、學生學習方式與過程：1、每週指定作業：交付閱讀內容，並要求下周（下下周）完成新聞譯稿或讀書心得，隨堂討論。2、分組討論與報告：此為分組書面報告，由同學就授課主題與閱讀資料進行相關資料的收集整理，於指定日期在堂課繳交文字報告，並以分組為形式在課堂上台 ppt 報告分析。",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
