[
  {
    "name": "陳生明",
    "email": "smchen@ntut.edu.tw",
    "latestUpdate": "2023-05-24 18:06:28",
    "objective": "生物電化學可以獲得更多先進的訊息，其中包括生化反應、形態學，以及物理、化學和電學等相關性質。運用相關的技術方法，例如電化學工具，可用以研究異相與均相反應，亦可獲得諸多界面間的化學活性和圖譜以利用於微裝置的發展。對生物分析而言，生物電化學感測器具有最大的再現性，並能夠成功的引用於電活性生化物種、母體材料，以及其規格上。生物電分析方法包括最先進和有用的方法，其中大部分皆建立在此領域的的基礎上。\nBioelectrochemistry can be investigated to get more and more advanced information about biochemical reaction, morphology, and physical, chemical, and electric properties. The techniques have been used in a variety of ways, for example, as an electrochemical tool to study heterogeneous and homogeneous reactions, for high-resolution imaging of the chemical reactivity and topography of various interfaces, and for microfabrication. For bioanalysis, bioelectrochemistry sensors have maximum reliability and can be successfully employed in electroactive biomaterials, matrix materials, and their size. Bioelectroanalysis include descriptions of the most advanced and successful methods, which in large part build on the fundamentals will be described.",
    "schedule": "First week : The Origin of Bioelectrochemistry: An Overview\nSecond week : Voltammetry of Proteins and Single Cell Electrochemical\nThird week : Bioelectroonics and Electrochemistry of NAD(P)+/NAD(P)H\nFourth week : Electrochemical Immunoassay\nFifth week : Holiday\nSixth week : Electrochemical Measurements of NO, Nitric Oxide, CO in Biological Systems\nSeventh week : Scanning Electrochemical Microscopy Applied to Biological Systems\nEighth week : Ion-Selective Electrodes for Measurements in Biological Fluids and Biomolecules\nNinth week : Midterm exam\nTenth week : Electrochemistry in Bioanalysis and drug determination \nEleventh week : Interfacial Properties of ProteinSpectroelectchemical Studies\nTwelfth week : Electrochemical Analysis of Nucleic Acids\nThirteenth week : Enzyme Electrodes, Enzyme Electrochemistry, Direct Electrochemistry\nFourteenth week : Carbon Fiber Microelectrodes for the in vivo Measurement of Neurotransmitters:A Close Up Look at Neurochemical Activity in the Brain\nFifteenth week : Potentiometric Measurements of Protenins\nSixteenth week : Membrane Electrochemistry\nSeventeenth week : Mediated Electron-transfer between Redox-enzymes and Electrode Supports\nEighteenth week : Final exam.",
    "scorePolicy": "Mid-term exam 30%\nFinal exam 30%\nQuiz, homework, and report 30%\nAttendance 10%",
    "materials": "Encyclopedia of  Eelctrochemistry Volume 9 Bioelectrochemistry",
    "consultation": "Sun Yat-Sen Memorial hall (Environmental Engineering) Room 404",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
