[
  {
    "name": "華國媛",
    "email": "kyhwa@ntut.edu.tw",
    "latestUpdate": "2023-07-21 09:43:07",
    "objective": "Bioenergy is referred to the energy stored in living or recently living biological organisms, such as animals, plants and microbes. The source of bioenergy can be traced back from plants harvesting the sunlight and converting it to glucose, then to other biopolymers such as polysaccharides. The technologies for developing bioenergy, with an emphasis on environmentally compatible, consist of gene cloning technology from molecular biology and enzymatic control and catalytic chemistry (i.e. green chemistry).  The course is an introduction course on the types of polysaccharides in animals and plants, how scientist use system biology to develop bioengergy.",
    "schedule": "Week/ Date\tTitle\n1.\tIntroduction on \n2.\tWhy bioenergy makes sense?\n3.\tNature’s green revolution- Photosynthesis\n4.\tBiomass and polysaccharides\n5     Composition and biosynthesis of lignocellulosic biomass \n6.     Bio-oil and bioethanol \n7.\tArtificial photosynthesis \n8.     First, second and third generation biofuels \n9.     Mid-term case report\n10\tBiological conversion of biomass into gaseous fuels\n11\tBiological conversion of biomass into liquid fuels   \n12.\tEnergy conversation- beyond combustion and pyrolysis\n13.   Carbon emission post-coronavirus: continual decline or rebound?\n14\tPollution and environmental issues related to common energy sources.\n15\tCase study- zero carbon & carbon credit\n16\tLiterature review\n17\tLiterature review\n18\tFinal report",
    "scorePolicy": "Evaluation: Class participation (40%), Midterm report (30%), Final report (30%)",
    "materials": "Class booklet with selected article will be given in the class.",
    "consultation": "If you have any question in regards to the class, you can reach the TA or me:1. in class discussion 2. prior or after class discussion with TA3. via TEAM or Line group",
    "remarks": "This class is under the SDGs 6,7 and 13.  The focus of the class is on Net-Zero policy (https://ncsd.ndc.gov.tw/Fore/en/Net-Zero).We will use Microsoft Team for the class.Register and download the software:https://www.microsoft.com/zh-tw/microsoft-teams/group-chat-software",
    "foreignLanguageTextbooks": true
  }
]
