[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2023-05-27 06:53:44",
    "objective": "To understand how Life Cycle Thinking and Life Cycle Management can solve environmental problems. Life Cycle Assessment (LCA), one of the most important tools for analyzing and assessing environmental problems will be taught during the course of the semester. Students will also be learning a popular LCA software, SimaPro. Various applications related to LCA, such as carbon footprinting and labeling, and eco-design will also be practiced in the class.",
    "schedule": "1. Introduction of Life Cycle Assessment I: History, development, and Applications\n2. Introduction of Life Cycle Assessment II: Life Cycle Thinking and Life Cycle Management\n3. Methodology of LCA: I. Goal and Scope definition and inventory analysis)\n4. Methodology of LCA- II. Inventory analysis\n5. LCA Software SimaPro: Introduction and Practices (Make learning groups)\n6. Methodology of LCA- III. Methodology of LCIA\n7. Methodology of LCA- IV. Methodology of LCIA)\n8. Methodology of LCA- V. Uncertainty, sensitivity analysis, and interpretation\n9. Mid-term Exam\n10. Group report- LCA for one product or service \n11. Other Types of LCA (Eco-efficiency, MFCA, Carbon Footprinting, Water Foorpeinting, Social LCA, and Organizational LCA, etc.)\n12. LCA Applications: Environmental Declarations and Carbon Labeling\n13. LCA Applications: Green Processes and Products, Eco-design\n14. LCA Outlook and Latest Development: Net Zero and Biodiversity\n15. Special Topic: Natural Capital Accounting and LCA\n16. Team Project Presentation\n17. Team Project Presentation\n18. Final Exam",
    "scorePolicy": " Participation and Homework：30 %   Exams：30 %\n Team Project (Report and Oral Presentation)： 40 %",
    "materials": "\tHauschild, M. Z., Rosenbaum, R. K., & Olsen, S. I. (2018). Life cycle assessment (Vol. 2018). Springer International Publishing, Cham. https://doi. org/10.1007/978-3-319-56475-3 \n\tJolliet, O. et al., Environmental Life Cycle Assessment, CRC Press, 2016",
    "consultation": "Office Hour: Wednesday afternoon 14:00~16:00Or Make an appointment with Prof. HU: Ext. 4151 or allenhu@mail.ntut.edu.tw",
    "remarks": "SDG4, SDG9, SDG12",
    "foreignLanguageTextbooks": true
  }
]
