[
  {
    "name": "王清祿",
    "email": "chinglu1831@gmail.com",
    "latestUpdate": "2023-09-03 09:43:30",
    "objective": "本課程旨在帶領學生讀、理解並分析國際時事，提高學生之英文能力，透過對多元主體之解析，讓學生了解單字用法，句型結構，特殊術語和慣用俚語等，提升閱讀能力，另外配合聽力技巧學習，提升理解能力。本課程著重英文閱讀，聽力與口說能力，鼓勵學生以英文討論國際時事，發表見解，拓展對世界的認識。\nThis course intends to enhance students’ reading, speaking and listening abilities by using quality newspapers, journals, interviews and podcast. It will help students enrich their vocabulary and acquire key English expressions and sentence patterns used in different realms like politics, arts, entertainment, science & technology, sports, business and health. Students learn to read, discuss and debate global issues through diverse forms of activities. This course familiarizes students with world affairs and broadens their perspective of the world.",
    "schedule": "Course syllabus  (Subject to change)  \nWeek 1\t● Class orientation\n● Why Read English News?  Wang Ching-lu 王清祿 (slides)    \n●\tKey terms and concepts on Information and media literacy. Wang Ching-lu\n— Always Stay Critical: Why Critical Thinking Matters in the Age of Information Overload. \n— The structures of hard news and features: inverted pyramid vs. pyramid \n— Hard news (objective) vs. soft news (individualized and subjective)  \n— Byline, features, columns, opinions\n— Information and media literacy\n— Information, misinformation, disinformation, faked news\n— Manufactured Images and texts in the digital age  \n\t     \nWeek 2  ~ “Artificial Intelligence Is Changing Social Media.\" Deborah Block. voanews.com. \t\t\t  July 19, 2023. \n~ “7 Reasons Why Artificial Intelligence Can’t Replace Humans at Work.” Raji Oluwaniyi. Mar 15, 2023. makeuseof.com.    \n● Key concepts on (news) media. Wang Ching-lu\n— How to read news headlines\n— How editing works: including vs. excluding \n\t● Reading skills.  Wang Ching-lu \n— Finding synonyms and referring words \n— Local/national vs. International/foreign/world/global affairs\n— Fact-checking and source-checking   \n— News source checking and evaluation\n— Reliable or unreliable sources/news  \nWeek 3\t~ “Will AI – Artificial Intelligence Take Over the World?” Darren Pesen.    \ttechbusinessnews.com.au, 2023/05/18\n~ “CNN 10: The Big Stories of the Day, Explained in 10 minutes.” edition.cnn.com. 18 May, 2023. (video)                 \nWeek 4  ~ \"How AI Could Save (Not Destroy) Education.\" Sal Khan. TED. May 1, 2023. (video)  \n● How to Write a Winning Summary: A Brief Guide. Wang Ching-lu (slides)  \n~ \"ChatGPT in Classrooms: What to Know.\" US News & World Report. 2023.1.18. usnews.com  \n~ \"ChatGPT Is Dumber Than You Think.\" Ian Bogst. The Atlantic. theatlantic.com. Accessed 03 May 2023. (excerpt)    \nWeek 5  ~ “Race to the Top.\"Excerpt from\"Innovation Power: Why Technology Will Define the Future of Geopolitics.\" Eric Schmidt. March/April 2023. Foreign Affairs, pp. 44-47.   \n\t~ “7 Reasons Why Innovation Is Important.\" Lisa Caprelli. 09.13.2021. (video + text) \nWeek 6  ~ \"My Advice in Three Parts [to Be a Good Designer].\" Jessica Walsh. How Ideas Are Born: Graphic Designers on Creative Processes. Miguel Ágnel Pérez Arteaga. Barcelona: Hoaki Books, 2022, pp. 294-295.   \t  \nWeek 7  ~ “9 Reasons Why Print Dictionaries Are Better Than Online Dictionaries.” Barbara Ann Kipfer. theweek.com. Accessed 4 April 2021. \n●\t“Writing Tips: Essential Academic/Professional Writing Skills.” Wang Ching-lu (slides)               \nWeek 8 \t● Midterm exam \t\t\t\t  \nWeek 9  ● Post-exam review \n~ “West vs. China Conflict Avoidable, Says Biden as G7 Summit Wraps.” Patsy Widakuswara. Voice of America. voanews.com. 2023.05.21. (video + text)\nWeek 10  ~ “West vs. China Conflict Avoidable.” (continued)\n ~ “Introduction to Political Geography.” (geopolitics). studysmarter.co.uk. Accessed 23 June 2023.            \nWeek 11  ~ “Forget Multitasking, Try Monotasking.” Paolo Cardini. YouTube. 2013. Accessed 23 June 2023. (video) \t \nWeek 12  ~ “Nvidia: The Chip Maker That Became an AI Superpower.” Zoe Corbyn & Ben Morris. BBC News. 26 May, 2023. \n~ “Women Across the Globe Are Falling Victim to Doxxing. Here's What to Know” CNN. Accessed 22 June 2023. (video) \nWeek 13 \t~ “The Age of Distraction.” Amy E. Herman. 27 June, 2022. saturdayeveningpost.com. \n~ “Staying Focused in the Era of Digital Distractions.” June 29, 2019. Harvard Medical School. health.harvard.edu. \nWeek 14 \t~ “Ten Questions about Copyright.” Tad Crawford. tadcrawford.com. The Ele",
    "scorePolicy": "The final grade will be based on:\nMidterm exam 20%\nJoint midterm exam 20% \nFinal exam 20%\nAttendance 20% \nClass participation, quizzes, and assignments 20%\nStudents who are absent in class up to one third (18 class hours) or more of the semester will be given a failing grade.\n期中考 20%\n全校英文期中大會考 20%\n期末考  20%\n出席率  20%\n平時成績 20%  (包括課堂參與、小考、作業、課外閱讀、英文閱讀與寫作，如摘要技巧)\n缺席時數達總學期（18 週計）的三分之一或以上者，則學期總成績不及格。",
    "materials": "Photocopy handouts",
    "consultation": "If students need consultation related to English learning, please email me at chinglu1831@gmail.com or go to LINE at https://line.me/ti/g/8ij47LGLVH. 同學如有學業相關問題需和我討論可用 LINE 或 email。",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
