[
  {
    "name": "林鼎然",
    "email": "tinglan@ntut.edu.tw",
    "latestUpdate": "2023-05-25 18:37:08",
    "objective": "[Attention! This course combines programming implementation and theory. This course even more heavily relies on programming side. The programming skill is the main knowledge you learn and the key to get high score. So please make sure you like or like to learn programming to enroll the class] \n\n[Attention! There will be weekly programming homework!]\n\n The video transmission over the network has occupied more than half of the bandwidth of the internet (by Youtube and services mobile devices for example). Therefore it is essential to compress the video to save the bandwidth and maintain good video quality. This course provides students the general introduction to video compression processes and video transmission in error prone channel. By the end of the course, students will understand the concept of video compression and have a chance to apply their learnt knowledge to improve the video coder.",
    "schedule": "week\tunit\n1. \t[Course introduction]\n2. \tImage format, Image quality\n3. \tDiscrete Cosine Transform (DCT) \n4.\tDiscrete Cosine Transform (DCT) \n5.\tVector quantization and DCT for correlated data compression\n6.\tCodebook design\n7.\tJPEG:DCT, zonal coding, threshold coding, JPEG:Zigzag, huffman coding in JPEG\n8.\t[on-computer midterm] \n9.\t[school midterm --- self review]\n10.\tMPEG(I)\n11. \tMPEG(II)\n12.\tH.264(I) \n13. \tH.264(II) \n14. \tH.264(III) \n15. \tMulti-View Coding (MVC)\n16. \t[Student final presentation]\n17. \t[on-computer final]\n18. \t[school final – self review]",
    "scorePolicy": "On-computer midterm 30%\nStudent final presentation 20%\nOn-computer final 30%\nOther (online activities, homework etc.) 20%",
    "materials": "[main educational material] Self-written slides\n[reference educational material]\nIain E. Richardson, The H.264 Advanced Video Compression Standard, 2010, Wiley, 2\nRafael C. Gonzalez and Richard E. Woods, Digital Image Processing, 2007, Prentice Hall, 3",
    "consultation": "email",
    "remarks": "In case of epidemic condition, the class policy will be announced in https://istudy.ntut.edu.tw/. Email your name and ID number to me at tinglan@ntut.edu.tw for more info.",
    "foreignLanguageTextbooks": true
  }
]
