[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2023-09-07 18:05:28",
    "objective": "本課程旨在提升學生學術英文能力，課堂將引導學生透過不同的學術聽力訓練、閱讀學術文章、學術寫作練習、與學術口語訓練等，來增進學生於大學英語授課課堂中的課堂參與，以及整體學術能力的展現，並為未來專業職場上語言能力奠定良好基底。\nThis course is designed for undergraduate students to develop their academic English language skills for success in English-medium university coursework. This course will engage students with active participation in a variety of academic listening, reading, writing, and speaking activities that they would encounter in real-life academic university lectures and professional workplace environments.",
    "schedule": "Week \t\tActivity\t\t\n\n1\t\tIntroduction\t\n2\t\tClass\n3\t\tClass and group presentation (Group 1)\n4\t\tClass and group presentation (Group 2)\n5\t\tClass and group presentation (Group 3)\n6\t\tClass and group presentation (Group 4)\n7\t\tClass and group presentation (Group 5)\n8\t\tClass and group presentation (Group 6)\n9\t\tSchool Mid-Term (Nov 7)\n\t\tClass and group presentation (Group 7)\n10\tNo class (The two hours of class time to be fulfilled by the talk on Dec 8.)\n11\t\tTalk (10:10am to noon on Nov 14 or Nov 21)\n12\t\tClass and group presentation (Group 8 and Group 9)\n13\t\tTest\n\t\tTalk at 7pm, Dec 8 in the Museum of National Taipei University of Education\n14\t\tSpeaking test\t\n15\t\tSpeaking test \n16\t\tClass \n17\t\tClass\n18\t\tConsultation",
    "scorePolicy": "Group presentation\t\t\t20%\nSchool mid-term\t\t\t20%\nSpeaking test*\t\t\t\t20%\nTest*\t\t\t\t\t20%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup test may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of the test or exam. The format of the make-up test will be determined by the lecturer.\n\nAttendance policy\nYou will automatically receive a grade of zero with 7 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system to the Class Rep.\n\nGroup presentation:\nYou will form groups of four and present a book chapter or article selected by the lecturer for 20 minutes followed by a Q&A session. Sign-up with the Class Rep is on a first-come first-serve basis.",
    "materials": "Textbook: to be confirmed",
    "consultation": "Students may make appointments for consultation.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
