[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2023-06-01 11:48:50",
    "objective": "本課程提供學生及職前專業人士必備之英語文語言技巧，強調設計專業領域之英文溝通能力之訓練。課程內容依學院專業內容區分並整合英語文之聽說讀寫之能力為未來全球化移動及以英語專業溝通人才培育為目標。\nThis course aims to provide pre-service design students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.",
    "schedule": "Topic and Tentative Schedule: This class aims to have a balance between improving your professional speaking, writing, and grammar *in general* and providing you with particular vocabulary that will be useful to you. The units from American Headway, listed below, are advisory. I will assign additional homework in class. All listed assignments are due on the day they are listed. \n\nCourse Introduction\nWeek 1: Unit One—American Headway: What makes us Human?\nPlease buy the American Headway 5 textbook before next week. Also, please make sure to have bought (and brought) your other class supplies. (See p. 1) Bring them each class each day.\n\nWeek 2: Unit One (cont.)\n(As always, make sure to finish any listed assignments before you come to class.) \nRead “Why Clay Shirky Banned Laptops, Tablets and Phones from His Classroom” and do the related vocab homework (both are on MS Teams). Choose ten words from the vocabulary that you really want to learn and put a start next to them. Prepare, if time allows, “The Stages of Your Major” presentation.\n\nWeek 3: Unit One (cont.)\nPresent “The Stages of Your Major,” with costumes/props.\n\nWeek 4: First Reading/Viewing Groups (about something related to your major that you spend time on on your own—not in class) (Later presentations scheduled throughout the semester)\n\nWeek 5: Unit 2: In So Many Words (Accents and Grammar)\n\nWeek 6: Unit 2 (cont.)\nHalloween Dialogs due\n\nWeek 7: Unit 3: Enough is Enough? (Sustainability) \n\nWeek 8: Unit 3 (cont.)\nStart-up company projects (in-class work).\n\nWeek 9: Midterm exam and Proficiency Test, Tuesday at 10:10 a.m. Please remember that you must bring your NTUT ID to the exam. Please remember that you cannot take the exam if you are more than twenty minutes late.\n\nWeek 10: Start-up company presentations \n\nWeek 11: Start-up company interviews. \nResume due. \n(An exam on units 1–3 may be given anytime between now and 12/7. I will keep you posted.) \n\nWeek 12: Unit 4: Not All it Seems\nUnit 4, cont./Sherlock Holmes/Deductions\n\nWeek 13: Unit 5 (Culture Clashes) and 6 (Fruits of War--things that have been designed during wars)\n\nWeek 14: Unit 5 continued/Unit 6: Fruits of War\n\nWeek 15: Unit 5/6 continued\n\nWeek 16: Start-up company interviews. \nResume due. \n\nWeek 17: Unit 5/6 continued and review",
    "scorePolicy": "Homework: 25%\t\t\t\t\t\nSkits and Oral Activities: 10%\nQuizzes/Tests/Alternative Assessments: 25%\t\nPresentations: 10%\nMidterm: 20%\t\t\t\t\t\nParticipation: 10%",
    "materials": "American Headway 5, 3rd edition\nCourse packet and/or MS Teams folder with other readings",
    "consultation": "Tuesdays: 3:00–4:00 Wednesdays: 1:10–4:00 (by appointment)",
    "remarks": "I use MS Teams as a platform for both online and in-person classes. Please be sure to check it at least three times a week.",
    "foreignLanguageTextbooks": true
  }
]
