[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2023-09-16 10:20:07",
    "objective": "本課程旨在帶領具進階英文能力學生讀、理解並分析國際時事，提高學生之英文能力，透過對多元主體之解析，讓學生了解單字用法，句型結構，特殊術語和慣用俚語等，提升閱讀能力，另外配合聽力技巧學習，提升理解能力。本課程著重英文閱讀，聽力與口說能力，鼓勵學生以英文討論國際時事，發表見解，拓展對世界的認識。\nThis course intends to enhance students’ advanced-level reading, speaking and listening abilities by using quality newspapers, journals, interviews and podcast. It will help students enrich their vocabulary and acquire key English expressions and sentence patterns used in different realms like politics, arts, entertainment, science & technology, sports, business and health. Students learn to read, discuss and debate global issues through diverse forms of activities. This course familiarizes students with world affairs and broadens their perspective of the world.",
    "schedule": "Week \t\tActivity\t\t\n\n1\t\tIntroduction\t\n2\t\tClass\n3\t\tClass and group presentations (Groups 1 and 2)\n4\t\tClass and group presentations (Groups 3 and 4)\n5\t\tClass and group presentations (Groups 5 and 6)\n6\t\tClass and group presentations (Groups 7 and 8)\n7\t\tClass and group presentations (Groups 9 and 10)\n8\t\tClass and group presentations (Groups 11 and 12)\n9\t\tSchool Mid-Term (Nov 7)\n\t\tClass and group presentations (Groups 13 and 14)\n10\tClass (guest speaker)\n11\t\tNo class (The two hours of class time to be fulfilled by a take-home assignment.)\n12\t\tClass and group presentations (Groups 15 and 16)\n13\t\tTest\n14\t\tSpeaking test\t\n15\t\tSpeaking test \n16\t\tClass \n17\t\tClass\n18\t\tConsultation",
    "scorePolicy": "Group presentation\t\t\t20%\nSchool mid-term\t\t\t20%\nSpeaking test*\t\t\t\t20%\nTest*\t\t\t\t\t20%\nParticipation and attendance\t\t20%\n\n*At the lecturer’s sole discretion, a makeup test may be granted upon presentation of a note of approval for leave from the university system no later than 5 days after the date of the test or exam. The format of the make-up test will be determined by the lecturer.\n\nAttendance policy\nYou will automatically receive a grade of zero with 7 or more unexcused absences from Week 2 onwards. You may get an excused absence only upon presentation of a note of approval for leave from the university system to the Class Rep.\n\nGroup presentation:\nYou will form groups of 2 or 3 and present a current news event as reported by at least 3 news outlets and analyze the differences in reportage and reasons for and implications of these different perspectives. You will present for up to 15 minutes followed by a Q&A session. Sign-up with the Class Rep is on a first-come first-serve basis.",
    "materials": "Textbook:\nCalling Bullshit: The Art of Skepticism in a Data-Driven World, Carl T. Bergstrom, Jevin D. West, Random House",
    "consultation": "Students may make appointments for consultation.",
    "remarks": "All SDG goals as listed on the UN website.",
    "foreignLanguageTextbooks": true
  }
]
