[
  {
    "name": "陳志遠",
    "email": "cychen123@ntut.edu.tw",
    "latestUpdate": "2023-05-31 18:25:54",
    "objective": "In recent years, economists, social science researchers, policymakers, businessmen and professionals have begun to make increasing meso-level and macro-level use of patent information. This is being done to analyze, for example, patenting activities of a country' technical patterns of internationalization; patenting activities in a sector, technology or company to ascertain or forecast the direction of technical change, or ascertain the relative technological position of a company in a marketplace; etc. As such, the use of patent information has expanded to many different tactical and strategic business, research, and policy making activities at national, institutional or enterprise levels. Therefore, the primary objective of present course focus on patent information analysis in several areas through related cases study.\nFurthermore, the student who would like participate the course should obey at least one of following two requirements: (1) He/She is a student of Graduate Institute of Intellectural property, or (2) He/She has taken at least one of the following courses, i.e. patent examniation guidelines I, II, design & intellectural property rights, patent portfolio and patent strategy, in the previous semesters.",
    "schedule": "Week 1 ~ 5  Patent information introduction.\nWeek 6 ~ 8  Patent search methodology introduction. \nWeek 10~12 Taiwan patent information introduction.\nWeek 13~15 U. S. patent information introduction.\nWeek 16~17 European  patent information introduction.\nWeek 18 Final Exam.",
    "scorePolicy": "1. Mid-term exam  (45 %)\n2. Final exam (45 %)\n3. Course participation (10%)",
    "materials": "Use of self-made materials.",
    "consultation": "The contact information will be given in the first course.",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
