[
  {
    "name": "尹秦清",
    "email": "yinchinching@ntut.edu.tw",
    "latestUpdate": "2023-05-29 11:25:41",
    "objective": "本課程旨在為學生提供創業和經營新創企業所需的基本知識和技能。 課程內容涵蓋當前各種形態的創業模式和創業家精神所具備的一些關鍵特質與必要的技能，學生將學習到如何識別市場機會並評估將想法商業化的可行性。本課程也將深入介紹行銷的核心概念與市場運作，包括市場細分，目標顧客定位和行銷組合，學生將學習到如何根據市場需求制定行銷策略並有效地實施。該課程還將涵蓋品牌策略、定價策略、推廣和銷售等主題。完成本課程後，學生將獲得關於創業以及經營企業的關鍵知識和技能，以及對行銷在創業過程中的作用有更深入的理解。\nThis course aims to provide students with the foundational knowledge and skills necessary to start and operate a new business venture. Students will learn about the various forms of entrepreneurship and entrepreneurship essentials, such as the characteristics, traits, and skills of successful entrepreneurs. Students will learn how to identify opportunities and assess the feasibility of a business idea. The course will then delve into the core concepts of marketing, including market segmentation, targeting, positioning, and the marketing mix. Students will learn how to develop a marketing plan and implement it effectively. The course will also cover topics such as branding, pricing strategies, promotion, and distribution. Upon completion of this course, students will have gained the knowledge and skills necessary to launch and operate a new business, as well as a deeper understanding of the role of marketing in entrepreneurship.",
    "schedule": "1. Course Introduction\n2. Concept of entrepreneurship\n3. Business opportunities in digital times I\n4. Business opportunities in digital times II\n5. Holiday for Double Tenth Day \n6. Financial Planning I\n7. Financial Planning II\n8. Entrepreneurial Teams\n9. Midterm Exam\n10. Innovative thinking and business models\n11. Go-to-market (GTM) strategy I\n12. Go-to-market (GTM) strategy II\n13. Entrepreneurship marketing tactics I\n14. Entrepreneurship marketing tactics II\n15. Customer needs and behaviors I\n16. Customer needs and behaviors II\n17. Holiday for New Year's Day\n18. Final report (PPT presentation)",
    "scorePolicy": "1. Attendance & Class Participation: 20% \n2. Case Study Presentation: 20%\n3. Midterm Exam: 30%\n4. Final Report: 30%",
    "materials": "The reference book is not required.",
    "consultation": "Email, Office Hours, and i-School Plus",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": false
  }
]
