[
  {
    "name": "徐昕煒",
    "email": "hwhsu@ntut.edu.tw",
    "latestUpdate": "2023-05-29 15:42:44",
    "objective": "本課程預計搭配中國工業工程學會的「永續工程師」證照檢定考試做授課，由工程面與管理面探討淨零排放趨勢下，企業永續下工業工程所需具備的能力與知識。其中管理篇包括：企業永續發展、永續發展與氣候變遷風險管理、碳中和浪潮與因應之道、綠色供應鏈管理、永續金融、氣候相關財務揭露建議、資源永續與產業共生、與永續經濟決策分析。工程篇則包括：永續供應鏈設計、永續與能源政策、排放權交易與碳定價、綠色產品設計與評估、綠色物流與綠色冷鏈、產品服務系統、綠色聰明生產與循環經濟、清潔生產等理論與案例實務。\nThis course is designed to cover the knowledge and skills required for sustainable industrial in the context of net-zero emissions. It will be taught in conjunction with the \"Sustainable Engineer\" certification exam of the Chinese Institute of Industrial Engineers. The course will explore the topics from both engineering and management perspectives, focusing on sustainable enterprise development. The management chapters will cover a range of areas such as climate change, sustainable finance, green supply chain, carbon-neutral strategies, climate-related financial disclosure, resource sustainability, and industrial symbiosis, as well as sustainable economic decision analysis. Meanwhile, the engineering chapters will delve into topics such as sustainable supply chain design, energy policies, carbon pricing, green product design and evaluation, green logistics, product-service systems, green smart production, circular economy, and clean production theories and case studies.",
    "schedule": "Week 1/ 課程簡介 + 證照說明\n管理篇\nWeek 2 / 企業永續發展\nWeek 3/ 永續發展與氣候變遷風險管理\nWeek 4/ 碳中和浪潮與因應之道\nWeek 5/ 綠色供應鏈管理\nWeek 6/ 永續金融\nWeek 7/ 氣候相關財務揭露建議\nWeek 8/ 資源永續與產業共生 + 永續決策\nWeek 9/ 期中考 (證照考試模擬)\n工程篇\nWeek 10/ 永續供應鏈設計\nWeek 11/ 永續與能源政策\nWeek 12/ 排放權交易與碳定價\nWeek 13/ 綠色產品設計與評估\nWeek 14/ 綠色物流與綠色冷鏈\nWeek 15/ 產品服務系統\nWeek 16/ 綠色聰明生產與循環經濟 + 清潔生產\nWeek 17/ 期末案例報告\nWeek 18/ 期末考 (證照模擬考試或現場考試)",
    "scorePolicy": "期中考：30% [選擇題]\n期末考：30% [選擇題]\n小小作業：10% [視狀況調整]\n期中小報告：5%\n期末報告：20%\n點名：5%",
    "materials": "永續工程與管理 (2022)，永續工程與管理，前程文化。ISBN：9786269592333",
    "consultation": "授課老師資訊 \t授課老師：徐昕\t辦公室：宏裕大樓 1134 室\t辦公室電話: 02-27712171 ext.2323\thwhsu@ntut.edu.tw 課程辦公室時間 \t星期二 13:00-16:00        星期三 10:00-12:00\t或者事先預約",
    "remarks": "SDG 6 淨水及衛生 SDG 7 可負擔的潔淨能源 SDG 8 合適的工作及經濟成長 SDG 9 工業化、創新及基礎建設 SDG 10 減少不平等 SDG 11 永續城鄉 SDG 12 責任消費及生產 SDG 13 氣候行動 SDG 16 和平、正義及健全制度 SDG 17 多元夥伴關係",
    "foreignLanguageTextbooks": false
  }
]
