[
  {
    "name": "陳維昌",
    "email": "wcchen@ntut.edu.tw",
    "latestUpdate": "2023-05-25 20:03:52",
    "objective": "Orthogonal frequency division multiplexing (OFDM) and multiple-input multiple-output (MIMO) are popular transmission techniques for wireless and mobile communications, because they offer several advantages such as increasing transmission data rate and enhancing error performance. In the class, we will learn about the basic principles and some advanced topics of OFDM and MIMO. We will also learn how to write a MATLAB program to evaluate the performance of a communication system. All students taking this class have to study a special topic on OFDM or MIMO as a final project.",
    "schedule": "Week 01. Elements of digital communication system\nWeek 02. Probability and random variables\nWeek 03. Detection theory and estimation theory\nWeek 04. OFDM: Signal model, orthogonality, spectral efficiency and efficient implementation\nWeek 05. Adjusted holiday (National Day)\nWeek 06. OFDM: How to combat with multipath channel\nWeek 07. OFDM: Synchronization and channel estimation\nWeek 08. OFDM: OFDM variants\nWeek 09. OFDM: Monte Carlo Simulation in MATLAB\nWeek 10. OFDM: Power allocation\nWeek 11. OFDM: PAPR problem and PAPR reduction techniques \nWeek 12. OFDM: Large OOB emission problem and OOB emission reduction techniques\nWeek 13. MIMO: Error performance in fading channels, maximal ratio combining, and selection combining. \nWeek 14. MIMO: Space-time block code and spatial precoding \nWeek 15. MIMO: Spatial multiplexing and spatial modulation \nWeek 16. Massive MIMO\nWeek 17. Founding Day of the Republic of China\nWeek 18. Final Exam\n\nThe schedule may be adjusted if necessary.",
    "scorePolicy": "MATLAB  Homework     30%\nFinal Exam           35%\nSpecial Topic Report 35%\n\n附註：\n1. 本課程會使用到基本的線性代數、機率與傅立葉轉換概念。\n2. 會提供簡單的 MATLAB 教學影片，供沒有用過 MATLAB 的同學參考。",
    "materials": "Lecture notes\nReferences:\n1. Y.-P. Lin, S.-M. Phoong, P. P. Vaidyanathan, Filter Bank Transceivers for OFDM and DMT Systems, Cambridge University Press, 2010. \n2. T. D. Chiueh, P. Y. Tsai, and I. W. Lai, Baseband Receiver Design for Wireless MIMO-OFDM Communications, 2nd ed., Wiley Inc., 2012.\n3. D. Tse and P. Viswanath, Fundamentals of Wireless Communication, Cambridge university press, 2005.",
    "consultation": "1. 本課程以北科 i 學園 plus 做為課程網頁，並設 Line 群方便同學聯繫與討論，Line 群連結將於開學前提供。2. 如有加退選或課程問題請寄 email 給老師 (wcchen@mail.ntut.edu.tw)。",
    "remarks": "因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。若染疫或隔離無法到校時，可使用 Google Meet 視訊會議室上課，連結將於開學前提供。",
    "foreignLanguageTextbooks": false
  }
]
