[
  {
    "name": "簡良翰",
    "email": "lhchien@ntut.edu.tw",
    "latestUpdate": "2023-06-03 15:48:38",
    "objective": "Course Outline:\nDesign methods, forced convection correlations for single phase heat exchange, pressure calculation, condensers and evaporators analysis, shell and tube heat exchanger analysis, compact heat exchanger analysis, wet coil analysis.\n課程大綱：\n本課程介紹熱能交換原理與熱交換相關之工程技術。使學生熟悉低溫熱交換中之分析熱效率、選擇材料之方法，及選用高效率熱交換器表面形狀之技術。內容包括：流力、熱交換基礎原理；氣冷式散熱鰭片分析、再生式熱交換器、管內與管集之單相熱傳、壓降計算；冷凝器、蒸發器等兩相熱交換器之設計；以及各種幾何變數、殼管式熱交換器之答拉瓦計算法、強化熱傳表面、鰭片管、熱傳表面積垢之問題與對策。",
    "schedule": "週次 / Week\t 授課內容 /Topic\n1\tIntroduction of heat exchangers 熱交換器簡介 \n2\tTypes of heat exchangers an their applications 各種熱交換器之分類及應用\n3   Fluid flow and heat transfer fundamentals in heat exchangers 熱交換器流力及熱傳基本觀念之回顧\n4\tFundamental theories of heat exchanger design 熱交換之設計方法導論　\n5\tDesign methods of heat exchangers 熱交換之設計流程\n6\tDesign of double pipe heat exchangers, fin analysis 套管式熱交換器之設計、鰭片分析\n7\tAnalysis of compact heat exchangers 密集式熱交換器之分析\n8\tHeat transfer and pressure drop of compact heat exchangers 密集式熱交換器熱傳及壓損\n9\tMidterm exam 期中考\n10\tAn example of compact heat exchanger design 密集式熱交換器之計算實例　\n11\tEvaluation of heat exchangers 熱交換器之性能評估\n12\tHeat and mass transfer of direct contact heat exchangers 熱質傳與直接接觸式熱交換器\n13\tPlate type heat exchangers 板式熱交換器\n14\tRegenerative heat exchangers 再生式熱交換器　\n15\tShell and Tube heat exchangers 殼管式熱交換器\n16\tAnalysis of shell and tube heat exchangers 殼管式熱交換器之分析\n17\tFouling problems and solutions of heat exchangers 熱交換器積垢之問題與對策\t　\n18\tFinal exam 期末考",
    "scorePolicy": "Homework: 30%, Midterm: 35%, Term Report 15%, Final Exam: 20%.",
    "materials": "1.\tRemsburg, R., Advanced Thermal Design of Electronic Equipment, International Thomson Publishing, Newyork, 1997.\n2.\tYeh, L.T. and Chu, R.C., \"Thermal management of microelectronic equipment: heat transfer theory, analysis methods, and design practices,\" ASME Press, New York, 2003.\n3.\tSergent, J. and Krum, A., Thermal Management Handbook, McGraw-Hill, New York, 1998.\n4.\tMills, A. F., Heat Transfer 2nd Ed., Prentice Hall, 1999.Myers, G. E., Analytical Methods in Conduction Heat Transfer, Genium Publishing, 1987.\n5.\tSteinberg, D. S., Cooling Techniques for Electronic Equipment, John Willey & Sons, Inc., New York, 1991.\n6.\tOosthuizen, P. H., Naylor, D., Convective Heat Transfer Analysis, , McGraw Hill, 1999.",
    "consultation": "1. 課程諮詢時間 Office hour: Tuesday, Wednesday, Thursday  2:20~4:20pm2. 開學後組成線上群組 Line group discussion: to be announced.",
    "remarks": "依據本校採遠距教學時機，採用 Microsoft Teams 進行線上教學，並提供上課錄影檔案連結功課後觀看。",
    "foreignLanguageTextbooks": true
  }
]
