[
  {
    "name": "張文馨",
    "email": "wenhsin0616@ntut.edu.tw",
    "latestUpdate": "2023-09-05 09:50:51",
    "objective": "All students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman and Sophomore students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in. Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "上課教室：多功能舞蹈教室 (中正館地下室桌球教室內)\n\n一、授課教師：張文馨；r72226@gmail.com\n二、授課班級：肢體美學 \n三、教學進度與主題：\n第一週 教學規劃說明，含目標、內容、進度、應備知識基礎、評量方式。\n第二週 瑜珈體位法之操作 I-\n第三週 瑜珈體位法之操作 II\n第四週 瑜珈體位法之操作 III\n第五週 壺玲操作 - Turkish Get-Up\n第六週 壺玲操作 - 上肢\n第七週 壺玲操作 - 下肢\n第八週 心肺適能 - 定向越野\n第九週 腦瑜珈\n第十週 協調與爆發力 - 繩梯練習\n第十一週 TRX 懸吊操作 - 上肢\n第十二週 TRX 懸吊操作 - 下肢\n第十三週 TRX 懸吊操作 - 核心\n第十四週 心肺適能 - Balloon blow\n第十五週 小組 TABATA\n第十六週 小組 TABATA\n第十七週 期末報告繳交、期末考試\n第十八週 期末補考",
    "scorePolicy": "方式\t百分比\t說明\n作業\t10%\t運動海報設計：針對課程主題製作成海報，並撰寫心得。\n分組競合\t20%\tTABATA 分組競賽與合作評分\n術科考試\t30%\tHinge mobility；Turkish Get-Up；Balloon blow\n出席、學習態度\t40%\t依學校流程請假，3 次曠課將被學校扣考\n上課注意事項\t\n1.\t上課時，請穿著適合身體活動的服裝及運動鞋 (嚴禁牛仔褲、裙子、拖鞋與高跟鞋)。\n2.\t當日有任何身體不適或健康疾病的問題，請務必告知教師，以便其他課程安排。\n3.\t為了身體健康著想，盡量用完餐再來上課，並自備開水。\n4.\t準時上下課，記得攜帶水及「毛巾」可視個人需要攜帶衣服替換。\n5.\t請盡量不要攜帶貴重物品，以遺失。",
    "materials": "1.\tTeachers' Physical Fitness Guidebook. Author: Jinlong Fang. Ministry of Education, 1997.\n2.\tThe core basic sports that top athletes are secretly practicing. Author:  Dr. Eric Goodman / Peter Park. Publisher: DaShi Culture Publishing House.\n3.\tYOGA ANATOMY. Author: Leslie Kaminoff. Translated by Xie Weiling. Publisher: common master press.",
    "consultation": "If students have any questions about class, please email r72226@gmail.com.*****Class Location: Basement of the third teaching building, Class of Multi-functional Training",
    "remarks": "If students have any questions about class, please email r72226@gmail.com.",
    "foreignLanguageTextbooks": false
  }
]
