[
  {
    "name": "張志揚",
    "email": "chychang@gmail.com",
    "latestUpdate": "2023-05-25 22:04:55",
    "objective": "透過我國金融體系與相關金融證券交易法規之概述，促使學生瞭解銀行法、證券交易法、信託法與信託業法等法規之性質、內容、立法目的及原則，進而培養學生明瞭本國有價證券之發行程序、證券交易市場以及證券交易法之責任規範等立法精神與體制，俾能達到融會貫通的境界並因應未來金融市場之競爭與挑戰。\nThe objectives of this course are trying to explain Taiwan's financial system and Financial and Securities Exchange Act, to help students recognize the Banking Act, the Securities and Exchange Law, Trust Law and Trust Business Law, Financial Institutions Merger Act, the financial supervision unification. In addition, the nature, content, lawmaking objectives and principles of related legislation will be introduced. The goals of this course will further promote students to understand the procedures for issuing securities, the spirit, responsibility and institutional norms of securities market and the Securities Exchange Act, so that to achieve the state of digest, in response to market competition and financial challenges in the future.",
    "schedule": "第 1 週：課程大綱介紹\n第 2 週：銀行法 - 通則、銀行的設立、變更、停業、解散\n第 3 週：銀行法 - 商業銀行、專業銀行、信託投資公司、外國銀行、罰則\n第 4 週：商業會計法 - 總則、會計憑證、會計帳簿、財務報表\n第 5 週：商業會計法 - 會計事務處理程序、認列與衡量、損益計算\n第 6 週：商業會計法 - 決算及審核、罰則、附則；商業會計處理準則\n第 7 週：公司法 - 總則、無限公司\n第 8 週：公司法 - 有限公司、兩合公司\n第 9 週：期中考\n第 10 週：公司法 - 股份有限公司\n第 11 週：公司法 - 關係企業、外國公司、登記、附則\n第 12 週：證券交易法 - 總則、有價證券之募集、發行、私募及買賣\n第 13 週：證券交易法 - 證券商、證券商同業公會、證券交易所\n第 14 週：證券交易法 - 外國公司、仲裁、罰則\n第 15 週：記帳士法\n第 16 週：行政程序法 - 行政處分\n第 17 週：信託法與信託業法\n第 18 週：期末考試",
    "scorePolicy": "平時成績，包括出席情況、課堂互動、習題作業占 30%\n期中考成績，占 30%\n期末考成績，占 40%\n\n在授課過程或課堂討論充分的對話是有效學習的關鍵，主動與建設性的互動是學習者最基本的權利與義務。 考試目的在於測試學習者對個別觀與整體架構的解程，並作為教學溝通效果之依據。考試是測試學習者應該知道的課程內容，只要有積極與課程學習者，無須過憂慮。\n\n上課一定要帶課本，並且專心上課，不要用餐和聊天！",
    "materials": "銀行法、商業會計法、商業會計處理準則、公司法、證券交易法、記帳士法、行政程序法、信託法與信託業法條文彙編。",
    "consultation": "電子郵件信箱：chychang@gmail.com 臉書社團：https://www.facebook.com/groups/247150565408124",
    "remarks": "因應疫情發展，本學期教學及授課方式請依照學校網頁所公布之訊息為準：(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw) 確保全面、公平及高品質教育，提倡終身學習",
    "foreignLanguageTextbooks": false
  }
]
