[
  {
    "name": "劉凱鈞",
    "email": "kaichunliu@ntut.edu.tw",
    "latestUpdate": "2023-08-09 21:36:16",
    "objective": "本課程主要目的為使學生以電子學、訊號處理等相關的知識，應用在生物醫學的臨床領域，包含擷取人體的生理參數或用以治療人類疾病。本課程以模組化的課程設計，系統化地介紹以醫電系統為基礎的醫學量測設備與生醫訊號關聯及應用。介紹主題包含 (1) 生醫感測設備原理和測量理論 (2) 血流與血壓量測原理和與應用 (3) 生理訊號量測與健康照護 (3) 生物聲學量測與應用 (4) 電生理量測設備與量測 (ECG、EMG、EEG) (5) 醫電安全性。\n\nThe main objective of this course is to enable students to apply knowledge in electronics, signal processing, and related fields to the clinical domain of biomedical science. This includes the extraction of physiological parameters from the human body or their application for the treatment of human diseases. The course employs a modular curriculum design and systematically introduces medical measurement devices and the correlation and application of biomedical signals based on biomedical electronic systems. The topics covered include: (1) Principles and measurement theories of biomedical sensing devices, (2) Principles and applications of blood flow and blood pressure measurement, (3) Physiological signal measurement and healthcare, (4) Bio-acoustic measurement and applications, (5) Electrophysiological measurement devices and measurements (ECG, EMG, EEG), and (6) Biomedical electrical safety.",
    "schedule": "1.\t生醫電子儀表與量測之基本概念。介紹醫療量測設備的用途、基本知識以及與一般電子系統的差別。\n2.\t各式感測器介紹與量測基本原理介紹 (I)\n3.\t各式感測器介紹與量測基本原理介紹 (II)\n4.\t生醫放大器與信號處理介紹 (I)\n5.\t生醫放大器與信號處理介紹 (II)\n6.\t探討各式電生理訊號量測的需求和特性 (I)\n7.\t探討各式電生理訊號量測的需求和特性 (II)\n8.\t探討各式電生理訊號量測的需求和特性 (III)\n9.\t期中考\n10.\t心血管循環系統的生理參數量測 (I)\n11.\t心血管循環系統的生理參數量測 (II)\n12.\t生物聲學量測與應用 (I)\n13.\t生物聲學量測與應用 (I)\n14.\t遠距醫療與無所不在的健康照護\n15.\t健康照護產業實務之專題報告 (I)\n16.\t健康照護產業實務之專題報告 (II)\n17.\t醫電安全\n18.\t期末考",
    "scorePolicy": "1.\tMiddle Exam (30%)\n2.\tFinal Exam (30%)\n3.\tProject report (40%)",
    "materials": "Carr, Joseph J., and John Michael Brown. \"Introduction to biomedical equipment technology.\" (4th edition) (2001).",
    "consultation": "綜科館 406-1 室",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
