[
  {
    "name": "程聖倫",
    "email": "scheng@ntut.edu.tw",
    "latestUpdate": "2023-05-30 17:19:48",
    "objective": "This course will focuse on the application of principles of linear modeling in the context of linear regression analysis to exploring questions about mediated (i.e., indirect) and moderated (i.e., interaction) effects. We will spend part of the course talking about partitioning effects into direct and indirect components and how to quantify and test hypotheses about indirect effects, part talking about estimating, testing, and probing interactions in linear models, and part integrating moderation and mediation as “conditional process analysis” by discussing and how to conceptualize and test the contingencies of a mechanism. Computer applications will focus on R using off-the-shelf code and the PROCESS macro available through www.processmacro.org and documented in the text for the course. It is assumed that you have taken a course in multiple regression and have done well or are otherwise comfortable with the principles of multiple regression analysis. No knowledge of matrix algebra is required or assumed.",
    "schedule": "week 1-2: Oview of the course and a gentle introduction to R\n\nweek 3: Overview and review of regression concepts\n\nweek 4-6: Statistical mediation analysis\n\nweek 7-8: Moderation analysis\n\nweek 9: Mid-term\n\nweek 10: Moderation analysis\n\nweek 11-12: Condtional process analysis I\n\nweek 13-14: Statistical mediation and moderation analysis II\n\nweek 15-16: Advanced topics in conditional process analysis\n\nweek 17: That’s a lot to process! Pitfalls of popular path models\n\nweek 18: Final",
    "scorePolicy": "Attendance 20%\nFinal presentation and report 80%",
    "materials": "Course materials will be prepared by the instructor.\n\nOptional:\n\nHayes, A. F. (2022). Introduction to mediation, moderation, and conditional process analysis: A regression-based approach (3rd ed.). The Guilford Press.",
    "consultation": "The best way to reach out to me is through my email: scheng@ntut.edu.tw. I am happy to speak with you during my office hours (10AM-noon on Mon/Thu)",
    "remarks": "Google Meet will be used in case in-person classes are suspended due to the pandemic. The instructor will send an invitation link to the whole class in advance.",
    "foreignLanguageTextbooks": true
  }
]
