[
  {
    "name": "李昭輝",
    "email": "leetzau@gmail.com",
    "latestUpdate": "2023-09-09 15:38:54",
    "objective": "通過 “職場英文溝通” 這門課，化英文單字能力，熟記字彙片語。除了拼寫及發音外，協助學生用單字片語造句。熟悉會話容後，學生做角色扮演活動或課堂討論，增加師生互動機會。教師在課堂上指導學生分組搜集傳統產業現況，將實際職場情況融入于課堂學習。\n\n嘗試從商業溝通角度，探討個人如何從溝通角度建造職場人完整的競爭籌碼，以溝通力創造個人職場價值與優勢，協助個人在職場不同色扮演中，培養受人信任，溝通無礙的職場性格，建立屬於自己的職場口碑與競爭力。溝通是所有人與人之間互動與建立關係的基礎。商業溝通是職場成功的黃金武器；優質的溝通能力是職場人邁向成功舞臺的關鍵能力。\n\nThrough the course of \"Communication in English in the Workplace\", strengthen the ability of English words and memorize vocabulary and phrases. In addition to spelling and pronunciation, help students make sentences with single-word phrases. After being familiar with the content of the conversation, students can do role-playing activities or classroom discussions to increase opportunities for teacher-student interaction. Teachers guide students in groups to collect the current situation of traditional industries and integrate actual workplace situations into classroom learning.\n\nFrom the perspective of business communication, try to explore how individuals can build a complete competitive bargaining chip in the workplace from the perspective of communication, create personal value and advantages in the workplace with communication skills, and assist individuals in different role-playing in the workplace to develop a workplace character that is trustworthy and has no barriers to communication. Establish your own workplace reputation and competitiveness. Communication is the foundation of all human interactions and relationships. Business communication is the golden weapon for success in the workplace; high-quality communication skills are the key to success in the workplace.",
    "schedule": "Week /Date/ Topic\n1.  09/15 Introduction 課程介紹\n2.  09/22 職場英文 (1) Part 1 英文熱身操\n3.  09/29 中秋節（停課一次）\n4.  10/6  職場英文 (2) Part 2 Unit 1\n5.  10/13  職場英文 (3) \n6.  10/20  職場英文 (4) \n7.  10/27  職場英文 (5) \n8.  11/03  職場英文 (6) \n9.  11/07 週二統一會考，校方統一命題。11/7 週二請到校考試。\n     11/10 期中考 / 報告\n10.  11/17 職場英文 (7) \n11. 11/24 商業溝通 (1) Part 1 Chapter 1-4\n12. 12/01 商業溝通 (2) Part 2 Chapter 5  \n13. 12/08 商業溝通 (3) Part 2 Chapter 6\n14. 12/15 商業溝通 (4) Part 2 Chapter 7  \n15. 12/22 商業溝通 (5) Part 2 Chapter 8  \n16. 12/29 商業溝通 (6) Part 3 Chapter 9  \n17. 01/05 總復習\n18. 01/12 期末考 / 報告",
    "scorePolicy": "成績計算:\n\nCampus-wide English Proficiency Test     全校英文會考: 20%\nMidterm Exam                                     期中考：20%\nFinal Exam                                   期末考: 30 %\nHomework                                    作業報告: 10%\nAttendance/Participation              出勤與上課參與: 20 %\n\nFIVE absences or THREE unexcused absences will yield a failing grade.                                                                                  同學三次無正當理由缺課，或缺課連同請假共計五次以上，將導致學期成績不及格。\n\nThere will be neither make-up quiz nor make-up final exam. 平日 Easy Test 小考及期末考試，無法補考。\n\nCellular phone should be turned off during the two-hour class period. 上課不得使用手機。\n\nSleeping through the class will be considered absent. 睡覺等同曠課。",
    "materials": "1）職場英文溝通（第二版）English for Specific Workplace \n      陳愛華 編著 新文京出版社\n2）商業溝通 -- 正向溝通職能 UP！（第二版）周春芳 著 華泰文化出版\n\n輔助教材：1）用 IG 思維做自己的學涯設計師（親子天下出版社）\n                  2）一本書讀懂性格（菁品文化出版社）\n                  3）和主管相處的技術\n                  4）為什我很努力，卻沒有被看見？",
    "consultation": "leetzau@gmail.com  Contact me via email or line 請以電子信箱或 line（上課掃描） 和我聯繫。",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
