[
  {
    "name": "葉英斌",
    "email": "Kent88@msl.url.com.tw",
    "latestUpdate": "2023-09-04 17:15:13",
    "objective": "電商企業競爭議題一直是管理學界及實務界探討課題，如何進行最佳經營規劃及透過多媒體溝通受到高度注目，多媒體溝通課題包括以使用者需求為目標進行規劃、以使用者經驗設計、分析最佳組合的多媒體應用、讓使用者得到最佳體驗進而擁護企業。本課程強調理論與實務的結合、進行個案分析及討論，以全球觀點探討國際電商企業，在地思考本土電商企業運用多媒體之發展，進而獲取持續競爭優勢。本課程設計乃針對多媒體於電商企業最佳規劃，探討使用者經驗過程，以使用者需求為目標而進行的設計，以實際案例協助同學們深入了解多媒體工具運用於電商企業，以提升同學們學習意願且具有優質的多媒體規劃及設計能力。\n    The issue of competition among e-commerce companies has always been a topic of discussion in the management academic and practical field. How to conduct the best business planning and communicate through multimedia has attracted great attention. Multimedia communication topics include planning based on user needs, user experience design, and analysis the best combination of multimedia applications, so that users can get the best experience and support the enterprise. This course emphasizes the combination of theory and practice, case study and discussion, discusses international e-commerce companies from a global perspective, and locally thinks about the development of local e-commerce companies using multimedia to obtain sustainable competitive advantages. This course design is aimed at the best planning of multimedia in e-commerce companies, discusses the user experience process, and designs with user needs as the goal. It uses practical cases to help students understand the application of multimedia tools in e-commerce companies to improve students They are willing to learn and have high-quality multimedia planning and design skills.",
    "schedule": "1. 電商多媒體設計導論\n2. 電商使用者需求目標\n3. 電商使用者經驗設計\n4. 多媒體設計體驗概念\n5. 多媒體 (UI/UX) 設計師的設計流程與工作內容\n6. 文字媒體：數位資料的處理方式、跨平台電子格式文件、電子書製作\n7. 影像媒體：數位影像的類型、色彩模式、影像檔案格式和壓縮方式\n8. 音訊媒體：認識語音數位化、數位音訊的錄製、GoldWave 音訊的編輯技巧\n9. 期中報告\n10. 視訊媒體：視訊原理、視訊型態、視訊壓縮、視訊檔案格式、串流媒體知識\n11. 動畫媒體：動畫原理、頁框率 FPS、動畫種類、動畫製作等觀念\n12.Openshot 視訊剪輯：輕鬆編輯家庭影片，從操作環境至影片匯出完整介紹\n13.Web3.0 技術新媒體：社群網路、網路電視、行動裝置、IG、臉書、YouTube\n14.Google Sites 架站術：從登入、編輯網站架構、預覽與發佈\n15.Figma 核心操作基礎及進階技巧\n16.Figma Auto Layout\n17. 期末報告\n18. 電商多媒體設計個案研討",
    "scorePolicy": "1. 出席                     10%\n2. 作業及課堂討論   20%\n3. 期中報告              30%\n4. 期末報告              40%",
    "materials": "1. 使用教材\n(1) 鄭苑鳳 著，學會多媒體設計的 12 堂黃金入門課 (第二版)：費共享軟體 × 影像  處理設計 × 視訊剪輯製作 ×3D 動畫實務，博碩文化公司出版，2021.12.21\n(2) 吳嘉芳 譯，UX Design 初學者學習手冊 (玉飼真一、村上龍介、佐藤哲、太田文明、常盤晉作、IMJ Corporation 著)， 旗標文化公司出版，2018.05\n(3) 彭其捷 曹伊裴 著，Figma UI/UX 設計技巧實戰：打造擬真介面原型，博碩文化公司出版，2022.07.14",
    "consultation": "1.LINE 課程群組「11201 電商多媒體設計實務群組 https://line.me/ti/g/1rgfb1NSaG」2. MS Teams",
    "remarks": "SDG12｜負責任的消費與生產 (Responsible Consumption and Production) SDG17｜夥伴關係 (Partnerships for the Goals)",
    "foreignLanguageTextbooks": false
  }
]
