[
  {
    "name": "黃晉岳",
    "email": "jimhuang0902@gmail.com",
    "latestUpdate": "2023-06-02 13:32:11",
    "objective": "經濟學重視邏輯與嚴謹推理的理性特質是其主要特色，此亦為理工科系人之專長優勢，然而僅偏重左腦訓練的人才往往讓人覺得生冷機械，對事物看法也常過於直接而缺乏人情，若能在不失理性效率之下，兼顧以人為本之社會人文感性關懷，則經濟學自無愧為社會科學之母，其訓練目標亦與通識教育的人格均衡發展目的一致！\n為避陷入一般經濟教學因理論工具比重過高而失焦，導致學生學習興趣驟減以致成效不彰，本課程重點在於先讓學生擁有強烈之學習動機，接著認知到 \"確立學習目的\" 的重要性，藉由生活實例直接帶領學生面對並感受問題，從而引導出經濟學切入問題的思維方式，並傳授其正確可行的學習態度與方法，同時提醒學生維持對專業知識批判的精神，在嚴謹訓練架構下督促其尋求感性的意涵，因而不致陷入經濟工具與名詞的浩瀚泥沼中，從而漸進體會出經濟學之精髓。\nThe science of economics is characterized by logics and cautious reasoning-at which most of the students of natural science and technology are good at. It is also a fact that those who take better advantage of the right brain are very likely to be straightforward and thus seemingly more mechanical and unsympathetic. Economics can be seen as the mother of science under the condition that rational efficiency-as well as the socially humanity--are kept at the same time. As a matter of act, the economic trainings share the same goal as what is required by the General Education courses.\nThe first priority of the course is to highly motivate the students in the economic issues. We do our best to avoid too much weight generally put into teaching economics, leading to poor learning and teaching experience. Cases are studied in such a way that students will recognize the \"real purpose of studying.\"  Real cases and examples are brought into discussion. We guide the students to\"feel\"the problems.",
    "schedule": "週次\t      日期\t        單元主題\n第 1 週\t\t\t09/11\t\t為什麼要唸經濟學\n第 2 週\t\t\t09/18\t\t需求、供給與均衡\n第 3 週\t\t\t09/25 \t\t供需彈性與均衡分析 / 1 組\t\n第 4 週\t\t\t10/02\t\t消費者選擇與需求曲線的導出 /2 組\n第 5 週\t\t\t10/09\t\t* 國慶日調整放假\t\t\n第 6 週\t\t\t10/16 \t\t生產理論與成本分析 /3 組\n第 7 週\t\t\t10/23\t\t完全競爭市場 / 4 組\n第 8 週\t\t\t10/30\t\t不完全競爭市場 / 5 組\t\n第 9 週\t\t\t11/06 \t\t【期中考】\n第 10 週\t\t\t11/13 \t\t生產要素的供需 / 6 組\n第 11 週\t\t\t11/20 \t\t總體經濟與總體指標 / 7 組\n第 12 週\t\t\t11/27\t\t失業與物價膨脹 / 8 組\n第 13 週\t\t\t12/04\t\t簡單凱因斯模型 /9 組\n第 14 週\t\t\t12/11 \t\t貨幣的供給與需求 /10 組\n第 15 週\t\t\t12/18 \t\t總合供需與政府政策 /11 組\n第 16 週\t\t\t12/25\t\t國際貿易 /12 組\n第 17 週\t\t\t01/01 \t\t* 開國紀念日放假\n第 18 週\t\t\t01/08 \t\t【期末考】\n\n\n\n■    課程進行方式：\n1)\t互動交流\n2)\t分組報告\n每週相關經濟新聞時事或指定主題報告\n第 4 週（10/02）起每週就相關經濟之新聞時事或老師指定主題作整理，每週 1 組輪流上台報告 (須準備 PPT)，共分 12 組，每組學生人數比例分配。\n相關經濟新聞時事或指定主題報告時間約 15 至 20 分鐘，如為新聞，內容請盡量以最新時事為佳。原則上不超過三則，其中以一則為主要報告時事，其他為補充時事，並為主要時事設計三個問題提供報告完後課堂中討論。\n請大家把時事報告內容和同學分工表等訊息放在同一個 PPT 檔內，並於報告完後三天內 Line 檔案給老師。檔名: 324596 經濟學時事報告第 X 組（報告題目）。",
    "scorePolicy": "平時成績\t        40%\t含課堂互動表現、分組報告和出席率\n期中考\t        30%\t題型包括選擇題、問答和計算題\n期末考\t        30%\t題型包括選擇題、問答和計算題",
    "materials": "經濟學概要，七版，朱敬一，毛慶生，林全，許松根，陳添枝，陳思寬，黃朝熙合著，華泰文化",
    "consultation": "★學生加退選簽核問題及諮詢課程問題管道：1. 教師 Email: jimhuang0902@gmail.com2. 平時課程相關之事項則以互相建立之 Line 群組聯絡 `Jim Huang 邀請您加入台北科大黃晉岳老師經濟學 324596 群組。https://line.me/ti/g/AQiHwthFGT",
    "remarks": "本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：※採遠距上課時：★課程訊息公告：1. 如採遠距教學，上課、同學分組報告、期中考及期末考均一律在學校建好之 Microsoft Teams 上課、報告、出題及提交考卷。本課程對應 SDGs 指標：1、8、12★課程對應指標：指標 1「消除貧窮」指標對應授課內容：第 1 週授課主題「Ch.1 為甚麼要唸經濟學」，對應指標 1「消除貧窮」。★課程對應指標：指標 8「就業與經濟成長」指標對應授課內容：第 11 週授課主題「Ch.9 總體經濟與總體指標」、第 12 週授課主題「Ch.10 失業與物價膨脹」，對應指標 8「就業與經濟成長」。★課程對應指標：指標 12「責任消費與生產」指標對應授課內容：第 4 週授課主題「Ch.4 消費者選擇與需求曲線的導出」、第 6 週授課主題「Ch.5 生產理論與成本分析」、第 10 週授課主題「Ch.8 生產要素的供需」，對應指標 12「責任消費與生產」。",
    "foreignLanguageTextbooks": false
  }
]
