[
  {
    "name": "林家弘",
    "email": "jhlin@ntut.edu.tw",
    "latestUpdate": "2023-05-31 23:33:02",
    "objective": "超快雷射由於其獨特的特性，包括超短的脈衝寬度 (寬度小於皮秒)、寬的頻寬與超高的強度，因此它在軍事科技、工業應用、生醫檢測與學術研究所扮演的角色日益重要，本課程除了介紹雷射產生的原理和各種超短脈衝雷射與其短脈衝產生的原理、脈衝壓縮與超快量測的技術，此外也將介紹超快雷射的應用包括生醫檢測、微加工、泵 - 探量測與非線性光學量測等技術。\n\nUltrafast lasers, known for their unique properties such as ultra-short pulse duration (narrower than a picosecond), broad bandwidth, and relatively high intensity, have found extensive applications in military, industrial, biological diagnosis, and scientific research. This course aims to provide an introduction to the principles of lasers, types of ultrafast lasers, mechanisms of mode-locked pulse generation, pulse compression techniques, and ultrafast measurement techniques. Moreover, it will explore the applications of ultrafast lasers in areas such as biological diagnosis, micro-machining, pump-probe measurements, and nonlinear optical measurements.",
    "schedule": "第一週 簡介  (Introduction)\n第二週 超快雷射之特性與應用 I (Property and application of ultrafast laser I) \n第三週 超快雷射之特性與應用 II (Property and application of ultrafast laser II)\n第四週 Z 掃描量測技術與原理 (Z scan measurement technique and principle)\n第五週 超連續光譜產生原理與應用 (Supercontinuum generation and )\n第六週 超短脈衝的量測 I - 自相關 (I) (Pulsewidth measurement I-Autocorrelator)\n第七週 超短脈衝的量測 II - 頻率解析光閘 (Pulsewidth measurement FROG)\n第八週 雷射簡介 (Introduction of laser)\n第九週  期中報告 (Midterm examination)\n第十週  第八週 雷射放大器與共振 I (Laser amplifier and Oscillation I)\n第十一週 雷射放大器與共振 II (Laser amplifier and Oscillation II)\n第十二週 Q 開關與鎖模簡介 (Introduction of Q-switching and mode-locking)\n第十三週 鎖模原理 (Principle of mode-locking)\n第十四週 人造飽和吸收體 (Artificial Saturable absorber)\n第十五週 材料飽和吸收體 (Material based Saturable absorber)\n第十六週 超快光學原理 I (Principle of Ultrafast Optics I)\n第十七週 超快光學原理 II (Principle of Ultrafast Optics II)\n第十八週 期末考 (Final examination)",
    "scorePolicy": "期中考 (Midterm examination) 40%    \n期末考 (Final examination)  60%",
    "materials": "教科書: \n書名: Ultrashort Laser Pulse Phenomena, (Fundamentals, Technique, and Application on a Femtosecond Time Scale) Second Edition \n作者: JEAN-CLAUDE DIELS and WOLFGANG RUDOLPH",
    "consultation": "同學可以透過 office hour 的時間與授課老師討論超快光學相關議題，或是透過 line 和 email 進行詢問",
    "remarks": "無",
    "foreignLanguageTextbooks": true
  }
]
