[
  {
    "name": "黃正民",
    "email": "jenmin@sunnytec.com",
    "latestUpdate": "2023-07-12 11:13:25",
    "objective": "新創事業面臨許多的挑戰，包括：避與大企業競爭，找到存活的依據、從無到創立強勢品牌、創立或擴張自有市場 / 消費者據點等。本課程旨在啟發修課同學創業的興趣並協助修課同學思考新創事業如何平衡有限資源以迎向挑戰。\n新創企業已發展成熟的企業是不一樣，主要是因為新創事業的資源有限，創業家必須同時兼顧許多面向並回應顧客所需。本課程旨在協助修課同學思考創建企業應注意的各種面向評估自己的創能力。\n課程包含了三大部份，第一部份為創新與創業概念啟發；第二部份在辨別市場機會與發展市場；最後第三部份為新創事業行銷管理。行銷活動能夠將企業的產品及服務傳遞給顧客；並將產品、服務及企業本身的資訊帶到市場上；將顧客資訊回饋給企業。創業行銷管理能夠幫助創業者向潛在投資者及企業夥伴銷售創意以獲得資源，也讓創業家透過創新的商業手法來充分利用稀少的資源。\nManagers must have excellent leadership skills in order to A start-up company has lots of challenges, such as: niche market located and brand diffusion. The course intends to encourage the participant to become an entrepreneur and handle with these challenges. A start-up company is different from well-developed one due to limited resources. Usually, to response customer’s requirement, the entrepreneur must take multiple criteria into consideration simultaneously.\n    The course includes three parts. Part I build students’ concept about innovation and entrepreneurship. Part II is about market identification. Part III is about marketing management of a start-up company. The efficient marketing activities enable business to approach customer’s requirement, to bring their customer product (or services) and get customer’s feedback. Also, the marketing management helps entrepreneur to reach their potential investor to obtain more resources.",
    "schedule": "本課程著重於使學員們提早認識產業界所需的專業與才能，以利於畢業後能夠和社會的無縫接軌. \n\n   首先是分析大學畢業後馬上面臨的 創業，就業或升學 的困難抉擇，這三項難題普遍會是學員們目前心中的困惑。其次是分享教師個人的創業經歷及經營理念，以及企業面臨經營瓶頸所做出的創新改革 (公司制度) , 並且列舉數項接受客戶委託的創新產品研發，設計及生產製造過程\n\n   在這學期中將安排數位畢業於本校的學長姐們回來演講，就他們的創業，就業，智慧財產權，及其專業領域的心得分享，這項安排將會使學員們隨時掌握目前產業界的脈動，此外課程的安排上有幾堂是偏重於 創新的方法與實踐，各種營利模式的介紹，人際關係互動，… 等彌補專業領域教育的不足. \n\n   另外也將實際的以分組方式 (不同科系編排在一組) 建立團隊合作的經驗與實踐，加強為將來步入社會所需的基本認知\n週\t月\t日\t課      程\t備    註\n01\tSep\t14\t課程介紹，上課規則\t                                   繳交自傳\n02\t\t21\t就業，創業 or 升學？\t\n03\t\t28\t政府如何協助創業\t                                   編排分組\n04\tOct\t05\t我的經營理念分享\t\n05\t\t12\t國際貿易簡介 – 門檻最低的創業\t\n06\t\t19\t從事公職，中途創業甘苦談？\t                   學姊分享\n07\t\t26\t國際貿易簡介\t\n08\tNov\t02\t談判技巧 & 回話藝術\t\n09\t\t09\t上台的技術 & 智慧財產權簡介\t\n10\t\t16\t認識金融領域與財務控管\t                   銀行理專\n11\t\t23\t關於創新的一些方法\t\n12\t\t30\t企業創新的分享\t                                   學長分享\n13\tDec\t07\t關於企業創新的 10 個基本模式\t\n14\t\t14\t我的創業心路歷程\t                                   學長姐分享\n15\t\t21\t付諸行動\t\n16\t\t28\t分組研究心得報告 1 ～ 5 組\t\n17\tJan\t04\t分組研究心得報告 6 ～ 10 組\t\n18\t\t11\t給學弟妹們的一些建議",
    "scorePolicy": "分數的高低完全取決於自己的學習態度.\n\n學期成績計算方式 :\n\n1. 每次上完專題演講課要繳交上課心得報告 (這學期會有 7 篇), 每週簽到出席都會累 \t積學期成績  --- 40%\n2. 參觀國際性專業展覽 (以南港展覽館，台北世貿 展出的檔期為標竿) --- 15%\n3. 分組團隊研究作業. --- 40%\n4. 學習態度與互動關係. --- 15%\n\n每次上課後，在下次上課的下課以前，交上週的學習心得報告 (Word 格式), 原則上內容應符合整頁 的 80% 以上，大約是 450 ~ 600 個字為佳。盡可能在當週的下個週日完成作業\n\n教師自製教材，每次上課前會存放在本校網路 i 學園，每次上課也會開啟學校提供的 “ 教學全都錄 “\n\n沒有考試，但要繳交上課心得報告，至少 5 篇以上，每篇大約 400 ~ 500 個字．學期總成績的分數高低完全取決於自己的學習態度.\n\n課綱內容是基於本學期為正常的實體教室上課，上課內容會有一些彈性修改，會適度地邀請幾位本校 EMBA 畢業的學長姐回來演講分享他們的社會經驗與心得",
    "materials": "1.\t如果遇到不可抗拒的情況而導致學校要求必須採用 ' 遠距離教學 '  時，我們將使用 Microsoft Teams 這個軟體平台，於同一個時段同步教學\n2.\t若採用同步教學，則該堂課要繳交當日的 ‘ 上課心得報告 ‘ \n3.\t若疫情，天災，… 不得不採用遠距同步教學時，教學內容將會適度地修改",
    "consultation": "jenmin@sunnytec.com",
    "remarks": "SDGs 永續發展目標 #3 良好健康與福祉 SDGs 永續發展目標 #4 優質教育 SDGs 永續發展目標 #5 性別平等 SDGs 永續發展目標 #7 可負擔的潔淨能源 SDGs 永續發展目標 #8 尊嚴就業與經濟成長 SDGs 永續發展目標 #9 產業創新與基礎建設 SDGs 永續發展目標 #10 減少不平等 SDGs 永續發展目標 #12 負責任的消費與生產 SDGs 永續發展目標 #16 和平正義與有力的制度 SDGs 永續發展目標 #17 夥伴關係",
    "foreignLanguageTextbooks": false
  }
]
