[
  {
    "name": "楊梵妤",
    "email": "fanyu@ntut.edu.tw",
    "latestUpdate": "2023-06-01 23:49:51",
    "objective": "人際關係是探討對自我的了解及對人的認知，包括性格、態度、魅力、溝通、壓力、挫折和情緒等重要課題的處理；幫助同學學習與各種不同品味、信念、立場與生活方式的人作有效率的溝通，開放的表達出自己的感覺與想法，以建立良好的合作關係，從而開發潛能、爭取更好的發展機會。\nInterpersonal Relationship is to discuss about self-understanding and perception of other people, including how to handle key issues related to character, attitude, attractiveness, communication, pressure, frustration and emotion.  It helps students to learn effective communication, open their minds to express personal feeling and thought, and try to communicate with other people having different tastes, convictions, standpoints and ways of living so as to establish a harmonic and cooperative relationship and furtherly to develop personal potential and strive for better opportunity of development.",
    "schedule": "Week   \tTopics\n1\tIntroduction   \n2\tSelf and Self-Esteem\n3\tSelf-Presentation\n4\tMovie Discussion\n5\tSocial Perception\n6\tMovie Discussion\n7\tSymbolic Communication and Language\n8\tMovie Discussion\n9\tMidterm Exam    \n10\tRelationships in the family\n11\tRomantic relationships\n12\tRomantic relationships\n13\tAggression\n14\tAggression\n15\tPersuasion\n16\tEmotion\n17\tMovie Discussion\n18\tFinal Exam",
    "scorePolicy": "Attendance & Participation  50% ( 3 points for full attendance，\nthose who are late, leave early, and absent from class will not be awarded points. Bonus points for those who actively participate in course activities)\nMidterm exam 15%\nGroup Report and presentation 35%",
    "materials": "Social Psychology By John D. DeLamater, Daniel J. Myers, Jessica L. Collett",
    "consultation": "fanyu@ntut.edu.twThe latest news will be posted on Taipei Tec i-school Plus",
    "remarks": "SDGs: 10 Reduced Inequalities Target10.2: By 2030, empower and promote the social, economic and political inclusion of all, irrespective of age, sex, disability, race, ethnicity, origin, religion or economic or other statusIn response to COVID-19 pandemic, the ways in which teachers and students engage in their classes for this semester are based upon the updates on our school's website :(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)Google Meet",
    "foreignLanguageTextbooks": true
  }
]
