[
  {
    "name": "莊喬汝",
    "email": "cj@themislaw.com.tw",
    "latestUpdate": "2023-07-12 10:29:33",
    "objective": "性、性別是人類與生俱來的課題，其與各時代之政治體系、法律規範及社會變遷有密不可分的關係法律中的性別議題，既是法律問題也是社會問題，需要結合法律領域與社會領域的知識，作跨領域教學與學習。\n本課程配合性別平等教育政策趨勢，分就不同面向的法律規範中的相關性別議題，來讓學生了解近年來性別平等之相關法律意涵希望能在認知、情意、行動等層面，讓學生習得正確的性別權利意識，進而在國家公私領域中運用相關知識落實性別平等，以促進多元文化之下兩性平權發展。\nSex and gender are inherent issues of human beings, and they are inseparable from the political system, legal norms and social changes of all ages. Gender issues in the law are both legal and social issues and need to be combined with the legal field and society Domain knowledge for cross-domain teaching and learning.\nThis course is in line with the gender equality education policy trend, and divides the relevant gender issues in different aspects of legal norms to let students understand the relevant legal implications of gender equality in recent years. Hopefully, students can learn from the levels of cognition, affection, and action. Correct awareness of gender rights, and then apply relevant knowledge to implement gender equality in the public and private sectors of the country, so as to promote the development of gender equality under multiculturalism.",
    "schedule": "第一週（112/9/14）認識性別、何謂性別意識\n第二週（112/9/21）認識性騷擾 (一)\n第三週（112/9/28）與現代婦女基金會合作授課：關係界線桌遊 (桌遊需 6 人一組，最佳約 5 組，此桌遊需進行 60~90 分鐘，議題討論權力與關係界限的關聯，以進行暴力預防宣導。)\n第四週（112/10/05）認識性騷擾 (二)\n第五週（112/10/12）性騷擾三法\n第六週（112/10/19）性騷擾申訴流程\n第七週（112/10/26）將邀請實務律師講授：性暴力有關犯罪（一）：刑事部份、跟騷法\n第八週（112/11/02）與現代婦女基金會合作授課：性暴力及完美空難桌遊 (桌遊需 4 人一組，最佳 4~8 組，此桌遊需進行 90 分鐘，議題關於探討性暴力，唯若人數懸殊，即較難安排此桌遊。※若桌遊較難安排可改成性騷三法加跟騷案例分享)\n第九週 （112/11/09）期中考\n第十週（112/11/16）與現代婦女基金會合作授課：法院參訪及服務介紹 (至台北新店法院家暴服務處進行參訪簡介，但若法院場地無開放，則改為到班授課)\n第十一週（112/11/23）將邀請實務律師講授：性暴力有關犯罪（一）：民事部份\n第十二週（112/11/30）與台灣伴侶權益推動聯盟合作授課：認識多元性別\n第十三週（112/12/07）與台灣伴侶權益推動聯盟合作授課：同性婚姻合法化之推動歷程及現狀\n第十四週（112/12/14）談就業歧視\n第十五週（112/12/21）性別時事討論\n第十六週（112/12/28）性別時事分組討論報告（一）\n第十七週（113/01/04）性別時事分組討論報告（二）\n第十八週（113/1/11）期末考試",
    "scorePolicy": "筆試（期中考、期末考）各 25％\n分組討論、心得 500 字繳交 25％\n平常分數（包括出席到課、參與討論）25％",
    "materials": "使用講師自編 PPT",
    "consultation": "Email:cj@themislaw.com.tw",
    "remarks": "課程指標：5 性別平等 10 減少不平等",
    "foreignLanguageTextbooks": false
  }
]
