[
  {
    "name": "陳建文",
    "email": "a868@ntut.edu.tw",
    "latestUpdate": "2023-07-13 10:16:22",
    "objective": "本課程搭配傳統布袋戲文創產業的問題素材安排創新思考系列學習單元。藉由探索傳統布袋戲如何進行文化創新與商業創新來學習創新思考",
    "schedule": "週別\t課程主題\t  \n第 1 週      課程說明？分組\n第 2 週      小組合動及小組識別標誌設計\n第 3 週\t布袋戲歷史 - 以霹靂為主軸的探討\t\n第 4 週\t霹靂布袋戲的品牌行銷與創新思考 (一)\t\n第 5 週 \t霹靂布袋戲的品牌行銷與創新思考 (二)\t\n第 6 週\t霹靂布袋戲的人物發想與創意設計\t\n第 7 週\t偶頭設計概念解說與實作賞析\t\n第 8 週\t造型設計概念解說與實作賞析\t\n第 9 週\t企劃實作與劇情大綱的創作\t\n第 10 週\t企劃實作與劇情大綱的創作\t\n第 11 週\t期中成果發表 (人物設計、發想方向、劇情走向、品牌結合等報告)       \n第 12 週\t偶戲配音與創意行銷\t\n第 13 週\t操偶教學 (一)+ 角色口白教學\t\n第 14 週\t操偶教學 (二)+ 角色口白教學\t\n第 15 週\t影視短片實作 - 後製概論 + 實景拍攝 (一)\t\n第 16 週\t影視短片實作 - 後製概論 + 學生拍攝作品解說及分析 (二)\t\n第 17 週\t分組討論\t\n第 18 週\t成果發表會",
    "scorePolicy": "期中與期末發表  (50%)\n指定作業 (30%)\n平常上課表現 (20%)",
    "materials": "參考書籍\n本課程檢索全國博碩士論文網站所有公開之布袋戲論文檔案於課程教學過程中供參考同學參考\n\n<參考書籍>\n本課程檢索全國博碩士論文網站所有公開之布袋戲論文檔案於課程教學過程中供同學參考。\n童美英，臺灣布袋戲的發展與創新，玄奘大學中國語文學系碩士論文，2014 年 6 月。 \n李杰晉，以大數據探究金光布袋戲的產業與競爭分析 ，玄奘大學資訊管理學系碩士論文， 2017 年 7 月。\n董資柳，臺灣意象布袋戲偶創新整體造型趨勢之探討，東方設計大學時尚美妝設計系碩士班碩士論文，2018 年 12 月。 \n劉燕怡，台灣霹靂布袋戲和中日合作的東離劍遊紀布袋戲之魅力差異探討，國立高雄第一科技大學機械與自動化工程系 工業設計碩士班碩士論文，2017 年 7 月。\n郭建甫，臺灣北部傳統布袋戲頭戴軟巾之研究，中國科技大學視覺傳達設計系研究所碩士學位論文，2018 年 3 月。\n王淑惠，台灣布袋戲女性人物造型之比較研究─以傳統布袋戲與霹靂布袋戲之旦角為例，東方技術學院文化創意設計研究所，2010 年。\n章丁尹，霹靂布袋戲之精神？文化與美學研究，中興大學台灣文學與跨國文化研究所碩士學位論文，2014 年 7 月。\n何偉民，傳統藝術跨界思辨：解讀霹靂布袋戲之文化經濟，靜宜大學大眾傳播學系碩士學位論文，2015 年 9 月。\n王一同，文化創意產業感性行銷之研究 - 以霹靂布袋戲為例，亞洲大學創意商品設計學系碩士學位論文，2015 年 7 月。\n蘆翰莛，假面與鏡子：黃立綱金光布袋戲角色研究，中興大學中國文學系碩士學位論文，2019 年 1 月。\n王瀚強，獲取順從策略在霹靂布袋戲當中的運用－以霹靂布袋戲中的霹靂俠影之轟定干戈為例，世新大學口語傳播學系碩士論文，2015 年 4 月。\n林宜樺，理解布袋戲中的文化差異：以 < 東離劍遊紀 > 中的日本觀眾接收分析為例，政治大學國際傳播英語碩士學位學程碩士論文，2018 年 6 月。\n蘇星瑜，臺灣布袋戲的音樂設計：以雲林縣廖文和布袋戲團為中心之探討，臺中教育大學音樂學系碩士班音樂學組碩士論文，2017 年 5 月。\n白佳加，臺灣電視布袋戲動態影像合成之探討，虎尾科技大學多媒體設計系數位內容創意產業碩士班碩士論文，2017 年 6 月。",
    "consultation": "課程諮詢管道：共同科館 5 樓 506 研究室 分機：3026",
    "remarks": "SDGs 對應指標：SDG 4 優質教育.SDG 9 工業化、創新及基礎建設實際實施依學校網頁訊息為準：遇防疫遠距教學則改為期中報告與期末報告評量。全校遠距教學：1. 採用 GOOGLE MEET 線上教學 2. 課程 LINE 群組課程訊息溝通管道：(1) 創新思考課程討論區：創新思考課程 討論區 | Facebookhttps://www.facebook.com/groups/958497924266086 (2) 創新思考課程 LINE 群組 (QR 碼提供於上述課程臉書社團)",
    "foreignLanguageTextbooks": false
  }
]
