[
  {
    "name": "楊梵妤",
    "email": "fanyu@ntut.edu.tw",
    "latestUpdate": "2023-09-11 00:37:47",
    "objective": "每個人都不想孤獨地活著，學習建立親密關係是幸福的來源。\n本課程透過講解、討論、體驗、分享，幫助學生認識自己，發揮最大潛能，懂得溝通連結，能處理情緒與壓力，尊重個別差異與性別平等，從而尋覓最對的人。\n在親密關係中鼓勵彼此做最真最喜歡的自己，也樂於分工合作，建立最美好的家庭，進而活出有意義有價值的人生。\n本課程是真正的成年禮，從自我到互依，是成長與成熟的必修課。\nNobody wants to live a lonely life. Having an intimate relationship is a source of happiness.\nIn this course, students will be given a skill set for understanding themselves, exploring their potential and managing emotional stress. They will also learn to communicate and connect with others through personal sharing, group discussions and in-class exercises. Issues like individual difference and gender equality will be emphasized, since respecting each other is the base for any good relationship, not to mention finding the right partner.\nIt is only when both partners are true to themselves and like the way they are in the relationship will they be willing to share the hard and fun work of building a family and living a meaningful life together.\nOne can see this course as a rite of passage into adulthood.  It is a prerequisite for growing mature, from being self-centered to being able to rely on one another.",
    "schedule": "因應學校二教整修工程施作，本 (112-1) 學期於第二教學大樓教室授課之課程，將配合施工期程實施遠距教學至 9 月 28 日。112/9/11-9/28 皆改用 Google Meet 或 Teams 遠距教學，上課當日請務必查閱本課程「北科 i 學園」-「學習互動區 -- 課程公告」裡的上課網址進入教室。\n第一週    你了解自己嗎？\n第二週    你了解別人嗎？\n第三週    影片欣賞與課堂問題討論\n第四週    什麼是愛？談談依附關係的影響\n第五週    影片欣賞與課堂問題討論\n第六週    為什麼你被他 / 她吸引了？\n第七週    影片欣賞與課堂問題討論\n第八週    如何讓他 / 她注意到你？如何和他 / 她建立關係？\n第九週    期中考\n第十週    經營一段美好的關係\n第十一週  好好的分手\n第十二週  好好的分手\n第十三週  有效的溝通\n第十四週  有效的溝通\n第十五週  親密的陷阱\n第十六週  從不良的親密關係中發現\n第十七週  影片欣賞與課堂問題討論\n第十八週  期末考週\n教學內容會依照學生學習情況調整。",
    "scorePolicy": "1. 出缺席：15% (*** 第一週上課未能到課也未請假或來信說明原因者，請勿修習本課程)\n2. 課堂參與：35% (課堂表現、上課積極參與討論與發表、參與課堂活動、完成指定作業、參與研究等)\n3. 期中考：15%\n4. 期末小組企劃報告與展演：35%",
    "materials": "埃里希．佛洛姆 (2021) 愛的藝術。 梁永安譯。\n馬克．伯格，葛蘭特．柏連納，丹尼爾．貝利 (2020) 假性親密：修復失衡的互動，走進真實關係。殷麗君譯。\n羅伯特・強森 (2020) 戀愛中的人：榮格觀點的愛情心理學。鄧伯宸譯。\n陳皎眉，王叢桂，孫蒨如 (2014) 社會心理學（第三版）",
    "consultation": "fanyu@ntut.edu.tw「i 學園」或 Zuvio 課程平台。所有課程重要訊息都會公告於「北科 i 學園」，請同學務必時常查閱。教師會提供課程教材於「i 學園」或 Zuvio 課程平台，請自行下載觀看。",
    "remarks": "因應學校二教整修工程施作，本 (112-1) 學期於第二教學大樓教室授課之課程，將配合施工期程實施遠距教學至 9 月 28 日。112/9/11-9/28 皆改用 Google Meet 或 Teams 遠距教學，上課當日請務必查閱本課程「北科 i 學園」-「學習互動區 -- 課程公告」裡的上課網址進入教室。教室網址 https://meet.google.com/ogv-eigb-xhz 課程對應 SDGs 指標：5 性別平等指標對應授課內容：第十五週 「親密的陷阱」與第十六週「從不良的親密關係中發現」對應指標 5 性別平等中的降低女性過去 12 個月遭受目前或過去伴侶施暴（身體、性或精神）、或伴侶以外性侵害的女性比率。.",
    "foreignLanguageTextbooks": false
  }
]
