[
  {
    "name": "鄭又平",
    "email": "youpingcheng@gmail.com",
    "latestUpdate": "2023-05-30 19:35:19",
    "objective": "中國的崛起正在改變全球的政治、經濟和文化，而台灣與港澳都是已然成型的大中華經濟圈成員，吾人必須要趁早了解中國市場崛起的原因，並開始作好準備。\n \n本課程帶領學生深入瞭解中國崛起的背景、所代表的意義、以及如何去面對隨之而來的新挑戰。課程中並將描繪出世界的未來走向、美國霸權的逐日衰退、和各種產業即將面臨的威脅 / 挑戰 / 機遇。\n \n中國已經成為世界最大的經濟體，未來台灣的企業、經濟前景、甚至個人生活都會感受到巨大的衝擊。中國的經濟成長何以會影響到所有的全球性產業和消費者，並分析許多工作即將面臨的威脅。\n \n本課程由總體宏觀角度出發，逐步進入細部剖析，期末再以全球觀點回顧大中華經濟圈的發展，並對未來趨勢提出分析。\n\nThis is an introductory level course on the rise of China as a major power and the emergence of the Greater China Economic Circle.\n \nThe rise of China is changing the global politics, economy and culture. Taiwan, as a member of GCEC, needs to understand the rise of China market in order to prepare for the future.\n \nThis course will show you the background and significance of China’s rising power and how to face the following challenges. Also, you will see the trends of the world, the decline of American hegemony and the challenges of different industry. \n \nChina has already become the largest economy in the world. Taiwan, as a neighbor of China, will face great impact on aspects such as business, economic prospective and personal life. \n \nThrough intensive reading and in-class discussion, the students are expected to gain an in-depth understanding of the developmental causes, path, and trajectory of the GCEC.\n \nBoth positive and negative factors will be critically examined in the assi",
    "schedule": "臺北科技大學 112 學年度第一學期 【大中華經濟圈】課程課綱\n\n第一週 09/15\n課程總論 大中華經濟圈的崛起與衝擊\n\n第二週 9/22\n中國企業無限公司：中國好，世界就好？從山寨經濟邁向自主創新\n\n第三週 09/29\n中秋放假\n\n第四週 10/06\n獨特又矛盾的經濟體：21 世紀中國奇蹟背後的真相\n\n第五週 10/13\n媒體中國的『軟實力』：甄嬛傳、舌尖上的中國、中國好聲音、中國有嘻哈\n\n第六週 10/20\n強國不強？：中國國力與經濟成長的極限。從鄧小平到習近平：21 世紀中國面對的挑戰與國際角色的調適\n\n第七週 10/27\n我是世界最大黨：誰在統治及如何統治中國\n\n第八週 11/03\n出賣中國：權貴資本主義的起源與共產黨政權面臨的壓力與挑戰\n\n第九週 11/10 期中考週\n匱乏：中國 14 億人口到底還缺什麼？對中國崛起有多少限制？\n\n第十週 11/17\n傳統產業的工廠女孩 與 科技產業的白領小資\n\n第十一週 11/24\n超級中國的超級工程：工程師眼中的中國技術\n\n\n第十二週 12/01\n當中國買下全世界：全球資源佈局戰的最大贏家，如何掌控世界商品的供需網絡\n\n第十三週 12/08\n金融霸權的誘惑：買下全世界後，中國夢的下一步會往哪裡去？\n\n第十四週 12/15\n一個中國、兩個世界：底層的抗爭所帶來的危機與衝突\n\n第十五週 12/22\n修昔底德陷阱：中、美兩大國終將一戰嗎？\n\n第十六週 12/29\n失衡的經濟：美中「再平衡」戰略大藍圖！\n\n第十七週 01/05\n與龍共舞：外資企業如何與中國政府打交道\n\n第十八週 01/12 \n期末考週",
    "scorePolicy": "1. 期末報告\n2. 出席率\n    無故缺席 2 次，學期成績為 60 分；缺席 3 次則學期成績為不及格\n3. 平時表現",
    "materials": "1. Karl Gerth。中國好，世界就好？（台灣：高寶，2011。）As China Goes, so Goes the World。（New York,NY：Hill and Wang 2010）\n\n2. Arthur R. Kroeber。獨特又矛盾的經濟體：21 世紀中國奇蹟背後的真相\n（台灣：聯經出版社，2017。）China’s Economy: What Everyone Needs to Know。",
    "consultation": "有任何問題都可以與許庭瑋助教聯繫 E-mail: glimmer.900111@gmail.com",
    "remarks": "課程名稱：大中華經濟圈課程對應指標：4 教育品質 8 就業與經濟成長 10 減少不平等 16 和平與正義制度 17 全球夥伴指標對應授課內容：4 教育品質：第 1 週 大中華經濟圈的崛起與衝擊 8 就業與經濟成長：第 4 週 獨特又矛盾的經濟體：21 世紀中國奇蹟背後的真相 10 減少不平等：第 16 週 失衡的經濟：美中「再平衡」戰略大藍圖！16 和平與正義制度：第 12 週 當中國買下全世界：全球資源佈局戰的最大贏家，如何掌控世界商品的供需網絡 17 全球夥伴：第 17 週 與龍共舞：外資企業如何與中國政府打交道",
    "foreignLanguageTextbooks": false
  }
]
