[
  {
    "name": "黃少妤",
    "email": "phsophia@gmail.com",
    "latestUpdate": "2023-09-05 17:05:11",
    "objective": "隨著跨學門的多元連結，當代建築學的設計與史論研究向度越趨廣泛且複雜。為回應此變動的條件，研究方法作為知識體系建構的工具，亦需重新思考如何提供理解當代建築學和認識論的新興維度。因此，本課程首先以「研究為一門藝術的概念」- 透過理解自身意識與研究的關係，作為開啟研究的初步引導。接著，將從人文社會科學研究方法的基礎出發，探討如何在建築學門內適切轉化及運用此些方法。透過本課程，學習者將能夠有效辯證和梳理不同研究主體 (知識論) 以及該研究所對應之方法邏輯 (方法論), 並以此作為設計研究的基礎建構。同時，期待學習者能夠理解在建築研究中，學門的部分特殊性質所衍伸出的方法論修正，並鼓勵為當代建築設計與史論研究提供新的思路。\nWith the growing interdisciplinary connections, contemporary architectural design, theoretical research, and historical dimensions have become increasingly expansive and intricate. In response to these evolving conditions, research methods, as essential tools for constructing knowledge systems, need to be reconsidered in order to offer fresh insights into understanding contemporary architecture and its epistemology.\n\nThis course starts by embracing the concept of \"research as an art\" as a foundational guide to initiate research, emphasizing the crucial relationship between self-awareness and the research process. It then builds upon the established research methods in the humanities and social sciences, exploring how to effectively adapt and apply these methods within the field of architecture. Throughout the course, learners will learn to skillfully articulate and organize diverse research subjects (epistemology) and their corresponding methodological frameworks (methodology), estab",
    "schedule": "09.11 課程簡介＋建築與研究概論\n\n研究與論文\n09.18 建築研究方法：學術倫理，研究問題，論文結構\n09.25 資訊搜尋\t- 圖書館與資料庫介紹\n10.02 甲組老師分享＋量化與質化研究 01\n10.09 放假\n\n研究方法與結構\n10.16 甲組老師分享＋量化與質化研究 02\n10.23 甲組老師分享 + 研究設定與工具 / 文獻回顧與格式０１\n10.30 甲組老師分享 + 文獻回顧與格式 02\n11.06 期中練習 [小論題目討論：研究心智地圖＋摘要] \n11.13 學術寫作演講及工作坊 \n11.20 方法實作：訪談 + 問卷 \n11.27 青年研究者問題分析與討論\n12.04 問卷練習成果發表 + 視覺文本 01\n12.11 青年研究者問題分析與討論\n12.18 中英論文寫作 + 視覺文本 02 \n\n研究書寫與回饋\n12.25 研究提案簡報討論 \n01.01 放假\n01.08 期末報告繳交",
    "scorePolicy": "期中報告 30%- 質性研究方法報告。\n期末報告 50%- 小論形式研究提案 4500 字 ±10%，不包括參考書目與註腳 (格式於課堂公布)。\n平時作業 10%- 研究問題發展練習作業。\n平時表現 10%- 含出席狀況、課堂參與討論。\n所有報告須準時繳交，遲交半小時扣 5 分，含電子檔與紙本。細節另行公告。授課教師保有修正或調整評分項目之權利。\n\n\n[課程內涵與核心能力之對應]\n1. 整合及問題解決的能力\n2. 跨域之空間專業知識統整與運用之能力\n3. 加強國際景觀視野與多元文化的素養\n5. 具備進行研究之方法與論述能 \n6. 培養學術倫理、獨立研究與批判寫作之素養",
    "materials": "Aksamija, Ajla. 2021. Research Methods for the Architectural Profession. London: Routledge.\nBabbie, Earl. 2016. 社會科學研究方法。台北：雙葉書廊有限公司.\nBorden, Iain, and Katerina Ruedi-Ray. 2006. The Dissertation: An Architecture Student’s Handbook. Edited by Architectural Press. 2nd ed. Oxford.\nBooth, Wayne C., Gregory G. Colomb, and Joseph M. Williams. 2008. The Craft of Research. 3rd edition. Chicago: University of Chicago Press. 陳美霞、徐畢卿、許甘霖譯，2009，《研究的藝術》。台：巨流圖書公司 。\nLucas, Ray. 2016. Research Methods for Architecture. London: Laurence King Publishing.\nWang, Linda N; Groat David. 2013. Architectural Research Methods. 2nd ed. New York: John Wiley & Sons.\nYin, Robert K, and Donald T Campbell. 2018. Case Study Research and Applications: Design and Methods. Thousand Oaks, California: SAGE Publications.\n鈕文英. 2019. 質性研究方法與論文寫作. 2nd ed. 台北：雙葉書廊有限公司.\n胡龍騰、黃瑋瑩、潘中道譯，研究方法步驟化學習指南，台北：學富文化，民國 90 年。\n書林編輯部 編譯，MLA 論文寫作手冊，第七版，台北：書林，2010。\n張慶，論文寫作手冊（增訂三版），台北：心理，2010。\n韓乾，研究方法原理，台北：五南，2008。\n畢恆達，教授為什麼沒告訴我，台北：小畢空間出版社，2020。\n洪伯邑，黃舒楣 等，田野敲敲門：現地研究基本功，台北：國立臺灣大學出版中心，2021。\n林開忠，張雯勤等， 田野的技藝：自我、研究與知識建構，台北：左岸文化，2019。\n [其他參考於課堂補充]",
    "consultation": "以下方式諮詢 Email: shaoyuhuang@mail.ntut.edu.tw 學校分機：#2932 老師諮詢辦公時間",
    "remarks": "本學期原則採實體授課方式；本學期教學及授課方式請依照學校網頁所公布之訊息為準：> 學生分兩組；一組學生以遠距上課一組學生實體上課，每週對調。有特殊需求者可以遠距上課為主。課程錄影將視需求以適當方式提供學生於非課堂時間學習 > 建立學生常使用的網絡社團，即時更新課堂資訊與確保問題交流 > 評量方式：線上報告與繳交電子檔案 > 上課網址：https://meet344.webex.com/meet/pr26441318824 本課程符合 SDGs 優質教育，性別平等，永續城鎮與社區等。",
    "foreignLanguageTextbooks": true
  }
]
