[
  {
    "name": "余盛延",
    "email": "syyu@ntut.edu.tw",
    "latestUpdate": "2023-07-08 18:40:46",
    "objective": "本課程主要在培養各類型段落、短文的撰寫能力，包括描寫、敘述、說明及議論性質文章。\nThis course is intended for university-level EFL writing students with the aim of increasing their fluency in English writing. To achieve this goal, students in this course will have ample opportunities to write varying types of English paragraphs, for instance, paragraphs of definition and paragraphs focusing on cause and effect relationships. In addition, they will have plenty of opportunities to write various kinds of short English essays, including descriptions, narratives, and argumentative writings.",
    "schedule": "09/12\tIntroduction\n09/19\t1. Introduction: Why We Need Critical Perspectives on AI\n09/26\t2. Artificial Intelligence (AI): When Humans and Machines Might Have to Coexist\n10/03\t3. Digital Humanism: Epistemological, Ontological and Praxiological Foundations\n10/10\tHoliday \n10/17\t4. An Alternative Rationalisation of Creative AI by De-Familiarising Creativity: Towards an Intelligibility of Its Own Terms\nShort Response Paper 1 Due\n10/24\t5. Post-Humanism, Mutual Aid\n10/31\t6. The Language Labyrinth: Constructive Critique on the Terminology Used in the AI Discourse\n11/07\tMidterm clinic \n11/14\t7. AI Ethics Needs Good Data\n11/21\t8. The Social Reconfiguration of Artificial Intelligence: Utility and Feasibility\n11/28\t9. Creating the Technological Saviour: Discourses on AI in Europe and the Legitimation of Super Capitalism\nShort Response Paper 2 Due\n12/05\t10. AI Bugs and Failures: How and Why to Render AI-Algorithms More Human?\n12/12\tArtificial Intelligence and Creative Expression\n12/19\tG1 students: Critical perspective paper presentation and defense.\n12/26\tG2 students: Critical perspective paper presentation and defense.\n01/02\tG3 students: Critical perspective paper presentation and defense.\n01/09\tReview and Discussion",
    "scorePolicy": "Two oral presentations on assigned articles, two group reflection papers, and group AI art works and the prompts: 35%; two short response papers: 25%; one critical perspective paper and presentation: 50%.",
    "materials": "Verdegem, Pieter, ed. AI for Everyone: Critical Perspectives. U of Westminster P, 2021.",
    "consultation": "Google Meet: https://meet.google.com/fkt-jfam-ppiR804 Office Hours: Mon: 3:10-5:00 p.m., Tue. 2:10-3:00 p.m. and Wed. 5:10-6:00 p.m.Email: syyu@ntut.edu.tw",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
