[
  {
    "name": "黃儀婷",
    "email": "evie.ting.huang@gmail.com",
    "latestUpdate": "2023-09-30 18:32:30",
    "objective": "本課程之目的在於介紹互動媒體設計所需之故事腳本設計相關知識與其應用。 課程規劃主要著重在 \"設計方法\" 以及 \" 設計思維 (Design Thinking) 的實際操作演練；希望透過本課程讓同學們以互動體驗實作的方式來建構設計概念發展的模式。 課程內容包含敘事性方法、創意思考方法、互動腳本企劃以及互動腳本撰寫及實作等。修習此課程之學生可學習互動情境劇本設計之原理與實作模擬，並具備業界所需之互動媒體設計實務之企劃與分析能力。在以實務操作、課堂腦力激盪與討論的方式下，學生的評量採報告與作業的繳交以及課堂討論成績為主。\nThe course aims to introduce knowledge and application relevant to storytelling and script planning. Under the structure of user oriented scenario design, this course includes narrative methods, creative thinking methods, interactive script planning and writing. Students will be capable of interactive scenario script design, planning and analyzing for interactive media practice. By means of practical work, in-course brainstorming and discussion, students are evaluated by reports, assignment and course discussion.\n\n說故事與腳本企劃作為互動系大二視覺傳達組的必修課程，旨在訓練同學創意的敘事方式與多媒體腳本企畫執行。在課程大綱中。本學期課程的實務專題預計以 USR 專案：原住民部落安居構築與綠色樂業推動計畫；南投仁愛鄉賽德克東岸部落之耆老口述歷史故事影像化和災後心理支持 app 腳本企畫兩大專題，在課程中藉由多次與部落耆老訪談和 USR 團隊專任助理的資料提供協助、讓同學們實作影片敘事與 app 腳本企畫。\n\n本課程鏈結 SDG11 所探討的永續城市與社群及 SDG15 - 保育陸域生態的主題。授課教師本身為 USR- 原住民部落安居構築與綠色樂業推動計畫的共同主持人，負責第三期 USR 賽德克東岸部落的互動行銷規畫與實踐項目，然 2023 年 8 月初的卡努風災導致土石流導致我們的場域家園毀損嚴重，因此本 USR 計畫將調整執行方向到災害應變和復原。故此次課程亦將以” 災後部落居民心理支持 app” 作為專題，預計在課程中開闢兩個講次談 SDG11/15 相關的概念和東岸部落的災前災後生態復育，另安排一次東岸部落的據點觀察 (移地教學) 及三週當災害來臨 app 討論和實作課程實施。",
    "schedule": "Week 1 :  課程介紹 / 課程要求與期待 \nWeek 2:   創意點石成金  作業 1 發題\nWeek 3:   互動設計的創意發想方法 / 近期案例介紹\nWeek 4:   敘事性方法 / 51 種物戀  課堂中小作業 \nWeek 5:  How Marketing Communication Works\nWeek 6:  個案介紹南投仁愛鄉賽德克東岸部落的場域發展\nWeek 7:  南豐村東岸賽德克部落耆老口述故事分享\nWeek 8:  故事的三個組成 - 作業 2 發題 \nWeek 9:  戲劇三大要素 與故事曲線安排\nWeek 10: 作業 2 討論\nWeek 11: 如何透過聲音和音樂敘事\nWeek 12: 台灣遭遇的天災 - 災民需求 - 協助支持系統及災民心理支持 app \nWeek 13: 移地教學前往南豐村賽德克東岸部落踏查與訪談\nWeek 14: 來畫 storyboard   \nWeek 15: SDG11 與 SDG15 之概念與案例分享\nWeek 16: 作業 3 實作討論\nWeek 17: 作業 3 發表\nＷeek 18: 期末總檢",
    "scorePolicy": "作業 60%\n報告 20%\n課堂討論互動 10%\n出席   10%",
    "materials": "1. 設計思考改造世界 (2010)   Tim Brown 著 / 吳莉君譯 / 聯經出版公司\n2. 數位時代的奧格威談廣告 (2019)  Miles Young 著 / 莊淑芬、高嵐 譯 天下\n3. 圖解設計思考：好設計，原來是這樣「想」出來的！\nGRAPHIC DESIGN THINKING：BEYOUND BRAINSTORMING (2012) / Ellen Lupton 著 / 林育如 譯 / 商周出版",
    "consultation": "1. email : ythuang@mail.ntut.edu.tw2. office phone: #89143. facebook: Evie Huang",
    "remarks": "SDG11: 永續城市與社群 SDG15: 保育陸域生態本課程為 112-1USR 認證課程",
    "foreignLanguageTextbooks": false
  }
]
