[
  {
    "name": "陳圳卿",
    "email": "cceugene@ntut.edu.tw",
    "latestUpdate": "2023-06-01 10:21:22",
    "objective": "輔具是輔助器具的簡稱，舉凡日常生活，能使活動更容易、方便的各種用具皆屬之，正確的使用輔具可以改變身心障礙者或老年人原本有障礙的生活，走入社會，降低社會成本。本課程為專案導向課程，課程中除教授輔具設計基本概念，透過實際個案訪談分析目標對象，以工作坊形式找出使用者痛點，進而發展解決方案，提出適切的輔具資源，以幫助身心障礙者或老年人族群。\nAssistive device is the abbreviation of auxiliary equipment. For everyday life, all kinds of utensils that make activities easier and convenient belong to it. Correct use of assistive device can change the life of people with physical and mental disabilities or the elderly who have obstacles, and enter the society and reduce Social costs. This is a project-oriented course. The course introduces the concept of auxiliary equipment; students can also analyze target audience through different case studies. During workshops, it helps students indicate users’ pain points and develop the solutions. The goal of this course is to come out with the resources to help people with disabilities or the elderly.",
    "schedule": "9/14\t課程簡介\t陳圳卿老師 林立老師 彭志維老師\t第 7-8 節\t上課地點：臺北醫學大學 杏春樓跨領域學院 1F i8\n\n9/21\t1. 輔具使用者介紹 2. 政府身障者數據分享 分組報告：資訊收集數據呈現\t林立老師 林欣蓓老師 (暫)\t第 7-9 節\t上課地點：北醫\n\n9/28\t人因 / 通用設計\t彭志維老師\t第 7-8 節\t上課地點：北醫\n\n10/5\t1. 無障礙環境介紹 2. 成長障礙環境家裡及工作活動環境 分組報告：分享所描繪退休後的夢想家園\t林立老師 林欣蓓老師 (暫) 第 7-9 節 上課地點：北醫\n\n10/12\t1. 輔具介紹 2. 實際接觸合適行動輔具，身心障礙鑑定架構及申請流程 分組報告：根據 ICF 鑑定面向進行身障者訪綱擬定\t林立老師 林欣蓓老師 (暫)\t第 7-9 節 上課地點：北醫\n\n10/19\t1. 失能與高齡同理心體驗式學習介紹 2. 親身故事強化學生同理心 分組報告：身障體驗活動與心得分享、行動輔具體驗與發想\t林立老師 林欣蓓老師 (暫)\t第 7-9 節\t上課地點：北醫\n\n11/11 (暫)\t找出痛點 1 (工作坊)/ 訪談 TA 觀察訓練 / 訪談問題發現 訪談問題發表\t陳圳卿老師 林立老師 彭志維老師\t週六 第 2-7 節\t週末上課 6 小時 上課地點：北科\n\n11/18 (暫)\t找出痛點 2 (工作坊)/ 聚焦收斂 概念成形 聚焦收斂 / 概念成形\t陳圳卿老師 林立老師 彭志維老師\t週六 第 2-7 節\t週末上課 6 小時 上課地點：北科\n\n11/23、11/30、12/7、12/14、12/21、12/28\tMeeting 解決方案發展與實作－小組各自約指導老師討論 \t與分組指導老師約定時間討論 5 小時 \n\n1/4\t繳交期末發表資料\t第 7-8 節\n\n1/11\t期末發表\t陳圳卿老師 林立老師 彭志維老師\t第 7-9 節\t上課地點：北醫\n\n兩次工作坊時間將於第一次上課時討論後訂定",
    "scorePolicy": "課堂出席\t40\n工作坊出席\t30\n期末專題分組報告\t30",
    "materials": "依授課老師指定",
    "consultation": "北科：陳圳卿 老師北醫：林立 老師",
    "remarks": "上課地點：臺北醫學大學 杏春樓跨領域學院 1F i8                  臺北科技大學：另行公告任何相關的調整請依課程 LINE 群組公告對應 SDGs：第 3 項：健康福祉",
    "foreignLanguageTextbooks": false
  }
]
