[
  {
    "name": "王鴻祥",
    "email": "wanghh@ntut.edu.tw",
    "latestUpdate": "2023-08-06 19:17:29",
    "objective": "互動設計專注於使用情境相關課題，包括多元感覺的產品語意、資訊與功能的整體設計。顧及使用者的需求、使用者的心理和使用者的認知特性；將所有參與互動的操作及顯示單元，透過視覺、觸覺及聽覺等多元感覺的整合設計。使得使用者容易理解。\nThis course provides study of interaction design related topics on Product Semantics, Information and Function. With emphasis on User Interface integration and Usability Testing, psychology and cognitive proactive, the course will be characterized by inter-disciplinary on multi-median. This is where the user easy understanding applies and interacts with the product.",
    "schedule": "Each student is responsible for presenting an usability excerpt from the text Designing with the Mind in Mind (DMiM). These are five-minute presentations, only five slides. They will be scheduled throughout the semester, and the calendar will be posted in advance on the Blackboard.Include website examples that refer to specific useful guidelines in the designated chapter.",
    "scorePolicy": "1. As a lecture course, attendance is essential. The learning environment is the collaborative work of the creative process, with regular feedback. The role of the teacher is to guide you through this process. Outside work is sometimes necessary during the research phases, but apart from that, you are expected to attend each class for the entire class time. Plagiarism is dealt with in accordance with NTUTs academic standards and policies on fraud and plagiarization. Any copy of the work of another student or of information without proper citation is unacceptable. The student manual details the acts considered to be plagiarism, the channels through which they are treated, and their consequences.\n2. Your final rating will be calculated on the basis of the scale below; the scoring criteria listed in the course syllabus. \nDiscovery 5 Points \nExploration; Generation + 10 Points \nEvaluation Phase with wireframes; documentation + 10 Points \nTest Plan; Validation + 20 Points Final Design + 15 Points \nFinal Documentation &amp; Presentation + 10 Points \n5 Slides 5 Minutes Presentations + 5 Points \nParticipation, Quiz, Homework + 15 points = 100 Points \nNo grades will be discussed by e-mail. No extensions will be granted unless a medical note or an email from your academic advisor is provided. In general, incomplete course grades are not granted without the agreement of the academic dean. Three absences will result in the loss of a final class; six absences will result in failure.",
    "materials": "Designing for Interaction by Dan Saffer isbn: 978–0321643391\nDesigning with the Mind in Mind by Jeff Johnson isbn: 978–0123750303\nTomorrow’s Standards Today by Brian Hogan isbn: 978–1934356685\nhttp://www.sensible.com/\nhttp://www.useit.com/alertbox/\nhttp://www.useit.com/homepageusability/guidelines.html",
    "consultation": "Google Classroom",
    "remarks": "SDGs 12 responsible consumption and production",
    "foreignLanguageTextbooks": true
  }
]
