[
  {
    "name": "陳紅章",
    "email": "hctran@ntut.edu.tw",
    "latestUpdate": "2023-08-27 14:34:45",
    "objective": "先修課程：負責教授同意。\n本課程主要介紹幾何光學與 Coherent 光學兩部份之基本概念與應用﹐提供機械領域的學生有關光的知識﹐讓機械領域的學生有能力加入機光電技術整合。本課程首先介紹幾何光學﹐幾何光學雖然簡單﹐卻是光學應用最普遍的知識﹐接著進入 Coherent 光學原理與應用介紹﹐Coherent 光學在光量測技術部份佔了非常重要的地位﹐透過本課程的訓練﹐學生將可更順利的進入光學實驗室工作﹐當然﹐本課程也適合其他對光學有興趣的學生來修習。\nThe lectures in this course include two main parts, the geometrical and the coherent optics. Due to the future high technology, the optomechatronics, needs the cooperation of knowledge among the optics, the electrics, and the mechanics. This course gives the students of mechanical engineering the chance to participate in this work group. The lecture will first show the students the geometrical optics which is simple but important in the field of optical application. The coherent optics is the main part in this course which occupies the most optical technique of measurement. After the course the students should have the enough knowledge to work in the optical laboratory. Certainly, this course is also useful for all students who are interest in the area of the optics.",
    "schedule": "Week 1-3: Introduction to Applied Optics and Light Propagation\nOverview of applied optics in mechanical engineering\nBasics of light propagation, reflection, and refraction\nUnderstanding the electromagnetic spectrum and wavelengths\n\n\nWeek 3-6: Geometrical Optics and Lens Systems\nPrinciples of geometrical optics and ray tracing\nAnalysis of lens systems, focal points, and image formation\nApplication of lens systems in optical components\n\nWeek 7-8: Wave Optics and Interference\nIntroduction to wave optics and wavefronts\nInterference of light waves and its applications\n\nWeek 9 : Midterm \n\nWeek10: Diffraction and Optical Gratings\n\n\nWeek 12: Polarization and Optical Materials\n\nWeek 13-14: Optics in Imaging and Measurement\nFundamentals of optical imaging systems\nOptical metrology techniques and precision measurements\nApplications of imaging and measurement in mechanical engineering\n\nWeek 14-17: Lasers and Laser Applications\nPrinciples of laser operation and types of lasers\nLaser-matter interactions and material processing\nRole of lasers in mechanical engineering processes\n\nWeek 18: Project Presentations and Reflective Assessment",
    "scorePolicy": "Weekly assignments: 30%\nMidterm exam: 30%\nGroup project and presentation: 40%",
    "materials": "Basic Optical Engineering for Engineers and Scientists , Author Haiyin Sun",
    "consultation": "Contact Instructor via email address : hctran@ntut.edu.tw or during office hours",
    "remarks": "(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)",
    "foreignLanguageTextbooks": true
  }
]
