[
  {
    "name": "楊景德",
    "email": "jyang@ntut.edu.tw",
    "latestUpdate": "2023-08-29 08:51:23",
    "objective": "Whether our careers and even our lives are successful or not is contingent not just upon the results we produce, but also upon whether we enjoy the activity of achieving those results.  To achieve this goal, we need to be able to think creatively.  The course hence covers at least the following topics relevant to “Creative Thinking”: its neuroscientific basis, its psychological methods, the epistemic foundation in both philosophy and logic, the development of the gene of creative thinking, the difference between thinking creatively as an individual and in a group, etc.  The course will proceed with a series of close studies of theories and practical cases, so that the participants of the course will not only know 'what is creative thinking', but also be able to think creatively.",
    "schedule": "1\tIntroduction: What is the \"creativity quotient\"？\n2\tCreative Butterfly Thinking I\n3\tCreative Butterfly Thinking II\n4\tCreative Butterfly Thinking III\n5\tCreativity CEO I\n6\tCreativity CEO II\n7\tCreativity CEO III\n8\tCreativity Method: Toothache Tree\n9\tMid-term Exam Week\n10\tCreativity Method: Observation I\n11\tCreativity Method: Observation II\n12\tCreativity Method: Analogy I\n13\tCreativity Method: Analogy II\n14\tCreativity Method: Association I\n15\tCreativity Method: Association II\n16\tCreativity Method: Creativity Box\n17\tCreativity Method: Painting I\n18\tCreativity Method: Painting II",
    "scorePolicy": "Evaluation is base on the average scores of the routine in-class feedback and take-home assignments, along with the in-class performance.*\n\n\n*No work done by ChatGPT is allowed.",
    "materials": "Required textbooks:\n1. Olivia Fox Cabane &Jubah Pollack, The Net and the Butterfly The Art and Practice of Breakthrough Thinking，2017.\n\n2. Dorte Nielsen & Sarah Thurber: The secret of the highly creative thinker， \n  2017.\n\n3. Mario Pricken: CLOU: Strategisches Ideenmanagement in Marketing, Werbung, Medien und Design,Verlag Hermann Schmidt, 2009.\n\n4. Mario Pricken: CLOU II: Strategisches Ideenmanagement in Marketing, Werbung, Medien und Design,Verlag Hermann Schmidt, 2010.\n\n\n\n\n\n\n\nRecommend textbooks:\n\n1. Keri Smith: How To Be An Explorer Of The World，2009.\n\n2. Betty Edwards: Drawing on the Artist Within: A guide to innovation, invention, imagination, and creativity. Published by Simon& Schuster, 1987.\n\n3. Tina Seelig: in Genius: A Crash Course on Creativity: HarperOne, 2012.",
    "consultation": "We shall set up a class line group during the first two weeks, followed by joining a Google Meeting discussion room should we take a remote class. My E-mail: jyang@ntut.edu.tw",
    "remarks": "N/A",
    "foreignLanguageTextbooks": true
  }
]
