[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2010-09-20 10:08:14","objective":"本課程旨在幫助學生經由閱讀與討論以了解全球共同面對的課題，包括：全球化的趨勢、文化衝突與恐怖主義、全球貧富差距、環境保護問題、基因工程所衍生的倫理道德問題等等。","schedule":"Discussions in Global Issues (2010 Fall)\n~with Prof. Vinia Huang\nMondays: 10:10am~12:00noon\nI.　　Objectives:  The goal of this course is (1) to familiarize the students with the on-goings of important issues common to most countries and people living on the Planet Earth and (2) to facilitate their awareness of the situations they themselves are currently situated, especially in the ever developing flux of environmental, technological and cultural/social challenges.\nII. Time distribution in the class:\n1.　　10:10am~10:30am (Weekly exam)\nThere is a weekly exam on the readings pertaining to the  two topics to be discussed in the class on that day. It lasts for 20 minutes.  There is no make-up exam.\n2.　　10:30am~10:50am (Report); 10:50am~11:05am (Discussion)\nThe first group presents the main argument of the chosen articles on the environment for 20 minutes and lead the discussion for 15 minutes.\n3.　　11:05am~11:15am (Break)\nLet’s take a 10 minute break!\n4.　　11:15am~11:35am (Report); 11:35am~11:50am (Discussion)\nThe Other group presents the main argument on the chosen unit about (1) technological innovation, and/or (2) Cultural/social development, for 20 minutes and lead the discussion for 15 minutes.\n5.　　11:50am~12:00noon\nProf. Vinia Huang will make comments for 10 minutes, and our class will be dismissed at 12:00 noon Sharp.\nIII.　　Percentile distribution of final grades: Total 110%\n1. In-class group presentation on two topics: 10% X 2 = 20 %\n2. Attendance and participation in the classroom discussion: 2 % X 15 = 30 %\n3.　　Weekly tests: 3% X 15 = 45%\n4.　　Final paper: 15%\nFinal project for each student will be uploaded to our blog on the internet. The final paper is a 3~5 page report, excluding photos and bibliography, on one of the global issues discussed in the class.  The due date is January 10 (Monday), 2011\nIV.　　Required Texts: A collection of articles from\nadvanced English Magazines\n\nA.　　Environmental issues: Each group is required to do a presentation on one of the following units from #1 to #17.\n1. . On clean environment~ \n(1)”Dumpster Diving:  Picking through the trash gets a new reputation” (2009 August), pp. 40~42\n(2) ”What happens to 3-D glasses?” (2010 June), pp. 31-32\n\n2. On environmental friendly vehicles~\n(1)“Old-Fashioned Bicycling:  Dutch bike company founder David Schmidt believes in pedaling” (2009 October), pp. 42~43 \n(2) “The Future of Transportation: One expert offers insight to new ways of getting around without damaging the environment” (2009 September), pp.16~17\n(3)”Firms developing light planes that can convert to car, motorcycle” (2009 December), p. 36\n\n3. On saving resources and energy~\n (1)“Wireless Electricity Is here:  You’ve used the Internet without cables—now try recharging batteries without wires” (2009 July), pp. 36~38\n(2)”Tech industry looks to turn down cost” (2009 September), pp, 27\n\n4.  On solar energy~\n(1) “The Next Wave of Solar Gear:  After decades of design neglect, solar-powered gadgets finally get a blast of style” (2010 April), pp. 34~36\n(2) “Cooking with the Sun’ (Focus on the Environment), pp.115 (The instructor will provide you with this article)\n\n5. On pollution and purification ~\n(1) “Clean Drinking Water for Haiti:  Florida students are making a difference by inventing a water=purification system” (2010 January), pp. 42~43\n(2) “Company turns water into effective, chemical-free cleaning product” (2010 January), p. 35\n(3) “Marine Plastic Pollution” (Focus on the Environment), p. 68 (The instructor will provide you with this article)\n\n6. On air, land, and water \n(1) “Oysters in Danger:  Is the Pacific Ocean’s chemistry killing sea life?” (2010 January), pp. 44~45\n(2) “Personalized Airspace” (2010 February), p. 21\n(3) Oil Spills: ”Oil and Water won’t Mix” (Focus on the Environment), p. 58 (The instructor will provide you with this article)\n\n7. On conservation of forests~\n“Redwood Forest in Northern Cal","scorePolicy":"Percentile distribution of final grades: Total 110% + adjustment\n1. In-class group presentation on two topics: 10% X 2 = 20 %\n2. Attendance and participation in the classroom discussion: 2 % X 15 = 30 %\n3.　　Weekly tests: 3% X 15 = 45%\n4.　　Final paper: 15%\n","materials":"DVDs:\nAn Inconvenient Truth\nThe Blue Butterflies\nThe Day After Tomorrow\nErin Brockovich\nAttack on the Pentagon\nUnited 93\n","foreignLanguageTextbooks":false}]
