[{"name":"賀一平","email":"ipho@ntut.edu.tw","latestUpdate":"2010-09-16 08:06:12","objective":"The purpose of this course is to develop students into better, more mature, confident, competent, enthusiastic, reflective, independent learners. Young adult literature are used as major reading materials together with articles dealing with controversial issues. Activities encouraging students to adopt response strategies and transact with texts actively and aesthetically are provided to motivate students to read whole authentic texts and to improve their communication skills, reading strategies, listening strategies, response strategies, and critical thinking skills. These response-centered activities include journal writing, group discussion, individualized independent study, and guided reading. Authentic evaluation tools including journals and portfolios are used to evaluate student performance.\n","schedule":"Week　　　　　　Topic\n1 　　　　　　Orientation\n2　　　　　　Euthanasia\n3　　　　　　Euthanasia\n4                          Cloning\n5　　　　　　Big brother is watching\n6　　　　　　Holes\n7                           Holes\n8　　　　　　Environmental issues\n9　　　　　　Mid-term Exam\n10　　　　         Animal rights; Animal experimentation\n11　　　　　　Animal rights\n12　　　　　　The Giver\n13　　　　　　The Giver\n14　　　　　　Economic might vs. ecologic right\n15　　　　　　Heroes\n16                         Julie of Wolves; Island of the Blue Dolphins; Hatchet; My Side of the Mountain\n17　　　　　　Julie of Wolves; Island of the Blue Dolphins; Hatchet; My Side of the Mountain\n18　　　　　　Final Exam\n","scorePolicy":"Evaluation\nGroup work and Oral Presentations and participation: 30%\nResponse Journal Entries: 35%\nExams and Reflective journal Entries: 35%","materials":"Reading Materials and References\nThree Young Adult Novels (Including The Giver, Holes, and one of the following three young adult novels: Island of the Blue Dolphins, Julie of Wolves, Hatchet, My Side of the Mountain)\nPavlik, C. (2006). Hot topics (1, 2, 3).  Boston, MA: Thomson/Heinle.\nMacAndrew, R., &amp; Martinez, R. (2002). Taboos and issues.  Boston, MA: Thomson.\nDay, R. R., Shaules, J., &amp; Yamanaka, J. (2009). Impact Issues, 1, 2, 3.  Hong Kong: Pearson Longman.\nMcDonald, S., &amp; Salomone, W. (2008). The writer’s response (4th ed.). Boston, MA: Thomson.\n","foreignLanguageTextbooks":false}]
