[{"name":"張瑞芬","email":"trappey@ntut.edu.tw","latestUpdate":"2010-08-16 16:42:55","objective":"About the Course\nThis course introduces the modern integrated enterprises and organization. The focus is on the managerial and technical aspects of creating and managing modern IT enabled and integrated enterprises. It is clear that enterprises have been in rapid transition toward virtual enterprises with value chain integration for high efficiency and efficacy. Management styles based on hierarchical command and control structures have been challenged both within an enterprise and among enterprises.  Information systems are being realigned around business processes, and business-to-business (B2B) electronic commerce (or some call it “e-business”) has become a key competence that business cannot survive without. This course provides such understanding by focusing on all aspects of managing this complex e-business oprocesses, from strategic planning to the technologies of modern enterprise application integration (EAI). The course stresses the importance of hands-on and creative training. Students will be asked to form project teams and complete term projects/term papers based on eEI techniques and tools introduced during the lectures for practical applications and case studies.\n本課程將介紹現代化企業和組織整合，主要目標是管理面與科技面的創造，以及現代資訊科技管理與企業整合。企業為了追求更高效率與更高效能的價值鏈而快速地轉變成虛擬企業。以階層命令為主的管理模式與控制結構，不論是企業內部還是企業外部，皆已改變。在企業流程內的資訊系統也開始重新規劃，企業對企業 (B2B) 電子商務，或是稱為電子化企業，也已經變成企業生存最主要的要素。這門課將會教導上述內容，並把焦點放在所有這些相關議題，從策略規劃到現代化科技應用整合 (EAI) 等複雜的電子商務流程管理。這門課著重在報告以及創造力的訓練。在課程中，學生將會被分成若干專案小組以完成一個專案或是一份與電子化企業整合技術或工具相關的報告或應用，還有一些個案研讀。","schedule":"eEI - Lecture and Activity Schedule\nNo.　　Core Topic　　                                     Date\n1 Introduction - Modern Integrated Enterprises　　         9/15\nThe Moon Festival　　                                              9/22\n2 Architectural Planning, Business Process Reengineering (BPR)　　9/29\n3 Enterprise Process Modeling and Simulation Tool – INCOME4 (I)\nITRI CAST Case Presentation – Business Process Modeling for Strategic Services　　                                              10/6\n4 Enterprise Process Modeling and Simulation Tool – INCOME4 (II).\nProcess Modeling Exercise/Report Presentations　　         10/7\n5 Enterprise Modeling – Examining Various Enterprise Views　　10/13\n6 Deploying Business Process Models　　                           10/20\n7 Midterm Exam                                                  10/27\n8 XML (Project Proposal/Abstract Due)                      　　11/3\n9 XML Deployment (Homework), Enterprise Resource Planning (ERP)　　11/10\n10 Introduction and Types of B2B Application Integration　　11/17\n11 Collaborative Commerce – Collaborative Product Commerce (CPC), Supply Collaboration, Customer Collaboration　　                  11/24\n12 Integrated ERP, SCM and CRM for Collaborative Commerce　　12/1\n13 E-Business Integration Technology and Standards　　         12/8\n14 EDI, XML/EDI, RosettaNet, ebXML                         　　12/15\n15 Final Team Works and Project Counseling　　                  12/22\n16 Term Project Presentations (1)                      　　12/29\n17 Term Project Report Due, Term Project Presentations (2)　　1/5\n18 Final Exam Due　　                                              1/12\n","scorePolicy":"Grading\nMidterm Exam       　　30%\nFinal Exam　　         30%\nTerm Project　　         30%\nAssignments/Homeworks　　10%\n","materials":"Reference Materials\nLinthicum, D. S., 2001, B2B Application Integration, Addison Wesley, Boston, MA.\nBustard, D., Kawalek, P., and Norris, M, 2000, Systems Modeling for Business Process Improvement, Artech House Publishers, Boston, MA.\nScheer, A.-W., 1998, ARIS – Business Process Frameworks, 2nd Edition, Springer, Berlin, Germany.\n","foreignLanguageTextbooks":false}]
