[{"name":"周至如","email":"cjchou@ntut.edu.tw","latestUpdate":"2010-08-06 14:23:46","objective":"The modern electrical power systems are requested with very high safety, reliability and quality. In general, even a small fault on power system or/and apparatus may lead to large outage and hazards. Power system and apparatus faults (power fault) had become one of the most important risks in the customers especially the high-tech industries e.g. the semiconductor industries. Hence, the issues of preventing power fault and to reduce their risks are more and more important, which will very rely on well fault protections and coordinations for the power systems and apparatuses. This course is aimed to the protection and coordination for the power system and apparatuses. The scope includes the generators, transformers, buses, motors, capacitor banks, reactors, transmission and distribution lines and their associated equipments , in which the fault types are described and the protection scheme are planned and the relay setting for coordinations are studied. Furthermore, the advanced protection technologies will be discussed.\n","schedule":"1.Introductions, scope, definitions, basic concepts and important\nissues descriptions.(week 1)\n2. power system protection fundamental, problems and solutions..(week 1) 　\n3. power system fault characteristics, analysis methods and\nprotection considerations..(week 2) 　\n4. overview the related standards of power system protections and the\nprotection methodology..(week 3)\n5. protective relays performances and their practical aspects on\napplication and considerations..(week 4)\n6. relay system input sources and associated devices especially the\nperformances of current transformers (CT) and voltage transformer..(week 5)\n7. the primary protections with current differential protections\nand some backup protection methods..(week 6\n8. generator system protections: primary protection descriptions and\nprotection scheme planning and design. .(week 7)\n9. midterm and report, generator system protections:backup and\nsupplementary protections descriptions..(week 8)\n10. generators protection scheme planning and design..(week9)\n11. transformer protection planning and design..(week 10)\n12. reactor and capacitor bank protection planning and design..(week 11)\n13. bus protections planning and design considering various bus\nscheme..(week 12)\n14. motor protections planning and design considering starting,\nabnormal operations and faults..(week 13)\n15. substion protection planning: outdoor types and indoor type\nbased on gas insulated switchgear (GIS)-PART1. .(week 14)　\n16. substion protection planning: outdoor types and indoor type\nbased on gas insulated switchgear (GIS)-PART2..(week 15)\n17 transmission line system protections: overhead transmission\nlines ..(week 16)\n18.transmission line system protections: underground cables ..(week 17)\n19.protection associated system stability, final examination ..(week 18)　\n","scorePolicy":".評量方式：期中考佔30%，期末考佔30%，學習報告/作業佔20％，平常表現（含出席率）佔20%。","materials":"本課程依進度進行授課，以課堂講解為主，輔以資料補充,主要教才為：\n(1)J. L. Blackburn, Protective Relaying Principles &amp; Application,\nMarcel Dekker Inc., 1987\n(2)S. H. Horowitz, A. G. Phadke, Power System Relaying, 2nd Edition, John Wiley  &amp;  Sons Inc.1995\n(3)A. G. Phadke, J. S. Thorp, Computer Relaying for Power System,John Wiley  &amp;  Sons Inc.1998\n","foreignLanguageTextbooks":false}]
