[{"name":"賀一平","email":"ipho@ntut.edu.tw","latestUpdate":"2010-08-20 10:07:51","objective":"本門課之目的是讓學生熟悉研究方法設計。主題涵蓋研究計劃之準備及撰擬 ;主要研究方法，如調查研究法、相關研究法、實驗研究法、個案研究法、人種誌研究法，行動研究法，觀察研究法；質性和量化資料之搜集與分析；敘述統計和推論統計。\nThis course familiarizes students with the procedures of research in applied linguistics. Topics will include the nature and process of research; survey research; experimental research; correlational research; case study; grounded theory research; ethnographic research; action research; data collection and data analysis; descriptive statistics; and basic knowledge concerning inferential statistics.","schedule":"Week                     Topic\n1                     Orientation\n2                     Qualitative, quantitative and mixed methods    research\n3                     Qualitative, quantitative and mixed methods    research\n4                     Qualitative data collection\n5                     Ethnography\n6                     Observation\n7                     Interviewing\n8                     Case studies                   9                     Grounded theory\n10                    Action research\n11                    Qualitative data analysis\n12                    Quantitative data collection (Computerized data analysis and SPSS)\n13                   Quantitative data collection (Computerized data analysis and SPSS)\n14                    Survey research\n15                    Survey research\n16                    Quantitative data analysis              17                    Writing quantitative and qualitative research papers and proposals. \n18                    Final Exam","scorePolicy":"Evaluation\nOral presentations: 30%\nJournal writing:30%\nFinal term paper or reflective paper (observation, interviewing, or survey): 30%\nAttendance and participation: 10%\n","materials":"Textbooks: Dornyei, Z.  (2007). Research methods in applied linguistics.  Oxford: Oxford University Press.\nRichards, K. (2003). Qualitative inquiry in TESOL. Palgrave.\nReferences:\nMackey, A &amp; Gass, S. M. (2005). Second language research: Methodology and design.  Mahwah, NJ: Lawrence Erlbaum.\nGass, S. M. &amp; Mackey, A. (2007). Data elicitation for second and foreign language research. Mahwah, NJ: Lawrence Erlbaum.\nWei, L., &amp; Moyer, M. G. (2008). The Blackwell guide to research methods in bilingualism and multilingualism.  Malden, MA: Blackwell.\nCreswell, J. W. (2003). Research design: Qualitative, quantitative, and mixed methods approaches.  Thousand Oaks, CA: Sage.\nCreswell, J. W. (2006). Qualitavie inquiry and research design. Thousand Oaks, CA: Sage.\nCreswell, J. W. (2005). Educational research: planning, conducting, and evaluating quantitative and qualitative research.  Upper Saddle River, NJ: Pearson Prentice.\nNunan, D. (1992).  Research methods in language learning. Cambridge: Cambridge University Press.\nDornyei, Z. (2003). Questionaires in second language research. Mahwah, NJ: Lawrence Erlbaum.\nBrown, J. D. (2001) Using surveys in language programs.  Cambridge: Cambridge University Press.\n","foreignLanguageTextbooks":false}]
