[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2010-09-10 13:51:26","objective":"Course Description: The course is designed to offer English-major students structured and highly formulated practice in the recursive processes. Writing skills developed in this course are essential elements for effective communication both in the future workplace and in academia. This current writing course centers its emphasis on building analytical reading, critical thinking, organizing and structuring. Issues of writing mechanics, grammar, and style will be thoroughly addressed and practiced. In addition, rhetorical strategies will be discussed. \n Course Objectives:  At the successful conclusion of this course, students are expected to learn how to:\n(1)　　gather, evaluate and synthesize information from texts \n(2)　　write to the issues and audiences by producing clear and efficient writing\n(3)　　be concise\n(4)　　be focused\n(5)　　be organized \n","schedule":"Weekly Syllabus\nWeek　　Class Task / Activities 　　Assignment\nWeek 1　　Orientation / Criterion Essay Writing 　　Reading: Understanding Style\nCriterion Essay Topic 1\nWeek 2　　Understanding Style (Instructor) 　　Reading: Correctness \nInstructor Essay 1_ Main Arguments \nWeek 3　　*Presenting IE1_Main Arguments \n*Style: Correctness 　　Reading: Actions\nCrtE Topic 2\nIE1_Main Arguments (Rewriting) \nWeek 4　　*Presenting CrtE 1 &amp; 2\n* Style: Actions 　　Reading: Characters\nIE1_Supporting Facts \nWeek 5　　*Presenting IE1_Supporting Facts \n*Style: Characters 　　Reading: Cohesion and Coherence \nCrtE Topic 3\nIE1_Supporting Facts (Rewriting)\nWeek 6　　Style: Cohesion and Coherence 　　IE1_ Counter Arguments \nWeek 7　　TBA 　　TBA \nWeek 8　　TBA 　　TBA \nWeek 9　　TBA 　　TBA \nWeek 10　　TBA 　　TBA \nWeek 11　　TBA 　　TBA \nWeek 12　　TBA 　　TBA \nWeek 13　　TBA 　　TBA \nWeek 14　　TBA 　　TBA \nWeek 15　　TBA 　　TBA \nWeek 16　　TBA 　　TBA \nWeek 17　　TBA 　　TBA \nWeek 18　　TBA 　　TBA \n","scorePolicy":"Course requirements: Students are required to 　　\n(1)　　write one argumentative essay, with 10 to 12 pages, submitted to the course instructor during the semester.\n(2)　　write six essays, each with 3 to 5 pages, submitted to and rated by ETS Criterion.\n(3)　　write one research paper with 12 to 15 pages     \n(4)　　evaluate and edit his colleagues’ writings.\n(5)　　present writing assignments as scheduled. \n \nGrading Policy:　　(1) Attendance 20% : each unexcused absence will result in 10% deduction from the final semester grade) \n(2) Writings 70% \n　　  (i) Essays evaluated by the instructor: 40% \n　　  (ii) Essays rated by Criterion 30%\n(3) Presentation 10%\n　　\n　　　　　　　　　　\nLeaves and Absences: 　　1) Any AWOL will result in the penalty of 10% semester grade deduction.\n　　　　　　　　  　　2) Penalty-waiver can be granted for any absence w/ official document at the \n　　　　　　　　　　   　　 instructor’s discretion. It is only limited for one time in the entire semester. \nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction.\n","materials":"Style: Lessons in Clarity and Grace by Joseph Williams","foreignLanguageTextbooks":false}]
