[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2010-09-10 14:01:59","objective":"認識通俗科技文章及科技學術論文語法、文體、結構組織等特質，並探討技術報告及論文撰寫方式。\n本課程授課包括約三分之一的時間在語言教室練習職場英語。　　\n　　Course Description: 　　This course aims to prepare graduate level engineering-major students with sufficient repertoire of English for engineering at the level of workplace and academia. This present course content is threefold. Basic scientific paper writing, including its language, format, techniques, and style will be introduced. In addition, academic presentation trainings will be incorporated. Developing essential core content vocabulary and strategies for reading comprehension and content discussion is implemented through reading scientific and technical papers, reports and articles. 　　\nCourse Objective:　　At the successful conclusion of this course, students are expected to \n1)　　develop a substantial vocabulary repertoire for the “pan-engineering” disciplines and collations for research in English\n2)　　build solid skills of English writing in the context of science and technology for field reports as well as academic publications\n3)　　strengthen English oral language fluency for technical presentations\n4)　　consolidate content knowledge, field expertise, research capability, and English proficiency for career advancement \n","schedule":"TBD","scorePolicy":"Course Requirements:　　Students enrolled in this course will be required to:\n1)　　complete all readings assigned by the instructor and selected by students themselves \n2)　　select one scholarly paper or technical report to present in class \n3)　　participate in all in-class activities, including reading, writing, and speaking \n4)　　complete assigned exercise tasks \n5)　　use the service of writing consultation for paper editing both for drafts and final submission version *Writing consultation is provided by Media Center. Online reservation is open for all registered students of NTUT. \nAttendance:  Students are required to attend the class as scheduled and to arrive on time. Full attendance and punctuality are prioritized. \n 　　　　　　　　　　 1) Any AWOL will result in the penalty of 10% semester grade deduction.\n2) Penalty-waiver can be granted for any absence w/ official document at the instructor’s discretion. Should there be any major incidents and issues under extreme circumstances, special considerations will be given after thorough discussion with the student(s), and the class advisor(s), if necessary. \nEvaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their attendance, presentations, assignments and quizzes / exams. (*Note that the grading policy may be subject to change as the class proceeds.)\n(1)　　Attendance 30 %\n(2)　　Reading Assignment 30% \n(3)　　Presentations 20% \n(4)　　Term paper 20%\n","materials":"Engineering Workshop by Lindsay White. Oxford U. Press 2003","foreignLanguageTextbooks":false}]
