[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2010-09-01 17:42:46","objective":"以消費者為重心已蔚為目前市場行銷的重要潮流。了解消費者決策過程也成為行銷領域研究的主流。一般而言，消費者的購買決策制定過程決定產品與服務的購買結果，主要包括五個階段：(1)問題察覺、(2)資訊搜尋、(3)方案評估、(4)購買選擇、(5)購後過程。消費者的購買決策制定過程深受各種不同因素之影響。這些因素大抵可分為兩個類別：個人內在因素（知覺、資訊處理與學習、記憶、知識、動機與涉入、價值觀、自我與人格、生活形態、態度、與情感等）與環境因素（行銷環境、購買情境、文化、團體與人際影響、家庭等）。\n本課程主要目標在使學生了解消費者決策過程與相關心理學、社會學、行銷學與廣告學原理之間的關係。本課程強調如何藉由理論概念、實例討論與實作方式進一步了解消費者，並將此知識應用於行銷策略上。\n此外網際網路為一整合媒體,有別於傳統之行銷環境,在網際網路上消費者與媒體可以產生高度的互動,並且也可能產生虛擬經驗.本課程也從消費者行為理論出發,探討在網際網路環境下之消費者行為。課程以哈佛式個案討論為主。\n","schedule":"次　　     主題 Text Book　　內容與個案\n1(9/15)　　課程介紹\n2(9/22)　　中秋節　　放假\n3(9/29)　　消費者行為概論　　小組P1:Hoffman, D.L. and T. Novak (1996), ”Marketing in Hypermedia Computer-Mediated Environments: Conceptual Foundations,” Journal of Marketing, 60 (July), 50-68.\n4(10/6)　　Ch3-ch4消費者決策與購前行為　　哈佛商學院HBS Case1: IKEA\n請分析採購家俱的消費者行為,通常消費者會有哪些困難?\n家俱業者提供哪些服務來解決困難?\n分析美國的家俱市場\nIKEA提供給消費者什麼價值?商業模式為何?\nIKEA如何在美國拓展市場?\n5(10/13)　　Ch5-6 消費者購買與購後行為　　哈佛商學院HBS Case2: Starkbucks\n1.請解釋StarBucks在1990年成功的因素?在這段期間他所提供的顧客價值與品牌形象為何?\n2.為何StarBucks滿意度下滑?\n3.2002年的StarBucks與1990年的StarBucks有何不同?\n4.StarBucks應該要投資$40Million的labor提升方案嗎?\n6(10/20)　　Ch7 消費者人格　　哈佛商學院HBS Case3: Tivo in 2000\n1. Analyze the situation from the consumer's standpoint. What is TiVo? What factors facilitate its adoption? What factors make adoption difficult? Who is TiVo best suited for?\n2. Now adopt the standpoint of the networks, the advertisers, and the cable/satellite\ncompanies: what do they want TiVo to be? Thinking about the competition: What are Microsoft’s potential strengths and weaknesses in this market?\n3. How would you describe and characterize TiVo’s action plan as given at the end of the case? How do you evaluate the planned communication campaign? Does your situation analysis suggest an alternative plan?\n7(10/27)　　Ch8 消費者動機　　哈佛商學院HBS: Case4: Sony-Eyetoy\n1. Is EyeToy an important product for Sony? What role does EyeToy play within Sony Computer Entertainment Europe’s (SCEE) strategic objectives?\n2. Although sales figures for EyeToy Play have been impressive, those for EyeToy Groove have been disappointing. What are reasons for Play’s phenomenal success -- and Groove’s failure to emulate Play’s performance?\n3. If you were Phil Harrison, would you continue to invest in the development and marketing of EyeToy software? If so, how much? Why?\n4. What EyeToy software should Sony focus on in the coming years? Which of the concepts currently in the pipeline is the most attractive? More generally, what is the ideal EyeToy development pipeline? Why?\n5. What is the appropriate marketing strategy for EyeToy products? Specifically, how should Sony advertise, price, and bundle its new products? Why?\n8(11/3)　　Ch9 消費者態度\n哈佛商學院HBS: Case5:Omnitel Pronto Italia\n9(11/10)　　Ch13群體與個人影響　　Case1-5  review\n行銷巴菲特競賽11/15截止\n10(11/17)　　Ch14 進行接觸　　哈佛商學院HBS: Case6:Learning from LeapFrog\nQ1. LeapFrog’s business models: LeapFrog pursues two separate industry sectors, (consumer toys and educational technology) so it actually might described as having two distinct business models. How does the company balance these two models, and what challenges arise for the young firm in addressing them both?\nQ2. LeapFrog’s educational model: what is the relationship between the company’s educational approach and its business models? How has its educational approach influenced the company’s success in the markets it serves?\n11(11/24)　　Ch15 opinion　　哈佛商學院HBS: Case7:Wyndham International\nQ1. What is the value of a brand in the lodging industry?\nQ2. Does the Wyndham ByRequest initiative create competitive advantage? If so, is the advantage it creates significant? Is it sustainable? How easy or hard would it be to imitate the Wyndham ByRequest program?\nQ3. What is your evaluation of the Wyndham ByRequest program? What would you do if you were put in charge of the program?\n12(12/1)　　Ch16 memory　　哈佛商學院HBS: Case8: Colgate precision\nQ1. What changes are occurring in the toothbrush category? Assess Colgate-Palmolive’s competitive position.\nQ2. How is the toothbrush market segmented? Compare consumer behavior for toothbrushes and toothpaste.\nQ3. What are the arguments for launching Precision as (a) a niche product and\n13(12/8)　　Ch11culture　　哈佛商學院HBS Case9:","scorePolicy":"個案討論(40%)  個案心得報告(30%) 期末報告(30%)","materials":"課本:\nBlackwell, R. D., Miniard, P. W., and Engel, J. F. Consumer Behavior, 10th ed,白滌清編譯,華泰出版社, 02-2162-1217.\n哈佛商學院HBS Case(須購買版權)\nPaper(學校資料庫下載)\nPaper 3篇:分成三組報告,每組一篇\n個案討論: 共10個，所有同學需繳交10個心得(哈佛商學院HBS個案)報告，於當天上課時繳交\n哈佛商學院HBS case\n1.IKEA\n2.Starbucks\n3.Tivo in 2000\n4.Sony EyeToy\n5.Omnitel Pronto Italia\n6.Learning from LeapFrog\n7.Wyndham International\n8.Colgate Precision\n9. submarino.com\n10.Quicken Insurance\nTerm Project:\n參加:行銷巴菲特競賽\nhttp://www.credit.com.tw/newweb/schoolevent/text/resource.asp\n中華徵信所自1961年成立以來，致力於服務工商業界，提供最精闢、優質的徵信報告與商業資訊。五十年來，已成為國內最為聲譽卓著、形象專業的徵信公司。並自1980年起設立商情資料庫，提供龐大、完整的工商資訊網路資料庫。\n　　 2008年本公司舉辦第一屆的校園創意競賽，構想係來自於我們長期蒐集兩岸企業資料，堪稱國內最早從事數據資料庫的先驅機構，所累積之財經資料庫，亦廣為產官學界所採用。基於拓展數據資料庫的加值運用，應與學術資源相結合，因此決定廣發院校英雄帖，舉辦「資料加值誰最行」校園創意競賽；2009年在全球景氣大衰退的當下，中華徵信所則以「發掘台灣特色企業」作為第二屆競賽主題。該發想源於中華徵信所每年進行5000大企業調查時，蒐集到超過3000家非公開發行公司的財務營運資料，許多非公開發行公司營運出色，業績甚或經營績效超越上市櫃公司。他們打拼的成功模式非但值得被學界探討研究、讓其他中小企業學習、也值得媒體報導，同時由於這些優異的非公開發行企業也必然是上市櫃的候選企業，也更值得政府的重視。\n　　 鑑於前二屆校園創意競賽之舉行成果豐碩，獲得熱烈迴響。2010年則延續前兩屆之精神與目的，本次首度將主題擴大為『行銷巴菲特』，藉由將數據資料庫跨出財務金融框架，期吸引更多跨領域的優秀學子創意發揮，追求資料庫附加價值的提升，並藉此機會拔擢優秀人才，為產學界創造雙贏，以達創意商業化、人才產業化與資料庫應用推廣三大目標。\n題　　目：『行銷巴菲特』\n參賽者需利用中華徵信所資料庫品項：企業資料庫、產業資料庫、財務資料庫、名錄資料庫及大陸研究資料庫。參賽者必須從以上五樣產品選擇單一項目或多項組合，作品中必包含基礎4P及STP 概念並結合他項行銷手法將中華徵信所資料庫產品加以包裝及衍生。\n以隊為單位， 隊員人數4~5人 ／ 每隊需邀請一名指導教授， 指導作品方向\n報名事項：\n（1）報名期限自即日起至 2010年10月31日23：59止\n（2）作品上傳截止：2010年11月15日\n（3）以組為單位，一律採網路報名。\n（4）報名後E-MAIL通知資料庫使用帳號密碼。\n","foreignLanguageTextbooks":false}]
