[{"name":"溫琇玲","email":"wensl@ms9.hinet.net","latestUpdate":"2010-09-06 10:42:06","objective":"藉由本課程讓學生了解下列智慧建築之相關事項：\n1、智慧建築之發展及構成。\n2、自動化科技對建築物之影響與效益。\n3、資訊通信系統與網路技術在建築及工程上之運用。\n4、台灣地區智慧建築在實施過程中所面臨之問題與應注意之事項。\n5、智慧建築之系統整合與綜合佈線。\n6、智慧型建築之設施管理。\n7、智慧建築標章之評估指標。\n8、智慧建築之規劃設計與案例說明。\nTo provide students with the knowledge about intelligent buildings, the following topics are taught in this course:\n1.The development and composition of intelligent building\n2.Influence of automation technology on buildings\n3.Application of information communication system and internet technology on buildings\n4.Problems faced during the course of implementing intelligent building in Taiwan\n5.System integration and wiring for intelligent building\n6.Facilities management of intelligent building\n7.Planning, design, and case studies of intelligent building\n","schedule":"a.智慧建築概念說明\nb.說明本課程上課規定,上課內容,計分辦法","scorePolicy":"考試及成績計算方式\n1、出席考核與上課態度 30﹪\n2、期末報告與作業繳交 50﹪\n3、活動參与與互動學習 20﹪\n","materials":"a.上課用書\n授課老師編訂講義\n「建築物智慧化設計規範暨解說研訂」，溫琇玲等，內政部建築研究所，2000年。\n「智慧建築解說與評估手冊」，溫琇玲等，內政部建築研究所，2003年。\nb.參考書目\n1、田有松編譯，「智慧型大樓建築設備的自動控制」，中華水電空調雜誌社，1989年。\n2、田有松編譯，「智慧型大樓設計計劃指南」，中華水電空調雜誌社，1990年。\n3、許宗熙等，「智慧型建築指標基準及未來發展方向之研究」，內政部建築研究所，1991年。\n4、溫琇玲等，「智慧型建築自動化現況調查及分析研究」，內政部建築研究所，1991年。\n5、溫琇玲等，「智慧型辦公大樓自動化設備使用狀況評估及法令研修建議」，內政部建築研究所，1992年。\n6、「智慧型建築研討會論文集」，內政部建築研究所，1992年。\n7、蔡守智編著，「智慧型大樓入門」，詹氏書局，1993年。\n8、「邁向二十一世紀住宅之發展方向-住宅智慧化研討會論文集」，中國工商專科學校建築工程科，1994年。\n9、溫琇玲等，「智慧型公寓大廈自動化系統設計準則之研究」，內政部建築研究所，1995年。\n10、溫琇玲等，「智慧型建築管線空間標示系統之研究」，內政部建築研究所，1995年。\n11、華東建築設計學院編著，「智能建築設計技術」，同濟大學出版社，1996年。\n12、「邁向二十一世紀住宅之發展方向-1998住宅智慧化研討會論文集」，中華民國智慧型大樓系統協會，1998年。\n13、溫琇玲等，「建築物智慧化設計規範計解說研訂」，內政部建築研究所，2000年。\n14、洪慶雲、溫琇玲、張家銘，「智慧建築智慧化程度評量方法之研究」，淡江大學技術學院，亞太工程科技學報，第一卷第一期，第69-82頁，2002年5月。\n15、溫琇玲、林正昌，「智慧型辦公建築室內環境監控設備使用現況調查」，第十四屆建築研究成果發表會論文集，台北，第E37-1~4頁，2002年11月。\n16、吳滋聖、溫琇玲，「判別分析應用於建築物智慧化影響因素分析之可行性研究」，第十四屆建築研究成果發表會論文集，台北，第E38-1~4頁，2002年11月。\n17、劉俊伸、溫琇玲，「家庭網路在居住環境內之需求調查研究」，中華民國都市計劃學會、區域科學學會、住宅學會、地區發展學會二00三聯合年會暨論文研討會論文集，台北，2003年12月。\n18、溫琇玲、溫秀如、黃國書，「自動讀錶系統在智慧型建築之能源監測應用」，第十六屆建築研究成果發表會論文集，台北，第97-102頁，2004年。\n19、溫琇玲、陳素貞，「智慧型辦公大樓發包方式與預算科目之研究」，第十六屆建築研究成果發表會論文集，台北，第103-108頁，2004年。\n20、溫琇玲等，「「智慧建築標章」作業要點暨評估系統之建立」，內政部建築研究所，2002年。\n21、溫琇玲等，「智慧建築標章解說與評估手冊」，內政部建築研究所，2003。\n22、溫琇玲等，「數位化水、電及瓦斯自動讀錶系統在建築物能源監測之應用與推動辦法之研擬」，內政部建築研究所，2004年。\n23、溫琇玲等，「智慧化建築設計手冊之編訂」，內政部建築研究所，2004年。\n24、「インテリジェントビルの計畫と實務」，日本建築センタ-編，株式會社ぎょうせい，1989年。\n25、「インテリジェントビルの活用と展開」，日本建築センタ-編，株式會社ぎょうせい，1990年。\n26、Brian Atkin, (1988), Intelligent Buildings:/Applications of IT and building Automation to High Technology Construction Projects, J. Wiley Publishers.\n27、Hwa-Tung Institute of Architectural Design (1996), Design Technology for Intelligent Buildings, Edited by Bo-Chau Wen, Published by Tung-Ji University Press. (in Chinese)\n28、Andrew Harrison, Eric Loe and James Read (1998), Intelligent Buildings in South East Asia, Published by Spon.\n29、So, Albert T. and Chan, W. L. (1999), Intelligent Building Systems, Kluwer Academic Publishers.\n30、Kua, H. W. and Lee, S. E. (2002), “Demonstration Intelligent Building – A Methodology for the Promotion of Total Sustainability in the Built Environment”, Building and Environment, No. 37.\n","foreignLanguageTextbooks":false}]
