[{"name":"陳雅玫","email":"ymchen@ntut.edu.tw","latestUpdate":"2010-08-30 15:10:44","objective":"This course aims to introduce the “globalization turn” and “sociological turn” in translation studies after the 1990s. An exploration will also be made into their possible implications for translation practice and the translator’s qualifications. Translation issues to be addressed may include the following: (1) the globalization turn – the tension between globalization and localization, cultural identity, power relations, the translator’s mediation, technology and translation, community translation and fansubbing; (2) the sociological turn – social factors of translation (e.g. social constraints and mechanisms), social aspects of the translator’s profession (e.g. the translator’s role, habitus and network), and the sociology of the translating process (e.g. quality control, revision and team translation). Through concrete examples of authentic translations, this course will enable students to better understand how the new trends in translation studies can guide translation practice, and lead students to rethink the translator’s professional qualifications. Also included in the course are practical English&lt;-&gt;Chinese translation exercises and translation commentaries, which can assist students in keeping abreast with the new trends and formulating appropriate translation strategies.","schedule":"Week 1: introduction\nWeek 2: an overview of the “globalization turn” and “sociological turn” in translation studies\nWeek 3: the impact of globalization on translation (1) \nWeek 4: the impact of globalization on translation (2) \nWeek 5: user-generated translation and community translation \nWeek 6: fan-subbing\nWeek 7: localization \nWeek 8: globalization and the translation of tourist materials, ads and news texts\nWeek 9: globalization and cultural identity\nWeek 10: meeting with the instructor (term paper topics)\nWeek 11: questions and issues in the sociology of translation \nWeek 12: constraints, norms and translators\nWeek 13: translation agents and network\nWeek 14: Bourdieu and the Sociology of Translation\nWeek 15: cultural translation (1) \nWeek 16: cultural translation (2)\nWeek 17: paper presentation\nWeek 18: term paper due\n","scorePolicy":"1. attendance &amp; participation: 15%\n2. oral presentation: 20%\n3. translation and commentary: 25%\n4. term paper (including paper presentation and final written paper): 40% \n","materials":"　","foreignLanguageTextbooks":false}]
