[{"name":"陳建丞","email":"ccchen@ntut.edu.tw","latestUpdate":"2010-08-21 21:19:06","objective":"本課程介紹許多有關於組織中的個人、團隊與組織交互作用的研究。明確地說，本課程內容主要在探討如何改善員工績效與利社會行為，降低缺勤與離職率，以及提高工作滿足與組織承諾等員工態度。","schedule":"1.　　課程簡介與學期報告格式介紹\n2.　　組織管理研究法簡介\nI.　　老師講義\n3.　　工作表現理論\nI.　　【文章】Borman, W. C., &amp; Motowidlo, S. J. (1993). Expanding the criterion domain to include elements of contextual performance. In W. Borman &amp; N. Schmitt (Eds.), Personnel selection in organizations (pp. 71-98). San Francisco, CA: Jossey-Bass.\n4.　　組織公民行為\nI.　　【實證】Farh, J. L., Zhong, C. B., &amp; Organ, D. W. (2004). Organizational citizenship behavior in the People’s Republic of China. Organization Science, 15, 241-253.\n5.　　職場的偏差行為\nI.　　【實證】Robinson, S. L., &amp; O’Leary-Kelly, A. M. (1998). Monkey see, monkey do: The influence of work groups on the antisocial behavior of employees. Academy of Management Journal, 41, 658-672.\n6.　　人格特質與能力\nI.　　【文章】G &amp; J: Ch2 (Individual differences: Personality and ability)\nII.　　【實證】Barrick, M. R., &amp; Mount, M. K. (1993). Autonomy as a moderator of the relationships between the big five personality dimensions and job performance. Journal of Applied Psychology, 78, 111-118.\n7.　　知覺與學習\nI.　　【文章】G &amp; B: Ch2 (Perception and learning: Understanding…)\n8.　　工作動機\nI.　　【文章】G &amp; B: Ch4 (Motivation in organizations)\n9.　　工作態度\nI.　　【文章】R &amp; J: Ch3 (Attitudes and job satisfaction)\nII.　　【實證】Chen, Z. X., Tsui, A. S., &amp; Farh, J. L. (2002), Loyalty to supervisor vs. organizational commitment: Relationships to employee performance in China. Journal of Occupational and Organizational Psychology, 75, 339-356.\n10.　　組織中的社會交換：LMX, Guanxi, and POS\nI.　　【實證】　　Law, K. S., Wong, C. S., Wang, D., &amp; Wang, L. (2000). Effect of supervisor–subordinate guanxi on supervisory decisions in China: an empirical investigation. International Journal of Human Resource Management, 11, 751-765.\nII.　　【實證】　　陳建丞 (2008)。員工知覺組織支持與工作績效間之中介模型研究。管理學報，25(3)，309-331。\n11.　　組織中的正義知覺\nI.　　【實證】　　Roch, S. G., &amp; Shanock, L. R. (2006). Organizational justice in an exchange framework: Clarifying Organizational Justice Distinctions. Journal of Management, 32, 299-322.\n12.　　轉換型領導與家長式領導\nI.　　【實證】Cheng, B. S., Chou, L. F., Wu, T. Y., Huang, M. P., &amp; Farh, J. L. (2004). Paternalistic leadership and subordinate reverence: Establishing a leadership model in Chinese organization. Asian Journal of Social Psychology, 7, 89-117. (中文版)\n13.　　情感；Happy Worker = Productive Worker?\nI.　　【實證】Tsai, W. C., Chen, C. C., &amp; Liu, H. L. (2007). Test of a model linking employee positive moods and task performance. Journal of Applied Psychology, 92, 1570-1583.\n14.　　情感與決策之間的關係\nI.　　【實證】Chen, C. C., Yang, I. W. F., &amp; Lin, W. C. (Accepted). Applicant impression management in job interview: The moderating role of interviewer affectivity. Journal of Occupational and Organizational Psychology.\n15.　　團隊情感氛圍 (group affective tone)\nI.　　【實證】蔡維奇、紀乃文 (2008)。團隊情感氛圍形成的前因、情境調節、及個人層次後果變項之研究。組織與管理，1，1-37.\n16.　　員工情緒表達\nI.　　【文章】Rafaeli, A., &amp; Sutton, R. I. (1991). Expression of emotion as part of the work role. Academy of Management Review, 12, 23-37.\nII.　　【實證】Tsai, W. C., &amp; Huang, Y. M. (2002). Mechanisms linking employee affective delivery and customer behavioral intentions. Journal of Applied Psychology, 87, 1001-1008.\n17.　　組織行為與服務品質的連結\nI.　　【文章】Morrison, E. W. (1996). Organizational citizenship behavior as a critical link between HRM practices and service quality. Human Resource Management, 35, 493-512.\n18.　　期末報告繳交\n","scorePolicy":"授課方式與課程要求：\n**上課方式以同學報告、帶領討論為主，老師講授為輔。每次上課大多有安排課本內文與英文文獻導讀，由同學負責導讀。導讀請控制在20~30分鐘，而開放討論時間大約是20分鐘。值得注意的是，導讀的同學必須提出至少五個讓你印象深刻的段落，例如你覺得這一段講得很有趣、你很想深入研究、對實務很重要、寫作寫得很棒，或者剛好相反，你覺得這一段講得不太好，有甚麼缺點等等。其他同學皆有義務加入討論，每位同學在每一次上課都必須至少發言一次，否則將可能影響學期成績。\n**期末研究報告採分組的形式，每組2~3人，須打字，內文字體以12pt為限，單行間距，頁數至少10頁，詳細內容如下：每組同學先選定組織行為課程中的某一重要理論(例如期望理論、目標設定、員工情感等)，而後再選擇適當對象，以問卷或訪談方式收集資料，以驗證課本所學理論是否與組織實務相符。內容須包括：(1)理論介紹；(2)研究方法(樣本簡介、研究流程、問卷出處與題項等)；(3)統計結果；(4)結論與建議(比較分析結果與理論之異同，實務意涵、研究限制等)；(5)附錄（問卷、訪談問與答）。\n成績評量：\n**課堂導讀                                     30%\n**期末報告                                     40%\n**課堂參與(提問題、參與討論與出席狀況等)       30%","materials":"1.　　Greenberg, J., &amp; Baron, R. A. (1995). Behavior in organizations: understanding &amp; managing the human side of work. London : Prentice-Hall International.\n2.　　George, J. M., &amp; Jones. G. R. (2002). Organizational behavior. New Jersey: Prentice Hall.\n3.　　Robbins, S. P., &amp; Judge, T. A. (2009). Organizational behavior. New Jersey: Pearson Prentice Hall.\n以及十幾篇英文期刊文章\n","foreignLanguageTextbooks":false}]
