[{"name":"王維周","email":"remi.wang2@gmail.com","latestUpdate":"2013-07-15 10:44:22","objective":"在人類文明發展的進程上，曾經不斷地擴張其生存領域，並且在掠奪來的領土或是無人居住的地區興建過全新的城市，這些新興的城市，可能被稱為計畫城市或是殖民城市，與自然生成並且具備風土性格的城市在其空間屬性上有著極大的差異，因而殖民城市研究也有這完全不同的論述方法，在其建築的相關討論上亦然。\n為了更清楚地瞭解今日我們所存在的世界以及其空間環境，本課程將針對十五世紀以後大航海時期歐洲人進入到非洲、美洲、亞洲海域及陸地，開始了殖民地的新生活，並且開始了以殖民為主要需求的城市規劃，同時投射了其心中的理想城市，以及在歷史過程中的整體實踐，並帶入歐洲的建築思考與營建文明，本課程將探討相關城市與建築的現象。","schedule":"第1週　　9/17　　  課程簡介 – 課程大綱與參考書目介紹\n第2週　　9/24　　  中世紀的文明技術發展與地理概念\n第3週　　10/1　　  航海探險與殖民城市的建立\n第4週　　10/8　　  全球殖民經濟系統的建立\n第5週　　10/15 殖民地的經營與建城策略\n第6週　　10/22 亞洲殖民城市\n第7週　　10/29 澳門 Macao\n第8週　　11/5　　  東北都市計畫\n第9週　　11/12 期中考週\n第10週　　11/19 法屬印度支那 I\n第11週　　11/26 法屬印度支那 II\n第12週　　12/3　　  卡薩布蘭加 Casa Blanca\n第13週　　12/10 彭蒂茄利 Pondicherry\n第14週　　12/17 開羅及中美洲\n第15週　　12/24 台灣 I\n第16週　　12/31 台灣 II\n第17週　　1/7　　  期末報告\n第18週　　1/14　　  期末考週　　繳交期末報告","scorePolicy":"上課參與與討論  60%\n作業   40%","materials":"黃武達，1996，《台灣近代都市計畫之研究》，論文集(1)，台灣都市史研究室。\n黃武達，1996，《台灣近代都市計畫之研究》，論文集(2)，台灣都市史研究室。\n黃武達，1997，《日治時代台北市之近代都市計畫》，台灣都市史研究室。\n黃武達，1997，《日治時代台灣都市計畫歷程基本史料之調查與研究》，台灣都市史研究室。\n黃武達，2000，《日治時代台灣都市計畫歷程之建構》，台灣都市史研究室。\n陳正哲，1998，《日治時期台灣地震災害對建築與都市發展影響之研究》，中原大學碩士學位論文。\n越澤明，1986，黃世孟譯，《中國東北都市計畫史》，1982年東京大學博士論文，大佳出版社。\n盧建銘，1995，《越南法屬時期河內的都市經營策略》，中原大學碩士學位論文。\n江樹生譯注，1999，《熱蘭遮城日誌》第一冊，原文《De Dagregisters Van Het Kasteel Zeelandia, Taiwan, 1629-1662，deel I 1629-1641》，台南市政府。\n《澳門四百年城市建築遺產 - 特輯之一及之二》，1998，文化雜誌第卅五、卅六、卅七期，澳門文化司署出版。\n村松伸，徐蘇斌、蘇睿弼合譯，《亞洲摩登城市》，台北市，創興出版社。\nMILTON, Giles，王國璋譯，《荳蔻的故事 – 香料如何改變世界歷史 ?》(Nathaniel’s Nutmeg – How one man’s courage changed the coure of history)，2001.3，究竟出版社。\nSEVERIN, Tim，廖素珊譯，《香料群島之旅 – 追尋「天擇論」幕後英雄華萊士》(The Spice Islands Voyage – in search of Wallace)，1999.7.10，馬可孛羅文化。\nD.R. SarDesai，蔡百銓譯，《東南亞史》【上】(Southeast Asia : Past and Present)，2001.2.22，麥田出版社。\n\nARNAUD, Jean-Luc, Le Caire – mise en place d’une ville moderne 1867-1907, 1998, Actes Sud.\nAtelier parisien d’urbanisme, Phnom Penh – developpement urbain et patrimoine, Departement des affaires internationales, Ministere de la Culture, 1997, Paris.\nBENEVOLO, Leonardo, Histoire de la ville, Paris, 1994, editions Parentheses.\nBENEVOLO, Leonardo, Histoire de l’architecture moderne 1-4, Paris, 1998, editions Dunod.\nBENJAMIN, Walter, Paris, capitale du XIXe siecle, 1989, les editions du Cerf.\nBURNHAM, Daniel H., BENNETT, Edward H., Plan of Chicago, New York, 1993, Princeton Architectural Press.\nCLEMENT, Pierre &amp; Sophie, GOLDBLUM, Charles, sous la direction de, Cite d’Asie, Les cahiers de la recherche architecturale 35/36, Paris,1995, editions Parentheses.\nCLEMENT, Pierre, LANCRET, Nathalie, sous la direction de, Hanoi – le cycle des metamorphoses, formes architecturales et urbaines, Paris,2001, editions Recherche/IPRAUS.\nCOHEN, Jean-Louis, ELEB, Monique, Casablanca – mythe et figures d’unbe aventure urbaine, Paris, Hazan.\nFOURNIAU, Charles, Vietnam, domination coloniale et reistance nationale, 1858-1914, Paris, 2002, Les Indes Savantes.\nKING, Anthony D., Urbanism, Colonialism, and the world economy, cultural and spatial founbdations of ths world urban system, 1990, London, Routledge.\nLE BRUSQ, Arnauld, DE SELVA, Leonard, Vietnam a travers l’architecture coloniale, 1999, Patrimoines et Medias, Editions de l’Amateur.\nLORTIE, Andre, sous la direction de, Paris s’exporte – architecture modele ou modeles d’architectures, 1995, editions du Pavillon de l’Arsenal, Paris, Picard editeur.\nMALVERTI, Xavier, PICARD, Aleth, collection dirigee par, La ville reguliere – modeles et traces, Paris, 1997, Picard editeur.\nMALVERTI, Xavier, PICARD, Aleth, sous la direction de, La fabrication des villes, Grenoble, 1995, Ecole d’architecture de Grenoble.\nRABINOW, Paul, French Modern – norms and forms of the social environment, Chicago, 1995, the University of Chicago Press.\nREID, Anthony, Southeast Asia in the Age of Commerce 1450-1680 volume one : The Lands below the Winds, 1988, Yale University Press.\nRONCAYOLO, Marcel, PAQUOT, Thierry, sous la direction de, Villes et civilisation urbaine, XVIIIe-XXe siecle, Paris; 1992, Larousse.\nTAFURI, Manfredo, DAL CO, Francesco, Modern Architecture 1/2, 1986, New York, Electa/Rizzoli.\nTARLING, Nicolas, The Cambridge Hisotry of Southeast Asia – volume one part one : from early time to c.1500, 1992, Cambridge University Press.\nTARLING, Nicolas, The Cambridge Hisotry of Southeast Asia – volume one part two : from c.1500 to c.1800, 1992, Cambridge University Press.\nWANG, W","foreignLanguageTextbooks":false}]
