[{"name":"賀一平","email":"ipho@ntut.edu.tw","latestUpdate":"2008-02-19 21:01:10","objective":"Issues and topics discussed include: legalizing drugs, designer babies, cloning,  sexual harassment, and gun control.\nThe young adult novels used for common readings are: The Giver;Tuck Everlasting; The Lion, the Witch,  and the Wardrobe; A Wrinkle in Time; Ella Enchanted\n","schedule":"Topics and themes for study and discussion\n1st week: Orientation; Oral presentation on the winter vacation reading assignment--a self-chosen young adult or children's novel\n2nd week: Oral presentation on the winter vacation reading assignment--a self-chosen young adult or children's novel\n3rd week: Cheating on your partner; Cyber cheating\n4th week: Old enough to be her grandfather; The Giver\n5th week: Big Brother is watching\n6th week: Designer babies; Whose child\n7th week: Cloning; Group discussion on The Giver\n8th week: Oral presentation on The Giver; Submission of journal entries\n9th week:  Zodiac signs\n10th week: Zodiac signs; the art of palmistry\n11th week: sexual harassment\n12th week: Sexual harassment\nGroup discussion: Tuck Everlasting; The Lion, the Witch,  and the Wardrobe; A Wrinkle in Time; Ella Enchanted\n13th week: Oral Presentations: Tuck Everlasting; The Lion, the Witch, and the Wardrobe; A Wrinkle in Time; Ella Enchanted\n14th week: legalizing drugs; Time to submit your journal entry\n15th week: gun control\n16th week: You won the lottery\n17th week: TV or not TV\n18th week: Oral presentations: The fourth young adult novel--a self-chosen one; Time to submit your portfolio containing all your journal entries and your final reflective paper for this course.","scorePolicy":"Evaluation\nDramatics, Oral Presentations, and Final Oral Test: 50%\nResponse and reflection Journal Entries:50%\n","materials":"MacAndrew, R., &amp; Matinex, R. (2002). Taboos and issues. Thomson/Heine.\nThe Giver (common reading for all students)\nChoosing one of the following to read as common reading: Tuck Everlasting; The Lion, the Witch,  and the Wardrobe; A Wrinkle in Time; Ella Enchanted\n","foreignLanguageTextbooks":false}]
