[{"name":"謝佳玲","email":"clhsieh@ntut.edu.tw","latestUpdate":"2008-03-20 21:46:12","objective":"本課程設計重點有三：(1)藉由精選的中級程度教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)透過練習加強聽、說、讀、寫的知能及表達。","schedule":"1　　02/19　　 Introduction\n2　　02/26　　 March 1\n3　　03/04　　 March 1\n4　　03/11　　 March 2\n5　　03/18　　 March 3\n6　　03/25　　 March 3\n7　　04/01　　 March 4\n8　　04/08　　 March 4\n9　　04/15　　 Joint exam\n10　　04/22　　 May 1\n11　　04/29　　 May 1\n12　　05/06　　 May 1\n13　　05/13　　 May 2\n14　　05/20　　 May 2\n15　　05/27　　 May 3\n16　　06/03　　 May 3\n17　　06/10　　 May 4\n18　　06/17　　 Joint exam","scorePolicy":"1. Participation (10%)\n(a) TWO POINTS will be taken off of your final grade for each hour of absence. Do not be absent for more than TEN HOURS, or you will fail this course.\n(b) If you are absent in case of uncontrollable situations (e.g. illness, emergency and important occasions), you need to submit a FORMAL PROOF (a leave permit or the health insurance card with correct stamp of date) within ONE WEEK. DO NOT send it through e-mail. If no formal proof is available, you need to typewrite one IN ENGLISH, with at least 300 words stating why you were absent.\n2. Tests (60%) and joint exams (30%\n(a) Cheating on the exam is forbidden. If caught cheating, you will fail the exam and even the course.\n(b) There will be no make-up exam unless you have valid and official reasons for absence in advance.\n","materials":"Websites\n(a) http://www.ntut.edu.tw/~clhsieh\nThe instructor Chia-Ling Hsieh’s website.\n(b) http://elearning.ntut.edu.tw\nClass announcement.\n(c) http://www.ntut.edu.tw/~wwwmedia/eng\nQuality English learning and testing websites.\n(d) http://www.ntut.edu.tw/~wwwmedia/exam\nOnline registration for free NTUT English Joint Exam consultation.\n(e) http://www.ntut.edu.tw/~wwwmedia/contest\nOnline registration for English speech and reading/writing contests.\n(f) http://www.ntut.edu.tw/~wwwmedia/ept\nOnline registration for free English proficiency test.\n(g) http://www.ntut.edu.tw/~wwwmedia/consult\nOnline registration for free English writing consultation.","foreignLanguageTextbooks":false}]
