[{"name":"謝佳玲","email":"clhsieh@ntut.edu.tw","latestUpdate":"2008-03-20 21:44:20","objective":"This course provides an introduction to the study of sentence structures. It directs students to progress to a deeper understanding of grammatical constructions, including various descriptive and theoretical approaches to representing them. By the end of this course, students will have\n1. become familiar with the core concepts of syntax, such as grammaticality, grammatical categories (e.g. nouns, verbs, adverbs, and prepositions), grammatical relations (e.g. subjects, objects, and adjuncts), constituent structures (e.g. heads, complements, and specifiers), semantic roles (e.g. agent, themes, and experiencers), and movement operations (e.g. interrogation and passivization).\n2. developed an ability to analyze the primary sentence structures of English, such as finite and non-finite clauses, simple, compound, and complex sentences, active and passive voices, declarative, imperative, interrogative, and exclamative sentence types, and embedded clauses belonging to distinct grammatical categories (e.g. nominal clauses, adjectival clauses, and adverbial clauses).\n3. been introduced contemporary syntactic theories (mainly within the framework of Generative Grammar) and the basics of linguistic argumentation.\n4. demonstrated the above knowledge and skills through analyses of linguistic data.\n","schedule":"02/21　　Introduction\n02/28　　Holliday\n03/06　　Book 1: Syntax (1)\n03/13　　Book 1: Syntax (2)\n03/20　　Book 1: Syntax (3)\n03/27　　Book 2: Chapter 1-2\n04/03　　No class\n04/10　　Book 2: Chapter 3\n04/17　　Midterm Exam\n04/24　　Book 2: Chapter 4\n05/01　　Book 2: Chapter 5\n05/08　　Book 2: Chapter 6\n05/15　　Book 2: Chapter 7\n05/22　　Book 2: Chapter 7\n05/29　　Book 2: Chapter 8\n06/05　　Book 2: Chapter 9\n06/12　　Book 2: Chapter 9\n06/19　　Final Exam\n","scorePolicy":"1. Assignment\n2. Oral presentation\n3. Midterm and Final exams","materials":"1. Fromkin, Victoria and Robert Rodman. 2003. An Introduction to Language. (7th ed.). Orlando, Florida: Harcourt Brace College Publishers.\n2. Aarts, Bas. 2001. English Syntax and Argumentation. 2nd ed. New York: PALGRAVE.\n","foreignLanguageTextbooks":false}]
