[{"name":"王順源","email":"sywang@ntut.edu.tw","latestUpdate":"2008-02-15 16:35:07","objective":"1  Past, present, and future of electrical machines and variable-speed drives\n \n2  General aspects of the application of artificial intelligence in variable-speed drives\n \n3  Conventional, fuzzy, neural, and fuzzy-neural function approximators\n \n4  Artificial-intelligence-based steady-state and transient analysis of d.c. machines, estimators, control\n \n5  Artificial-intelligence-based steady-state and transient analysis of induction machines, estimators, control, design, condition monitoring,and diagnosis\n  \n6  Artificial-intelligence-based  steady-state and transient analysis of synchronous machines, estimators, control, design, condition monitoring, and diagnosis","schedule":"週次        課程內容                                 備註\n第一週   Past, present, and future of electrical machines and  variable-speed drives\n \n第二週   Past, present, and future of electrical machines and  variable-speed drives\n \n第三週   General aspects of the application of artificial intelligence in variable-speed drives\n \n第四週   General aspects of the application of artificial intelligence in variable-speed drives\n \n第五週   Conventional, fuzzy, neural, and fuzzy-neural function approximators\n\n第六週   Conventional, fuzzy, neural, and fuzzy-neural function approximators\n\n第七週   Conventional, fuzzy, neural, and fuzzy-neural function approximators\n\n第八週   Artificial-intelligence-based steady-state and transient analysis of d.c. machines, estimators, control\n\n第九週   期中考\n\n第十週   Artificial-intelligence-based steady-state and transient analysis of d.c. machines, estimators, control\n \n第十一週 Artificial-intelligence-based steady-state and transient analysis of d.c. machines, estimators, control\n\n第十二週 Artificial-intelligence-based steady-state and transient analysis of induction machines, estimators, control, design, condition monitoring,and diagnosis\n\n第十三週 Artificial-intelligence-based steady-state and transient analysis of induction machines, estimators, control, design, condition monitoring,and diagnosis\n\n第十四週 Artificial-intelligence-based steady-state and transient analysis of induction machines, estimators, control, design, condition monitoring,and diagnosis\n\n第十五週 Artificial-intelligence-based  steady-state and transient analysis of synchronous machines, estimators, control, design, condition monitoring, and diagnosis\n\n第十六週 Artificial-intelligence-based  steady-state and transient analysis of synchronous machines, estimators, control, design, condition monitoring, and diagnosis\n\n第十七週 Artificial-intelligence-based  steady-state and transient analysis of synchronous machines, estimators, control, design, condition monitoring, and diagnosis\n\n第十八週 期末考","scorePolicy":"期中考 30%\n期末考 30%\n作業報告及平時分數 40%\n","materials":"　","foreignLanguageTextbooks":false}]
