[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2008-03-15 20:02:10","objective":"社區是人類生存與生活最重要的聚落，是建立在自然環境、經濟發展、社會福利、公共政策、文化習俗、生產技術、土地資源分派以及都市發展等諸多因素的互動關係上，且基於居民的需求與願景，經由參與、協商、規劃、設計、施工、居住者的使用與維護管理等過程，才能將「空間」呈現在整體環境中並發揮其應有的功能。因此「社區」往往被視為特定地理範圍內居民的社會互動、歸屬與認同感，而成為居民實現自我與促成社會變革的基地。是以，社區規劃問題與理論的探討及社區環境的規劃設計實已包含了都市實質空間規劃與社區發展之人文範疇，常成為跨領域的研究課題，需以「科際整合」的觀點切入尋求對策。\n在美國及聯合國的支持下，社區發展於1950年代迅速擴張亞、菲、中南美洲；於此風潮下，台灣亦於1965年正式訂頒「都市社區發展工作指導綱要」辦理社區發展工作，由當時偏重政府社政部門主導的修築社區道路、溝渠、圍牆等基層建設，及至近幾年來轉由空間規劃與文化建設部門運籌並受到許多學術研究者、實務界及行政人員、甚至居住者本身的重視與熱心投入的社區實質空間營造、特有風貌呈現與地區經營議題而興起的社區營造運動，已有四十年的實施經驗。回顧這些實踐經驗與展望新時勢下的發展，對於從學術象牙塔走向真實社會的空間規劃專業者以及滿懷理想與熱忱的同學而言，如何剝析與擷取過往經驗，認清理論建構之陷阱與豐富空間規劃知識、凝聚社會共識之積極途徑，為本課程主要探討之內容。因此，本課程除了講授一般理論之外，亦從居住者之生活型態與居住行為、社區空間配置與形式、社區結構關係與營造等觀點就社區生活環境、規劃設計、使用方式與公共安全之維護管理作綜合性的探討。此外並探究國內外社區案例汲取經驗，選擇國內社區進行實例參觀、調查與討論，以提供同學對社區規劃之生活空間的營造，及未來從事空間規劃專業者角色的應有調適，有較完整的認知。\n","schedule":"（一）近代社區發展與規劃歷史回顧(Community Development and Planning)\n（二）都市與永續性(Sustainability)：環境的思索、永續都市\n（三）永續都市的規劃：地區環境行動計畫擬定、運作\n（四）永續都市的經營管理(Management)：經營管理模式、執行與新挑戰\n（五）都市住居、鄰里與社區(Dwelling, Neighborhood, Community)\n（六）城市、都會與未來花園城市(City, Metropolis, Garden City 21)\n（七）社區行動規劃應用理論(Community Action Planning)\n（八）社區工程與都市規劃\n（九）　　社區規劃教育與理論\n（十）　　社區照顧(Community Care)：理念、社會網絡與社會工作\n（十一）　　社區之維護管理與安全\n（十二）　　社區參觀研習\n（十三）　　社區設計(Community by Design)\n（十四）　　邁向新都市主義社區建築(The New Urbanism: Toward an Architecture of Community)\n（十五）　　學生研究報告或閱讀心得報告\n","scorePolicy":"（一）上課互動情形（30%）：閱讀主要的參考文獻、上課聽講、參與課堂討論\n（二）課堂報告（30%）：就各人所選的主題進行文獻閱讀或專題研究，並作二次課堂報告\n（三）學期報告（40%）：製作並撰寫兩次國內外社區規劃實例，報告內容需包括課堂報告後師生所提意見，修撰完稿之規劃實例報告\n","materials":"1.Wates, N. (1999) The Community Planning Handbook, Earthscan, London.\n2.Barton, H. et al. (2003) Shaping Neighborhoods: a Guide for Health, Sustainability and Vitality, Spon Press, London.\n3.Hall, K.B. et al. (2001) Community by Design: New Urbanism for Suburbs and Small Communities, McGraw-Hill, London,\n4.Dundee City Council, (2001) Dundee in Partnership: the Community Plan for Dundee 2001-2006, Dundee.\n5.London Borough of Tower Hamlets, (2001) The Community Plan 2002/03, Tower Hamlets\n6.Foster, S., (2002) Visioning Riverside: a Report from the Community, Riverside.\n7.Katz, P. (1994) The New Urbanism: Toward an Architecture of Community, McGraw-Hill, London.\n8.Hamdi, N. et al. (1997) Action Planning for Cities: A Guide to Community Practice, Wiley.（有中譯本）\n9.Leitmann, J. (2001) Sustaining Cities: Environmental Planning and Management in Urban Design, McGraw-Hill, London.（有中譯本）\n10.Simonds, J. O. (1994) Garden Cities 21: Creating a Livable Urban Environment, McGraw-Hill, London.（有中譯本）\n11.吳剛立、李麗雪譯，永續都市：都市設計之環境管理，六合，九十一年 (Leitmann, J., Sustaining Cities: Environmental Planning and Management in Urban Design, McGraw-Hill, London, 2001)\n12.Simonds, J. O., Garden Cities 21: Creating A Livable Urban Environment, McGraw-Hill, London, 1994 （有中譯）\n13.Hamdi, N. &amp; Goethert, R., Action Planning for Cities: A Guide to Community Practice, Wiley, 1997（有中譯）\n14.Hall, K.B., &amp; Porterfield, G.A., Community by Design: New Urbanism for Suburbs and Small Communities, McGraw-Hill, London, 2001\n15.Katz, P., The New Urbanism: Toward an Architecture of Community, McGraw-Hill, London, 1994\n16.Bruton, M. and Nicholson, D. (1990) Local Planning in Practice, Stanley Thornes, Cheltenham\n17.Cohen, N., (1999) Urban Conservation, MIT, Massachusetts\n18.Devas, N., Rakodi, C. (1993) Managing Fast Growing Cities: New Approaches to Urban Planning And Management in The Developing World, Longman, New York\n19.Haughton, G. &amp; Hunter, C., (1994) Sustainable Cities, RSA, London\n20.Herington, J., (1989) Planning Process: An Introduction for Geographers, Cambridge University Press, Cambridge\n21.黃源協，社區照顧：台灣與英國經驗的檢視(Community Care: Reviewing Experiences of Taiwan and Britain)，揚智，八十九年\n22.王明蘅，住宅社區規劃設計準則之研究，營建署，八十六年\n23.謝慶達，戰後台灣社區發展運動之歷史分析，台大城鄉所博論， 八十四年\n24.文崇一，台灣的社區權力結構，東大，七十八年\n25.李永展，永續發展：大地反撲的省思，巨流，八十八年\n26.中國地政研究所，生態鄉街規劃：以台北縣深坑鄉為例，住都處，八十七年\n27.謝慶達譯，社區建築（Community Architecture: How People are Creating Their Own Environment）八十三年\n28.謝慶達譯，伙伴（Partners）鄰里-公司合作模式的社區復甦實例，創興，八十七年\n29.黃世孟，國民學校與鄰近社區資源共享模式之研究，建研所，八十五年\n30.專業者都市改革組織，台灣地區住宅社區環境問題與改善策略之研究，營建署，八十二年\n31.王惠君譯，故鄉魅力俱樂部，源流，八十六年\n32.施鴻志編著，地區經營管理，建都文化，八十九年\n33.莊翰華，都市行銷理論與實務，建都文化，八十七年\n34.莊翰華，都市財政理論與實務，建都文化，八十六年\n35.馮正民、林楨家，都市及區域分析方法，建都文化，八十九年\n36.另有各機關研究或技術報告多種\n","foreignLanguageTextbooks":false}]
