[{"name":"陳英一","email":"ichen@ntut.edu.tw","latestUpdate":"2008-06-03 11:11:12","objective":"本課程針對網際服務應用軟體(Web-based Applications)特性，透過原理與實作的結合，引導學生有效統合軟體工程原理、觀念、方法、與技術，以建立網際服務軟體工程程序(Web-based software engineering process)，開發高品質網際服務軟體。課程內容包括下列主題：\n一、網際服務軟體工程概論\n二、網際服務應用系統架構\n三、網際服務軟體開發程序\n四、網際服務軟體程序框架\n五、網際服務系統規劃與分析\n六、網際服務軟體設計\n七、網際服務軟體測試\n八、網際服務軟體管理\n九、元件式網際服務應用軟體開發\n十、服務導向式網際服務應用軟體開發","schedule":"1. 2/19 SOA Overview\n2. 2/26 WebSphere Integration Developer\n3. 3/4  Business Driven Development(BDD)\n4. 3/11 Web Services\n5. 3/18\n6. 3/25 DB adapter\n7. 4/8  a. SOA b. Why ESB c. Mediation module, Flow Compoonent, Primitives d. Serivce Message Object e. Summary\n8. 4/15 a. Create mediation module b. Define mediation interface c. Define web services references d. build the module flows e. Test the mediation f. Integrate the module with process\n8. 4/22 a. SOA(Business Agility, Process/Services) b. The Project(Business Goal, Architecture) c. Human Task d. State Machine e. Summary\n9. 4/29 a. State Machine b. States c. Transition d. Event e. Action f. Condition g. Development steps h. Testing i. Homework\n10. 5/6 a. Business-Driven Development b. The SOA Project c. Account Approval Process d. Modeler e. RSA, WID, RAD, TestManager f. Monitor g. Development Life Cycle\n11. 5/13 a. Create a Modeler Project b. Modeling the Process c. Simulate the Process Model d. Export the Process Model from Modeler e. Refine the Process in WID f. Generate the Monitor Model g. Deploy, Test and Monitor the Process h. Refine and Simulate the Process Model i. Deploy, Test and Monitor the Revised Process\n12, a. Case Study b.Telecom Billing System c. Next Generation Operations System and Software d. Enterprise Service Bus e. Adaptable Service Bus f. ASB Architecture and Its Role in the ChungHwa Telecom Billing System g. The Development Lifecycle of NGOSS h. Conclusions\n13. a. Federated Identity Management b. Architecture c. Technical problem d. Technical solution: components--validation, authorization, map, issue e. conclusion\n14. a. SOA Testing  b. Define the Testing Domina c. Define Architecture Objectives d. Create functional approach e. Define Performace Requirements f.Define SLA Requirements g. Define Data Layer Testing Approach h. Define Services Layer Testing Approach i. Define Process Layer Testing Approach j. Define Service Simulation k. Select SOA Testing Technology Suite l. Testing Execution","scorePolicy":"1. 4 homeworks assignment 20% (5% each)\n2. Midterm project        40%\n3. Final project          40%","materials":"SOA Overview_PPT.pdf\nWID 602_installation_guide.pdf\nDB2 8.2.6InstallationGuide.pdf","foreignLanguageTextbooks":false}]
