[{"name":"黃博全","email":"pchuang@ntut.edu.tw","latestUpdate":"2008-04-24 14:51:44","objective":"本科目將由認識地球上太陽能之基本熱輻射理論，結合各種不同形式之太陽能源有效利用裝置，討論太陽能之有效利用方式及相關系統技術。以期在既有太陽能利用技術上，發揮更有效率的太陽能源工程系統設計，奠定未來21世紀太陽能源利用之高效率化基礎。本門課主要為太陽能應用的原理分析及系統設計，課程內容包括太陽熱能系統的熱力熱傳及流體力學分析與系統設計；太陽能光電系統的組成與設計分析。\n    The aim of this course is to discuss three individual topics of more specialized nature: large PV systems, photo-voltaic under concentrated sunlight and the hydrogen economy. After completing this course the students should be able to: 1. Understand the specific features of large PV systems,an examine their economic and technical characteristics. 2. Explain the advantages and disadvantages of concentrator PV systems, and discuss their operation. 3. Analyze the structure of the hydrogen economic and show its feasibility and future potential.\nThis course is an introduction to the principles and system design of solar energy system that includes the application of thermodynamic, heat transfer, fluid mechanic theory and performance analysis of system.\n","schedule":"周次　　授課內容　　作業\n1　　Ready week-Overall introduction　　\n2　　Chap. 1 Introduction to Solar Energy and Its Conversion for Use on Earth　　    \n3　　Chap 1 Introduction to Solar Energy and Its Conversion for Use on Earth　　Homework 1\n4　　Chap. 2 Fundamentals of Solar Radiation(I)　　\n5　　Chap. 2 Fundamentals of Solar Radiation(II)　　\n6　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer(I)　　Homework 2\n7　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer(II)　　Homework 3\n8　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer(III)　　\n9　　Chap. 4. Methods of Solar Collection and Thermal Conversions(I)　　\n10　　Chap. 4. Methods of Solar Collection and Thermal Conversions(II)　　Homework 4\n11　　Chap. 5 System Analysis, Component and Economics of Solar System(I)　　\n12　　Chap. 5 System Analysis, Component and Economics of Solar System(II)　　Homework 5\n13　　Chap. 6 Solar-Heating Systems(I)　　\n14　　Chap. 6 Solar-Heating Systems(II)　　Homework 6\n15　　Chap. 7 Solar Cooling and Dehumidification(I)　　\n16　　Chap. 7 Solar Cooling and Dehumidification(II)　　Homework 7\n17　　Chap. 8 Solar Electric Power and Process Heat(I)　　\n18　　Chap. 8 Solar Electric Power and Process Heat(II)　　Homework 8\n19　　Chap. 9 Natural Solar Conversion Systems(I)　　\n20　　Chap. 9 Natural Solar Conversion Systems(II)　　Homework 9\n21　　Research report presentation　　\n22　　Research report presentation　　\n23　　Research report presentation　　\n24　　Research report presentation　　\n25　　Final Exam　　\n　　　　\n","scorePolicy":"成績計算方式:\n作業、平時考、上課表現出席率(40%)\n期中考(或研究報告)(30%)，\n期末考(30%)\n註:作業須於規定期限內繳交，逾期一週以內所得成績打80%計算，逾期一週以上者，以零分計算。\n","materials":"1.　　太陽能系統分析與設計\n2.　　Frank Kreith and Jan F. Kreider, Principles of Solar Engineering, Hemisphere Publishing Corporation, 1978.\n3.　　Michael F. Modest, “Radiative Heat Transfer”, McGaw-Hill Inc., 1993.\n4.　　Edward E. Anderson, Fundamentals of Solar Energy Conversion, Addison Wesley Publishing Company.\n5.　　黃文雄，太陽能之應用及理論，協志工業叢書。\n6.　　羅運俊、何梓年、王長貴，太陽能發電技術與應用，新文京開發出版股份有限公司。\n7.　　張鶴飛，太陽能熱利用原理與計算機模擬，.大陸西北工業大學出版社。\n8.　　Handouts based on recently published articles\n","foreignLanguageTextbooks":false}]
