[{"name":"簡良翰","email":"lhchien@ntut.edu.tw","latestUpdate":"2008-03-26 21:18:08","objective":"熱交換器設計方法、單向對流熱傳計算、壓差計算、冷凝器與蒸發器分析、殼管式熱交換器分析、密集式熱交換器分析、濕盤管理論分析","schedule":"周次\n教　學　進　度\n壹　　Course introduction; Review of Heat Transfer fundamentals, Application of heat exchangers.\n貳　　Break (228 memorial day)\n參　　Heat exchanger classification; sizing and rating problems; Calculation of UA\n肆　　Geometric factors of H-X; rating calculation; laminar flow surfaces; laminar flow; j, f vs. Re similarity.\n伍　　Finned tube H-X; Fin efficiency calculation; Row effect; Staggered and inline tubes.\n陸　　Plate finned tubes; Sizing calculations; Discussion of plate-and-fin H-X.\n柒　　Effect of property variation;\n捌　　Selection of fin geometry; Heat exchanger evaluation\n玖　　Mid-term Exam\n拾　　Introduction of plate-type heat exchangers \n拾壹　　Analysis of plate-type heat exchangers\n拾貳　　Rotary Regenerator\n拾參　　Shell and tube heat exchangers; Rod baffle H-X\n拾肆　　Stream analysis; Delaware method.\n拾伍　　Fundamentals of condensation and Evaporation; Two phase flow\n拾陸　　Fundamentals of heat and mass transfer; Direct contact heat exchangers\n拾柒　　Design procedures and optimization of heat exchangers; Class review\n拾捌　　Final Exam\n","scorePolicy":"期中考 (35%) + 作業 (25%) +學期報告(20%)＋期末考試 (20%)","materials":"教科書:　　 自編講義 ＋ 王啟川，「熱交換設計」，五南圖書出版公司，民國九十六年。\n\n參考書:\nEric M. Smith, Thermal Design of Heat Exchangers, John Wiley and Sons Ltd, New York, 1997.\nFraas, Arthur, P. Heat Exchanger Design, 2nd Ed., Joln Wiley and Sons Inc, New York, 1989.\nHewitt, G. F., Shires, G. L., and Bott, T. R., Process Heat Transfer, CRC Press Inc., Florida, 1993.\nKakac, S. and Liu, H., Heat Exchangers, Selection, Rating, and Thermal Design, CRC Press, 1997.\nKuppan, T., Heat Exchanger Design Handbook, Marcel Dekker, Inc. 2000.\nMills, A. F., Heat Transfer 2nd Ed., Prentice Hall, 1999.\nShah, R. K., and Sekulic, D. P., Fundamentals of Heat Exchanger Design, John Wiley and Sons, Inc., Hoboken, New Jersey, 2003.\nWebb, R. L, and Kim, N.-H., Principles of Enhanced Heat Transfer, 2nd Ed., John Wiley and Sons Inc., New York, 2005.\nWilliam M. Kays &amp; A. L. London, Compact Heat Exchangers, 3rd Ed., McGraw-Hill Co, 1984.\n王啟川，「熱交換器設計」，五南圖書出版公司，民國九十年。\n","foreignLanguageTextbooks":false}]
