[{"name":"Michael Ro","email":"suching@ntut.edu.tw","latestUpdate":"2008-05-02 18:01:51","objective":"本課程主要目的是提供學生對於都市政策規劃、都市設計與方案實施等有關專業領域更深入研究之機會。專題多元而深入，諸如以下之專題皆可作為討論之主題：1.　　地方發展計畫、與管理之理論與實務2.　　資源規劃與管理3.　　環境倫理4.　　交通政策與規劃5.　　土地使用規劃6.　　公共設施建設7.　　國外規劃比較8.　　住宅政策9.　　鄉村規劃10.　　景觀規劃11.　　綠社區12.　　敷地與不動產開發管理13.　　都市理論研究14.　　當代規劃設計思潮與評論","schedule":"NATIONAL TAIPEI UNIVERSITY OF TECHNOLOGY\nGRADUATE INSTITUTE OF ARCHITECTURE &amp; URBAN DESIGN\n\n112022 Seminars on Special Urban Topics – The Making and Mediation of Place 2008\nFebruary 22nd – June 13th 2008\n(All periods 3 hours on Friday afternoons, 1400-1700 in Room 555 in the Graduate Institute of Architecture &amp; Urban Design.  Class will begin at 1400, February 22nd)\n\nThe objective of this course is to explore varied approaches to the ‘making and mediation of space’, and then to see how it is implemented in current planning systems in various countries and territories around the world at the level of detailed urban design.  Reasons for the differences that are found will be explored, and the question will be asked ‘how and why could this planning methodology be relevant for current urban design planning practice and planning reform in Taiwan?’\n\nIt is also proposed to use a teaching technique known as ‘Problem-based Learning’ (PBL) during this course, as in previous years in NTUT, and students intending to take this course might like to use the Google web search engine to look up this term.  You will find that the teaching method involves students working in groups with guidance only from staff, rather than traditional lectures, although there will be some use of detailed course materials provided by the lecturer.  Students taking this programme last year can give guidance on how this works in this course.\n\nThe teaching will involve solving a series of ‘problems’ (one each week), and therefore the topic list shown below is an outline only of the subjects to be covered by the course during the remainder of this semester.\n\nPeriod 1　　　　What is PBL and how do students use it to learn\n(22 Feb)　　This is to explain the structure of the course, and the method that is proposed for students to follow for their individual and group learning\nPeriod 2　　　　What is the making and mediation of space?\n(29 Feb)　　This will be the first problem to explore in the course, and it will be for each student, helped by their group, to find their own answer to this question.  Your answers will be explored in the following week (Period 3)\nEach week will involve investigating a further problem, which will be designed to get to explore and learn about the following broad topic areas within comparative urban planning and urban design.  Each period will broadly be divided into three –\nFirstly to explore the result for the problem begun the previous week (1 hour)\nSecondly to have a lecture input related to the problem begun in the previous week (1 hour)\nThirdly for each group to investigate a new problem, and then to allocate the learning tasks to be completed by the next week (1 hour)\nThe broad topic areas to be covered during this semester will be : \nPeriod 3　　　　How do we make place in planning practice?\n(7 March)　　How should we make plans at the local level?\nPeriod 4　　　　What does mediating place mean?\n(14 March)　　The role of the professionals and other players in local planning\nPeriod 5　　　　How could we plan?\n(21 March)　　Is there an ‘ideal’ local urban design planning system that we might\norganise on a more collaborative basis?.\nPeriod 6　　　　How should local planning be organized in Taiwan?\n(28 March)　　How does the current urban design control system in Taiwan match \nperceived ‘best practice’ from theory?\n　　　　4 April is a public holiday\nPeriod 7　　　　How can we plan - control or flexibility?\n(11 April)　　　　The conflict between certainty, flexibility, control and discretion\nPeriod 8　　　　Design Control in Planning\n(18 April)　　　　Some alternative procedures\n　　　　25 April is Mid-semester break\nPeriod 9　　　　Planning Alternatives – United Kingdom\n(2 May)　　　　Design control in a permissive planning system\nPeriod 10　　　　Planning Alternatives – United States\n(9 May)　　　　Zoning control within planning\nPeriod 11 　　Planning Alternatives – Hong Kong I\n(16 May)　　　　Urban design with weak planning control\nPeriod 13　　　　Planning Alternatives – Hong Kong II\n(23 May)　　　　Master p","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
