[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2015-02-24 10:29:00","objective":"本課程介紹語言教學與學習原則，語言習得理論，和語言習得領域重要研究發現。期能建立學生應用語言學知識與日後相關研究的基礎。課程涵蓋主要內容包括：母語習得理論與實踐、第二語言(外語)習得理論與實踐、母語習得與第二語言(外語)習得之相同與相異處、影響語言習得重要因素(情性因素與社會文化因素)、語言學習者策略、對比分析、錯誤分析、語言溝通能力、閱讀理論與實踐、 寫作理論與實踐。\nCourse Title:　　　　Language Acquisition _ Second Language Acquisition \nCredit Hours:　　　　3 \nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw \nTerm Offered:　　　　Spring, 2015\nScheduled Class Hours: Monday 9:10—12:00 AM \nOffice Hours:      By appointment \nRequired Texts:  Selected Chapters from Understanding Second Language Acquisition, Second Language Acquisition, and others  \nCourse Description: This course will look at the process of acquiring / learning and using a second language. It provides theoretical and experimental insights to examine the phenomenon of language development from multi-disciplinary perspectives.  \nCourse Objectives:  This course aims to help the students \n　　　　　　(1) understand the principles and processes governing L1 &amp; L2 \n               acquisition and learning\n　　　　　　(2) examine how non-native language ability develops\n            (3) become familiar with SLA theories to account for many facets of non-native discourse","schedule":"Week 　　Class Task(s) 　　Lecturer(s)　　\n1　　Orientation + Ch. 1 　　Dr. Yang　　\n2　　Ch. 1 Key Issues in SLA　　Dr. Yang　　\n3　　Ch. 1 Key Issues in SLA　　Dr. Yang　　\n4　　Ch. 2 The role of the first language　　Dr. Yang　　\n5　　Ch. 2 The role of the first language　　Dr. Yang　　\n6　　Ch. 3 Interlanguage　　Dr. Yang　　\n8　　Ch.3 Interlanguage　　Dr. Yang　　\n9　　Ch. 3 + Ch. 4 Variability in interlanguage　　Dr. Yang　　\n10　　Ch. 4 Variability in interlanguage / Review 　　Dr. Yang　　\n11　　Midterm 　　　　\n12　　Social aspects of interlanguage 　　Students / Dr. Yang　　1-2 groups \n13　　Psycholinguistic aspects of interlanguage　　Students / Dr. Yang　　1-2 groups\n14　　Individual differences in L2 acquisition (Ellis)　　Students / Dr. Yang　　1-2 groups\n15　　Individual differences in L2 learning (Lightbown &amp; Spada)　　Students / Dr. Yang　　2 groups\n16　　Instruction and L2 acquisition　　Students / Dr. Yang　　1-2 groups\n17　　Review 　　　　\n18　　Final Exam","scorePolicy":"Course Requirements:\n(1)　　It is recommended that students take class notes.  The use of any form of recording device and/or photographing is strictly prohibited. \n(2)　　Students are divided into 8-10 groups to give brief in-class presentations as well as provide lecture notes and summary. \ni.　　All PPT presentations need to comply with the format as instructed and modeled by the instructor.\nii.　　Detailed notes of presentation handouts for distribution in class need to incorporate all theories, arguments, discussions and studies reviewed in the textbook. English-Chinese bilingual handouts are preferred. \niii.　　Comprehensive and detailed notes of lectures are required for study review. \niv.　　A full-length, revised PPT content, lecture notes, and the Chinese translation of the text are due for submission a week after the presentation session. All the aforementioned materials need to be distributed to all students enrolled. \n(3)　　Each student will be given abundant opportunities to provide his/ her response toward the assigned reading content as the lectures proceed. Students must complete all readings assigned prior to the class session.  \n(4)　　The instructor will not assign additional readings. However, as SLA is multi-disciplinary in nature, it comprises a broad array of theories and studies. Students who are highly interested in this field are strongly encouraged to consult the professor for further suggested readings.\n(5)　　Attendance: Students are required to attend class as scheduled. \ni.　　Each unexcused absence will result in 10% semester grade deduction. \nii.　　At the sole discretion of the instructor, absence penalty may be waived with valid proof and just cause. Penalty waiver request will only be accepted in two weeks of the date of absence. It is important to know that generally only ONE- time penalty waiver will be considered.  \niii.　　Lateness to class: Any arrival to class after the instructor finishes the second-round roll call is considered lateness. Each occasions of lateness will, in effect, incur a grade penalty of 5% semester grade deduction.\nEvaluation Procedures &amp; Grading System:\n　　Final grades will be determined by a point system (X out of 100 total points). Students will be evaluated by their presentations, handouts, full-length text translations, in-class exams, and attendance. Please be advised that individual class notes, covering all lecture sessions, shall be respectively submitted in the week prior to the midterm and final exam. The failure will result in a 20% grade deduction of the exam.\n(1)　　PPT Presentation &amp; Translation / Handouts / Notes 20%\n(2)　　Individual lecture notes 10% \n(3)　　Exams (Midterm &amp; Final) 40% \n(4)　　Attendance 30%","materials":"Required Texts:  Selected Chapters from Understanding Second Language Acquisition (Ellis) / Second Language Acquisition (Ellis) / How Languages are Learned (Lightbown &amp; Spada)","foreignLanguageTextbooks":false}]
