[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2014-12-24 15:59:56","objective":"資訊管理是整合使用者和組織系統，用以提供一個組織之操作支援，管理分析，和決策功能。我們以學習資訊工作者的角色，幫助經理滿足組織目標， 以及了解資訊科技，使經理工作更容易順暢。學習主題：透過資訊系統獲取策略優勢、透過資訊系統應用，支持經理和執行、發展資訊科技應用、獲得競爭優勢。","schedule":"週次 日期    課程主題         課程內容(case)\n1  2/25    課程介紹與個案分組\n2  3/4 第一部份：理論探討\n系統觀念、管理資訊系統（MIS）的基本概念。資訊系統的發展與企業的資訊需求。\n3  3/11資訊系統的分類與應用\n組織中之資訊系統管理 VCD case C計畫\n大同公司供應鏈電子化融資\n4  3/ 18 Business Impact\nCh1 IT and Strategy\nCASE1: Ms. Fields(影印)\nQ1.費太太餅乾產業競爭分析 與其競爭優勢為何\nQ2.資訊系統在該公司的角色\nQ3.對費太太有何建議\n 5  3/25 Ch2 IT and Organization \nCASE2:Otisline(影印)\nQ1.電梯產業競爭分析\nQ2.導入OTISLINE前之顧客服務流程為何\nQ3.導入之後流程\nQ4.otisline 對otis公司的影響與角色\n\n 6  4/1 Ch3 Extending Enterprise\nCASE3:Li &amp; Fung (影印)\nQ1.li and fung 是否應該發展lifung.com 事業?會成功嗎?\nQ2.li and fung 虛實事業如何管理? 是否會互相吞噬?\n7. 4/8\nCASE4:雄獅旅行社(光華個案)\nQ1：當面臨產業到大環境改變，雄獅旅行社調整價值核心，將營運方向開始轉向直客方面發展。若公司考慮朝直客發展有哪些優勢，還需要哪些配套？\nQ2：為什麼雄獅要建立協同運籌平台，在管理通路當中扮演何種角色？\nQ3：協同運籌平台未來的延伸？是否繼續推旺來卡？\n8 4/15 Business Model \nCASE 5: Bank of American: Mobile Banking\n 1. What benefits does mobile banking provide to consumers? Why haven’t many consumers adopted mobile banking yet?\n 2. What is BofA’s motivation to offer mobile banking to its customers? What are the associated costs and risks to the bank?\n 3. What lessons can the bank learn from its online banking operations? What are the costs and benefits of having customers migrate to online banking?\n 4. How is mobile technology likely to influence the banking industry in the future?\n5. How should McDonald and Brown respond to the LOB managers’ request to include more functions in the bank’s mobile app?\n\n9. 4/22\nCase1-Case6 Review\n 10. 4/29  Business Model\nCASE 6: IBM (課本8th ed)\nQ1.說明IBM在1960-1970成功的原因,以及1980--1990所面對的問題?\nQ2.說明Gerstner在1993年接任CEO做了哪些事?他的危機管理與公司轉型做得如何?他在為公司的成長定位時面臨了哪些挑戰?\nQ3.Sam Palmisano在2002年所面臨的挑戰為何?IBM可以兼顧創新與作業效率嗎?他可以同時保持大企業與小企業之優點嗎?\n\n 11. 5/6  Business Model\nCASE7: Aamzon.com (課本8th ed)\nQ1.  On a scale of “1” (Very Poor) to “5” (Excellent), how would you rate Jeff Bezos as an entrepreneur? How would you rate him as an operating manager?\n Q2.  Trace the evolution of the Amazon.com business from the company’s launch in 1995 to the dotcom collapse in 2000. How did the company’s strategy change over time? How did capabilities evolve? What value did it deliver to all stakeholders?\nQ3.  Do you agree with the decision to pursue the Toys “R” Us deal? Why did the company do the deal? Should they do more deals like this? What impact does the Toys “R” Us deal have on Amazon.com’s business model in early 2000?\nQ4.  Consider the challenges facing the company. As a member of the Amazon.com board of directors in early 2001, what actions would you take?\n\n 12. 5/13  IT Infrastructure\nCh5 Understanding Internetworking Infrastructure\nCASE8: :Ford Motor Company(課本8th ed)\nThe Power of Virtual Integration: the interview of Dell’s Michael Dell.\n1.請比較汽車與電腦供應鏈差異\n2.Dell SCM 模式是否可適用於FORD\n3. SCM 對FORD 的效益如何\n13.  5/20  Leadership Issue\nCh8 Organizing and Leading the IT Function \nCASE9:匯豐汽車(光華個案)\nQ1. 匯豐汽車是否需要強制業務代表使用eMentor系統?\nQ2. 面對使用率不高的狀況，匯豐汽車之知識平台是否有必要推行繼續推行？有什麼要點是匯豐汽車可以在知識管理平台上進行改進？\nQ3. eMentor系統是否必要在如此經濟不景氣的環境下繼續投入資金進行開發與推動？\n14.  5/27\nCASE10: Canyon Ranch  (課本8th ed)\nQ1. What is the value of customer information to Canyon Ranch?\nQ2. As CIO, how would you make the case of business intelligence systems and CRM   at Canyon Ranch?\nQ3. What impact would anticipate these systems on the Canyon Ranch’s strategy and capabilities?\n15  6/3 \nCase 11: Boeing’s e-Enabled Advantage(課本8th ed)\nQ1:What steps did Boe","scorePolicy":"教學方式：\n課堂教授，個案討論，網路討論區 http://fashion.ntut.edu.tw\n個案討論( 40%)，個案作業(30%),出席率(10%),期末考(20%)","materials":"指定用書：\nApplegate, L.M., F. Warren McFarlan, and James L. McKenney, Corporate Information Strategy and Management: Text and Cases,IRWIN.8 ed. 2009 ,華泰書局代理(必購)\n哈佛商學院個案CASE1: Ms. Fieldspre CASE2:Otisline\nCASE3:Li &amp;Fung CASE 4:Bank of America: Mobile Banking  CASE 6 IBM CASE7: Aamzon.com CASE 8:Ford Motor Company CASE10: Canyon Ranch Case11:Boeing Case 12: Zappos.com\n光華基金會個案:雄獅, 匯豐汽車(必購)\nCASE5:雄獅旅行社 (個案編號1-08046-11) CASE9:匯豐汽車(光華個案) 個案編號1-07030-11","foreignLanguageTextbooks":false}]
