[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2015-03-03 10:07:20","objective":"課程專為欲深度瞭解英文文學史的中學教師與研究所學生而設計。課程將引領學生研讀17世紀至今的英國文學文本，種類包含詩、戲劇、小說與自傳。學生需利用課內與課外的時間研讀文本，以利學生跳脫其熟悉之課程框架，於實務教學思維上有所創新發想。本課程之評分將以實際的教學示範、短篇寫作作業，以及學生參與程度為主要標準，論文報告次之。","schedule":"Week 1: Course Overview--The History of English Literature, Old English Literature\n\nWeek 2: In-class reading of a Canterbury Tale.  \"How to Make Lectures More Effective\"\n\nWeek 3: \"Supplements and Alternatives to Lectures,\" \"Encouraging Student Participation\" Shakespeare, Twelfth Night (film)\n\nWeek 4:  \"Leading a Discussion\" and \"Student Participation in Discussion\" Shakespeare Sonnets, other poetry\n\nWeek 5: In-class screening of Othello\n\nWeek 6: The Silver Chair\n\nWeek 7: The Silver Chair, Romantic Poetry\n\nWeek 8: \"Asking Questions,\" Poetry--Robert Burns (and Scottish country dancing)\n\nWeek 9: from Pride and Prejudice (and a screening of the BBC film)\n\nWeek 10: from Pride and Prejudice\n\nWeek 11: Pride and Prejudice\n\nWeek 12: Out of town due to U.S. conference. Read Alice in Wonderland, ch. 1–7. \n\nWeek 13: Alice in Wonderland, Edward Lear limericks, \"Teaching Large Classes: You can still get active learning\"\n\nWeek 14: In class: The Importance of Being Earnest (Oscar Wilde)\n\nWeek 15: Read “The Speckled Band” (Sherlock Holmes) \nIn class: Wilfred Owen, “Dulce et Decorum Est.”\nW. H. Auden “Musée des Beaux Arts,” “The Shield of Achilles”\n\nWeek 16: The BFG (Roald Dahl) and/or The Story of the Treasure Seekers (E. Nesbit)In-class short readings from works by Charles Dickens. \n\nWeek 17: No class (Dragon Boat Festival)\n\nWeek 18: Reflection Paper due","scorePolicy":"Students will give practice teaching demonstrations and write two teaching reflection papers. Students will also take reading quizzes.\n\nReading Quizzes and Informal Writing: 30%\nInformal Teaching Presentations and Class Participation: 20%\nFormal Teaching Presentations: 25%\nMidterm Reflection Paper: 10%\nFinal Teaching Reflection Paper: 15%","materials":"I want you to have a combination of materials you can definitely use in class and general background knowledge to make you a more knowledgeable and interesting teacher.\n\nPlease contact me with any questions.","foreignLanguageTextbooks":false}]
