[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2015-02-22 17:55:31","objective":"課程通過一系列關於城市的文本(文學、電影、建築、或其他藝術），思考人跟城市的關係：文化產物如何呈現城市，和城市設計如何給不同思潮影響。如果都市化成了大趨勢，如果我們當下的存在處境離不開城市及對它的想象，我們就有理由研究城市和建築空間在不同歷史脈絡下如何影響人，和如何閱讀城市這充滿符號的文本。課程會介紹關於城市的著作、論述和理論，也會探討如現代性、後現代主義、全球化、殖民主義、解構等議題。如可能，課程會安排實地考察。","schedule":"Through works of fiction, films, architecture and urbanscape, this course examines how the city is represented in modern texts and how cities shape subjectivity and construct narrative? We will examine both the visible features of a city (architecture, monumental buildings, preservation projects) and also what Calvino means by the ‘invisible city.’  Cities represented in texts include Manchester, London, Dublin, Paris, St. Petersburg, Buenos Aires, New York, Shanghai, Taipei, Hong Kong and Macau. Topics concerning modernity, postmodernism, globalization, colonization, and deconstruction will be explored. A field trip may be included if feasible.\n\n課程通過一系列關於城市的文本(文學、電影、建築、或其他藝術），思考人跟城市的關係：文化產物如何呈現城市，和城市設計如何給不同思潮影響。如果都市化成了大趨勢，如果我們當下的存在處境離不開城市及對它的想象，我們就有理由研究城市和建築空間在不同歷史脈絡下如何影響人，和如何閱讀城市這充滿符號的文本。課程會介紹關於城市的著作、論述和理論，也會探討如現代性、後現代主義、全球化、殖民主義、解構等議題。如可能，課程會安排實地考察。\n\nCourse Outline: \n　　　　\nI: Introduction: Into the Nineteenth-century (Part 1)\n　　\nWeek 1: Introduction \nBlake, ‘London’ (poem) \nPoe, ‘Man of the Crowd’ (short fiction)\n\nWeek 2: Dickens’s London I\nDickens, Bleak House (ch.1)\nDickens, Little Dorrit (ch.3)\n\nWeek 3: Dickens’s London II\nDickens, A Tale of Two Cities (Book 1, ch.3)\nJonathan Swift, ‘A Description of a City Shower’ (1710) (poem)\n\nWeek 4: Paris and St. Petersburg \nBaudelaire, ‘The Swan’ &amp; ‘To a Woman Passing By’ in The Flowers of Evil (poems) Nikolai Gogol, ‘Nevsky Prospect’ (short fiction)\n\nII. The City in Theory:\nWeek 5:\nItalo Calvino, Invisible Cities (novel) \nGeorg Simmel, ‘The Metropolis and Mental Life’ (essay)\n\nIII. Into the Nineteenth-century (Part 2)\n\nWeek 6: Benjamin, ‘Paris – Capital of the Nineteenth Century’ (essay)\n\nWeek 7: Engels, ‘The Great Towns,’ in The Condition of the Working Class in England (essay)\n[Final essay draft due]\n\nWeek 8: Manchester in literature\nElizabeth Gaskell, Mary Barton (novel) *　　\n\nWeek 9: Mid-term Paper Due \n\nIV. The City and Sexuality:\n\nWeek 10: \nAugustus Leopold Egg, Past and Present. Oil on Canvas. 1858. Tate Gallery, London.\nManet, A Bar at the Folies-Bergere. 1881-1882. Oil on canvas. 96 x 130 cm. Courtauld Institute Galleries, London.\n\nWeek 11: \nWong Kar Wai, Happy Together (1997 film). \nBorges, ‘Man on Pink Corner,’ and ‘A Short History of Tango’ (short fictions)\n\nV. The Surrealist City: \n\nWeek 12: Michel de Certeau’s ‘Walking in the City’\n\nWeek 13: T. S. Eliot, The Waste Land (poem)\n\nWeek 14: Andre Breton, Nadja *\n\nWeek 15: 24 City (film) (dir. Jia Zhang-Ke) and Joyce’s Dubliners (the first and the last stories)\n\nVI. The City and Detective: ‘Down these mean streets a man must go’\n\nWeek 16: \nJoseph Conrad, Secret Agent (novel) * \nChinatown (dir. Polanski) or Taxi Driver (1976 film, dir. Martin Scorsese)\n[Final essay draft (with a list of annotated bibliography) due]\n\nWeek 17: Presentation (short films on Taipei)\n\nWeek 18: Final Essay due by 23:59hr (please submit a HARD COPY to my mail box)\n\nTeaching Approach\n\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend lectures, participate in discussions in tutorials, give a presentation, and write two essays. A field trip (voluntary) may be arranged.","scorePolicy":"Assessment\n\nTutorials - 10%\nPresentation or a short film production - 20%\nMid-term essay - 30%\nFinal essay - 40%","materials":"Resources 　　\n\nPrimary texts: Those marked with [*] are texts which the students should get a copy.\n\nBaudelaire, ‘To a Woman Passing By’ and ‘The Swan,’ The Flowers of Evil, in Charles Baudelaire Complete Poems, trans. Walter Martin. Manchester: Carcanet, 1997. \n\nBlake, ‘London’ \n\nBorges, ‘Man on Pink Corner,’ in Collected Fictions: Jorge Luis Borges, trans. Andrew Hurley. Harmondsworth: Penguin, 1998. 45-52.　　\n\n---. ‘A History of the Tango,’ in Selected Non-Fictions: Jorge Luis Borges, trans. Esther Allen et al, ed. Eliot Weinberger. Harmondsworth: Penguin, 1999. 394-404. \n\nBenjamin, ‘Paris – Capital of the Nineteenth Century’, Illuminations, trans. Harry Zohn. London: Jonathan Cape, 1970.　　\n\n* Breton, Andre. Nadja. Trans. Richard Howard and Mark Polizzotti. Harmondsworth: Penguin, 2007.\n\nCalvino, Italo. Invisible Cities.  Trans. William Weaver. New York: Harcourt Brace Jovanovich, 1978. \n\n* Conrad, Joseph. Secret Agent: A Simple Tale. Oxford: Oxford University Press, 2008.\n\nEgg, Augustus Leopold. Past and Present. Oil on Canvas. 1858. Tate Gallery, London.\n\nEngels, Friedrich. ‘The Great Towns,’ The Condition of the Working Class in England. Ed. Victor Kiernan. Harmondsworth: Penguin, 2005.\n\n* Gaskell, Elisabeth. Mary Barton. Ed. MacDonald Daly. Harmondsworth: Penguin, 1997. Or: Gaskell, Elisabeth. Mary Barton. Ed. Shirley Foster. Oxford: Oxford UP, 2009.\n\nGogol, Nikolai. Nevsky Prospect. London: Bristol Classical Press, 1995. (extract provided)\n\n* Joyce, James. Dubliners. Ed. Jeri Johnson. Oxford: Oxford UP, 2008\n\nHappy Together (1997), dir. Wong Kar Wai. perf. Leslie Cheung (Ho Po-wing), Leung Chiu Wai (Lai Yiu-fai), DVD, 1997.　　\n\nManet, A Bar at the Folies – Bergeres. 1881-1882. Oil on canvas. 96 x 130 cm. Courtauld Institute Galleries, London.\n\nPoe, ‘Man of the Crowd.’ \n\nSwift, Jonathan. 'A Description of a City Shower', The Moving Pageant: a Literary Sourcebook on London Street-life, 1700-1914. London: Routledge, 1998. \n\nSimmel, Georg. ‘The Metropolis and Mental Life’ (1903) in The Blackwell City Reader. Eds. Gary Bridge and Sophie Watson. Oxford and Malden, MA: Wiley-Blackwell, 2002. 11-19. 14 Feb 2013. &lt;http://www.blackwellpublishing.com/content/BPL_Images/Co ntent_store/Sample_chapter/0631225137/Bridge.pdf&gt;\n\nTaxi Driver (1976), dir. Martin Scorsese, writ. Paul Schrader, perf. Robert de Niro (Travis Bickle), Jodie Foster (Iris Steensma), DVD, Bill/Phillips.　　　　\n\nReferences:\n\nAbbas, Ackbar. Hong Kong: Culture and the Politics of Disappearance. Hong Kong University Press, 1997.\n\nAuster, Paul. New York Trilogy. Harmondsworth: Penguin Books, 1990.\n\nBenjamin, Walter. Arcades Project. Trans. Howard Eiland and Kevin McLaughlin. Ed. Rolf Tiedemann. Cambridge: Belknap Press, 1999.\n\n---. Charles Baudelaire. London and New York: Verso, 1997.\n\nBerman, Marshall. All That is Solid Melts into Air: the Experience of Modernity. London: Verson, 1983.  \n\nClark, T. J. The Painting of Modern Life: Paris in the Art of Manet and his Followers. Princeton, N.J.: Princeton University Press, 1999.\n\nEngels, Friedrich. ‘The Great Town’, The Condition of the Working Class in England, ed. Victor Kiernan. Harmondsworth: Penguin, 2005.\n\nGilloch, Graeme. Myth and Metropolis: Walter Benjamin and the City. Cambridge: Polity Press, in association with Blackwell Publishers, 1996.\n\nMarcus, Steven. ‘Reading the Illegible.’ The Victorian City: Images and Realities. Ed. H.J. Dyos and Michael Wolff. London: Routledge and Kegan Paul, 1976. 257-76.\n\nTambling, Jeremy. Lost in the American City: Dickens, James, Kafka. New York: Palgrave, 2001. \n\n---. Going Astray: Dickens and London. London: Longman, 2009.\n\nWalkowitz, Judith R. Prostitution and Victorian Society: Women, Class, and the State Cambridge : Cambridge University Press, 1980.","foreignLanguageTextbooks":false}]
