[{"name":"黃子坤","email":"phwang@ntut.edu.tw","latestUpdate":"2015-02-23 00:20:06","objective":"本課程介紹產品介面設計之系統性實務。產品介面設計面臨使用者多樣化與介面日趨複雜的挑戰，設計者必須憑藉精確的方法才能掌握設計的易用性。各種方法包括：使用者需求探討、使用性分析、解決方案評估、實驗模型製作、使用者測試等。其中使用性測試係模擬介面與使用情境，藉由觀察與記錄挖掘操作過程之經驗，其中包括操作錯誤、使用疑惑、使用挫折、使用效率與使用滿意度。本課程將介紹上述各種方法及理論，並以案例引導學習者思考與操作。\nThis course is to introduce a practical and systematic way to deliver a product (or software) that works for users. Knowledge required for understanding the user will be discussed, including mental models, user experience, system acceptability and mental workload.\nUsability Engineering is a methodical approach involves several methods, including gathering requirements, analyzing usability problems, evaluating design alternatives, proposing solutions, developing and testing prototypes, and testing a interface with users.\nThe goal of usability testing is to uncover problems that users may encounter so those problems can be fixed. Testing may include collecting data on the paths users take to do tasks, the errors they make, when and where they are confused or frustrated, how fast they do a task, whether they succeed in doing the task, and how satisfied they are with the experience. Case studies and practice will be carried out with illustration and discussions.","schedule":"1.　　Introduction to Usability\n2.　　Usability Study\n3.　　Development of User Interfaces - Setting Usability Goals\n4.　　Understanding the User - Mental Models\n5.　　Understanding the User - User Experience\n6.　　Framework of System Acceptability\n7.　　Intuitive Interfaces - Archetype\n8.　　Mental Workload &amp; Schema \n9.　　Mental Models\n10.　　Usability Methods\n11.　　Participatory Design\n12.　　Evaluation and Comparing Interfaces\n13.　　Usability Testing\n14.　　Measurement of Performance\n15.　　Collect Feedback from Field Use\n16.　　Heuristic Evaluation\n17.　　User Acceptance of Computer Technology\n18.　　Review","scorePolicy":"作業及報告　　　　50%\n參與討論　　　　　　30% \n服務與出勤　　　　20%","materials":"Nielsen, Jakob (1994), Usability Engineering. Morgan Kaufmann Publishers, ISBN 0-12-518406-9.\nJakob Nielsen (1994), Usability Inspection Methods, John Wiley &amp; Sons, ISBN 0-471-01877-5\nNorman, Don(2009). The Design of Future Things. Basic Books.\nNorman, Don (1994). Things That Make Us Smart: Defending Human Attributes in the Age of the Machine. Basic Books.\nPetroski, Henry (1994). The Evolution of Useful Things: How Everyday Artifacts-From Forks and Pins to Paper Clips and Zippers-Came to Be as They Are. Knopf Doubleday Publishing Group.\nNorman, Don (2005). Emotional Design: Why We Love (or Hate) Everyday Things. Basic Books. \nBen Shneiderman, Software Psychology, 1980, ISBN 0-87626-816-5.","foreignLanguageTextbooks":false}]
