[{"name":"洪子逸","email":"tyhung@ntut.edu.tw","latestUpdate":"2015-01-05 14:46:31","objective":"本課程旨在探討服務科學之各項議題，包含服務科學導論、服務相關政策及法律、服務科技、服務經濟、服務設計、服務工程、服務科學個案等。","schedule":"1. Services and Service Management\n2. The Management of Services Contracts\n3. A Model of Profitable Service Recovery\n4. Increasing Service Exports: A Key Contributor in the Growth of the Global Knowledge Economy\n5. A Theoretical and Empirical Investigation into Service Failure and Service Recovery in the Restaurant Industry\n6. Structuring the Service Encounter: A Test of Alternatives\n7. How Service Firms Manage Innovation: Development Process and Factors of Success\n8. Managing Intercultural Service Encounters: Establishing the Need for Intercultural Training\n9. The Role of External Indicators in Measuring the Service Performance of Local Governments: An Italian Case Study\n10. Service Science, Value Creation, and Sustainable Development: Understanding Service-Based Business Models for Sustainable Future\n11. Productivity and Innovation in Services: The Multidisciplinary Perspective Offered by Service Science\n12. Technology-Induced Customer Services in the Developing Countries\n13. Technical Competitive Intelligence System: An Innovation and Technology Management Tool\n14. Business-to-Consumers eCommerce: How Companies Use the Internet in Marketing Products and Services to Consumers\n15. B2B eCommerce: Current Practices\n16. An Innovative Firm: The Renova Case Study\n17. Service Science Innovations: E-Government\n18. Resources, Capabilities, and Business Success","scorePolicy":"In-class Performance: 30%\nMidterm Proposal: 35%\nFinal Project: 35%","materials":"1. Delener, N. (2012). Service science research, strategy and innovation: dynamic knowledge management methods. Business Science Reference.\n2. Ordonez de Pablos, P. (Ed.). (2013). Best Practices and New Perspectives in Service Science and Management. IGI Global.\n3. Xiong, G., Liu, Z., Liu, X., Zhu, F., &amp; Shen, D. (2012). Service Science, Management, and Engineering:: Theory and Applications. Academic Press.\n4. Galup, S. (2012). Technological Applications and Advancements in Service Science, Management, and Engineering. Business Science Reference.","foreignLanguageTextbooks":false}]
