[{"name":"莊清松","email":"chuang.cs@msa.hinet.net","latestUpdate":"2015-01-05 13:17:51","objective":"—　　To introduce the fundamental architectures, characteristics and applications of modern wireless radio frequency and microwave systems from a system approach point of view.\n—　　To introduce the analysis and design of critical components at the radio-frequency front-end stage of wireless system.\n—　　To introduce the analysis of mobile wideband wireless system performance based on system architecture, modulation techniques and radio propagation effect.\n—　　This course is particularly organized for a system engineer who needs the broad knowledge that may interweave with both communication and microwave engineerings","schedule":"Week 1: Introduction to Modern Microwave Wireless Systems \n    Week 2: Introduction of Conventional Analog Modulation in Modern Wireless Radio Link Systems-\n    Week 3: Introduction of Modern Digital Modulation in Modern Wireless Radio Link Systems-\n    Week 4: Radio Frequency Linkage in Physical Effects \n    Week 5: Radio Frequency Linkage with Multipath Effects\n   Week 6: Modern Receiver Architectures in Wireless Radio Link Systems\n    Week 7: Noise and Multipath Effect in Wireless Radio Receiver\n    Week 8: Distortion in Wireless Radio Receiver\n    Week 9: Middle Term Course Review Examination\n    Week 10: Introduction of Electromagnetic Wave Radiation for Wireless Communications \n   Week 11: Electrical Current Excited Small Antenna Design for Wireless Radio Link Systems\nWeek 12: Electrical Current Excited Resonate Antennas for Wireless Radio Link Systems\nWeek 13: Impedance Broadband Wire Antennas for Wireless Radio Link Systems\nWeek 14: Magnetic Current Excited Resonate Patch Antennas for Wireless Radio Link Systems\nWeek 15: Introduction to Matching Techniques for Wireless Radio Link Systems\nWeek 16: Radio Frequency Coupler and Power Divider for Wireless Radio Link Systems\nWeek 17: Radio Frequency Filter Synthesis for Wireless Radio Link Systems\nWeek 18: Issues on Updated Techniques for Next Generation Wireless Radio Link Systems","scorePolicy":"Homework Assignment                      30%\nMid-Term Paper Exam                       30%\nProject Presentation or Paper Exam.     40%","materials":"—　　RF Microelectronics, BEHZAD RAZAVi, Prentice Hall PTR, 2012\n\n—　　MICROWAVE AND RF DESIGN; A System Approach, Michael; Steer, Scitech Publishing, INC, 2010.\n\n—　　Papers on public Journals","foreignLanguageTextbooks":false}]
