[{"name":"王世榮","email":"ronnie.wang28@msa.hinet.net","latestUpdate":"2021-06-02 02:12:31","objective":"探討家具製造之最新技術，側重量產設備及其與產品工程的關係。介紹木材加工原理及最新量產設備之性能，以便依據家具特徵如組件形狀，材料性質，及產量多寡等考量，提出有效率的加工計畫（製造流程）。講授家具製造作業程序（從原料接受、備料、細作、裝配以迄塗裝、包裝、發貨等其間之種種細節），特別是以計量的觀點來看家具製造問題，以避發生瓶頸，製造系統整体概念之培養，尤為重點。\nSurvey of furniture manufacturing technology emphasizing mass production equipment and its relationship to furniture product engineering. This course provides students with an understanding of the principles of wood machining processes and the capabilities of modern production woodworking equipment. Students learn to develop efficient process plans (machining sequences) based on product characteristics such as part geometry, material composition, and production volume. Emphasis is on operations, and the integration of many types of equipment into a manufacturing system. This course specially requires the students to view the manufacturing process in quantitative terms.","schedule":"1 　　9/13　　簡介家具製造程序概論及學習評量方式說明\n3　　27　　家具廠的組織與製程策略\n4　　10/4　　家具物料清單與加工技術的整體流程規劃概念\n6　　18　　依材質與產量, 認識最新家具的成型加工技術\n7　　25　　木製類家具的加工製程\n8　　11/1　　板類家具的加工製程\n9　　8　　期中考 \n10　　15　　類產線虛擬實境操作\n11　　22　　積層材家具的加工製程\n12　　29　　金屬類 (鐵片、管、線) 家具的加工製程\n13　　12/6　　塑膠類家具的加工製程\n14　　13　　墊裝類家具的加工製程\n15　　20　　多元材質(布、皮、玻璃類)家具的加工製程\n16　　27　　實例家具製程與倉儲運輸介紹: 嬰兒椅、吧椅\n17　　1/3　　家具製程優化的入門\n18　　1/10　　期末考","scorePolicy":"平時 65 %\n期中 15 %\n期末 20 %\n\n成績考核:\n1. 出席率         \n2. 課間分享、討論、報告/作業 \n3. 期中考試        \n4. 期末考試、成果","materials":"Rob Thompson (2007), Manufacturing Processes for Design Professionals, London: Thames &amp; Hudson Ltd.  ISBN139780500513750\n\nS. Kalpakjian, S.R. Schmid (2006), Manufacturing Engineering &amp; Technology, 5th ed., Prentice-Hall International.\n \nE. Paul Degarmo, J.R. Black, R. A. Kohser (2003), Materials and Processes in Manufacturing, 9th Ed., John Wiley &amp; Sons, Inc. \n \nR. L. Timings, S.P. Wilkinson (2000), Manufacturing Technology, 2nd Ed., London: Pearson Education Ltd.\n\nKrzysztof Knop and Krzysztof Mielczarek, Using 5W-1H and 4M methods to analyse and solve the problem with the visual inspection process – Case study, 12th International Conference Quality Production Improvement, QPI 2018, MATEC Web of Conferences 183, 03006 (2018) &lt;https://doi.org/10.1051/matecconf/201818303006&gt;","foreignLanguageTextbooks":false}]
