[
  {
    "name": "施邦築",
    "email": "bjshih@mail.ntut.edu.tw",
    "latestUpdate": "2021-09-21 20:59:27",
    "objective": "首先介紹我國及美日等國的防災體制、組織權責、運作機制，並比較其優缺點。接著討論防災資訊、通訊及新興科技在災害防球上的應用。介紹各類天然及人為災害的理論及特性，如地震、颱風、淹水、坡地災害、土石流、施工災害、環境污染、工業災害、全球氣候變遷等。從減災、整備、應變、復原重建四個時序來探討防災計畫緊急應變計畫標準作業程序的內容與要點。\nThis course first introduces the disaster prevention systems,jurisdiction and responsibility, and operation mechanism of several countries including Taiwan,Japan and the  United States of America. The application of computer information, communication and advanced technologies for disaster prevention will also be discussed. The characteristics of various natural and man-made disasters, such as earthquakes, typhoons, floods, slope failures, debris flows, contruction incidents, environmental pollution, industrial hazards, and global weather changing will be introduced. The major contents of disaster prevention plans, emergency response plans and standard operation procedures will e discussed corresponding to the disaster mitigation, preparedness, response and recovery.",
    "schedule": "第一週　　中秋假期\n第二週　　課程說明、台灣天然與人為災害介紹\n第三週　　災害的特性與管理週期、災害應變之標準作業程序\n第四週　　防災規劃與風險管理\n第五週　　災害防救體系\n第六週　　洪旱災害與防治：颱洪、淹水、災例\n第七週　　洪旱災害與防治：地層下陷、旱災、災例\n第八週　　坡地災害 (山崩、地滑) 與防治\n第九週　　期中考週 \n第十週　　坡地災害案例\n第十一週　　土石流災害與防治\n第十二週　　地震災害\n第十三週　　海嘯災害\n第十四週　　地震災害案例、耐震設計\n第十五週　　防救災決策支援系統、災害應變演練之規劃設計\n第十六週　　全球氣候變遷之減災與調適\n第十七週　　學期計畫之期末口頭報告\n第十八週　　期末考週：學期計畫之期末口頭報告",
    "scorePolicy": "一、　　平常成績（30％）：含上課、出席情形、作業\n二、　　學期計畫口頭報告（20％）\n三、　　學期計畫書面報告（50％）",
    "materials": "一、　　自編教材（北科 i 學園 plus 可下載）\n二、　　天然災害防治導論，吳瑞賢等人編著，全華科技圖書股份有限公司印行， 2006，ISBN 978-957-21-5143-3\n三、　　天然災害防治 顏清連等人編著，土木工程防災教育改進計畫，教育部顧問室，民國 86 年",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中報告採線上報告\n期末報告採線上報告",
      "courseInfo": "1. 尚未選課之學生：加入 LINE 好友（老師的 ID：0933851881），將提供動態課程訊息，請告知姓名\n2. 已選課之學生：北科 i 學員 plus 公告動態課程訊息",
      "courseURL": "採 Google Meet 會議\n視訊通話連結：https://meet.google.com/oju-ctbv-vdn",
      "contactInfo": "1.LINE（老師的 ID：0933851881）\n2. 手機：0933-851-881\n3.email: bjshih@mail.ntut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
