[{"name":"顏維謀","email":"wmyan@mail.ntut.edu.tw","latestUpdate":"2021-08-30 12:39:35","objective":"本課程使學生充分瞭解燃料電池專業學科基礎知識，並進一步啟發及增進學生未來能源科技發展知能。\n燃料電池是一種電化學的發電裝置，其運作原理係利用電化學反應將燃料內之化學能直接轉換為電能，因其在能量轉換過程中並不經過熱機過程，因此能量轉換效率較高。本課程之授課綱要可分為以下幾項：\n燃料電池系統簡介、燃料電池效率及開迴路電壓、燃料電池工作電壓、質子交換膜燃料電池、磷酸燃料電池、鹼性燃料電池、直接甲醇燃料電池、固態氧化物燃料電池、燃料電池的燃料供應、燃料電池電力傳輸、燃料電池系統分析。\nThis course enables students to fully understand the basics of professional disciplines of the fuel cell, and to further inspire and enhance the knowledge of students about future energy technology. \nFuel cell is an electrochemical power generating device. It can directly convert the chemical energy of fuel into the electrical energy via the electrochemical reaction. Because it does not go through the process of thermal engine in the energy conversion process, and therefore a higher energy conversion efficiency. Teaching outlines of the course can be divided into the followings:\nIntroduction to fuel cell system, Efficiency and open voltage, Operational fuel cell voltages, Proton exchange membrane fuel cell, Phosphoric acid fuel cell, Alkaline fuel cell, Direct methanol fuel cell, Solid oxide fuel cell, Fueling fuel cell, Delivering fuel cell power, Analysis of fuel cell system.","schedule":"第一週： 燃料電池簡介\n第二週：燃料電之效率\n第三週：燃料電之效率\n第四週：燃料電池性能分析\n第五週：燃料電池性能分析\n第六週：質子交換膜燃料電池\n第七週：質子交換膜燃料電池\n第八週：直接甲醇燃料電池\n第九週：期中考\n第＋週：直接甲醇燃料電池\n第＋一週：固態氧化物燃料電池\n第十二週：固態氧化物燃料電池\n第十三週：燃料電池的燃料供應\n第十四週：燃料電池的燃料供應\n第十五週：氫經濟\n第十六週：氫經濟\n第十七週：期末報告\n第十八週：期末報告","scorePolicy":"期中考：40%\n期末報告：40%\n上課出席：20%","materials":"黃鎮江，燃料電池，滄海書局，第3版，2008\n自編講義","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"疫情「一級」學生須到校進行實體測驗\n疫情「二級」及「三級」(含)以上警戒，學生在家進行實體測驗","courseInfo":"※「一級」警戒：實體授課。\n※「二級」警戒 : 課程全採遠距授課。\n※「三級」(含)以上警戒：課程全採遠距授課。","courseURL":"https://teams.microsoft.com/l/channel/19%3azvyl1lLehW9C9fe_lin1XUZRmnEa84IuQjiDFhskYbM1%40thread.tacv2/%25E4%25B8%2580%25E8%2588%25AC?groupId=9c970014-a8ba-4f9b-894a-b1735eeb784a&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218","contactInfo":"研究室分機: 3568\n研究室位置:綜合科館608-3室\nOffice Hours: 週一~五14:00~18:00","additionalInfo":"遠距上課須先下載Microsoft Teams(費)，並連結至上述的上課網。","lv2Method":"遠距上課"}}]
