[
  {
    "name": "洪媽益",
    "email": "miguelt@ms19.hinet.net",
    "latestUpdate": "2021-09-17 14:56:00",
    "objective": "本課程廣泛介紹社會語言學的各個次領域，目的在引導學生瞭解此領域早期的基礎研究與現代的關注議題。學生可藉此認識英語在社會上的運用以及各種社會變因對於語言運作的影響。修完本課程後，學生有能力辨認現代英語的不同語體、解釋語言使用所牽涉到的社會因素、運用社會語言學中適切的研究方法完成語言研究，並能將社會語言學的概念應用到語言教學。\nThis course provides a comprehensive overview of sociolinguistic subcategories with the goal of introducing students to both early foundational work and current issues in this field. It provides students with valuable knowledge in the use of the English language in society and the effects of intricate social variables on language operation. Upon completion of this course, students will be able to identify the social varieties of English spoken in the present world, to explain the social factors involved in language use, to use appropriate methodology in sociolinguistics to conduct linguistic research, and to apply sociolinguistic knowledge to language teaching.",
    "schedule": "Tentative Schedule\nSeptember 28 Introduction\nOctober 5 Research Methods\nOctober 12 Language change \nOctober 19 Multilingualism / Bilingualism\nOctober 26 APLX; paper consultations\n\nNovember 2 Codeswitching\nReadings:\nThesis: Amy Yeh\nThesis: Joyce Hung\nHsu, Jia-Ling. 2013. English mixing in advertising in Taiwan: A study of English-literate readers’ attitudes. Concentric: Studies in Linguistics 39(1):91-122.\nMensah, Eyo Offiong. 2010. The morpho-syntax of code-mixing: The Efik-English perspective. Concentric: Studies in Linguistics 36(2):235-256.\n\nNovember 9 Social Factors\nReadings:\nThesis: Mamie Hsu\nThesis: Yi-hsiang Chou\nThesis: Chih-hsuan Hsu\nThesis: Lynn Zhang\nCheshire, Jenny. 2005. Syntactic variation and beyond: gender and social class variation in the use of discourse-new markers. Journal of Sociolinguistics 9(4):479-508. (SOCIAL FACTOR)\nFridland, Valerie. 2001. The social dimension of the Southern Vowel Shift: gender, age, and class. Journal of Sociolinguistics 5(2):233-253. (SOCIAL FACTOR)\nMacaulay, Ronald. 2002. Extremely interesting, very interesting, or only quite interesting? adverbs and social class. Journal of Sociolinguistics 6(3):398-417. (SOCIAL FACTOR)\nSclafani, Jennifer. 2009. Martha Stewart behaving badly: Parody and the symbolic meaning of style. Journal of Sociolinguistics 13(5):613-633. (SOCIAL FACTOR)\n\nNovember 16 Dialect in Society\nPresentations:\nAfrican American Vernacular English (AAVE) / Chicano English\nMandarin Chinese / Southern Min / Hakka\nReadings:\nAnderson, Bridget L. 2002. Dialect leveling and /ai/ monophthongization among African American Detroiters. Journal of Sociolinguistics 6(1):86-98. (DIALECT)\nBecker, Kara. 2009. /r/ and the construction of place identity on New York City’s lower east side. Journal of Sociolinguistics 13(5):634-658. (DIALECT)\nEdwards, Walter. 2001. Aspectual dn in African American vernacular English in Detroit. Journal of Sociolinguistics 5(3):413-427. (DIALECT)\nFought, Carmen. 1999. A majority sound change in a minority community: /u/-fronting in Chicano English. Journal of Sociolinguistics 3(1):5-23. (DIALECT)\nReyes, Angela. 2005. Appropriation of African American slang by Asian American youth. Journal of Sociolinguistics 9(4):509-532. (DIALECT)\nTrudgill, Peter, Elizabeth Gordon, and Gillian Lewis. 1998. New-dialect formation and southern hemisphere English: the New Zealand short front vowels. Journal of Sociolinguistics 2(1):35-51. (DIALECT)\nWolfram, Walt, Phillip Carter, and Beckie Moriello. 2004. Emerging Hispanic English: new dialect formation in the American South. Journal of Sociolinguistics 8(3):339-358. (DIALECT)\n\nNovember 23 Mid-term Paper presentations \nTask: decide term paper topic and present bibliography\n\nNovember 30 Gender\nReadings:\nThesis: Oby Wang\nThesis: Amber Wu\nThesis: Sunny Chiang\n\nDecember 7 Gender (Readings)\nBaranowski, Maciej. 2002. Current usage of the epicene pronoun in written English. Journal of Sociolinguistics 6(3):378-397. (GENDER)\nDaly, Nicola and Paul Warren. 2001. Pitching it differently in New Zealand English: speaker sex and intonation patterns. Journal of Sociolinguistics 5(1):85-96. (GENDER)\nHerring, Susan C. and John C. Paolillo. 2006. Gender and genre variation in weblogs. Journal of Sociolinguistics10(4):439-459. (GENDER)\nHobbs, Pamela. 2003. The medium is the message: politeness strategies in men’s and women’s voice mail messages. Journal of Pragmatics 35:243-262. (GENDER)\nSu, Hsi-Yao. 2012. The social implications of syllable-final nasal mergers in Taiwan Mandarin: A variation study. Language and Linguistics 13(4):767-802.\nWouk, Fay. 1999. Gender and the use of pragmatic particles in Indonesian. Journal of Sociolinguistics 3(2):194-219. (GENDER)\nYaguchi, Michiko, Yoko Iyeiri, and Yasumasa Baba. 2010. Speech style and gender distinctions in the use of very and real/really: An analysis of the Corpus of Spoken Professional American English. Journal of Pragmatics",
    "scorePolicy": "Final paper: 40%\nPresentations: 20%\nWritten Reflections: 20%\nClass Participation: 20%\nEND",
    "materials": "TBA\n\nComplete schedule and list of readings will be given on the first day of classes.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Oral presentations and final paper are required.",
      "courseInfo": "Students who intend to take the course should show up on the first day of class.",
      "lv2Method": "遠距上課"
    }
  }
]
