[{"name":"賴蓉禾","email":"julialai@ntub.edu.tw","latestUpdate":"2021-08-28 15:10:24","objective":"本課程主要使學生能強化會計學的基本觀念，並以國際會計原則(IFRS)為架構，熟悉會計流程與財務報表之編製。課程內容包含會計恆等式與財務報表的介紹、借貸法則、會計處理程序(分錄、過帳、試算)與調整、結帳與會計循環的完成、買賣業會計、存貨的會計處理、現金、應收帳款、不動產、廠房與設備、無形資產、負債、股東權益、以及投資活動的會計處理，最後則是現金流量表的編制，與財務報表的運用與分析。\nThis course is an introduction to the basic concepts and standards underlying financial accounting systems. Several important concepts will be studied in detail, including: cash, accounts and notes receivable, inventory, marketable securities, equity investments, PPE, intangibles, debt, equity issuance, and dividends. The course emphasizes the construction of the basic financial accounting statements - the income statement, retained earnings statement, statement of financial position, and statement of cash flows - as well as their interpretation. Financial accounting focuses on providing information that is relevant and useful for external users. This course expands your knowledge of understanding of the basic language and conceptions of accounting. The basic accounting concepts that will help you solve problems and exercises designed to transaction recording and financial statement preparation.","schedule":"第1-2週 導論企業與會計\n第3週  從會計恆等主到財務報表\n第4週　 借貸法則、分錄與過帳\n第5週　調整分錄、結帳分錄與會計循環\n第6週　會計循環\n第7週　買賣業會計與存貨會計處理—永續盤存制\n第8週　存貨\n第9週　期中考\n第10週 現金與應收款項\n第11週 不動產、廠房及設備與遞耗資產\n第12週 負債\n第13週 無形資產\n第14週 投資性不動產、生物資產與農產品\n第15週 權益\n第16週 投資\n第17週 現金流量表\n第18週 期末考","scorePolicy":"平時成績（課堂參與及小考）：30％\n期中考：35％\n期末考：35％","materials":"會計學概要 六版\n作者： 杜榮瑞, 薛富井, 蔡彥卿, 林修  \n出版社：東華","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">平時成績（課堂參與及小考）：30％\n期中考：35％\n期末考：35％\n在符合防疫規範的前提下，保留學生須到校進行實體測驗的可能</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">如果學期初就實施遠距教學，採google meet軟體，教材於課前提供</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">課前提供</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Office Hours：週一13:00-16:00, 02-23226615</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
