[
  {
    "name": "陳維昌",
    "email": "wcchen@ntut.edu.tw",
    "latestUpdate": "2021-09-02 22:12:03",
    "objective": "Orthogonal frequency division multiplexing (OFDM) and multiple-input multiple-output (MIMO) are popular transmission techniques for wireless and mobile communications, because they offer several advantages such as increasing transmission data rate and enhancing error performance. In the class, we will learn about the basic principles and some advanced topics of OFDM and MIMO. We will also learn how to write a MATLAB program to evaluate the performance of a communication system. All students taking this class have to study a special topic on OFDM or MIMO as a final project.",
    "schedule": "Week 01. Elements of digital communication system\nWeek 02. Probability and random variables\nWeek 03. Detection theory and estimation theory\nWeek 04. OFDM: Signal model, orthogonality, spectral efficiency and efficient implementation\nWeek 05. OFDM: How to combat with multipath channel\nWeek 06. OFDM: Synchronization and channel estimation\nWeek 07. OFDM: OFDM variants I\nWeek 08. OFDM: OFDM variants II\nWeek 09. MATLAB\nWeek 10. OFDM: Power allocation\nWeek 11. OFDM: PAPR problem and PAPR reduction techniques \nWeek 12. OFDM: Large OOB emission problem and OOB emission reduction techniques\nWeek 13. MIMO: Error performance in fading channels, maximal ratio combining, and selection combining. \nWeek 14. MIMO: Space-time block code and spatial precoding \nWeek 15. MIMO: Spatial multiplexing and spatial modulation \nWeek 16. Massive MIMO\nWeek 17. Final Exam \nWeek 18. Student Oral Presentation \n\nThe schedule may be adjusted if necessary.",
    "scorePolicy": "MATLAB  Homework     30%\nFinal Exam           40%\nSpecial Topic Report 30%",
    "materials": "Lecture notes\n\nReferences:\n1. Y.-P. Lin, S.-M. Phoong, P. P. Vaidyanathan, Filter Bank Transceivers for OFDM and DMT Systems, Cambridge University Press, 2010. \n2. T. D. Chiueh, P. Y. Tsai, and I. W. Lai, Baseband Receiver Design for Wireless MIMO-OFDM Communications, 2nd ed., Wiley Inc., 2012.\n3. D. Tse and P. Viswanath, Fundamentals of Wireless Communication, Cambridge university press, 2005.",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "1. MATLAB 作業將以電子方式繳交，故不受疫情影響。\n2. 如果期末考時間為二級 (含) 以上警戒，將以遠距方式進行期末考。考卷將在考試開始時上傳至 \"北科 i 學園 PLUS\"，同學需自行下載題目以及進入課程 \"Google Meet\" 會議室點名與考試。\n3. 如果專題報告時間為二級 (含) 以上警戒，將以遠距方式進行報告。同學需進入課程 \"Google Meet\" 會議室點名與報告。",
      "courseInfo": "1. 課程訊息將公告在 \"北科 i 學園 PLUS\" 上。\n2. 本課程設有課程 Line 群組，加入群組連結為 https://line.me/R/ti/g/fvLRV2ksrl。課程訊息也將公告在群組中。",
      "courseURL": "1. 如果上課時間為二級 (含) 以上警戒，本課程將使用 \"Google Meet\" 進行遠距上課，連結為：meet.google.com/nhw-xrbz-wim。\n2. 期初加退選時間結束後，可能會視情況更換連結。\n3. 遠距上課的課程錄影將公告在 \"北科 i 學園 PLUS\" 上。",
      "contactInfo": "1. 可使用課程 Line 群組聯繫老師。\n2. 可寄 email 聯繫，email: wcchen@mail.ntut.edu.tw。",
      "additionalInfo": "無",
      "lv2Method": "遠距上課"
    }
  }
]
