[{"name":"梁又照","email":"ycliang@mail.cgu.edu.tw","latestUpdate":"2021-05-31 15:38:59","objective":"21世紀的工業設計師已不能再靜待市場研究及產品企劃人員提供產品設計規範，而應以使用者代言人、及企業產品開發整合者身分，主動參與產品策略與企劃，並以視覺化技術協助相關人員作橫向溝通。因此，「產品創新設計策略與企劃」課程主要目標在教導學生以「前瞻性的視野」，透過創新設計的步驟與方法，策劃出符合企業技術及經營體質，並且能滿足市場及使用者使用情況需求的產品。本課程將以理論、方法、案例研討及個案研究方式進行。\nThe function of industrial design in the 21st century, will no longer waiting for the product definition from the marketing and product planning, It will become a integrator and visualizer during the product innovation strategic phase, and concerning to the user's needs. Product Innovation Strategy will guide the enterprise looking beyond their current operation to match their technologies and the distinct competencies with emerging the user and the market needs. The contents of this topic will include theory, methodology, and practical case study.","schedule":"1 2021-09-13(一) 3 工設系 「創新設計策略與企劃」課程內容與講師介紹。\n「21世紀AIoT進入5G世代的互動設計與創新」，或類似題目，讓同學了解在新世紀數位時代中，使用者導向.、人因互動在產品與服務創新設計中角色與重要性（The Role of Interaction Design in Product &amp; Service Innovation\n2 2021-09-20(二)中秋節放假一天、調整放假，授課教師另行補課\n3 2021-09-27 (三)李來春梁又照Ch 1. What Drives New Product Development .新產品開發的軀動力。「產品與服務創新設計與發展沿革與展望」。\n4 2021-10-04 (四) 3 李來春梁又照Ch 2. Moving to the Upper Right .\n移上右上角：科技創新與設計創新的右上限。\n5 2021-10-11 (五) 3 李來春 梁又照 　　國慶日遇例假補假\n6 2021-10-18 (六) 3 李來春 梁又照 　　Ch 3. The Upper Right: The Value Quadrant . 右上角：價值上限與價值分析。\n7 2021-10-25 (七) 3 李來春 梁又照 Ch 4. The Core of a Successful Branding.成功品牌戰略的核心：使用者導向的突破性產品利服務創新。\n8 2021-11-01 (八)3 李來春 梁又照 Ch 5. A Comprehensive Approach to User-Centered,Integrated New Product Development.以使用者為中心的整合性新產品開法途徑。\n9 2021-11-08 (九) 3 李來春 \n梁又照 　　 Ch 6. Integrating Disciplines and Managing Divers Teams .\n跨專業協同合作的整合，與多樣化團隊合作的管理。\n10 2021-11-15 (十) 3 李來春 梁又照 Ch 7. Understanding the User’s Needs, Wants, and desires.理解使用者（用戶）的、要求、需要、與願望。\n11 2021-11-22 (十一) 3李來春 \n梁又照 　　Ch 8. Service Innovation: Breakthrough Innovation on the\nProduct–Service Ecosystem Continuum .\n服務創新；品與服務生態系統\n12 2021-11-29 (十二) 3 李來春 梁又照 Ch 9. Case Studies: The Power of the Upper Right.案例研究分析：右上限、科技與設計整合創新的潛力與價值。\n13 2021-12-06 \n(十三) 3李來春梁又照 Ch 10. Case Studies: The Global Power of the Upper Right .案例研究分析：右上限、全球球國際應用的成功案例。\n14 2021-12-13 (十四) 3 李來春 梁又照 Ch 11. Where Are They Now?\n他們後續的發展？\n15 2021-12-20 (十五) 3 李來春 梁又照 Workshop Practice 1.\n上述方法與觀念實務体檢工作營（一）SET to POG.\n16 2021-12-27 (十六) 3 李來春 梁又照 Workshop Practice 2.\n上述方法與觀念實務演練工作營(二)典型使用者代表屬性與人物介定（Character Maping）\n17 2021-01-03 (十七) 3 李來春 梁又照 Workshop Practice 3.\n上述方法與觀念實務演練工作營(三）使用者情境模擬與創新內容關鍵課題（Key Theme）之介定.\n18 2021-01-10 (十八) 　　3 李來春 梁又照 Workshop Practice 4.\n上述方法與觀念實務演練工作營(四）綜合檢討：WHAT ARE THEY NOW？產品與服務、將隨社會、經濟、科技（SET）, 時空環境而、去年成功的產品,今年可能遭到淘汰、相對的不斷因變應變、卻使創新機會、源源不絕!","scorePolicy":"出席率25％\n課本報告25％\n創新工作坊週6週日2天,實務練習及報告50％","materials":"1.Innovation by design : what it takes to keep your company on the cutting edge. By Gaynor , Gerard H. AMACOM Press. 2002.\n2.The Art of Innovation: Lessons in Creativity from IDEO. By Tom Kelley and Jonathan Littman.","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":null,"courseInfo":null,"courseURL":null,"contactInfo":null,"additionalInfo":null}}]
