[
  {
    "name": "曾俊儒",
    "email": "ktseng@pddlab.org",
    "latestUpdate": "2021-09-06 18:49:48",
    "objective": "本課程為總整課程綜合了實際產品/服務開發項目中涉及的所學分析、比較和決策關鍵過程。課程提供給學生一個機會來展示對實際產品/服務開發的動態、資本要求、策略部署和產品開發交付程序的理解。\n\nThe capstone course synthesises the learnt analytical, comparative and critical processes involved in real product/service development projects. It provides an opportunity for the student to demonstrate his/her understanding of the dynamics of real product/service development, its capital requirements, strategy deployment and delivery procedures. \n\nWith the utilisation of various real product/service development and design case studies and the input by external industry professionals, this course presents a broad array of design and management contexts, critical decision-making and business styles. With the intensity of in-class examination of each case, the student will be required to advance his/her decision-making and management skills to respond to the rapid resolution of real product/service development issues and challenges. With reference to actual development sites and real-time analysis, students will proceed through the assessment of the physical aspects, financial returns, and strategic planning processes of a deal and propose improvements to the outcome.",
    "schedule": "With reference to professional practice, the format for addressing the case studies has three stages\nprogressing from full class discussion, though team-based debate, to the individual presentation:\n1.　　All-class discussion and debate of each of four selected case studies resulting in identification of product/ service development issues, capital structures, strategic planning or decisions which could be improved.\n2.　　Team-based, detailed investigation of each case (every student focuses on one of the four cases studies), resulting in the classroom negotiation between conflicting parties with the objective of improving the outcome, as evaluated by the non-participating class members.\n3.　　Individual exploration for an alternative resolution of the case study examined in the team-based following stage, taking into account the negotiation dynamics of that phase, and producing a comprehensive, detailed, and compelling proposal for an improved outcome. Creative but credible efforts are encouraged, with the deliverable being a soft and hard copy “Business Case Report” for potential capital partners.",
    "scorePolicy": "Assignments: 50%\nClass participation: 25%\nFinal presentation: 25%",
    "materials": "•　　Reading pack.\n•　　Slected case studies\n•　　Kenneth B. Kahn, editor (2013) “The PDMA Handbook of New Product Development,” 3rd Edition, John Wiley &amp; Sons, Inc.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Assignments: 50%\nClass participation: 25%\nFinal presentation: 25%",
      "courseInfo": "(1)加退選課期間尚未選課成功之同學,請寄信至ktseng@ntut.edu.tw。\n(2)第三週選課結束後,課程動態資訊將更新於 Line group。\n(3)教材提供方式: Line group",
      "courseURL": "meet.google.com/xtd-ujyn-van",
      "contactInfo": "[已寄信預約同學] meet.google.com/xtd-ujyn-van",
      "additionalInfo": "課程詳細資訊: Line group",
      "lv2Method": "遠距上課"
    }
  }
]
