[
  {
    "name": "吳和庭",
    "email": "htwu@ntut.edu.tw",
    "latestUpdate": "2021-09-17 15:41:55",
    "objective": "This course contains the basic theories in probability and random processes. It includes probability measures, random variables, the law of large number, statistical inference, random processes and stationary processes. This course offers substantial probabilistic and statistical backgrounds for the machine learning (ML) field and serves as a basic course in field of communications, networks and controls in graduate school.",
    "schedule": "Course Website: https://myweb.ntut.edu.tw/~htwu/courses/Fall2021RP/Fall2021RP.htm\n\nWeek 1. Reviews of Probability Concepts\nWeek 2. Discrete and Continuous Random Variables\nWeek 3. Sequential Events, Conditional Probability and Conditional Expectation\nWeek 4. Multiple Random Variables\nWeek 5. Functions of Random Variables\nWeek 6. Random Vectors\nWeek 7. Sums of Random Variables\nWeek 8. Moment Generating Functions, Central Limit Theorem\nWeek 9. Midterm; The Sample Mean\nWeek 10. Point Estimates of the Model Parameter\nWeek 11. Confidence Intervals; Significance Testing\nWeek 12. Binary and Multiple Hypothesis Testing\nWeek 13. Estimation of Random Variables\nWeek 14. Optimal Estimation; MAP and ML Estimation\nWeek 15. Definitions and Types of Random Processes\nWeek 16. The Poisson Process; The Brownian Process\nWeek 17. Stationary Random Processes\nWeek 18. Final Exam",
    "scorePolicy": "1.　　Homeworks + Class Participation                     40%\n2.　　Midterm Exam                                                   30%\n3.　　Final Exam.                                                       30%",
    "materials": "Prerequisites: Probability, Transform Theory\nTextbook:  Yates and Goodman, “Probability and Stochastic Processes,” 2nd Ed., John Wiley &amp; Sons, 2005. (You may choose the 3rd ed. of this textbook, which contains similar contents and was published in 2015.)\n\nReferences:\n1.　　Leon-Garcia, “Probability and Random Processes for Electrical Engineering,” 3rd ed., Pearson, 2009.\n2.　　Childers, “Probability and Random Processes”, Irwin, 1997.\n3.　　Papoulis and Pillai, “Probability, Random Variables, and Stochastic Processes,” 4th ed., Mc-Graw-Hill, 2002.\n4.　　Stark and Woods, “Probability and Random Processes with application to Signal Processes”, 3rd ed., Prentice Hall, 2002.\n5.　　Ross, “Introduction to Probability Models”, 7th ed., Academic Press, 2000.\n6.　　Ghahramani, “Fundamentals of Probability with Stochastic Processes”, 3rd ed., Prentice Hall, 2005.\n7.　　Bhat and Miller, “Elements and Applied Stochastic Processes”, 3rd ed., 2002.\n8.　　Ross, “A First Course in Probability”, 7th ed., Prentice -Hall, 2006",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "原則上期中考、期末考採實體紙筆測驗。\nIn general, the midterm and final exams will take place in classroom, even if the  remote teaching format is conducted.",
      "courseInfo": "課程上課方式將隨時在課程網頁上公告。\nWhenever the remote teaching format is conducted, all of the detailed information will be posted on the course website dynamically.",
      "courseURL": "https://myweb.ntut.edu.tw/~htwu/courses/Fall2021RP/Fall2021RP.htm",
      "contactInfo": "教師研究室: 宏裕科技大樓　1528 室；(O)(02)27712171 x 4221\nOffice location:  room# 1528, Technology Building. (O)(02)27712171 x 4221",
      "additionalInfo": "The distance learning approach will be adopted during the first 3 week period from 9/22 to 10/10, using  Microsoft (MS) Teams Platform. Please refer to the course website for detailed info.",
      "lv2Method": "遠距上課"
    }
  }
]
