[{"name":"鄭鈺潔","email":"milu775199@gmail.com","latestUpdate":"2021-08-31 22:35:31","objective":"The course aims to implement problem-based learning for the design of modern optical devices. Practical case studies in the design of optical components and systems will help students become an optical consultant who has the ability to solve problems, especially for wave optics.\nStudents will learn commercial optical software Rsoft and COMSOL, which are commonly used in the industry, to simulate the assigned cases studies for modern optics including optical communication, photosensitive materials, and nano-optical structures.\nFinally, students are required to autonomy to design, plan, execute, analyze and implement their research ideas to others. There are two ways to presenting their final research results: poster presentations or oral presentations.","schedule":"2/18 Opening week: introduction to the modern optics \n2/25  industrial case studies from Cybernet(思渤科技) lectured by the invited industrial teacher: Mr. Richard \n3/4  Case study and group discussion for the case studies raised from Cybernet Co. \n3/11 Industrial case studies from PitoTech(皮托科技) lectured by the invited industrial teacher: Dr. Jason Lin\n3/18 Case study and group discussion for the case studies raised from PitoTech Co. \n3/25　　Simulation exercise\n4/1　　Metalens tutorials　　lectured by the invited industrial teacher: Mr. Richard \n4/8　　Metalens tutorials II lectured by the invited industrial teacher: Mr. Richard \n4/15 Midterm report I\n4/22 Midterm report II\n4/29 Nonlinear Metalens　　 lectured by the invited industrial teacher: Dr. Jason Lin\n5/6　　 Nonlinear response for Au-coated LCE lectured by the invited industrial teacher: Dr. Jason Lin\n5/13　　Case study and group discussion With Dr. Jason Lin\n5/20　　Case study and group discussion With Prof. Yu-Chieh Cheng\n5/27　　Case study and group discussion With Prof. Yu-Chieh Cheng\n6/3　　        Case study and group discussion With Mr. Richard\n6/10　　Case study and group discussion With Dr. Jason Lin\n6/17　　Final presentations","scorePolicy":"Exercise and discussion in class 20%\nFinal presentation 50%\nHomework 30%","materials":"Optics Hetch","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"Midterm/ Final online presentation \n期中、期末報告採線上報告","courseInfo":"Real-time class by Google Meet","courseURL":"Modern optics\n9月 24日 (星期五) · 下午1:00 - 4:00\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/zos-snzx-fqm","contactInfo":"Everlight building 9F 931\n億光大樓 九樓931\nyu-chieh.cheng@mail.ntut.edu.tw","additionalInfo":null,"lv2Method":"遠距上課"}}]
