[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2021-09-16 20:57:57",
    "objective": "The Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.\nThis course is for  IEECUS international students.\nLast semester, we've done some presentations. Assign PPL to chat with, interview individually, all mission is for getting to realize to your personal ideology. That could be related to you and other's interaction. Each person is unique. Select a suitable approach to be with others is our curriculum purpose. \nThis semester we're going to collect some information with mass and make them organizing. You'll learn how to fill in form and how we use them practically.",
    "schedule": "W1 Introduction\n(1st class we'll meet online : please log in the meeting room directly https://meet.google.com/fwj-akrn-bfe (google meet))\nW2 Listening and Reading skill\nW3 Structure\nW4 Make a form\nW5 text and document\nW6 Meaning and select information\nW7 Your mind and your presentation\nW8 Make your own profile\nW9 midterm exam\nW10 jigsaw \nW11 option and decision\nW12 Require \nW13 maintain and release\nW14 boundary and refuse\nW15 Observation\nW16 Human Resource\nW17 Write a script -director and performance \nW18 final exam",
    "scorePolicy": "Attendance 20%\nDiscussion 20%\nMidterm exam 30%\nFinal exam 30%",
    "materials": "handout\npowerpoint\n&lt; 看報學中文 & gt;，許英英。正中書局\n&lt; 縱橫天下事 & gt;， 國立臺灣師範大學國語教學中心。聯經\n今周刊",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "midterm exam--test online (on i-school plus)30%\nfinal exam--online presentation(paper+PPT)30%\ndiscussion--it depends on the interaction in class 20%",
      "courseInfo": "Differentiated teaching is possible.",
      "lv2Method": "遠距上課"
    }
  }
]
