[
  {
    "name": "黃琛傑",
    "email": "conji2@yahoo.com.tw",
    "latestUpdate": "2021-09-06 11:32:31",
    "objective": "一、本課程凡十六學分，供學生前四年修習之用。\n二、本課程教學目標旨在透過適當選文，增進學生閱讀、鑑賞、思考、創作與文字及口語之表達能力，並特重文化教材之選讀，使學生對我國重要典籍及傳統文化能有深入認識，從而培植其人文素養，啟發其尊重自我、關懷他者乃至環境之情操。\n三、本課程另計畫教授「新六藝」—— 書藝、棋藝、武藝、園藝、茶藝、樂藝，為時計三年，分布於前六學期，以期使學生除於重視學習生存能力（專業）外，能進而體會「學生」之深意，更在學習生活品味，乃至學習生命意義，以此陶冶情性，成就全人格之教育。\n四、本課程亦教授應用文，如履歷、自傳與名片等之撰寫 (四年級），並安排模擬面試活動，俾使學生能與畢業後之謀職一事提早接軌。\na) The course is designed for the students to study in the first four years, with a sum total of 16 credit hours. \nb) Course Objective: Through proper readings, the students will increase their ability to read, write and even appreciate literary works, and better understand significant books of ancient times and of traditional culture. With better development of humanity, they are likely to have more sense of loving the country, family and people. \nc) The Readings are adopted from a diversity of sources, including Classics, History Books, individual writings and literary anthology-ancient or modern. In addition to the explanation and discussion of vocabulary items, difficult words, classic allusions, main ideas, origin and the time background of the articles, a brief comment is also made on the authors' life, their works, literary styles/status. \nd) The course is to teach students how to write and handle official correspondences and social letters.",
    "schedule": "第一週                 課程概說\n第二週                 漁父\n第三週                 漁父\n第四週                 鴻門宴\n第五週                 鴻門宴\n第六週                 鴻門宴\n第七週                 諫逐客書\n第八週                 諫逐客書\n第九週                 諫逐客書\n第十週                 期中考\n第十一週             勸學\n第十二週             勸學\n第十三週             勸學\n第十四週             文化教材：大學選讀\n第十五週             文化教材：大學選讀\n第十六週             大山大河大海（茶藝與人生）\n第十七週             大山大河大海（茶藝與人生）\n第十八週             期末考",
    "scorePolicy": "出席與發言         20 %\n小組報告             20 %\n期中考                 30 %\n期末考                 30 %",
    "materials": "王基倫等《國文 Ⅴ》台北：東大圖書，107 年 8 月再版三刷",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "評分方式：出席與發言         20 %\n                 小組報告             20 %\n                 期中報告             30 %\n                 期末報告             30 %            \n備註：1. 報告不接受遲交\n           2. 符合防疫規範的前提下，若恢復「一級」警戒，則為實體上課，須到校進行實體紙筆測驗",
      "courseInfo": "課程公告動態調整，詳見北科 i 學園 PLUS\n遠距教學期間，本課程使用 Meet 上課",
      "courseURL": "meet.google.com/hko-thpm-vuz",
      "contactInfo": "加退選簽核，以網路加退選為主\n諮詢管道：conji2@mail.ntut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
