[{"name":"莊澤光","email":"s2300072ray@gmail.com","latestUpdate":"2021-08-18 15:46:16","objective":"本課程作為高年級生的必修課程，旨在拓廣學生們對於設計的眼界，理解當代產業中的職涯脈絡與發展方向，藉以提供學子們更多元寬廣的未來發展道路。\n  課程將透過邀請的業師講座、授課教師的講述課程以及學生的搭配研究報告交叉運行，藉以達到更多元的互動與回饋。\n針對以美學設計與科技運用混合為主題的互動設計系，本學期專題將以”空間”為主題，邀請五位業界專精的講者，分享在數位程式與各自領域中的不同應用。其中包含了”平面紙藝”，”概念設計”，”建築與影視特效”，”參數化設計”，”3d列印與營造”等幾項專題。在廣泛的演講範疇中，都仍涉及到了空間、程式、創意美學等幾項核心課題，可作為學生發展核心技能的借鏡。\n  而講師授課的部分則將以智慧建築與城市為主，搭配學生們的報告為輔，培養學生理解數位運算技術在都市、建築與室內居家的應用，理解其中的脈絡，進而尋找出互動設計於傳統營建、房市場中之可能性。 課程將分為智慧城市、智慧建築居家與智慧營建(BIM)等三個大方向: 從智慧城市的規劃、BIM的營建管理以至智慧居家與室內設計的可能性等面向給予學生概論性的理解，並搭配大量案例作為說明。講師授課部分為能與專題講座配合，將保有其內容與進度上的彈性。\n  課程評量將以學生報告、小組討論與呈現為主要評分方式，除增加課堂的互動與趣味性，也增加學生對此主題的認知深度。\n(本課程為求語言講述的深度，仍將以中文講述為主，中英文簡報為輔。)\n\nThe major goal of this class aims to give students general understanding about how the digital technologies affecting different design industries, such as architectural design, interior design and urban planning, etc. So that to think the future possibilities of interaction techniques to be applied in different industries and careers. \nThis class would be organized into three different parts: invited lecturer talks, class lectures and class discussion. \nThe first part: Invited lecturer talks has a very wide range of topics, included paper crafts, conceptual design, VFX and parametric design, however all of them are stick with the major issue of design, technology and space.\nThe second part: class lectures will be given by lecturer himself and be split into three chapter: intelligent city planning, digital architecture / interior and BIM construction. Through lecturing in the classes and series of case studies, students will get fundamental knowledge of the digital design process in practice. \nStudent will be asked to participate the class discussions， presentations and give reports in the end of semester. Students’ learning outcome must be showed in this report and will be the critical criteria of semester grading.","schedule":"週 次　　授課內容要項\n1　　 課程介紹、進度安排、評分標準說明/　　分組與選取小老師。\n2　　 智慧城市_1:  簡述城市發展與智慧城市的成形/　　Kevin Lynch的城市意象。幫助學生從法規的體系了解周圍空間的層級:從國土、區域、都市、  建築以至室內等/　　概述從早期聚落的型態到近現代的城市類型；從機能到精神、形態到意識、硬體到軟體之間的變化。\n\n3~4　　 智慧城市_2:  簡述數位軟體對城市型態的影響:如地景都市、移動都市、游牧都市等各式烏托邦的想像。　　MVRDV: 垂直村落、Jose Sanchez、Zaha Hadid、OMA\n\n5　　 專題講座_吳翔偉與他的跨界\n6　　 期中研究報告\n7　　 期中研究報告\n8　　 專題講座  葉洋與他的互動紙藝\n\n9~10  智慧建築_2\n軟體的影響: 從早期圖學的發展以至當代數位科技的製圖，說明工具對設計的影響。　　簡述數位工具對建築與室內空間的影響-從空間的型態以至內部軟裝的應用可能。幫助學生了解數位建築、異形建築、參數化建築的發展與成形。\n \n11　　 智慧建築_3\n介紹目前從社區、公寓以至居家科技的整合影響，搭配案例如忠泰2025想家計畫、日本”House Vision”等案例。\n \n12　　 專題講座_蘇育民與他的實作\n13　　 混合空間_1   投影/ VR/ 裝置/ 營建/3d 打印\n14　　 專題講座_洪瑞晟與他的建築motion graphic\n15　　 專題講座_徐銘沂與他的空間\n16　　 期末作業輔導。\n17　　 期末作業完成: 報告。\n18　　 期末作業完成: 報告。\n\n(註: 以上進度視實際上課情況與外聘講者時間保有調整彈性)","scorePolicy":"01: 出席率與課堂參與表現  30%\n02: 期中報告表現 30%\n03: 期末報告表現 40%","materials":"1.　　MVRDV 垂直村落_忠泰建築文化藝術基金會\n2.　　智慧城市概論_社會科學文獻出版社\n3.　　智慧建築評估手冊_財團法人台灣建築中心\n4.　　我們夢想的未來都市_田園城市出版社\n5.　　新興建構圖集(Atlas of Novel Tectonics: Reiser, Jesse)\n6.　　 Diagrams: interactive instruments in operation\n7.　　都市地球學: 日本三大建築家的都市論集THE GEOCOSMOLOGY OF CITY_田園城市出版社\n8.　　數位建築與東方實驗_天下文化","foreignLanguageTextbooks":false}]
