[{"name":"黃博全","email":"pchuang@ntut.edu.tw","latestUpdate":"2021-06-06 19:45:59","objective":"本課程屬於流體力學之應用學科，課程內容著重於如何將流體力學的基本原理應用到廣泛使用之流體機械上。其中各章節將介紹各種常用流體機械之結構、操作原理及其分類、相關之流體力學基本原理、定律，以及特性曲線之使用。透過本課程之介紹期望使學生能對流體機械之工作有深刻的瞭解，並知曉如何設計相關之流路或管線以及選用適當之流體機械。教材大綱: 分流力(基本定律、管流、流體量測)、水力機械(泵、水輪機)、空氣機械(送風機、風車)、排量型機械等四大主題來教學。\nThis course belongs to the applied discipline of fluid mechanics. The content of the course focuses on how to apply the basic principles of fluid mechanics to widely used fluid machinery. Each chapter will introduce the structure, operating principle and classification of various commonly used fluid machinery, related basic principles and laws of fluid mechanics, and the use of characteristic curves. Through the introduction of this course, students are expected to have a deep understanding of the work of fluid machinery, and know how to design related flow paths or pipelines and select appropriate fluid machinery. Textbook syllabus: Four major themes for teaching are shunt force (basic law, pipe flow, fluid measurement), hydraulic machinery (pump, turbine), air machinery (blower, windmill), and displacement machinery.","schedule":"週次　　日期　　題目及內容　　備註\n1　　　　準備週--課程介紹　　\n2　　　　流體特性簡介及流體機械概論　　　\n3　　　　流體流動的重要基本定律　　　\n4　　　　管流　　　\n5　　　　流體量測　　　\n6　　　　輪機機械的相似定律\n(水輪機、泵的相似定律)　　　\n7　　　　輪機機械相似定律\n(水輪機、泵的比速率)　　　\n8　　　　(再生能源-水力能)\n水輪機\n(水輪機構造、分類與作動原理)　　　\n9　　　　水輪機\n(水輪機性能、失速、水鎚與孔蝕現象)　　　\n10　　　　期中考　　　\n11　　　　泵\n(離心泵構造、分類、作動理論、相關特性與運轉)　　　\n12　　　　泵\n(軸流泵、斜流泵構造、理論、特性與運轉)　　　\n13　　　　泵\n(往復泵、特殊泵理論分析)　　　\n14　　　　空氣機械\n(送風機構造、分類、作動理論、性能量測)　　　\n15　　　　空氣機械\n(壓縮機構造、分類、作動理論、性能量測)　　　\n16　　　　(再生能源-風力能)\n空氣機械\n(風車構造、分類、作動理論)　　　\n17　　　　風機性能之測定、管路之設計、風量之調節及運轉　　\n18　　　　流體連結器與扭矩轉換器　　\n19　　　　期末考試　　學生將分別作一專題, 並有10-20分鐘之報告","scorePolicy":"分作業(20%)，期中考(30%)，分組研究報告(40%)，期末考(40%)","materials":"教科書:自編講義:黃博全，流體機械，曉園書局(高考用)\n授課方式:  演講  討論 設計研究\n以投影片及寫黑板同步進行之課堂教學為主，並輔以作業、研究報告等。\n參考書:\n1.　　Azad, R. S. and Scott, D. R., “Fans”, Pergamon press, 1993.\n2.　　Shephered, D. G., “principles of Turbomachinery”, Macmillan Publishing Co., Inc., 1956.\n3.　　Stepanoff, A. J.,” Centrifugal and Axial Flow Pumps”, 2nd Edition, John Wiley &amp; Sons, Inc., 1976.   \n4.　　Stepanoff, A. J., “Turboblower-Theory, Design, and Application of Centrifugal and Axail Flow Compressors and Fan”, John Willey sons, Inc., New York, 1956.\n5.　　Lakshminarayana, B., “Fluid Dynamics and Heat Transfer of Turbomachinery”, John Wiley &amp; Sons, Inc., 1996.\n6.　　Munson, B. R., Young, D. F., and Okiishi, T. H., “Fundamentals of Fluid Mechanics”, 4th-edition, John Wiley &amp; Sons, Inc., 2002.\n7.　　Handouts based on recently published articles","foreignLanguageTextbooks":false}]
