[{"name":"陳岡伯","email":"kpchen@ntut.edu.tw","latestUpdate":"2021-09-03 10:29:03","objective":"本課程主要在培養各類型段落、短文的撰寫能力，包括描寫、敘述、說明及議論性質文章。\nThis course is intended for university-level EFL writing students with the aim of increasing their fluency in English writing. To achieve this goal, students in this course read various kinds of articles and formulate their own critical thinking. With the experience of critical reading and thinking, students will develop their own writing strategies and write three short critical essays (500-800 words) with different rhetorical modes: comparison-contrast, cause-and-effect, and argumentative. \n     Basic knowledge and skills of conducting research will be integrated into the course; students will learn how to search for relevant sources, adopt proper academic styles, and avoid plagiarism. Towards the end of the semester, students will decide a research topic and write a research proposal and working bibliography to prepare for the longer researched essay (1500-2000 words) in the spring term.","schedule":"Week 1: Introduction to the course\n\nWeek 2: Review the organization of an essay: introduction, body paragraphs and conclusion, review the concepts of unity and coherence\n\nWeek 3: Review language and grammar: clauses and run-on sentence and fragment \n\nWeek 4: How to use secondary sources\n\nWeek 5: Comparison-and-contrast essays: in-class discussion and lecture\n\nWeek:6: Discussion of a selected article\n\nWeek 7: Discussion of students' topic and thesis statement\n             Introduction to academic styles\n\nWeek 8: Discussion of students' outline\n             \nWeek 9: Cause-and-effect essays: in-class activity and lecture\n              \nWeek 10: Discussion of a selected article\n\nWeek 11: Discussion of students’ topics and thesis statements\n               \nWeek 12: Discussion of students’ outlines\n              \nWeek 13: Argumentative essays: in-class activity and lecture \n\nWeek 14: Discussion of a selected article \n\nWeek 14: Discussion of students’ topics and thesis statements\n               \nWeek 15: Discussion of students’ outline\n\nWeek 16: Film viewing\n\nWeek 17: Film viewing and final review\n\nWeek 18: final cafe time","scorePolicy":"Attendance and participation: 40%\nThree essays: 60%","materials":"To be announced","foreignLanguageTextbooks":true}]
