[{"name":"楊景德","email":"jyang@ntut.edu.tw","latestUpdate":"2021-09-06 14:20:23","objective":"本課程始自ㄧ系列關於「古代哲學」的演講，特別著重於自然主義哲學家的思想，如泰利斯、巴門尼德斯、赫拉克利圖斯，與德摩克利圖斯。藉此讓我們得以瞭解下述議題: 宇宙的基本物質、變化問題，與原子論。接下來，我們會探討希臘哲學，著重於:辯士學派、蘇格拉底、柏拉圖，與亞里斯多德。我們接著探討希臘化時期的學說: 如犬儒主義、斯多葛主義、伊比鳩魯學派、新柏拉圖主義，與神祕主義。最後我們轉向中世紀哲學，再接著探討文藝復興與巴洛克時期的思想。\nThe course starts with a series of lectures on ancient philosophy with an emphasis of thoughts presented by the Naturalistic philosophers who initiate our research interest in the Nature and our surroundings such as Thales, Parmenides, Heraclitus, and Democritus.  By doing so we would learn the following important topics such as the basic matter of the universe, the problem of change, and atomism.  We then shall move onto Greek philosophy with a particular look at the following philosophers: the Sophists, Socratics, Plato, and Aristotles.  Afterwards, we will study the theories and accounts during the Hellenistic period such as Cynicism, Stoicism, Epicureanism, Neo-Platonism, and Mysticism. We then will turn to Medieval philosophy, followed by a close look at thoughts appeared in the Renaissance and Baroque era.","schedule":"課程介紹\n2　　伊甸園∕魔術師的帽子\n3　　神話∕自然派哲學家\n4　　德謨克里特斯∕命運\n5　　蘇格拉底∕雅典\n6　　柏拉圖∕少校的小木屋\n7　　亞理斯多德∕希臘文化\n8　　中世紀∕文藝復興\n9　　期中考週(停課一次)\n10　　國慶日\n11　　史賓諾莎∕洛克\n12　　休姆∕柏克萊∕柏克來\n13　　啟蒙∕康德∕浪漫主義\n14　　祈克果∕馬克思∕達爾文\n15　　佛洛伊德∕我們這個時代\n16　　花園的宴會∕對位法∕宇宙大爆炸\n17　　期末考\n18　　檢討考卷與總結","scorePolicy":"平時成績：20% (根據出席率與上課參與表現)\n期中測驗：30% (課堂學習回饋單數次)\n期末測驗/心得：50%\n\n\n\n\n備註: 教師有權根據學期實際情況調整評量標準占分比例。","materials":"一、教科書\n1.喬斯坦‧賈德(Jostein Gaarder) 著，伍豐珍 譯 : 《蘇菲的世界》(木馬文化 2010)。(Sophie's World: A Novel About the History of Philosophy.  Farrar, Straus and Giroux, 2007)\n\n二、指定參考書\n1.安琪拉‧達克沃斯( Angela Duckworth)，洪慧芳 譯 :《恆毅力：人生成功的究 \n   極能力》(Grit: The Power of Passion and Perseverance), (天下文化, 2016)。\n\n2. The Art of Choosing, Sheena Iyengar，Twelve，2011。\n   中譯本:\n   (繁體)  希娜．艾恩嘉( Sheena Iyengar)，洪慧芳 譯：《誰在操縱你的選擇： \n               為什麼 我選的常常不是我要的？》 (漫遊者文化, 2011)。\n   (簡體)  希娜．艾恩嘉( Sheena Iyengar)，《選擇的藝術︰為什麼我選的不是 \n                我要的？》(中信出版社,2011)\n\n3. 大衛布魯克斯(David Brooks)，廖建容、郭貞伶譯：《品格：履歷表與追悼 \n    文的抉擇》(天下文化2016)。","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"All the exams or quizzes shall either be taken either remotely or in the classroom pending the pandemic situation.","courseInfo":"All the information shall be posted here.","courseURL":"We shall set up a course group in line during the first two weeks.","contactInfo":"My office is located in Room 705 at the General Education Building.  My office hour shall be posted here soon.","additionalInfo":null,"lv2Method":"遠距上課"}}]
