[{"name":"古碧源","email":"ku@ee.ntut.edu.tw","latestUpdate":"2021-08-30 14:36:57","objective":"Course Title:Electronics and Electronics Lab.\nDescription:\n1. Introduction to bench instruments : oscilloscope, function generator, power supply, digital multimeter.\n2. Diode circuits : voltage-current characteristics, rectification, filtering, limiting and clamping, and zener diode.\n3. Operational amplifier circuits : inverting and non-inverting, arithmetic circuit, voltage follower, integration and differentiation, instrument amplification.\n4. Transistor: voltage-current characteristics, voltage transfer characteristic, biasing, various amplifier configurations.\n5. Frequency response of amplifiers, multi-stage and cascade amplifiers, differential amplifiers, feedback amplifiers, power amplifiers.","schedule":"Week01~03: Course description and Instruments function introduction.\nWeek04~06: Diode Circuits\nWeek07~08: Operational Amplifier Circuits\nWeek09      : Mid-term exam\nWeek10~12: Op-Amp application circuits\nWeek13~15: Bipolar Junction Transistor Characteristics\nWeek16~17: Transistor Amplifier Circuits\nWeek18: Final Exam","scorePolicy":"Experimental Results : 60 %\nMid-term and Final exams : 30 %\nAttendance : 10 %","materials":"The instructor will prepare experiment handouts in English for all experiments that suits your Electronics class. The handouts will be passed out at the beginning of each experiment. However, the students should study related materials in the textbook of their Electronics course.","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>分流上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\">The laboratory has 24 benches, and can have students work in sufficient social distance from each other. So experiments are still done in the laboratory in case of COVID-19 Level 2 Alert. In the worst case of Level 3 Alert the instructor will perform experiment in the laboratory and students attend the class on-line. Then students send their reports by emails for grading. </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">All experiment reports should be prepared electronically, and submit to the instructor by emails to present spreading of COVID virus. In the case of Level 1 and Level 2 Alert students will fill in their mid-term and final exams in paper.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Due to the small enrollment of this course all students will come to the laboratory even in case of Level 2 Alert.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">This course will not offer website because only those foreign students can attend the class in person can be enrolled.</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">All students can find contact info of the instructor in the Department of Electrical Engineering official website.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
