[
  {
    "name": "鍾孟雲",
    "email": "alexmychung@gmail.com",
    "latestUpdate": "2021-10-04 17:19:54",
    "objective": "Course Title: Electronics Lab.\nDescription: Introduction to Electronic Instruments and Operational Training Basic Instruments and the Knowledge of electronic parts. The properties, feedback concepts, characteristics and circuits of the Diode; Chopper circuit and clamp circuit; BJT transistor and amplifier circuit; FET transistor and amplifier circuit; Class A, Class B amplifier.",
    "schedule": "Week 1. 　　N/A\nWeek 2. 　　N/A\nWeek 3. 　　Introduction of laboratory equipment and equipment, training of electronic equipment operation\nWeek 4. 　　Diode characteristics\nWeek 5. 　　Diode rectifier circuit\nWeek 6. 　　Characteristics and applications of the diode\nWeek 7. 　　Wayne Bridge Oscillator\nWeek 8. 　　IC 555 astable oscillator\nWeek 9. 　　Mid-term. Take a week off.\nWeek 10. Characteristics of bipolar junction transistor (BJT)\nWeek 11. Switch of bipolar junction transistor (BJT)\nWeek 12. Bipolar junction transistor (BJT) bias circuit\nWeek 13. Integrator and Differentiator\nWeek 14. Field Effect Transistor (FET) Characteristics and Bias Voltage\nWeek 15. Field Effect Transistor (FET) Amplifier\nWeek 16. High frequency response of amplifier\nWeek 17. Theme reports \nWeek 18. Final exam including written test and circuit implementation\nThe course will be adjusted according to the progress.",
    "scorePolicy": "Mid-term exams: 0%\nFinal exams: 30%\nAttendance: 20%\nExperimental Results: 30%\nTheme Reports: 20%",
    "materials": "The instructor will prepare experiment handouts in English for all experiments that suits the class. The handouts will be passed out at the beginning of each experiment. The students should study related materials in the textbook of their Electronics course. The followings are the reference text books.\n電子學實驗 (上)，第九版，陳瓊興編著，全華出版\n電子學實驗 (下)，第八版，陳瓊興編著，全華出版",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "COVID-19 Alert Level 2\nThe laboratory has 24 benches, and can have students work in sufficient social distance from each other. So, experiments are still done in the laboratory. The Evaluation and grading policy will be the same above.\n\nCOVID-19 Alert Level 3 (or above)\nThe instructor will do on-line teaching and students attend the class on-line. The students will fill in their final exams online by google sheet. The Evaluation and grading policy will be the followings.\nMid-term exams: 0%\nFinal exams: 15%\nAttendance: 40%\nExperimental Results: 25%\nTheme Reports: 20%",
      "courseInfo": "For online lectures, students are asked to log in using the school’s google mailbox. During the exam, the camera needs to be shot on the computer screen and desktop. And you need to prepare blank A4 paper by yourself.",
      "lv2Method": "遠距上課"
    }
  }
]
