[
  {
    "name": "鍾孟雲",
    "email": "alexmychung@gmail.com",
    "latestUpdate": "2021-08-30 09:39:03",
    "objective": "　　課程名稱：電路學 (上)\n　　介紹：集總電路和克希荷夫定律（KCL, KVL），電路元件，串、並聯電路，一階電路，二階電路，線性非時變電路分析，相量及弦波穩態分析，耦合元件和電路，多相電路，複數頻率，頻率響應，狀態變數法，雙埠網路，PSPICE，傅式分析及轉換，拉式轉換。\n　　說明：本課程的目標是培養未畢業的學生建立電路理論基礎。為此，學習了電路的概念和分析技術，增強了解決電路問題的相關電磁理論、物理概念和數學方法。研究了包括解析法和數值法在內的逼近方法。 學生可以從中了解許多電路定理及其應用和一些相關的方法軟件。 除了電路分析技術外，鼓勵學生解決一些簡單的電路綜合問題，以便將來進一步研究電路設計及其相關領域。\n　　Course Title: Electric Circuits\n　　Description: Lumped circuit and Kirchhoff's law (KCL, KVL), circuit components, series and parallel circuits, first-order circuits, second-order circuits, linear time-invariant circuit analysis, phasor and sine wave steady-state analysis, coupling components and Circuit, multiphase circuit, complex frequency, frequency response, state variable method, dual port network, PSPICE, Fourier analysis and conversion, pull conversion.\n　　Explanation: The goals of this course are to discipline the students of under graduated level to erect their fundamental on the circuit theory. For this, the concepts and the analysis technique of electric circuit are learned, in which the related electromagnetic theory, physical concepts and mathematic methods for solving the circuit problems will be enhanced. The students can realize many circuit theorems and their applications and some associated approach software. In addition to the circuit analysis techniques, the students are encouraged to solve some simple circuit synthesis problems for further study on the circuit design and its related fields in the future.",
    "schedule": "第 1 週：課程介紹、集總電路和分佈式電路的概念及其應用。\n第 2 週：電路元件特性、電路變量及簡單計算。\n第 3 週：KVL 與 KCL 電路分析。\n第 4 週：KVL 與 KCL 電路分析。\n第 5 週：維寧 - 諾頓等效電路分析。\n第 6 週：維寧 - 諾頓等效電路分析。\n第 7 週：運算放大器。\n第 8 週：運算放大器。\n第 9 週：期中考（期中考）\n第 10 週：電感、電容、互感特性及重要方程式推導。\n第 11 週：電感、電容、互感特性及重要方程式推導。\n第 12 週：電感、電容、互感特性及重要方程式推導。\n第 13 週：電感、電容、互感組合計算。\n第 14 週：一階電路特性分析。\n第 15 週：一階電路特性分析。\n第 16 週：一階電路特性分析。\n第 17 週：專題報告 / 模擬報告\n第 18 週：期末考試（期末考）",
    "scorePolicy": "期 中 考：20%\n期 末 考：30%\n平時表現：50%\n註 1：平常表現包含出席率、作業、報告、小考、課堂表現… 等。\n註 2：防疫期間將配合學校規定調整授課方式。",
    "materials": "主要教材\n書名：Electric Circuits (Eleventh Edition, Global Edition)\n作者：James W. Nilsson &amp; Susan A. Riedel\n出版書局：Pearson Education\n代理書局：滄海圖書\n出版日期：西元 2019 年\n\n次要教材\n書名：電路學\n作者：曾國雄、譚旦旭教授編著\n出版書局：高立圖書",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "若為遠距上課，小考採線上考試 (google 表單作答)。\n二級緊戒時，期中考、期末考在符合防疫規範的前提下，學生需到校進行實體測驗，並採分流方式進行。\n三級緊戒時，期中考、期末考採線上方式進行，評分標準將挪其中的 5~10% 到平時表現。",
      "courseInfo": "上課時間固定星期三下午，3:00~6:00。上課方式二級以上採遠距上課。連結如上課網址。其他事項請直接來信詢問：mychung@ntut.edu.tw 。",
      "courseURL": "視訊通話連結：https://meet.google.com/bcq-osns-vvk\n代碼：bcq-osns-vvk",
      "contactInfo": "綜合科館 313 研究室，分機：2144，信箱：mychung@ntut.edu.tw。\nOffice Hours: 星期三，早上 10:00~12:00。",
      "additionalInfo": "若線上授課，請學生使用學校 google 信箱登入。\n考試時，鏡頭需照到電腦螢幕及桌面。並需自行準備空白 A4 紙張。",
      "lv2Method": "遠距上課"
    }
  }
]
