[{"name":"陳貞光","email":"jkchen@ntut.edu.tw","latestUpdate":"2021-09-15 09:36:52","objective":"This course applies the theories of thermodynamics to evaluate the chemical potentials equilibrium phases. Three fundamental laws of thermodynamics will first be introduced.  The effects of temperature and pressure upon Gibbs Free energy are then discussed. Applications for solutions, phase diagram, and chemical reaction evaluations with aids of computers will be the main practical topics for thermodynamics. The concepts of thermodynamics will be used extensively for metallurgical and materials-related fields.\n\n本課程討論材料熱力學的基本理論、技巧及應用等，特別是平衡時化學熱力學有關氣相，氣体定理，熱量，功，熱力學第一、第二及第三定律，溫度與壓力對焓，熵，自由能之影響等概念；利用電腦輔助計算溶液、相圖與相平衡、及化學反應平衡等均為熱力學的應用範疇，這些概念對於諸多冶金、材料相關的場域皆十分重要。","schedule":"This course will be conducted fully in English. [本課程將採全英文授課] Critical concepts will be added with Chinese explanations. All classes will be recorded at i-School or Microsoft Teams for review. \n\nw1- Course Description and Rules\nw2- Introduction to Thermodynamics - Chap.1\nw3- First Law of Thermodynamics - Chap.2\nw4/5- Second Law of Thermodynamics - Chap.3\nw6/7/8- Statistical Interpretation of Entropy - Chap.4\nw9- Midterm Exam\nw10/11/12- Auxiliary Functions - Chap.5\nw13/14- Heat Capacity, Enthalpy, Entropy, and the 3rd Law - Chap.6\nw15/16/17- Phase Equilibrium in One-component System - Chap.7\nw18- Final Exam.","scorePolicy":"30% Midterm, 30% Final Exam, 30% Assignments, and 10% Class performance","materials":"Textbook: Introduction to the Thermodynamics of Materials, 6th Ed., by David R. Gaskell and D.E.Laughlin, CRC Press, 2018. ISBN#9781498757003\n\n中文參考書：材料熱力學，陳貞光編譯，偉明圖書，c.2020，ISBN#9789869190374 (原著：同英文教科書，by David R. Gaskell and D.E.Laughlin, 6th Ed., 2018)\n\nTeaching assistant will be assigned when EMI (English as a Medium of Instruction 英語教學) project get approved by MOE.","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"The course will use blackboard for lecturing, partial online course will greatly affect the quality of classes. Fully virtual classes will be given if 2nd or higher degree alert is in act.\n\n因本課程主要以板書為主，若部分實體、部分線上勢必影響線上教學品質，故二級警戒採遠距上課。\n評量方式：期中考與期末考皆採實體紙筆測驗，實際分流方式，視警戒程度而定。","courseInfo":"Upon the order of 2nd degree or higher alert, all classes are given virtually via Microsoft Teams. For online class, please join Microsoft Teams [NTUT-Sync]110-1_291936_材料熱力學 Group by using your 11033xxx(ID)@cc.ntut.edu.tw and the password for school nportal system. All notifications will be posted on Teams.\n\nClasses will be given at the same time as those in the course schedule.\n\n請利用 學號@cc.ntut.edu.tw 登入 Microsoft Teams，密碼同nportal入口網頁密碼，選擇：[NTUT-Sync]110-1_291936_材料熱力學\n相關上課資料與教學訊息均於該團隊公告；上課時間同課表時間，並於上課前15分鐘開啟會議。","courseURL":"Please join the following course: \n https://teams.microsoft.com/l/team/19%3aMaehccGlt_09ZvgxJezEON3UZhIA0hwbLkYJy5RhyDo1%40thread.tacv2/conversations?groupId=736c47d0-27d5-4703-b169-89917600f6f3&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218\n\nContact 11235@cc.ntut.edu.tw, if you have not been added to this course group. 若未加入本課程，請盡快與教師聯絡加入。","contactInfo":"Feel free to contact Prof. J.K.Chen 陳貞光 via email: 11235@cc.ntut.edu.tw\n\n研究室：材資館 507-1室，02-27712171轉2763；工程學院院長室(第一教學大樓二樓)","additionalInfo":"Teaching assistant will be made available tentatively on Friday morning at 11:00-12:00 via Microsoft TEAMS. Chinese assistance will be provided. \n\n本課程將安排教學助理：廖桓雍同學，統一在周五上午11:00(暫定)，可由Teams上線接受提問，同學可以對於課程內容或作業有問題之處提問。","lv2Method":"遠距上課"}}]
