[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2021-09-07 00:26:25","objective":"本課程引導學生熟悉變遷中之英美文學作品典律，並探討其形成之歷史文化背景及隨變遷所產生之時代意義。課程中將討論與作品相關之社會、政治、文化、心理、哲學、理論等議題，使學生能瞭解欣賞選讀作品，並銳化其思辯能力及分析技巧。學生須於課前詳讀作品，並於課堂上參與討論。","schedule":"(This is an old version of the syllabus, and the exact dates are being updated. Contact me for an up-to-date copy if you need it, or you will receive it on the first day of class.)\nWeek 1: Course Introduction\nOld English\nCaedmon’s Hymn\nDeor\n“The Wife’s Lament”\n“The Wanderer”\n\nWeek 2: Beowulf\n\nWeek 3: Chaucer—“The Pardoner’s Tale”\nSir Gawain and the Green Knight\nMorte de Arthur\n\nWeek 4: Sonnets and Drama\nWyatt\nShakespeare (Sonnet 116, 130, 138)\nSidney\nDr. Faustus (scenes chosen)\n\nWeek 5: Twelfth Night\n\nWeek 6: William Bradford. From “Of Plymouth Plantation” \nRead Milton (1608–74) from Paradise Lost, “When I consider How My Light is Spent,” Donne (1572–1631), “Death Be not Proud,” Marvell “To His Coy Mistress” (1621–78), Civil War poetry \n\nWeek 7: from Gulliver's Travels\n\nIn class: Lady Wortley Montagu, Letter\n“The Lover” (1747)\nChristopher Smart, “[My Cat Jeoffrey]” from Jubilate Agno. (1722–71)\n“Elegy Written in a Country Churchyard” Gray (1751)\n\nWeek 8: \nSamuel Johnson, from Rasselas (1759), Dictionary (1755)\nIn-class: \nfrom The Castle of Otranto (1764)\n\nWeek 9: Midterm exam\n\nWeek 10: 1776 (film)\nRobert Burns: “To a Mouse,” “To a Louse,” “Auld Lang Syne,” “A Man’s a Man for A’ That.”\n\nWeek 11: \nfrom Benjamin Franklin’s Autobiography\nThomas Jefferson “The Declaration of Independence” \n\nContexts (in-class):\nWilliam Godwin. Caleb Williams “Preface”\nfrom The Mysteries of Udolpho (1794)\nA Vindication of the Rights of Men, A Vindication of the Rights of Woman, Edmund Burke (Marie Antoinette), Rights of Man, Tom Paine\n\nWeek 12: From Jane Austen's Northanger Abbey, ch. 14\n\nIn-class reading of Romantic poetry: Shelley: “Ozymandias,” Blake: “Little Lamb Who Made Thee?” “The Tyger,” “The Chimney Sweep,” Wordsworth: “Simon Lee,” “French Revolution” \n\nWeek 13: Dickens. A Christmas Carol (1843). \nIndustrialization.\n\nWeek 14: Dickens. A Christmas Carol (1843).\nTennyson’s Idylls of the King.\nGhost stories.\n\nWeek 15: Native Americans Removal and Resistance. p. 1252-1271.\nfrom Narrative of the Life of Frederick Douglass (1845). \n\n\nWeek 16: from Harriet Beecher Stowe’s Uncle Tom’s Cabin (1852).\n\nWeek 17: Frankenstein\nReview for final exam\n\nWeek 18: Final Exam","scorePolicy":"Grade Percentages:\n\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nIn-class Writing and Reading Quizzes: 25%\nPresentations/Groupwork: 15%\nMidterm: 20%\nFinal: 30%\nIn-class Activities and Participation: 10%\n\nGrading Criteria:\n\nA　　Superior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\n\nB　　Achievement that is significantly above the level necessary to meet course requirements.\n\nC 　　Achievement that meets the course requirements in every respect. \n\nD 　　Achievement that fails to meet fully the course requirements. \n\nF 　　Achievement that is not worthy of credit. The only way to outright fail this course is through lack of effort and/or plagiarism. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.","materials":"Course Packets\nBeowulf\nA Christmas Carol\nMS Teams Materials","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Students should complete all the readings. If we are not meeting in person, we will have online oral quizzes and tests (via chat in MS Teams), online or video presentations, homework (to be uploaded), and take-home essay questions. Students may need to meet outside in groups to complete a video group project. (We will discuss this further.)</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">We are using MS Teams. All announcements will be there. If you are thinking about enrolling and need to take a sample class, please contact me so that I can add your ID number. Only students with valid Taipei Tech ID numbers may take the class. Until the MS Teams site is up and running, you may also look for announcements on the course web page: https://britamericanlit.wordpress.com/british-and-american-literature/.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">We will use MS Teams. Please see the above. You may also check the website for announcements until you are added to MS Teams: https://britamericanlit.wordpress.com/british-and-american-literature/.</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">I am most likely to be available for either online or in-person meetings during my office hours (Mondays from 3:10–5:00 and Friday from 10:10–12:00). Please make an appointment with 24-hours advance notice if possible.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Please stay tuned so I can let you know how to purchase the books.</div>\n\n  "}]
