[
  {
    "name": "劉傳銘",
    "email": "cmliu@ntut.edu.tw",
    "latestUpdate": "2021-08-30 15:07:07",
    "objective": "Data Science is an emerging multi-discipline field which is the intersection of computer science, statistics, and mathematics.  This course is designed to provide a hands-on introduction to Data Science by challenging students to build predictive models. In this course, we will discuss some fundamental components for efficiently and effectively handling the data as well  as presenting data.",
    "schedule": "-An Overview (3 hrs)\n-Mathematical Preliminaries (6 hrs)\n-Data Munging (3 hrs)\n-Scores and Rankings (3 hrs)\n-Introduction to Statistical Analysis (6 hrs)\n-Visualizing Data (3 hrs)\n-Mathematical Models (3 hrs)\nMidterm Exam (3 hrs)\n-Fundamental Linear Algebra (6 hrs)\n-Linear and Logistic Regression (6 hrs)\n-Distance and Network Methods (3 hrs)\n-Case Study: Practical Applications (3 hrs)\n-Project Demo (6 hrs)",
    "scorePolicy": "Class Participation: 5%\nHomework/Report: 30％\nProject: 65% (Proposal 25% ; Final Demo 20%; Report 20%)",
    "materials": "Steven S. Skiena, The Data Science Design Manual, Springer-Verlag, 2017, ISBN-13: 978-3319554433\nReferences:\n- Cathy O'Neil and Rachel Schutt. Doing Data Science, Straight Talk From The Frontline. O'Reilly. 2014.\n- Jure Leskovek, Anand Rajaraman and Je\u000brey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press. 2014. (free online)\n- Kevin P. Murphy. Machine Learning: A Probabilistic Perspective. ISBN 0262018020. 2013.\n- Foster Provost and Tom Fawcett. Data Science for Business: What You Need to Know about Data Mining and Data-analytic Thinking. ISBN 1449361323. 2013.\n- Avrim Blum, John Hopcroft and Ravindran Kannan. Foundations of Data Science.\n(Note: this is a book currently being written by the three authors. The authors have made the first draft of their notes for the book available online. The material is intended for a modern theoretical course in computer science.)",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "For evaluation, in this course, we will use the presentations for project proposal and demonstration respectively instead.",
      "courseInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
