[{"name":"周峻忠","email":"stephenchou@ntut.edu.tw","latestUpdate":"2021-09-05 17:03:07","objective":"The objectives of our physical education program are to train the body and mind, promote sound physical and mental development, cultivate sports ethics, promote teamwork, and develop lifelong sports habits.\n(1)Students will learn the concept of health management and lifelong exercise so that they can learn to participate and learn in a more diversified way.\n(2) Practical courses to enhance health fitness, to achieve health promotion and disease prevention through their own participation experience, and to understand the concept and methods of health fitness.\n(3) Through physical fitness and health and exercise related videos, students can understand the impact of exercise on physiology (body) and develop a habit of exercise.\n(4) To use the equipment in the physical fitness classroom to improve cardiorespiratory and muscular fitness, and to design their own cardiorespiratory, muscular and physical fitness programs.","schedule":"Week 1 Introduction to the course and introduction \nWeek 2 Health Fitness and Athletic Fitness \nWeek 3 Assessment, operation and application of cardiorespiratory fitness (1) \nWeek 4 Assessment, operation and application of cardiopulmonary fitness (2) \nWeek 5 Evaluation, operation and application of muscle strength and muscle endurance (1)\nWeek 6 Evaluation, operation and application of muscle strength and muscle endurance (2) \nWeek 7 Evaluation, operation and application of muscle strength and muscle endurance (3)\nWeek 8 Evaluation, manipulation and application of muscle strength and endurance (4) \nWeek 9 Midterm examination \nWeek 10 Flexibility assessment, operation and application\nWeek 11 Exercise and weight management \nWeek 12 Special training method (1): Interval training, Fartlek training\nWeek 13 Special training method (2): Intensification training, vibration training, stress training\nWeek 14 Special training method (3): Circuit training, crossfit\nWeek 15 Exercise prescription design\nWeek 16 Physical fitness assessment 1\nWeek 17 Physical fitness assessment 2\nWeek 18 Final Exam","scorePolicy":"(1) Regular Grade &amp; Attendance Grade: 30%\n\n(2) Midterm Grade: 20%\nAccumulated physical activity after school hours\n\n(3) Final Academic Test: 40% \nCardiorespiratory endurance and muscle strength test","materials":"Provided by teacher.","foreignLanguageTextbooks":true,"covid19":{"lv2Description":"Please join the line club\nhttps://line.me/R/ti/g/xF4IVqklzk ","courseScoreMethod":"1. Regular Grade70%\nComplete 2 hours exercise per week for 15 weeks (60 points)\n60/15=4 points/each time, check once every 2 weeks.\nYou can use classroom exercise or home workouts (group report mode, ie: APP record, paper record, video record)\n\n2. Paper report (30%)\n&gt;Self-rating(15%) + report (15%)","courseInfo":"Please join the line club\nhttps://line.me/R/ti/g/xF4IVqklzk","courseURL":"Please join the line club\nhttps://line.me/R/ti/g/xF4IVqklzk","contactInfo":"Please join the line club\nhttps://line.me/R/ti/g/xF4IVqklzk","additionalInfo":null,"lv2Method":"分流上課"}}]
