[
  {
    "name": "白俊恩",
    "email": "allenbalaz@gmail.com",
    "latestUpdate": "2021-09-14 10:34:27",
    "objective": "本課程目的在啟發學生英語聽力，分析及思辨能力。本課程自報紙，雜誌及電視選取豐富的教材, 以訓練聽力及筆記的技巧。 此外，在課堂上將討論一些有爭議性的或者有趣的議題，以培養學生獨立思辨能力。\nThe course aims to develop the student's listening techniques and critical thinking in English. A variety of texts will be selected from newspapers, magazines and T.V. to reinforce listening training and note-taking skills. Besides, some controversial or interesting issues will be discussed in class to encourage the student's independent and critical thinking.",
    "schedule": "1 House M.D. Pilot + Qs, group discussion for presentation\n2 Presentation; Feedback, question review to learn how to read television as text\n3 House M.D. Games + Qs, group discussion for presentation\n4 Presentation; Feedback, question review to learn how to read television as text\n5 House M.D. The Social Contract + Qs, group discussion for presentation\n6 Presentation; Feedback, question review to learn how to read television as text\n7 House M.D. The Greater Good + Qs, group discussion for presentation\n8 Presentation; Feedback, question review to learn how to read television as text\n9 MIDTERM EXAM Group 1\n10 MIDTERM EXAM Group 2\n11 House M.D. Informed Consent + Qs, group discussion for presentation\n12 Presentation; Feedback, question review to learn how to read television as text\n13 House M.D. One Day, One Room + Qs, group discussion for presentation\n14 Presentation; Feedback, question review to learn how to read television as text\n15 Ally McBeal The Pursuit of Unhappiness; group discussion\n16 Cross cultural communication without language: Bean’s Holiday\n17 FINAL EXAM Group 1\n18 FINAL EXAM Group 2\n\nNOTE: If the Taiwan CDC declares a Stage 1 COVID-19 alert, we will follow the syllabus that is already online. \n\nWhile we remain in Stage 2, we will begin by watching and discussing downloaded video files about language learning, how to have a conversation, and how to learn faster. \n\nI will send the class leader related pdf files (in English and Chinese) which you are required to read because I will refer to them during the following week(s). \n\nFrom there, we can proceed to live conversation/discussion and individual breakrooms (if Google Meet allows this.) We can also watch AND discuss videos you have asked for or, if no one says anything about that, then it will be my responsibility to decide which videos might be of interest and benefit to you.",
    "scorePolicy": "Grading: Midterm 20%, Final 20%\n\nSelf-Evaluation: 60% (participation in discussions in class or in online Google Meets, asking questions in class or online or via email, attendance, being on time, paying attention, etc.)",
    "materials": "Print, audio and visual materials will be provided by the teacher.\n\nCONTACT INFORMATION: allenbalaz@gmail.com",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "midterm = 25% individual 5-7 minute oral presentations\nfinal = 25% individual 5-7 minute oral presentations\nself-evaluation = 50% (the form will be distributed by the class leader at the end of the semester). \nThe self-evaluation includes attendance (joining Google Meets on time) and joining in general or group discussions. ALL STUDENTS ARE REQUIRED TO TURN ON THEIR CAMERAS DURING GOOGLE MEETS. This is part of your self-evaluation. I will be keeping records for each Google Meet to use when evaluating the self-evaluation percentage you give yourself.",
      "courseInfo": "Please check the syllabus.",
      "courseURL": "There is no link as yet. You will have to contact me through email to get the link at allenbalaz@gmail.com.\n\nThe link will be sent each week to the class leader. If I can find a way to set up a permanent link for “recurring event” through Google Meet, then we will use that link. But we will begin with temporary links.",
      "contactInfo": "First of all, contact the relevant university office to see how you add/drop a class. That is an official university matter.\n\nIf you want my permission for anything, contact me at allenbalaz@gmail.com",
      "additionalInfo": "Explanations for important aspects of the class such as how to prepare, practice, and an oral presentation, filling out the self-evaluation form, attendance, etc. will be given at the appropriate times as the semester unfolds.",
      "lv2Method": "遠距上課"
    }
  }
]
