[
  {
    "name": "曾添文",
    "email": "f10403@ntut.edu.tw",
    "latestUpdate": "2021-09-01 17:04:30",
    "objective": "Chemistry is the study of matter, its properties, and the changes it undergoes. Particularly, it is central to our fundamental understanding of many science-related fields. This course will introduce students to discuss about several topics in chemistry. All the studying issues are listed and classified into two parts, which are applied in two semesters courses. The first part is described as following, such as chemical foundations, atoms, molecules, and ions, stoichiometry, types of chemical reactions and solution stoichiometry, gases, thermochemistry, atomic structures and periodicity, bonding: general concepts, covalent bonding. Secondarily, all chapters are discussed in the second semester, including liquids and solids, properties of solutions, chemical kinetics, chemical equilibrium, acids and bases, acid-base equilibria, solubility and complex-ion equilibria, spontaneity, entropy, and free energy, electrochemistry. The learning goals are how to  establish students well fundamental concepts in chemistry.\n\n化學是學習物質、性質及它的變化。尤其它是關係我們去了解很多相關科學領域的核心基礎學問。所有學習的主題分成兩學期予以教導。第一部份介紹化學基本觀念，原子、分子、離子，計量化學，化學反應形式及溶液中計量，氣體，熱化學，原子結構與週期性，鍵結觀念，共價鍵。第二學期介紹液體及固體，溶液之物理性，化學動力學，化學平衡，酸及鹼，酸及鹼平衡，溶解度及錯合物之平衡，自發反應、自由度、自由能，電化學。所有學習目標為讓學生奠下良好化學基礎。",
    "schedule": "1~2 週. Chemical Foundations (化學基本觀念)\n3~4 週. Atoms, Molecules, and Ions (原子、分子、離子)\n5~6 週. Stoichiometry (計量化學)\n7~8 週. Types of Chemical Reactions and Solution Stoichiometry (化學反應形式及溶液中計量)\n9~10 週. Gases (氣體)\n11~12 週. Thermochemistry (熱化學)\n13~14 週. Atomic Structures and Periodicity (原子結構與週期性)\n15~16 週. Bonding: General Concepts (鍵結觀念)\n17~18 週. Covalent Bonding: Orbitals (共價鍵)",
    "scorePolicy": "1. 上課出席佔 10%\n2. 一學期中共考 7 次佔 90%\n\nGrading Policy: 1. Students must attend the course that will account for 10% of the \n                               grade.\n                           2. Grade point average: taking seven examinations in a semester and given \n                               90% of the grade.",
    "materials": "General Chemistry\nThe Central Science\nFourteenth Edition\nT. L. Brown, H. E. LeMay, J. B. E. Burssten, C. J. Murphy, P. M. Woodward, M. W. Stoltzfus, M. W. Lufaso\n2018 Pearson",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "平時考、期末考採實體紙筆測驗共三次，同學考完時將試卷照相後，把檔案寄到老師信箱: f1030tseng@gmail.com，收集後閱卷核給分數。",
      "courseInfo": "如果學期初就實施遠距教學，請班代至化工館 413 室面談，告知老師手機號碼: 0918379251，並相互建立 line 通聯方式。",
      "courseURL": "請通聯老師，手機號碼: 0918379251",
      "contactInfo": "請通聯老師，手機號碼: 0918379251",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
