[
  {
    "name": "楊元森",
    "email": "ysyang@ntut.edu.tw",
    "latestUpdate": "2021-09-15 14:32:19",
    "objective": "大學入門是針對大一新生所開授之全校性課程。用以協助學生:(一)認識高等教育的理念、目的與價值(二)有效學習(三)涵養正視困境並妥適因應能力。藉以實踐自我鍛鍊，自我掌握，自我經營並建構宏觀視界的高等教育宗旨。依據提供服務準則,工程師們須以誠實公平公正正當和奉獻保護公共健康,安全及幸福。工程師們必須以專業標準的行為履行最高的倫理準則。本課程以（1）工程倫理概述（2）衝突與抉擇（3）守則與解說（4）個案分析，提供學生瞭解及研析。",
    "schedule": "依本校通識中心規劃進行 (http://www.gate.ntut.edu.tw/bin/home.php)",
    "scorePolicy": "Attendance and Interaction: 50% +/- 20%\nAssignments: 50% +/- 20%",
    "materials": "依本校通識中心規劃進行 (http://www.gate.ntut.edu.tw/bin/home.php)",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Under the premise of the government and university regulations, the grading will be based on online attendance, online interaction, and assignments. \n\nNo midterm and final examination.",
      "courseInfo": "For lectures between Sep.17 and Nov 12: \nUnder the premise of the government and university regulations, the lecture will try to give lecture online through ...\n\nMicrosoft Teams (MS Teams) and login with [your student ID]@cc.ntut.edu.tw and you will see this course. For example, 110340999@cc.ntut.edu.tw\n\nOnline instant quiz can be a part of semester grading. There is no makeup quiz if you miss the online instant quiz. Lecture videos will be announced at NTUT iStudy (北科 i 學園 PLUS) and MS Teams.",
      "courseURL": "Please install MS Teams in your computer and login with [your student ID]@cc.ntut.edu.tw and you will see this course. \n\nFor example, if your student ID is 110340999, your MS Teams account should be 110340999@cc.ntut.edu.tw",
      "contactInfo": "Email to ysyang@ntut.edu.tw  with title of \"About NTUT Course 292494 from 110340xxx (your student ID)\" or 「有關大學入門與工程倫理, 學號 110340xxx 」. Email without correctly formatted title could be ignored.",
      "additionalInfo": "You need to use Microsoft Teams wit an account given from NTUT to attend the online lecture and examinations.\n\nFor example, if your student ID is 110340999, your MS Teams account should be 110340999@cc.ntut.edu.tw",
      "lv2Method": "遠距上課"
    }
  }
]
