[{"name":"黃雅雯","email":"Yw1002.huang@msa.hinet.net","latestUpdate":"2021-09-16 08:41:12","objective":"本校科技大學的國文課程，以能力及素養之培植為導向， 並以精深致用為授課標的，方能不負大學國文課程之名， 並符合本校重視實務應用的優良傳統。 依授課教師之取擇，課程可概分為兩大類。 一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。 二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。 期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.","schedule":"第一週    09.20   中秋節調整放假\n第二週    09.27   課程介紹\n第三週    10.04   中國古典小說的發展\n第四週    10.11   國慶日遇例假補假\n第五週    10.18   《西遊記》西天取經之路\n第六週    10.25   《西遊記》角色人物\n第六週    10.26   國文會考\n第七週    11.01   《西遊記》中的妖魔鬼怪\n第八週    11.08   《西遊記》中的神仙佛尊\n第九週    11.15   創作主題企劃提案報告\n第十週    11.22   《西遊記》與情欲\n第十一週  11.29   《西遊記》與寶物\n第十二週  12.06   《西遊記》與詩詞\n第十三週  12.13   《西遊記》與宗教\n第十四週  12.20   《西遊記》與節俗\n第十五週  12.27   《西遊記》與遊戲\n第十六週  01.03   期末考試：「《西遊記》與生活文化」成果發表會\n第十七週  01.10   全校共同課程：履歷自傳與口語表達\n第十八週  01.17   期末考試：「《西遊記》與生活文化」成果發表會","scorePolicy":"期末考試：百分之二十\n會考：百分之五\n書香計畫心得：百分之五\n作業（二篇作文）：百分之四十\n課堂分組報告：百分之二十\n綜合考評（包含出席、學習態度）：百分之十","materials":"吳承恩原著、徐少知校、朱彤、周中明注《西遊記校注》台北：里仁書局\n黃慶宣、龔鵬程等著《西遊記：取經的卡通》台北：時報文化\n余國藩《余國藩西遊記論集》台北：聯經出版\n朱一玄、劉毓忱編《西遊記資料匯編》天津：南開大學出版社\n《西遊記詩詞賞析》台北：國家出版社","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"1.因應疫情二級警戒，國文課程使用Microsoft  Teams同步教學系統進行遠距教學。\n2.國文課程中安排的同學分組報告和討論，亦透過Microsoft Teams同步教學系統進行線上報告和討論。\n3.國文課程需繳交的報告或成果作品，請同學於當週上課前將電子檔案上傳至課程團隊，以利線上報告與討論。","courseInfo":"1.課程相關訊息，公告於北科i學園課程公告與檔案教材版，請同學隨時上網瀏覽。\n2.若有課程臨時動議或訊息須知，亦將於國文課程團隊中宣布，周知同學。","courseURL":"因應疫情二級警戒，國文課程使用Microsoft Teams同步教學系統進行遠距教學。\n1.開學第一週上課，即使用Microsoft Teams同步教學系統進行遠距教學。\n2.請同學於上課前，先下載Microsoft Teams軟體，之後登入系統。\n登入帳號：學號@cc.ntut.edu.tw  \n登入密碼：校園入口網站密碼\n3.登入系統後，即可見到有著課號的國文課程團隊名稱(110-1_292461_國文)，點選進入課程。\n4.若無見到課程團隊，請使用課程團隊代碼加入團隊。課程代碼：v8kxw2l。","contactInfo":"老師Email：yw1005.huang@msa.hinet.net\n或洽通識教育中心助理","additionalInfo":null,"lv2Method":"遠距上課"}}]
