[
  {
    "name": "曾昱翔",
    "email": "eantyh@gmail.com",
    "latestUpdate": "2021-09-08 14:51:13",
    "objective": "Programming has become one of the \"essential literacy\" in recent years. While not each student, especially a literature/English major, is required to be a programming expert, a basic understanding of computational thinking would benefit undergraduates from all fields.\n\nIn this course, we pick front-end development as our entry point to the vast possibilities of programming. We will introduce HTML, CSS, and JavaScript. The most important reason for this is they provide immediate feedback, which is helpful for beginners. Secondly, the potential applicability is no doubt: a web page is still the most frequently-used way to communicate ideas, and many human-computer interactions still happen on web pages. Thirdly, although primarily used in web pages, JavaScript has become more and more omnipotent in every aspect. With the introduction of NodeJS, it gains significant traction on server back-end or general-purpose programming. Moreover, JavaScript is a great language. Although it starts as a front-end scripting language, it learns a lot from other successful paradigms. \n\nThis course will gradually introduce how to talk about things with programming language in the context of HTML, and how to change their appearances (states) with CSS. Afterward, we will cover basic programming concepts, such as variables, conditionals, loops, data structures, modules, etc. The course is organized as an one-hour lecture and an one-hour hand-on lab session. Students are expected to follow the course requirements, including participation, assignments, mid-term exams and a final project.\n\n## Objectives\n\nUpon successful completion of the course, students will know how to build a complete web page and have a basic understanding on programming and JavaScript.\n\nThe course also serves as a window through which students can find their way into more advanced and interesting aspects of programming.",
    "schedule": "| Week | Date   | Topic          |\n|:-----:|:------:|:----------------|\n|  03 | 09/27  |  Orientation &amp; Environment Setup\n|  04 | 10/04  |  HTML\n|  05 | 10/11  |  CSS\n|  06 | 10/18  |  (Double tenth day, make-up)\n|  07 | 10/25  |  JavaScript and jQuery\n|  08 | 11/01  |  Variables and Data structures\n|  09 | 11/08  |  Data structures and looping\n|  10 | 11/15  |  Conditionals\n|  11 | 11/22  |  Mid-term\n|  12 | 11/29  |  Events, callback, Promise\n|  13 | 12/06  |  HTML Forms\n|  14 | 12/13  |  Ajax &amp; JSON\n|  15 | 12/20  |  HTML5 APIs\n|  16 | 12/27  |  Intro to UI framework: Bootstrap\n|  17 | 01/03  |  Ecosystem: where the cool kids are \n|  18 | 01/10  |  Final project presentation",
    "scorePolicy": "Assignments: 30%\nMidterm: 30%\nFinal project: 30%\nClass participation: 10%",
    "materials": "(TBA)",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "(TBA)",
      "courseInfo": "因應疫情影響，本課程採遠距上課。學期初第一堂課將在以下Google Meet連結進行。第一週課程介紹也會一併說明課程進行方式和使用平台。\n\nDue to the pandemic, this course is organized as a remote learning class. We will describe the organization and platform of this course in the first week's orientation. The first week's class will be held on Google Meet (link below.)",
      "courseURL": "The first class will be held on Google Meet:\nhttps://meet.google.com/ohu-eouj-ozw",
      "contactInfo": "Please feel free to email me at seantyh@gmail.com",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
