[
  {
    "name": "劉靜怡",
    "email": "littlefucat@gmail.com",
    "latestUpdate": "2021-09-14 18:42:45",
    "objective": "本校科技大學的國文課程，以能力及素養之培植為導向， 並以精深致用為授課標的，方能不負大學國文課程之名， 並符合本校重視實務應用的優良傳統。 依授課教師之取擇，課程可概分為兩大類。 一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。 二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。 期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.",
    "schedule": "第一週：課程介紹與說明。\n第二～五週：連稱、管至父之亂（齊襄公出獵遇鬼）。\n第六～八週：荀偃夢與厲公訟。\n第九週：期中考\n第十～十三週：下宮之難（趙氏孤兒）。\n第十四～十六週：晉景公夢大厲（病入膏肓）。\n第十七週：泓水之戰（宋襄之仁） \n第十八週：期末考。",
    "scorePolicy": "1. 期中考：筆試，佔總成績 30％。\n2. 期末考：筆試，佔總成績 30％。\n3. 平時成績：課堂表現及出席率，佔總成績 30％。\n4. 國文會考：5％。\n5. 書香計劃：5%",
    "materials": "1.《春秋左傳注》楊伯峻 編著 北京：中華書局\n2.《左傳論評選析新編》洪順隆 編著 中國文化大學出版部\n3.《鎔裁文史的經典 — 左傳》簡宗梧 著 黎明文化事業\n4.《東萊博議》宋 呂祖謙 著 吳紹志 註譯  新世紀出版社\n5.《左傳譯注》李夢生 撰 上海古籍出版社\n6.《左傳擷華》林琴南 選 文光圖書公司\n7.《春秋左傳讀》章太炎 著 學海出版社\n8.《左傳譯文》沈玉成 著 源流出版社\n9.《左傳句解》 綜合出版社\n10. 《左傳選讀》   開明書局\n11. 《左傳正義》 (晉) 杜預注.(唐) 孔穎達疏\n12. 《國史大綱》錢穆 著 商務印書館\n13. 《史記》 司馬遷 著 台灣商務印書館\n14. 《東周列國志》 馮夢龍 著 世界書局",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "評量日期與方式：\n1. 期中、期末考試與學校行事曆之規定日期相同\n2. 採「北科 i 學園 pius」之線上測驗或作業繳交",
      "courseInfo": "上課時間與課表安排相同\n上課方式：ppt 檔案講授錄製（非同步）+「北科 i 學園 plus」之「線上討論」（與上課時間同步）\n教材提供平台：請於「北科 i 學園 plus」之「教材區」下載『上課投影片』（文字 + 聲音檔）\n其他相關上課資訊，皆統一於上課前公布於「北科 i 學園 plus」之「課程公告」欄位，請同學們務必注意。",
      "courseURL": "「北科 i 學園 plus」之「國文」課程。\n第一週上課會使用 google meet，上課日前一天，會將連線網址公佈在北科 I 學園之「課程公告」欄內，尚未加選成功的同學，請注意課程大綱內的「上課網址」更新內容。",
      "contactInfo": "聯絡方式：\n上課時間可透過「北科 i 學園 plus」之「線上討論室」留言，或 mail 至電子郵件信箱：littlefucat@gmail.com",
      "additionalInfo": "上課與考試方式會視疫情變化程度調整，請隨時注意課程「公布欄」通知。",
      "lv2Method": "遠距上課"
    }
  }
]
