[{"name":"張詠翔","email":"shawnchang@ntut.edu.tw","latestUpdate":"2021-09-02 15:07:11","objective":"The goal for this advanced ESL reading and conversation course is to further prepare students to participate successfully in the university courses where English language skills are essential. This course is designed to improve your English in reading, speaking, and listening in particular. Besides the required textbook, comprehensive supplementary teaching materials and aids will also be utilized.\nThere will be frequent discussions and chances for you to speak up and express yourselves. Please do not be afraid to take part in group discussion—this is a pressure-free and friendly learning environment. All students are encouraged to reach out to your classmates, make friends with them, and learn together—in English!","schedule":"A detailed course syllabus will be distributed in the first course meeting.","scorePolicy":"Practice TOEIC exam   20%    \nMidterm exam  15%\nFinal exam  15%\nOral presentation   20%\nParticipation   10%\nAttendance   20%","materials":"Real Reading 4: Creating an Authentic Reading Experience (published by Pearson Longman)","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">如果期中考週和期末考週還是只能遠距教學，期中考週會採取線上進行，期末考則會以非考試方式替代。\nIf online teaching will continue throughout the fall semester, the midterm will be administered online and the final exam will be replaced by a small personal project.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">請務必在第一天上課時，使用Google Meet 上線（上課網址如下）。我會告訴大家這學期課程和評量可能的調整。\nPlease do show up on the first day of class via Google Meet (the link can be found below). I will inform you of potential adjustments regarding course content and class assessment.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">meet.google.com/mwc-sbav-xpj</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Please email me at shawnchang@mail.ntut.edu.tw</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
