[{"name":"黃柏鈞","email":"pchuang.19840320@gmail.com","latestUpdate":"2021-08-30 01:31:45","objective":"(Tentative)\n本課程講授次世代記憶－儲存媒體之軟硬體技術、記憶體架構、存取特性、以及管理策略。此外，本課程亦將討論不同記憶－儲存系統，如檔案系統、資料庫、NoSQL資料庫、Key/Value儲存、內容感知儲存、近似儲存等之架構與設計，以及記憶體中運算等創新之關鍵技術。\n\n請注意本課程以全英語授課，並採用全英語教材。\nThis course introduces the hardware/software technologies, architecture, access characteristics, and management strategies of next-generation memory/storage media. In addition, we shall also cover the architecture and design issues of various memory–storage systems, such as file systems, databases, NoSQL databases, key–value store, content-aware storage, and approximate storage. The key technologies such as processing-in-memory (PIM) are also discussed. \n\nPlease note that this course is given in full English, and adopts full-English materials.","schedule":"(Tentative)\n- Week 1. Modern computer architecture\n- Week 2. The memory hierarchy\n- Week 3. Software–hardware collaboration for memory hierarchy management\n- Week 4. SRAM and DRAM (I): basic characteristics\n- Week 5. SRAM and DRAM (II): memory management in Linux\n- Week 6. Mechanical hard disk (I): basic characteristics\n- Week 7. Mechanical hard disk (II): disk scheduler and defragmentation techniques\n- Week 8. Shingled magnetic recording disk (SMRD): theory and practice in Linux\n- Week 9. NAND flash memory (I): basic characteristics and the flash translation layer (FTL)\n- Week 10. NAND flash memory (II): address mapping, space allocation, and wear leveling algorithms\n- Week 11. NAND flash memory (III): flash-aware data structures and march-like testing of flash chips\n- Week 12. Phase-change memory (PCM) (I): basic characteristics\n- Week 13. Phase-change memory (PCM) (II): write reduction techniques\n- Week 14. Spin-torque-transfer random-access memory (STT-RAM), resistive random-access memory (ReRAM), and racetrack memory (RM)\n- Week 15. Architecture of solid-state disks (SSDs)\n- Week 16. File system basics\n- Week 17. File system forensics\n- Week 18. Advanced topics: Approximate storage and processing-in-memory (PIM)","scorePolicy":"(Tentative)\n- Midterm exam (30%)\n- Final presentation (40%)\n- Homework assignments (15%)\n- In-class participation (15%)","materials":"(Tentative)\nBruce Jacob et al., Memory Systems: Cache, DRAM, Disk, Morgan Kaufmann, 2007.\nRecent papers in related fields.","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Replace the final examination by 2~4 times of homework assignments, in-class quizzes, and semester essays. Raise the weight of in-class participation.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Due to the continuing pandemic Covid-19, the course will be given remotely through Google Meet if the warning level remain 2 or higher.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Official course website: https://www.facebook.com/groups/589967012017377\nOnline course link: https://meet.google.com/eza-uqin-nam</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Office: Room 309-1, Complex Building\nOffice hours: During 11AM~5PM, Monday, or by appointment.\nEmail: po.chun.huang@mail.ntut.edu.tw</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">N/A</div>\n\n  "}]
