[{"name":"邱垂昱","email":"cychiu@ntut.edu.tw","latestUpdate":"2021-09-06 12:06:15","objective":"The objective of this course is to teach students how to make smart financial decisions in an effort to create most economical investment return. This course focuses on identification of investment projects, investment decision-making, project analysis and evaluation methods. The subjects includes: the investment environment, cost concepts and behaviors, understanding financial statements, investment project evaluation, interest rate and inflation rate, own - and debt financing, internal and external financing, depreciation, income taxes, developing project cash flows, capital budgeting, uncertainty and risk. Various factors that affect the financial decision problems such as economics, management, environment, and politics are discussed to help decision makers properly resolve investment decisions.","schedule":"Weekly Contents/Topic\n1 Introduction\n2 Project Investment Decisions\n3 Cost Concepts and Behaviors\n4 Understanding Financial Statements\n5 Interest rate and inflation rate\n6 Investment Analysis,  own - and debt financing, internal and external financing\n7 Capital Budgeting\n8 Depreciation\n9 Income Taxes\n10 Midterm Exam\n11-12 Developing Project Cash Flows\n13-14 Project Risk and Uncertainty\n15-16 Replacement Analysis\n17 Project Investment Case Study\n18 Final Report and Representation","scorePolicy":"30% Homework Assignments, Class Participation and Discussion\n30% Midterm Exam\n40% Final report and Representation","materials":"Fundamentals of Engineering Economics (4th Edition)\nby Chan S. Park\nPublisher:  Pearson\n\nSelected open source materials","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"midterm exam: related problem solving or case study\nfinal report and Representation: submit a final report on some selected topics, represent the report to the class via online platform( google meet)","courseInfo":"For the distance learning, the on-line teaching will be given during the official class hours using Google Meet. \nCourse material and homework assignment will be released on the NTUT i-school plus (https://istudy.ntut.edu.tw/learn/index.php) platform.","courseURL":"The link to distance learning will be announced on the NTUT i-school plus (https://istudy.ntut.edu.tw/learn/index.php) course platform.","contactInfo":"email: cychiu@ntut.edu.tw\nphone: 02 27712171 ext 4541\nTechnology building Room 841\nOffice hours: Mon. 3Pm-5Pm, Tue. 3Pm-5Pm","additionalInfo":null,"lv2Method":"遠距上課"}}]
