[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2021-09-01 11:53:04","objective":"此課程將介紹各種實驗之配置法及統計分析方法和結論，其中包括：一因子實驗 ‧區集和拉丁方格 ‧不完全區集設計 ‧多因子實驗 ‧部份因子實驗 ‧巢狀或階層實驗 ‧變異數分析 ‧迴歸分析 ‧交互變異分析\n\nStatistical design of experiments is a wide subject that treats a large number of methods for planning experimental investigations in a manner that ensures statistically valid conclusions. This course introduces students to concepts and techniques of classical and applied experimental design and covers the statistical design of experiments for systematically examining how a system functions. Topics covered will include: introduction to fundamentals and principles of experiments, blocking designs, completely randomized designs (CRD), randomized completely block designs (RCBD), full factorial designs with two levels, fractional designs with two levels, Latin square designs, 3-leval designs (CCD, BBD, Cuboidal designs), response surface methodologies, nested and split-plot designs, and optimal design theories.","schedule":"Week 1 Introduction to fundamentals of engineering statistics and principles of experimentation\nWeek 2 Simple comparative experiments: One-way ANOVA\nWeek 3 Simple comparative experiments: CRD (Completely randomized design)\nWeek 4 RCBDs (Randomized complete block designs)\nWeek 5 Factorial designs and 2-level factorial designs\nWeek 6 2-level fractional factorial design and resolution\nWeek 7 3-level (fractional) factorial designs and multi-factor designs\nWeek 8 Fitting regression model: Estimation, diagnostics and prediction \nWeek 9 Midterm exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 10 Latin square designs\nWeek 11 Nested designs and split-plot designs\nWeek 12 Mixture designs\nWeek 13 Random effects models\nWeek 14 Response surface methodology and process optimization (including EVOP &amp; Simplex EVOP)\nWeek 15 Box-Cox transformation and GLM (Generalized linear model)\nWeek 16 Unbalanced designs (missing data) and covariance analysis of factorial designs\nWeek 17 Computer-generated (optimal) design theory\nWeek 18 Final exam (In-Class, 1 Cheat sheet, Calculator)","scorePolicy":"Final Exam: 30 %\nAssignment: 15 %\nIndividual project: 50%\nAttendance: 5 %","materials":"Montgomery, D. C. (2017), Design and Analysis of Experiments, 9th Ed., Wiley. \nSupplementary references: Will be noticed if necessary.\nAdditional materials will be covered from other texts and/or from recent literature.","foreignLanguageTextbooks":true}]
