[{"name":"蔡佩芳","email":"ptsai@ntut.edu.tw","latestUpdate":"2021-09-08 14:20:22","objective":"企業運營管理要控制的主要目標是質量，成本，時間和靈活性，它們是在全球化的挑戰下，企業競爭力的根本。此課程探討服務業與製造業中，對於產品的關鍵生產和服務過程，從設計、監督與控制、流程與品質改善等議題，進而擴展到供應鏈中的存貨與物流。課程著重於理解生產與服務流程對於組織策略的角色，制定與評估相對應的效率指標，並進一步介紹相關議題可使用的分析工具。\nThis course is designed to address the key operations and logistical issues in service and manufacturing organizations that have strategic as well as tactical implications, which also serve as the core competitiveness in the global arena. It includes the introduction to the issues in designing, monitoring and controlling, efficiency and quality improving of the operations in an organization, and then expands to the entire supply chain. With class discussion and case study, the specific objectives include: to understand the role of operations management in the overall business strategy, to identify and evaluate the key factors in the design of effective operating systems, and to identify a range of tools appropriate for analysis of operating systems of the firm.","schedule":"Week1. Course Introduction and Overview\nWeek2~3.Process Strategy\nWeek4~5. Process Analysis\nWeek6~8. Quality and Performance\nWeek10~11. Inventory Management\nWeek12~13. Lean Systems\nWeek14~17. Supply Chain Design and Chain Integration","scorePolicy":"Class Participation and Game: 20%\nQuizzes (2) : 30%\nMid Term Exam: 25%\nTerm Project: 25%","materials":"G. Cachon and C. Terwiesch. 2019. Matching Supply with Demand: An Introduction to Operations Management, 4th ed. International Student Version. New York: McGraw-Hill Education.","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>分流上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\">採用混成式授課，學生依分組組別輪流允許到校上課，不願到校上課者採線上MS Teams同步上課。上課過程以全都錄錄影，提供課後非同步學習。The entire class will be separated into two groups and you can choose to physically attend the class when it is your turn. Others will join the class remotely via MS Teams link during the class, or watch video via Taipei Tech i-School portal after the class. </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">期中考與期末考保留實體紙筆測驗\nPhysical Midterm and Final Exams in class</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">請隨時注意本課程在北科i學園PLUS的公告\nTo be constantly updated in the Announcements on the Taipei Tech i-school PLUS portal</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">請隨時注意本課程在北科i學園PLUS的公告\nTo be constantly updated in the Announcements on the Taipei Tech i-school PLUS portal</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Office Hours: 每星期二(Tuesday) 1pm~5pm。\n請以 email: ptsai@ntut.edu.tw 聯繫。或於辦公室時間以電話聯繫，辦公室分機: 2354。\nYou might reach me via email anytime, or phone (ext. 2354) me during the office hours.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">請隨時注意本課程在北科i學園PLUS的公告\nTo be constantly updated in the Announcements on the Taipei Tech i-school PLUS portal</div>\n\n  "}]
