[
  {
    "name": "彭光輝",
    "email": "khpeng@ntut.edu.tw",
    "latestUpdate": "2021-10-13 11:43:59",
    "objective": "都市計畫是一門新興的學術，它是就特定地區有關都市生活之經濟、交通、衛生、保安、國防、文教、康樂等重要設施作有計畫的發展，並對土地使用作合理的規劃、開發與管制。其內容涵蓋建築物配置、住宅建設、土地使用分區、公共設施與交通路線規劃、開放空間管理與景觀設計、財務籌措與產業發展等。因此，都市計畫是提供一個都市長遠發展的藍圖，在時空上無論從單棟建築的興建乃至新社區、新市鎮的開發、舊市區的更新及各項公共設施的興闢，均須以都市計畫為藍本，所以都市計畫影響環境品質與居民生活福祉甚鉅。\n台灣的都市計畫在觀念、作法、行政體制以及實質發展方向上已經走到了一個轉捩點，不論是政府官員、專業人員、甚至於一般百姓，都深切體會到近年來都市各種問題的日趨嚴重而必須於予檢討變革。睽諸諸如英美先進國家的都市計畫，一般皆以公共利益為依歸，而涉及地理、經濟及公共行政等重要學術領域，也為從事建築、都市計畫、景觀設計、都市設計、土木、環境規劃與管理工作者必修的學科。因此在這關鍵時刻，如何檢討國內現有都市計畫課題，並參採國外已有的制度與經驗，將理論應用在實務工作上，皆必須作有系統的介紹與評論。修讀本課程可使瞭解都市成長、問題、規劃思想、都市政策之發展、規劃體制變革歷程、戰後歐美之規劃歷程經驗、與規劃及規劃過程之理論與應用、國內外都市計畫課題、對策與發展方向。",
    "schedule": "（一）都市計畫導論、理論與實務之間\n（二）都市規劃思潮與最新規劃理論及實務介紹\n（三）權利與公平觀點論都市計畫公共干預的本質\n（四）法制、體系與規劃實施\n（五）民眾參與與政策規劃\n（六）土地使用與規劃許可\n（七）都市公共設施規劃與維護管理\n（八）協議與都市開發、集約緊湊都市\n（九）都市永續規劃與環境心理、健康都市\n（十） 都市永續規劃與古蹟維護保存\n（十一）都市發展與休閒遊憩規劃、綠色都市\n（十二）新鎮（社區）開發與管理、智慧城市\n（十三）都市更新與再發展、循環都市\n（十四）都市環境與防災、救災、調適、韌性城市\n（十五）都市經營管理與行銷、宜居都市\n（十六）學生研究報告或閱讀心得報告",
    "scorePolicy": "（一）上課互動情形（30%）：閱讀主要的參考文獻、上課聽講、參與課堂討論\n（二）課堂報告（30%）：所選的主題進行文獻閱讀或專題研究，並作一次課堂報告\n（三）學期報告（40%）：依課堂報告內容以及師生所提意見，修撰學期報告完稿（依論文格式撰寫，文長 12 號字約 10-15 頁）",
    "materials": "1. 彭光輝著，社區規劃與永續都市，台北科大建都所，2017 年\n2. 丁致成著，城市多贏策略 o 都市計畫與公共利益，創興，1997 年\n3. 辛晚教著述，都市及區域計劃，詹氏，2011 年\n4. 周志龍，英國政治經濟發展與都市規劃制度，建都文化，1998 年\n5. Healey, P., McNamara, P., Elson, M. &amp; Doak, A. (1988) Land Use Planning and the Mediation of Urban Change, Cambridge University Press, Cambridge\n6. Bruton, M. and Nicholson, D. (1990) Local Planning in Practice, Stanley Thornes, Cheltenham\n7. Robert Riddell, (2004) Sustainable Urban Planning：Tipping the Balance, Blackwell\n8. Elsa Estevez, Nuno Vasco Lopes, Tomasz Janowski, (2016) Smart Sustainable Cities – Reconnaissance Study, UNU-EGOV\n9. Edited by Michael Lindfield and Florian Steinberg, (2012) Green Cities, Asian Development Bank\n10. Moir,E. et al. What are Future Cities? (2014) Government Office for Science, UK\n11. 課程進行中隨時提供參考專論及期刊論文",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "如原訂評量標準。",
      "courseInfo": "上課時間為原排定時間，採遠距較學，全班同學不須到校，上課地點為學生各自上網穩定及安靜處所。教材課前以 line 或 email 提供。",
      "courseURL": "都市計畫理論與實務\n依學校公告 10 月 12 日起恢復為實體教學，請至三教 307 (e) 上課。",
      "contactInfo": "將會在線等同學諮詢問題\n開學後請同學組 line 群組後，經 line 群組討論。",
      "additionalInfo": "1.9 月 28 日 (星期二) 下午 6:15 - 9:15 視訊通話連結上課，於當日課堂與同學討論決定後續上課方式。\n2. 經 9 月 28 日上課與同學討論後，決定 10 月 5 日及 10/12 日仍採視訊上課。請同學以視訊通話連結。",
      "lv2Method": "遠距上課"
    }
  }
]
