[
  {
    "name": "蔡銘修",
    "email": "mhtsai@ntut.edu.tw",
    "latestUpdate": "2021-12-01 12:44:56",
    "objective": "Explore the principles, design, and practical applications of game-based digital learning. The content includes the advantages, characteristics, limitations, technology, media, design and development, systems, practical cases, and future trends of game-based digital learning.",
    "schedule": "01 09/22 Course Description\n02 09/29 Types of  digital game-based learning: gamification vs Game based learning\n03 10/06 Features and goals of digital game-based learning\n04 10/13 Gamification: Minecraft\n05 10/20 Gamification: 8 Core Drives in Octalysis\n06 10/27 Group discussion\n07 11/03 Flow Theory \n08 11/10 Gamification: related research- Pagamo &amp; classcraft\n09 11/17 Midterm Week\n10 11/24 The characteristics and objectives of digital game-based learning\n11 12/01 Digital game-based learning: Hours of code &amp; codecombat\n12 12/08 Digital game-based learning: related research-Mini-flipped Game-based learning\n13 12/15 Group discussion\n14 12/22 The evaluation of digital game-based learning\n15 12/29 VR &amp; game based learning\n16 01/05 Final Report I\n17 01/12 Final Report II\n18 01/19 Final exam week",
    "scorePolicy": "attendance 30%\nMid-term report 30%\nFinal report 40%\n\nOne,\n1~2 students in a group, choose one of the following projest\n1. Game-based digital learning is useful for learning (paper from SSCI)\n2. Game-based digital learning is not useful for learning (paper from SSCI)\n3. Develop an educational digital game (real product)\n4. Use game-based digital learning to assist classroom instruction (experimental or action research)\n5. Observe the process of using game-based digital learning by students (or family members)\n6. Other issues related to the course(need to be approved by instructor)\ntwo,\nThis course needs to join the Line group for informal learning.",
    "materials": "Using the teaching material the instructor made.",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Applying synchronous online report for midterm and final report.",
      "courseInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
