[{"name":"林郁修","email":"yhlin@ntut.edu.tw","latestUpdate":"2021-05-31 08:55:52","objective":"This semester's Artificial Intelligence (AI) course will focus on Machine Learning (ML) and Deep Learning (DL) with related work in data science analytics. We will look at classic supervised and unsupervised learning methods, which will include Multi-Layer Perceptron (MLP), Deep Neural Networks/Convolutional Neural Networks (CNN), and k-Means clustering. This course is designed for graduate students who are interested in AI and its applications in data science analytics. Students who take this course should have mathematical maturity of undergraduate curricula in science and engineering, including Calculus, Discrete Mathematics, Linear Algebra and programming language such as C/C++/MATLAB/Python. Teaching approaches conducted in this course emphasize analysis, modeling and\ndesign principles of AI methodology. Case studies, engineering applications of AI in data science analytics, will also be covered in this course. Collaboration Policy &amp; Honor Code: You are free to form study groups and discuss assignments and projects. However, you must write up assignments and code from scratch independently, and you must acknowledge in your submission all the students you discussed with. Honor code violations: Looking at the writeup or code of another student &amp; Showing your writeup or code to another student.","schedule":"Week        Topic\n1               Introduction to IoT/AI/ML/DL (Overview of this course)\n2               Python (I)\n3               Python (II)\n4               Foundations for ML\n5               Supervised learning (I) -- Multi-Layer Perceptron (MLP)\n6               Supervised learning (II) -- MLP (scikit-learn)\n7               Supervised learning (III) -- MLP (scikit-learn) (Programming assignment#1)\n8               Programming assignment#1 (Oral / Programming assignment #1 Due)\n9               Mid-term exam\n10             Un-supervised learning -- k-Means clustering (scikit-learn)\n11             Foundations for DL\n12             Supervised learning (I) -- Deep Neural Networks (TensorFlow)\n13             Supervised learning (II) -- Convolutional Neural Networks (CNN)\n14             Supervised learning (III) -- CNN (TensorFlow/Keras)\n15             Supervised learning (IV) -- CNN (TensorFlow/Keras) (Programming assignment#2)\n16             Programming assignment#2 (Oral / Programming assignment #2\nDue)\n17             Case Study/Term project report (Oral)\n18             Term-project report (Oral / Term-project report (PPT) Due)\n\nA free, on-line course \"Getting Started with AI on Jetson Nano (https://courses.nvidia.com/courses/course-v1:DLI+S-RX-02+V2/about)\" from \"\nNVIDIA Deep Learning Institute\" may be included in this semester's AI course.","scorePolicy":"- Class participation: 15%\n- Assignments: 30% (Three programming assignments: No assignment turned in late will be accepted.)\n- Mid-term exam: 30%\n- Term-project report: 25 % (The term-/final project provides an opportunity for you to use tools/principles and techniques from class to build something interesting of your choice. Projects should be done in groups of up to four.)","materials":"Lectures will be distributed through our University's e-learning (iPlus) system.","foreignLanguageTextbooks":true}]
