[{"name":"林郁修","email":"yhlin@ntut.edu.tw","latestUpdate":"2021-09-08 09:25:09","objective":"This semester's Artificial Intelligence (AI) course will focus on Machine Learning (ML) and Deep Learning (DL) in data science analytics. We will look at supervised and unsupervised learning methods, which will include classic Multi-Layer Perceptron (MLP), Deep Neural Networks/Convolutional Neural Networks (CNN), and k-Means clustering. This course is designed for graduate students who are interested in AI and its applications in data science analytics. Students who take this course should have mathematical maturity of undergraduate curricula in science and engineering, including Calculus, Discrete Mathematics, Linear Algebra and programming language such as C/C++/MATLAB/Python. Teaching approaches conducted in this course emphasize analysis, modeling and design principles of AI methodology. Case studies, engineering applications of AI in data science analytics, will also be covered in this course. Collaboration Policy: You are free to form study groups and discuss programming assignments and projects. However, you must write up assignments and code independently, and you must acknowledge in your submission all the students you discussed with.","schedule":"Week        Topic\n1               Introduction to IoT/AI/ML/DL (Overview of this course)  (Remote Learning via Google Meet @ https://meet.google.com/zeg-zgfc-dwc)\n2               Foundations for ML  (Remote Learning)\n3               Supervised learning (I) -- Perceptron (Programming assignment #1)  (Remote Learning)\n4               Supervised learning (II) -- Multi-Layer Perceptron (MLP)\n5               Programming assignment #1 (Oral / Programming assignment #1 Due)  (Remote Learning)\n6               Supervised learning (III) -- MLP (scikit-learn)\n7               Supervised learning (IV) -- MLP (scikit-learn) (Programming assignment #2)\n8               Programming assignment #2 (Oral / Programming assignment #2 Due)  (Remote Learning)\n9               Mid-term exam\n10             Un-supervised learning -- k-Means clustering (scikit-learn)\n11             Foundations for DL\n12             Supervised learning (I) -- Deep Neural Networks (TensorFlow)  (Remote Learning)\n13             Supervised learning (II) -- Convolutional Neural Networks (CNN)\n14             Supervised learning (III) -- CNN (TensorFlow/Keras)\n15             Supervised learning (IV) -- CNN (TensorFlow/Keras) (Programming assignment #3)\n16             Programming assignment #3 (Oral / Programming assignment #3\nDue)  (Remote Learning)\n17             Final report (Term-project report or Paper reading report) (Oral)  (Remote Learning)\n18             Final report (Oral / Final report (PPT) Due)  (Remote Learning)\n\nA free, on-line course \"Getting Started with AI on Jetson Nano (https://courses.nvidia.com/courses/course-v1:DLI+S-RX-02+V2/about)\" from \"\nNVIDIA Deep Learning Institute\" may be included in this semester's AI course.","scorePolicy":"- Class participation: 15%\n- Assignments: 30% (Three programming assignments: No assignment turned in late will be accepted)\n- Mid-term exam: 30%\n- Final report: 25%","materials":"Course lectures will be distributed through our University's iStudy+ (e-learning) system.","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Oral for the assignments and final report: Online, virtual.\nMid-term exam: Onsite (Physical attendance).</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">For remote learning, on-line teaching will be given during the class hours (refer to the syllabus above) via Google Meet. Also, all related course lectures (handouts) and video records recorded during on-line teaching by Google Meet will be distributed through our University's iStudy+ system (https://istudy.ntut.edu.tw/learn/index.php).</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">https://meet.google.com/zeg-zgfc-dwc</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Please contact the instructor via e-mail: yhlin@ntut.edu.tw.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">◎</div>\n\n  "}]
