[
  {
    "name": "蔡佩芳",
    "email": "ptsai@ntut.edu.tw",
    "latestUpdate": "2021-09-15 11:52:39",
    "objective": "企業運營管理要控制的主要目標是質量，成本，時間和靈活性，它們是在全球化的挑戰下，企業競爭力的根本。此課程探討服務業與製造業中，對於產品的關鍵生產和服務過程，從設計、監督與控制、流程與品質改善等議題，進而擴展到供應鏈中的存貨與物流。課程著重於理解生產與服務流程對於組織策略的角色，制定與評估相對應的效率指標，並進一步介紹相關議題可使用的分析工具。\nThis course is designed to address the key operations and logistical issues in service and manufacturing organizations that have strategic as well as tactical implications, which also serve as the core competitiveness in the global arena. It includes the introduction to the issues in designing, monitoring and controlling, efficiency and quality improving of the operations in an organization, and then expands to the entire supply chain. With class discussion and case study, the specific objectives include: to understand the role of operations management in the overall business strategy, to identify and evaluate the key factors in the design of effective operating systems, and to identify a range of tools appropriate for analysis of operating systems of the firm.",
    "schedule": "Week1. Course Introduction and Overview\nWeek2~3.Process Strategy\nWeek4~5. Process Analysis\nWeek6~8. Quality and Performance\nWeek10~11. Inventory Management\nWeek12~13. Lean Systems\nWeek14~17. Supply Chain Design and Chain Integration",
    "scorePolicy": "Class Participation and Game: 20%\nQuizzes (2) : 30%\nMid Term Exam: 25%\nTerm Project: 25%",
    "materials": "G. Cachon and C. Terwiesch. 2019. Matching Supply with Demand: An Introduction to Operations Management, 4th ed. International Student Version. New York: McGraw-Hill Education.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中考與期末考保留實體紙筆測驗\nPhysical Midterm and Final Exams in class",
      "courseInfo": "請隨時注意本課程在北科 i 學園 PLUS 的公告\nTo be constantly updated in the Announcements on the Taipei Tech i-school PLUS portal",
      "lv2Method": "遠距上課"
    }
  }
]
