[{"name":"王正豪","email":"jhwang@ntut.edu.tw","latestUpdate":"2021-09-01 15:36:30","objective":"This course introduces the methods and applications of big data analytics.\nThe topics include big data management, data mining techniques, big data platforms, and project implementation and presentation.\nStudents are expected to learn the concepts of big data analytics techniques, and their applications and future trends in different case studies.","schedule":"Part I: Data mining concepts  (6 wks)\n1. Introduction to big data concepts &amp; data preprocessing (1 wk)\n2. Frequent pattern mining (2 wks)\n3. Data classification (2 wks)\n4. Data clustering (1 wk)\n\nMidterm exam (1 wk)\n\nPart II: Distributed processing (4 wks)\n\n1. Introduction to distributed platforms: Hadoop &amp; Spark  (1 wk)\n2. MapReduce programming: relational algebra, pairs &amp; stripes (1 wk)\n3. Case study of Spark programming: frequent itemset, classification, clustering (2 wks)\n\nTerm Project presentation (1 wk)","scorePolicy":"Homework assignments and programming exercises: ~30-35%\nMid-term exam: ~30-35%\nTerm Project: ~30-35%","materials":"Textbook:\nJiawei Han, Micheline Kamber, and Jian Pei, Data Mining: Concepts and Techniques, 3rd edition, Morgan Kaufmann, 2011.\n\nReferences:\n1. Jimmy Lin and Chris Dyer, Data-Intensive Text Processing with MapReduce, \nMorgan &amp; Claypool Publishers, 2010.\n2. Holden Karau, andy Konwinski, Patrick Wendell, and Matei Zaharia, Learning Spark: Lightning-fast data analysis, O'Reilly, 2015.\n3. Recent academic papers, tutorials, and slides.\n4. Latest news available soon on: http://www.ntut.edu.tw/~jhwang/IMFI-BDA/","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"Programming exercises &amp; homeworks~30%, midterm exam~30%, Term project~40%.\nMidterm exam will be held online.\nTerm project will be presented online, and the report has to be submitted online.","courseInfo":"If you haven’t successfully selected the course, please contact with the teacher for signature by appointment.\nYou are going to attend online courses via Microsoft Teams at the scheduled time. \nThe course materials and latest updates will be provided online in iSchool+, and the personal course web site at: https://myweb.ntut.edu.tw/~jhwang/BDA_IMFI/","courseURL":"The link to Microsoft Teams online courses will be announced in iSchool+, and the personal course web site at: https://myweb.ntut.edu.tw/~jhwang/BDA_IMFI/","contactInfo":"You can reach the teacher via e-mail in the personal course website.\nIf you need to contact the teacher online, you can use the online communication software or by appointment.","additionalInfo":"Please check the personal course web site at: https://myweb.ntut.edu.tw/~jhwang/BDA_IMFI/","lv2Method":"遠距上課"}},{"name":"陳俊豪","email":"chchen6814@gmail.com","latestUpdate":"2021-09-04 22:48:28","objective":"本課程介紹大數據在各個領域決策制定的應用，課程內容包括大數據分析與應用、大數據管理、大數據分法與策略、資料探勘介紹、資料探勘方法、大數據平台、大數據行銷實務、大數據個案分析、期末專題製作與報告。學生可以經由多個案例學習大數據的應用實務、目前技術與未來發展方向。\nThis course explores the rapidly developing fields of big data for the efficiency of decision making in various fields. The topics are about basic concepts of data manipulations, analytic, and communications which are including: introduction to big data; basic knowledge of data mining; special topics of big data in business Analytics, and data analytic project. The course will help students careful consideration of what is desired from big data, how big data analytic to add value to business, etc. Students can gain a strong data science knowledge set and techniques via in-depth case studies, most current readings and experiences, and most current and future technology exploration.","schedule":"Topic I:  Association Analysis\nWeek 1:　　Introduction to Association Analysis\nWeek 2:　　Advanced Association Analysis and implementation \n\nTopic II:  Clustering Analysis\nWeek 3:　　Introduction to Clustering Analysis\nWeek 4:　　Advanced Clustering Analysis and implementation\n\nTopic III:  Classification \nWeek 5:　　Introduction to Classification and implementation\n\nTopic IV: Project Demonstration\nWeek 6: Project Demonstration","scorePolicy":"Attendance：30％\nMark of usual：30％ \nProject Presentation: 40%","materials":"Python for Finance (Analyze Big Financial Data, Yves Hilpisch, O'Reilly Media, 2014.\nDeep Learning, Ian Goodfellow, Yoshua Bengio and Aaron Courville\nData Mining : Concepts and Techniques, 3/e (Hardcover), Jiawei Han, Micheline Kamber, Jian Pei, 2011.","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"Attendance：30％\nMark of usual：30％ \nProject Presentation: 40%","courseInfo":"All information will be announced in i-school system.","courseURL":"If you are not in the name list, please send message to my by email: chchen@ntut.edu.tw, and give me your email address. Then, I can send course link to you.","contactInfo":"If you have any question, please send message to my by email: chchen@ntut.edu.tw","additionalInfo":"因應疫情警戒等級調整之上課方式","lv2Method":"遠距上課"}}]
