[
  {
    "name": "陳振華",
    "email": "admin@assab.com.tw",
    "latestUpdate": "2021-09-17 15:33:02",
    "objective": "本課程是設計給研究所的理、工科學生作為研習管理的入門課程 (實務研討)，內容大體上包括有管理的基本理論、管理資訊系統、創新性技術對傳統的挑戰、科技法律概念、科技發展的專利地圖與迴避設計、科技知識管理、個案討論等等。在今天快速變動與競爭激烈的經營環境中，屬於無形資產之一的科學技術往往被認為是企業最不容易評估以及最不容易管理的課題，從歷史眼光看，大凡一家公司能夠將本身的技術管理的好並且能即時掌握競爭對手的最新技術動態，通常多能成就一番非凡事業。\nThe course is designed as a preliminary management study for graduate school  students majoring in science and engineering. It is focused on issues related to: Fundamental Principles of Management, Management Information System, The Challenge of Innovative Technologies to Tradition, The Concept of Technology Law, Patent Mapping and Design -Around of Research &amp; Development, Knowledge management of Technology and Case Discussions, etc. In today's fast moving and keenly competitive management environment, the evaluation and management of the scientific technology, one of the intangible assets, have been considered the ultimately difficult issues in every business enterprise. From the viewpoint of history, provided that an enterprise not only can properly manage their own technology but also can get the latest information of their competitors' technologies, it would always accomplish notable achievements.",
    "schedule": "管理的基本理論、\n管理資訊系統、\n創新性技術對傳統的挑戰、\n科技法律概念、\n科技發展的專利地圖與迴避設計、\n科技知識管理、\n個案討論等等",
    "scorePolicy": "個人願景，科技管理生涯計劃報告：30%.\n團隊報告：團隊科技管理實務報告：30%.\n期末報告：科技管理個案分析報告：40%.",
    "materials": "Strategic Management of Technology and Innovation- Robert Burgelman et.al. 5th Ed.Irwin, 2009.\nTechnology Venture: From Idea to Enterprise. Thomas Byers et.al. McGraw Hill, 2014.\nCase Study Application of VSM .Cheng Hua Chen Systemic Practice and Action Research, Volume 18, No.4, 2005.\n材資系科技管理講義及報告：2015-2016.",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": "室內上課人數以依照中央流行疫情指揮中規定.\n8/21 公布人數為 80 人.\n超過 80 人採分流. ",
      "courseScoreMethod": "實體上課：期末繳交報告.\n遠距上課：期末繳交報告.",
      "courseInfo": "Teams 上課團隊中，隨時公佈訊息.",
      "courseURL": "遠距上課採用 Teams, 並全程錄影.\nhttps://teams.microsoft.com/l/team/19%3alJ8sH_b-6ZeazozFHO7c0PUqb8ltjaIZO6TwwUX7eX01%40thread.tacv2/conversations?groupId=c38ba6b9-6041-4e39-b12b-689d1f7cf089&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218",
      "contactInfo": "學校分機：2766\n手機: 0926-557937",
      "additionalInfo": "依疫情警戒等級，滾動修正上課方式：\n1. 疫情警戒第一級或以下時，以實體授課為原則。\n2. 疫情警戒第二級時，課程將採取遠距上課或分流上課方式進行。\n3. 疫情警戒第三級或以上時，課程採遠距教學授課。",
      "lv2Method": "分流上課"
    }
  }
]
