[
  {
    "name": "林淑玲",
    "email": "shuling@ntut.edu.tw",
    "latestUpdate": "2021-09-18 18:13:41",
    "objective": "本課程主要闡述財務管理中最重要的投資決策、融資決策與短期資金管理決策之基本架構及企業經理人之財務決策，配合各項相關議題進行個案研討，結合資訊工具與軟體運用、以深入淺出方式介紹財務管理之基本觀念及理論架構，並搭配財務軟體、財金資料庫、與財金資訊網站的應用。藉由這些資訊工具與技術，將財務管理的觀念與原理加以運用於重要的融資與投資決策制定。課程內容涵蓋：金融市場與金融機構、財務報表與現金流量分析、財務規劃與預測、風險與報酬、債券與股票之評價、資金成本、資本預算決策、資本結構與財務槓桿、營運資金管理、股利政策…等。本課程結合財務管理實務並融入財務決策研討，以培育理論與實務兼備之財務管理人才。透過本課程之修習，期許學生能具備財務管理領域之學科知識與專業技術整合能力、獨立研究之能力、判斷性思考與決策能力，以及制訂並解決財務管理問題之能力。\nThe course focus on the three most important decisions of the financial management: the investment decisions, the financing decisions and short-term capital management and financial decisions of corporate managers, and various related topics with case studies. This course combines information and software tools to use; the major goal of this course is to help students understanding the basic principles and theories of investments. By mixing explanation and implementation using financial software and database, it can give students the skills to conduct a sophisticated assessment on investment decisions. The major topics including: Financial markets and financial institutions, the financial statements and cash flow analysis, financial planning and forecasting, risk and return, bond and stock pricing, the cost of capital, capital budgeting decisions, capital structure and financial leverage, working capital management, dividend policy, mergers and acquisitions, etc. This course combines b",
    "schedule": "週次　　日期　　課    程   內   容\n一　　9/23　　　　財務管理的範圍\n二　　9/30　　　　公司目標\n三　　10/7　　　　代理問題\n四　　10/14　　金融市場與機構&amp;市場效率性\n五　　10/21　　玩遊戲，學財務！線上實戰！《小永和豆漿》認識財務報表\n六　　10/28　　自由現金流量分析\n七　　11/4　　　　玩遊戲，學財務！線上實戰！《公司財務輕鬆管》　　財務報表分析及應用\n八　　11/11　　【S&amp;P Capital IQ Pro平台與資料庫以及CompuStat資料庫】\n九　　11/18　　【期  中  考  試】\n十　　11/25　　財務規劃與財務預測\n十一　　12/2　　　　貨幣的時間價值\n十二　　12/9　　　　股票與股票評價之應用\n十三　　12/16　　資本預算分析與應用：投資案評估\n十四　　12/23　　 運用「投資決策精靈」於產業分析與企業財報分析\n十五　　12/30　　「投資決策精靈」之進階分析與模擬實作\n十六　　1/6　　       【製作金融資產配置分析報告】\n十七　　1/13　　      【運用投資決策精靈之金融資產配置分析報告與競賽】\n十八　　1/20　　      【期  末  考  試】",
    "scorePolicy": "1. 課堂出席參與Q&amp;A &amp; 課前聆聽平台之當週數位影音教材之學習歷程 &amp; 課後於平台「討論版」參與討論當週指定之PBL問題研討 &amp; 課堂問卷填寫狀況：25%\n2. (課前)「自主學習-前導教材」指定主題(當週課堂)簡報 &amp; 課堂PBL問題研討簡報：25%\n3. 平時測驗：當週課程內容之線上測驗(https://irs.zuvio.com.tw/)：25%\n4. 線上遊戲競賽 &amp; 運用投資決策精靈之金融資產配置分析報告與競賽：25%",
    "materials": "Textbook:\n1. 王明昌(譯)，「財務管理 (Ross / Fundamentals of Corporate Finance 12e)」，第12版，2020年 (華泰文化)，ISBN-13: 9789863414308。《自主學習教材》\n2. 俞海琴、陳隆麒，「財務管理概論」，2版修訂，2014年（華泰文化），ISBN-13: 9789576099328。\n Reference:\n1. Stephen A. Ross, Randolph W. Westerfield, Jeffrey F. Jaffe, Bradford D. Jordan. Corporate Finance: Core Principles and Applications. 第6版，2021年 (華泰文化)，ISBN-13: 9781260571127。\n2. Richard A. Brealey, Stewart C. Myers, Alan J. Marcus. Fundamentals of Corporate Finance. 第10版，2020年 (華泰文化)，ISBN-13: 9781260566093。",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "評分方式不變，若採遠距授課將以線上點名代替簽到。",
      "courseInfo": "若學期初就實施遠距教學，將於「北科i學園PLUS」課程平台，公告課程進度表、授課講義PDF以及其他補充資料。",
      "courseURL": "「北科i學園PLUS」課程平台\nhttps://istudy.ntut.edu.tw/learn/index.php",
      "contactInfo": "Emails: shuling@ntut.edu.tw 或 shulingntut@gmail.com",
      "additionalInfo": "「財務管理與資訊應用(資財所)」課程之遠距教學上課網址:\nhttps://meet.google.com/eiu-rtft-tjy\n\n請修課同學提供個人的Email及Line ID予授課教師，以便若實施遠距教學時，授課教師能即時提供遠距教學連結方式並隨時保持聯繫，感謝!",
      "lv2Method": "遠距上課"
    }
  }
]
