[{"name":"葛如鈞","email":"dablog@gmail.com","latestUpdate":"2021-06-01 18:36:13","objective":"本課程主要在介紹互動媒體設計與製作時所需要的資訊技術與應用程式。本課程的內容包含了解目前發展互動科技應用時可使用之應用程式與系統的概念、元件及操作原理的介紹。並透過基礎元件設計如 Processing 的應用與實作，培養學生透過應用程式與腳本語言程式的撰寫。有別於資訊相關科系程式設計的課程，本課程將發展包含程式應用概念介紹、程式撰寫邏輯思維訓練、以及互動程式撰寫的模組，學生可依自己的興趣以及投未來生涯規劃需求，互相分享技能、教學相長，也可選擇不同的學習模組以合作創作，培養未來互動科技發展所需的跨領域專業知識。另本課程也將盡可能結合業界的資源與師資，協助學生深入了解未來互動科技技術與程式應用的發展趨勢。\n\nThis course introduces the information technology and applications required for the design and production of interactive media. This course covers the concepts, components and operating principles of applications and systems that can be used in the development of current interactive technology applications. The introduction of the In addition, through the application and implementation of basic device design such as Processing, students will be trained to design and develop their own devices through application programs and scripts. Language Programming. This course is different from the programming courses in information-related departments. The course will develop concepts of program application, program writing logic, and the ability to use the language. Thinking training and interactive programming modules are available for students to share with each other based on their interests and future career planning needs. We can also choose different learning modules to collaborate and create, so as to nurture the cross-disciplinary professionals needed for future interactive technology development. The course will also combine industry resources and faculty as much as possible to help students gain a deeper understanding of future interactive technology and program applications. The course will also combine industry resources and faculty as much as possible to help students gain a deeper understanding of the future of interactive technology and program applications. development trend.","schedule":"- 開課簡介\n- 線上 Processing 互動學習\n- 展示\n- 分組計畫\n- 分組展示","scorePolicy":"出席與簡報","materials":"http://processing.org","foreignLanguageTextbooks":false}]
