[
  {
    "name": "陳生明",
    "email": "smchen@ntut.edu.tw",
    "latestUpdate": "2021-09-01 16:57:32",
    "objective": "課程兩個主要目標為光譜學方法及分離方法。光譜學方法內容含紫外、可見、紅光、核磁、x-ray 等光譜法。電子譜及質譜也將被討論。分離方法方面有液層、氣層、膠層等層析法。分離後串聯之光譜分析也會學習。\nTwo major goals of this course are spectroscopy and separation methods. Spectroscopy methods include ultraviolet, visible, infrared, nuclear magnetic, and x-ray spectroscopies.Election and mass spectrometry are also included. Separation methods are: gas, liquid, and gel chromatographies. In addition, GC-MS,LC-MS, GC-IR, etc. will be studied.",
    "schedule": "Raman spectroscopy - Raman scattering - stoke's and anti stokes lines - instrumentation - differences between IR and Raman spectroscopy - mutual exclusion principle - applications - structural diagnosis.\n\nUV- Visible spectroscopy - Absorbtion laws - calculations involving Beer - lambert's law - instrumentation - spectrophotometer - block diagrams with description of components - theory - factors governing absorbtion maximum and intensity\n\nInfrared spectroscopy - principle - types of stretching and bending vibrations - vibrational frequencies - instrumentation - block diagram - source - detector and recorders \n\nChromatography techniques -Principles adsorption, thin layer, partition and paper. chromatography column chromatography - and applications. Ion exchange chromatography - principle - resins - action of resins - experimental techniques - applications - Gas chromatography and high pressure liquid chromatogrphy - principles - experimental techniques - instrumentation and applications.\n\nAFM and STM - Principles, instrumentation, and applications in detailed study\n\nSEM and TEM:  Principle and applications of compound, Different parts of compound microscope, resolving power, magnification power, numerical aperture and working distance. \n\nXPS- Principles, instrumentation, and applications in detailed study\n\nATR and XRD - Principles, instrumentation, and applications in detailed study \n\nMass spectroscopy, NMR- Principles, instrumentation, and applications in detailed study\n\nCV and SECM- Principles, instrumentation, and applications in detailed study",
    "scorePolicy": "Group discussions: --------------------15%\nExams (including final):-------------- 15%\nClass Presentations: -------------------15%\nWritten Reports:------------------------ 25%\nExperimental results:-------------------20%\nIn Class Participation:----------------- 10%",
    "materials": "期刊",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Ｍidterm(30%) ，Final Exam(30%) ，Group discussions(20%)，Q&amp;A(20%)。",
      "courseInfo": "選 課 結 束 後 ， 課 程 動 態 資 訊 將 更 新 於 Microsoft Teams。教材提供方式：Microsoft Teams (或提供連結)。",
      "courseURL": "https://teams.microsoft.com/l/channel/19%3aozcv7FYDWdLiwff_fDqVyeBvCkNbaiZSnwiLjmBzh5s1%40thread.tacv2/General?groupId=32573225-87e4-4ea0-a1ff-e42e601de595&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218",
      "contactInfo": "國百館 404，分機 2552。",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
