[
  {
    "name": "王聖銘",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2021-09-02 22:02:52",
    "objective": "This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of interaction design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the profession of interaction design. Therefore, one of the aims of this course is to construct multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate on an interactive media design project. It may execute interaction design by working with the form of the case study or design creation.",
    "schedule": "Design studio helps to develop student’s research abilities to identify problems, envision current and future needs, and provide validated solutions to these problems and needs through interaction design.\n\nWeek 01-03  Introduction\nWeek 04-09  Problem 1\nWeek 10-18  Problem 2",
    "scorePolicy": "Participation &amp; Final Project",
    "materials": "Kim Erwin, Communicating the New, Methods to Shape and Accelerate Innovation, John Wiley and Sons, Inc. 2014",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Participation 30%\nMidterm and Final Project 70%",
      "courseInfo": "Please refer to the Google Classroom (Class Code: cn4uhza)",
      "lv2Method": "遠距上課"
    }
  },
  {
    "name": "陳圳卿",
    "email": "cceugene@ntut.edu.tw",
    "latestUpdate": "2021-09-05 22:04:12",
    "objective": "本課程為一延續性的專題研究，其目標在於研討互動設計、互動媒體、互動藝術之相關研究專題，以文獻研讀、論文研讀討論以及個案研究為重點，藉由密集討論、書面報告以及設計專題之研究與實作，學生可以有效率地交換意見，獲得更深入而廣泛的體驗，並具備研究、分析、實作之能力。本所以結合電子資訊、機電、人文、設計與藝術等各領域的學生，以整合培育互動媒體設計專業人才，因此，本課程之另一主要學習目標為建構一多元領域交互學習的環境，以專題導向式為學習模式，可分別組合具設計、藝術、資訊、機電等專長的研究生，協同完成互動媒體設計專題的研究，或是透過互動媒體設計個案研討、互動媒體設計專題創作的方式進行。教學將以課堂講授、論文研討與發表以及專題實作為主，並以報告、分組討論與發表以及實作作品為評量方式。\nThis special topic is a continuous course within two semesters. This course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of graduate of interactive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of interactive media design. Therefore, one of the aims of this course is to construct a multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate a interactive media design project. It may execute interactive media design by wo",
    "schedule": "Week 2 to 8: Six instructors will guide the students in the individual group. \nWeek 3(10/08): Students will participate in the MIT City Forum for 2 hours.\nWeek 9: Midterm presentation(online).\nWeek 10 to 17: The supervisors will start the supervision with their students individually.\nWeek 18: Final presentation(online).",
    "scorePolicy": "Participation 20%\nMidterm 30%\nFinal 50%",
    "materials": "Scopus",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": "Six instructors will guide the students in the individual group. Students and their instructor decide on the method and time of group discussion. ",
      "courseScoreMethod": "All presentation will be evaluated online.",
      "courseInfo": null,
      "lv2Method": "分流上課"
    }
  },
  {
    "name": "韓秉軒",
    "email": "robert19881004@gmail.com",
    "latestUpdate": "2021-09-14 12:41:51",
    "objective": "This course aims to explore the fields of interaction design, interactive media, and interactive art. With workshops, panel discussions, case studies and design practices, students are expected to learn research, analysis and prototyping skills. The aim of this course is to integrate different disciplines ranging from computer science, mechatronics, architectural design, industrial design, graphic design, and art, so as to foster the professional of interaction design. Therefore, one of the aims of this course is to provide a multidisciplinary learning environment that encourages students to collaborate to explore an innovative application of interaction design.",
    "schedule": "Week 1-6 Exploration, collaboration &amp; group project\nWeek 7-18 Individual research/project development",
    "scorePolicy": "Participation &amp; Final Project",
    "materials": "None",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": "Six instructors will guide the students in the individual group. Students and their instructor decide on the method and time of group discussion. ",
      "courseScoreMethod": "All presentations will be evaluated online.",
      "courseInfo": null,
      "lv2Method": "分流上課"
    }
  }
]
