[{"name":"陳振誠","email":"coolhas2000@gmail.com","latestUpdate":"2021-09-06 11:06:34","objective":"Healthy Building Environment（1）\n\nThe main goal of this course is to built environment that encourages positive well-being of human beings. This course will introduce the healthy building and environment that between human health and the built environment and to achieve the Sustainable Development Goals (SDGs). Different factors in a building affect its safety and hygiene. The factors such as lighting, quality of air, thermal comfort, aural comfort, colors, mind, movement, water , Nourishment ,materials ,and community are known to have a positive relationship with a healthy built environment.\nThe course will be conducted in the following main topics.\n\nA. Air Quality：To achieve high levels of air quality across a building’s lifetime through diverse strategies that include source elimination or reduction, active and passive building design and operation strategies and human behavior interventions.\n\nB. Materials: to reduce human exposure, whether direct or through environmental contamination, to chemicals that may impact health during the construction, remodeling, furnishing and operation of buildings.\n\nC. Thermal Comfort：To promote human productivity and provide a maximum level of thermal comfort among all building users through improved HVAC system design and control and by meeting individual thermal preferences.\n\nD. Light : create lighting environments that promote visual, mental and biological health.\n\nE. Sound : the identification and mitigation of acoustical comfort parameters that shape occupant experiences in the built environment.\n\nF. Movement and Fitness: promotes physical activity in everyday life through environmental design, policies and programs to ensure that movement opportunities are integrated into the fabric of our culture, buildings and communities.\n\nG.mind: promotes mental health through policy, program and design strategies that seek to address the diverse factors that influence cognitive and emotional well-being.\n\nH.Water : All aspects of the quality, distribution and control of liquid water in buildings.","schedule":"1.  Course introduction.\n2.  Air Quality - outdoor air quality, indoor air quality.\n3.  Air Pollution-Smoke Free Environment, Construction Pollution Management.\n4.  Building Materials01- Material Restrictions\n5.  Building Materials02- Interior Hazardous Materials Management\n6.  Furniture-safe and healthy Management\n7.  Ventilation Design- Enhanced Air Quality and energy saving.\n8.  Air Quality Monitoring and Awareness-Intelligent device, Sensor with edge computing\n9.　　Mid-term week：Mid-term report\n10.  Thermal Comfort 01- Thermal Performance and comfort.\n11.  Thermal Comfort 02- Thermal zone, Humidity Control.\n12.  Light Quality- Light Exposure, Visual Lighting Design, Daylight Design Strategies.\n13.  Water Quality- Water Quality Indicators, Drinking Water Quality, Water Management.\n14.  Acoustic comfort- Sound and Noise, Sound Mapping, Noise Levels, Reverberation Time, Sound Reducing Surfaces.\n15.  Nourishment- Food environment and health Diets.\n16.  Mental Health- Mental Health Services and design.\n17.  Community- Communication and CO-Share space\n18.　　Final week：Final report","scorePolicy":"1.　　Attendance：Absent for three or more lessons will fail the course.\n2.　　Participation：Every student needs to prepare brief reports to lessons.\n3.     Attendance 30%\n        Mid-term report 35%\n        Final report 35%","materials":"1.　　Building Materials, Health and Indoor Air Quality，Tom Woolley，2016，ISBN 978-1138934498\n2.　　The Built Environment and Public Health，Russell P. Lopez，2012，ISBN  978-0470620038\n3.　　LEED Reference Guide v4.1，U.S. Green Building Council (USGBC)，2019， &lt; https://www.usgbc.org/resources &gt;\n4.　　WELL V2 Guide , The International WELL Building Institute (IWBI )，2019，&lt; https://v2.wellcertified.com/#&gt;\n5.    Journal of Indoor Air、Journal of Building environment、Journal of Indoor Built environment..Etc","foreignLanguageTextbooks":true}]
