[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2021-09-26 23:47:07",
    "objective": "The objectives of this course are as follws:\n1.　　To learn key content/context /concept about Marketing in theory and in real-world, the importance of Marketing, its Scope/definition, and review the core concepts of new Marketing.\n2.　　This course will also entail the 10 main types of marketers marketed, and how do they prospect into the marketplace, and who and what are the basic markets. While in the marketplace, how the sellers and buyers are connected and extended by key customers groups and target markets.\n3.　　With corporate core value proposition, students will alliance key elements with the course process to design a suggested proper Semester-Long marketing plan project. By using Kotler, it will enable students to extend their vision while using the Examples and case studies in the textbook. And students also need to learn the Core Marketing Concepts： Marketing Environment , both inside and outside the organization, TPS, Brands and offers, Value and Satisfaction, Societal forces, Marketing Channel, Supply Chain, and another competition watch, which may affect the marketing result. \n4.　　To understand the Marketing subject, an art and science combination in a holistic approach.\n\nLearning Methods:\n1. Reading classical text and modern related articles, where the group will share their insight by the presentation.\n2. Study journal paper: encourage students to learn to publish short articles or apply the mini-project.\n3. Site visiting: Creative clusters and museums, learning how creative industry working employees are different from other areas, and what learners will view the world after studying these subjects.",
    "schedule": "Week 01 (09/27) : Course Introduction.\n                              Chap. 1 -Defining Marketing for the New Realities\nWeek 02 (10/04) : Chap. 2 - Developing Marketing Strategies and Plans\n                              Chap. 3 - Gathering Information and Forecasting Demand\nWeek 03 (10/11) : Holiday\nWeek 04 (10/18) : Chap 4 – Conducting Marketing Research\nWeek 05 (10/25) : Chap. 5 - Creating Customer Value, Satisfaction, and Loyalty\n                              Chap. 6 - Analyzing Consumer Markets\nWeek 06 (11/01) :  校慶\n                              Chap. 7 - Analyzing Business Markets\n                              Chap.8 - Identifying Market Segments and Targets\nWeek 07 (11/08) :  Chap. 9 - Creating Brand Equity\n                               Chap. 10 - Crafting the Brand Positioning\nWeek 08 (11/15) :   Chap.11 - Competitive Dynamics\nWeek 09 (11/22) :  Mid-term Exam  by Group presentation\nWeek 10 (11/29) :  Chap. 12 - Setting Product Strategy\n                              Chap. 13 - Designing and Managing Services\nWeek 11 (12/06) :  Speaker Lecture \nWeek 12 (12/13) :  Chap. 14 - Developing Pricing Strategies and Programs\nWeek 13 (12/20) :  Chap. 15 - Designing and Managing Marketing Channels and Value Networks\n                               Chap. 16 - Managing Retailing, Wholesaling, and Logistics\nWeek 14 (12/27) :  Chap. 17 - Designing and Managing Integrated Marketing Communications \n                              Chap. 18 - Managing Mass Communications: Advertising, Sales Promotions, Events, and Public Relations\n                              Chap. 19 Managing Digital Communications: Online, Social Media, and Mobile\nWeek 15 (01/03) :  Chap. 20 - Managing Personal Communications: Direct Marketing and Personal Selling\nWeek 16 (01/10) :  Chap. 21 - Introducing New Market Offerings\n                              Chap. 22 - Tapping into Global Markets \nWeek 17 (01/17) :  Final-Exam (Final Report) Managing a Holistic Marketing Organization",
    "scorePolicy": "Mid Term 25%　　       Group presentation\nFinal        25%　　       Paper Exam + Group presentation \nParticipation 50%　　Asking question for gaining more participation scores\nAbsence w/o notice 2.5% if 10 times absence = 25%\nAllow for 2 times work or school business. (proof needed)\nClass Quiz + Presentation = 25%, \n\n1.　　3-4 people in a group.\n2.　　Absence / Leave notice is required in advance, the document is provided by the company or by the school. A sick leave notice by a doctor can be provided later.\n3.　　Group presentation may be required for each class for the wrap-up of the previous class.\n4.　　360 degrees evaluation at the end of the class by peers\n\nContact information: \nEmail:  shenchu.yang@gmail.com\nCell Phone: 0932302756",
    "materials": "1. Marketing Management: 7/E, An Asian Perspective, Philip Kotler,   Kevin Lane Kelle\n\n2. Lampel, J., &amp; Germain, O. (2016). Creative industries as hubs of new organizational and business practices. In. UK: Elsevier.\n\n3. Conley, J. G., Bican, P. M., &amp; Ernst, H. Value Articulation: A Framework For The Strategic Management of Intellectual Property. California Management Review, 55(4), 102-120. doi:10.1525/cmr.2013.55.4.102. (2013)",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "11/22 Mon. Hand in the report by mail or online submit.\n01/17 Mon. Group report, On line course.",
      "courseInfo": "Contact information: \nEmail:  shenchu.yang@gmail.com\nCell Phone: 0932302756",
      "lv2Method": "遠距上課"
    }
  }
]
