[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2021-09-16 11:05:16",
    "objective": "This Robotics and Automation Applications (RAA) course is offered only for limited undergraduate students with programming experience.  RAA focuses on projects in the areas of optical inspection, mobile robots, manipulators, visual servoing, and automation.\n機器人與自動化應用(RAA)適合大學生修習，因設備因素修課人數有限，須具備程式能力。課程專題聚焦於光學檢測、移動式機器人、機械手臂、視覺伺服與自動化。",
    "schedule": "1st Week 第1週. Course Introduction 課程介紹\n2nd Week 第2週. Project: 影像處理實驗: 灰階分類，膨脹與侵蝕處理 Image Processing: Gray-level Classification, Dilation, and Erosion Operations\n3rd Week 第3週. Project: 影像處理實驗: 斷開與閉合處理 Image Processing: Opening and Closing Operations \n4th Week 第4週. Project: 光學檢測實驗 Optical Inspection\n5th Week 第5週. Project: 移動式機器人運動學與避障 Mobile Robot Kinematics and Obstacle Avoidance\n6th Week 第6週. Project: 攝影機之主動控制-攝影機視覺控制實驗 Vision-Based Control of PTZ Camera\n7th Week 第7週. Project: 移動式機器人之車載視覺控制實驗 Mobile Robot Control with Onboard Vision\n8th Week 第8週. Project: 機械手臂模擬實驗:基本操作 Manipulator Control Simulation: Basic Operations\n9th Week 第9週. Project: 機械手臂模擬實驗:物體拾取與放置 Manipulator Control Simulation: Object Picking and Placing\n10th Week 第10週. Project: 機械手臂控制實驗:物體拾取與放置 Manipulator Control Experiment: Object Picking and Placing\n11th Week 第11週. Project:期末專題: 提案 Final Project: Proposals\n12th Week 第12週. Project: 期末專題: 實驗實作 Final Project: Experimental Implementations\n13th Week 第13週. Project: 期末專題: 實驗實作 Final Project: Experimental Implementations\n14th Week 第14週. 期末專題: 實驗實作 Final Project: Experimental Implementations\n15th Week 第15週. 期末專題: 實驗實作 Final Project: Experimental Implementations\n16th Week 第16週. 期末專題: 實驗實作 Final Project: Experimental Implementations\n17th Week 第17週. 期末報告及展示 Final Demonstrations and Presentations\n18th Week 第18週. 期末報告及展示 Final Demonstrations and Presentations",
    "scorePolicy": "The final grade will be a weighted average of attendance 10%, homeworks 10%, projects 60%, and final project 20%. 學期成績權重比例為出席10%，作業成績 10%，專題成績60%，期末專題20%",
    "materials": "Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company.\nRobotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke\nPublication Year: 2013 | ISBN 3642201431 | 1st Edition",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": "學生到校實體上課進行實驗，但若因室內社交距離1.5公尺等相關防疫規範之需求，將以輪留方式安排部分學生遠距上課，採線上方式與實體學生同步完成實驗。而若因疫情嚴峻政府禁止師生到校期間，將採適當方式進行，如線上教學操作模擬軟體、線上展示實驗或模擬成果並繳交電子檔報告等適當方式以儘可能符合此課程授課範圍與內容。 ",
      "courseScoreMethod": "此課程為實驗課，必須於課堂上實體完成專題實驗及期末專題實驗。若在符合防疫規範的前提下實體上課無法含括所有學生，部分學生必須輪流採遠距線上方式與實體學生同步完成實驗。而若因疫情嚴峻政府禁止師生到校期間，將採適當方式進行，如線上教學操作模擬軟體、線上展示實驗或模擬成果並繳交電子檔報告等適當方式以儘可能符合此課程授課範圍與內容。",
      "courseInfo": "將透過北科i學園+提供課程訊息，並輔以Google Meet於課程時間點名因分流上課之部分遠距線上學生，細節請參照北科i學園+課程公告。",
      "courseURL": "上課網址：\nGoogle Meet\nhttps://meet.google.com/sbs-rgic-eom\n\n助教將於第一週課前公告Google Meet連結於北科i學園+，其後公告於課程群組如Line。\nTA will provide URL link for Google Meet in iStudy’s [Annoucements] before our first lecture and in class group such as Line after wards.",
      "contactInfo": "Professor Wen-Chung Chang 張文中教授, wchang@ntut.edu.tw\nTA: Ying-Yao Hong 洪英耀、 Yun-Kai Liu 劉芸愷，Integrated Technology Complex Building 綜科504-1室，(02)27712171 Ext. 2130\nt109318047@ntut.edu.tw, t110318120@ntut.edu.tw",
      "additionalInfo": "將於第一週上課成立課程群組如Line，請聯繫助教加入群組或詢問課程問題。\nClass group such as Line will be established in the first class.\nContact TA if you need to join class group or ask any questions.",
      "lv2Method": "分流上課"
    }
  }
]
