[{"name":"陳怡靜","email":"sweetprettylover@gmail.com","latestUpdate":"2021-06-04 23:34:38","objective":"The Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. \n1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. \n2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.\nThis course is for intermediate class students who need to have CEF A2~B1 level. Reading strategy  is the main purpose of this semester. \nWe'll start from Chinese fables to analyze  the culture background and get to understand what the Chinese think.The further we'll explore yourself with those accent Chinese's experiences to know who you are and what you want to be.","schedule":"Week 1 introduce\nWeek 2 fables and life\nWeek 3 Fables : God, ghost and human\nWeek4 Topic: The thoughts of Chinese people\nWeek 5 Fables : Dream\nWeek 6 Topic: subconscious\nWeek 7 Fables : Rain Money\nWeek 8 Topic: Money history\nWeek 9  Midterm exam\nWeek 10 Fables : swift horse\nWeek 11 Topic: Personal image\nWeek 12 Fables : Birds' wishes\nWeek 13 Topic: Ambition \nWeek 14 Fables : Frog's paradise\nWeek 15 Topic: To be or not to be\nWeek 16  Practical presentation (1)\nWeek 17 Practical presentation(2)\nWeek 18  Discuss confusion","scorePolicy":"Attendance 20%\nDiscussion 20%\nMidterm exam 30%\nPractical and presentation 30%\nStudents in class are not just audiences, you need to be involved.","materials":"寓言 五南出版社 楊琇惠 \nHandout\nworksheet","foreignLanguageTextbooks":false}]
