[{"name":"黃慧禎","email":"Huichen429@gmail.com","latestUpdate":"2021-09-07 14:25:14","objective":"本校科技大學的國文課程，以能力及素養之培植為導向，\n並以精深致用為授課標的，方能不負大學國文課程之名，\n並符合本校重視實務應用的優良傳統。\n依授課教師之取擇，課程可概分為兩大類。\n一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。\n二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。\n期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\n\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application.\n\nDepending on the choice of the instructor, the courses can be divided into two categories.\n1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity.\n2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability.\n\nIt is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.","schedule":"1. 課程介紹（建立班群）\nCourse Introduction（Establish a group）\n2. 坎伯及其「英雄冒險旅程」的理論\nCampbell and his theory of  \"Heroic Adventure\"\n3. 西方的英雄冒險故事 ：〈莎賓娜的冒險故事〉一\nWestern heroic adventure stories: \"Chilling Adventures of Sabrina\" 1\n4. 西方的英雄冒險故事 ：〈莎賓娜的冒險故事〉二\nWestern heroic adventure stories: \"Chilling Adventures of Sabrina\" 2\n5. 東方的英雄冒險故事：魏晉時期冒險故事之閱讀、分析與小組討論\nHeroic Adventure Stories in the East : Reading, Analysis and Group Discussion of Adventure Stories in the Wei and Jin Dynasties\n6. 同上\nSame as above\n7. 中外經典賞析與翻譯（一）\nAppreciation and Translation of Chinese and Foreign Classics 1\n8. 中外經典賞析與翻譯（二）\nAppreciation and Translation of Chinese and Foreign Classics 2\n9. 中外經典賞析與翻譯（三）\nAppreciation and Translation of Chinese and Foreign Classics 3\n10. 期中評量\nInterim  test\n11. 故事改寫與創作：〈愛麗絲漫遊仙境〉和〈魔境夢遊〉二\nStory rewriting and creation: \"Alice in Wonderland\" and \"Alice Through the Looking Glass \" \n12. 同上\nSame as above\n13. 故事結構分析舉例\nStory structure analysis example\n14. 中外經典賞析與翻譯（四）\nAppreciation and Translation of Chinese and Foreign Classics 4\n15. 中外經典賞析與翻譯（五）\nAppreciation and Translation of Chinese and Foreign Classics 5\n16. 中外經典賞析與翻譯（六）\nAppreciation and Translation of Chinese and Foreign Classics 6\n17. 期末評量\nFinal test \n18. 期末評量\nFinal test","scorePolicy":"一、　　出席與課堂參與：各占百分之二十。\n二、　　期中評量：百分之二十。\n三、　　期末評量：百分之四十。\n備註：出席以當場點名為計，逾時不候。另，同學若當週無法到課，需在下週上課日時，本人跟老師當面核對准假假單，以銷抵曠課紀錄。 課堂參與包括課堂活動發言、積極度與秩序等。\n\n1. Attendance and class participation: 20% each.\n2. Interim assessment: 20%.\n3. Final assessment: 40%.\nRemarks: Attendance will be counted on the spot, and will not wait for overtime. In addition, if students cannot attend class that week, they need to check the fake slip with the teacher face-to-face on the school day next week to offset the record of absenteeism. Class participation includes class activity speech, enthusiasm and order, etc.","materials":"《千面英雄》\n自編講義：請至北科 i 學園「課程公告」下載。\n\n\"Hero with a Thousand Faces\"\nSelf-edited lecture notes : Please download from the \"Course Bulletin\" of NTUT i Academy.","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">一、　　出席與課堂參與：各占百分之二十。\n二、　　期中評量：百分之二十。\n三、　　期末評量：百分之四十。\n1. Attendance and class participation: 20% each.\n2. Interim assessment: 20%.\n3. Final assessment: 40%.\n若因疫情緣故，採線上遠距教學，評量方式也於線上進行。\nIf due to the epidemic, online remote teaching is adopted, the assessment method will also be conducted online.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">一、上課方式：使用 google meet 進行同步線上教學。\n二、請同學使用學校的 google 信箱帳號，於上課時間進入老師所建立的會議室，老師會召開會議，並於線上點名。\n三、教材與課程資訊：請多多注意北科 i 學園「課程公告」，老師會在那邊貼文公告。\n1. Class method: use google meet for synchronous online teaching.\n2. Please use the school’s google mailbox account to enter the meeting room established by the teacher during class time. The teacher will hold a meeting and roll the call online.\n3. Teaching materials and course information: Please pay more attention to the \"Course Bulletin\" of NTUT i Academy, where the teacher will post announcements there.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">一、請使用 google meet 會議網址，進入會議室中上課。\n上課網址：https://meet.google.com/mqz-ndmm-mdr\n二、若無法進入會議室，請使用會議代碼再作嘗試。會議室代碼：mqzndmmmdr\n1. Please use the google meet meeting URL to enter the meeting room for class.\nClass URL: https://meet.google.com/mqz-ndmm-mdr\n2. If you cannot enter the meeting room, please use the meeting code to try again. Conference room code: mqzndmmmdr</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">一、加退選一律以網路簽核為主。\n二、加退選人數以不超過教室座位為限。\n1. All additions and withdrawals are based on online approval.\n2. The number of additions and withdrawals shall not exceed the number of seats in the classroom.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">如有問題，請來信 huichen429@gmail.com \n並且於信件標題先寫上科系班別、姓名和學號\nIf you have any questions, please write to huichen429@gmail.com\nAnd write the class, name and student number in the title of the letter.</div>\n\n  "}]
