[
  {
    "name": "翁文慧",
    "email": "wendywwh@ntut.edu.tw",
    "latestUpdate": "2021-09-21 06:40:50",
    "objective": "The course aims to expose the students to scientific ideas and enable them to apply these ideas in addressing their research problems. It also aims to develop in students a deeper understanding of their own study works, and the others related fields, so they can be active, responsible, and effective contributors in science. The course also aspires to provide students with the required competencies that enable them to think, reflect, wonder, and flourish as responsible and successful individuals.",
    "schedule": "Course content:\n1 class rule introduction, Basic format, Prepare Title and List Authors and Address\n2.Writing Abstract, Introduction, Materials and Methods, Results and Discussion\n3.How to Write a Thesis, Present a paper Orally; Submit a manuscript and Thesis Writing\n4. Presentation skills, the vedio record will be used in the class.\nThe list of invited speakers and student leads seminar as below:\n週次　　　　                        \n1　　　　Introduction　　                      Prof. Weng\n2　　　　Discuss scientific Proposal Description Title and Reference Due　　                                                              \n3rd ~18th week student presentation\n18th week　　        Final Report Due",
    "scorePolicy": "The score configuration to this course:\nSeminar performance 20%, discussion with Prof. Weng 25%  \nQuestions proposed on the classes and interact with participants 40%\nPresent 5%\nHand in notes and paper works 10%",
    "materials": "1.Select 3 different topics and prepare 3 titles (5 papers for each topic) send to Prof. Weng by email\n2.The criteria of papers selection:\nThe selected papers should be top 10 of the ranking in the category. Please labeled the ranking information on the paper to show me. \nAll papers should make a brief oral presentation when we meet to decide topic. \nAs long as the topic has been selected by one of classmates, you are not allowed to use it. (Try to be an early bird…)\n3.All presenters please send me the titles, topics and papers 14 days before your presentation date, and discuss with me at Tuesday seminar class (we have 30 minutes, so only can take a student who is going to give a presentation in coming week).\n4.Presenters ready the PPT and send all your references to all members by email a week before your presentation.  \n5.All the attendants have to prepare at least 10 questions in the class for the discussion. \n6.Laptops are welcome to be used in the class.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Please follow the school officially announcements from time to time. \nAll the students' presentations will  be held online accordingly, in case the Covid-19 outbreak.",
      "courseInfo": "Time: according to the course arrangement.\nOnline course software：microsoftteams。[NTUT-Sync] 110-1_294264_專題討論\nWhere：Please find the proper place with wifi, and prepare your own computer or 3C devices.（If you need help with the devices, please feel free to contact library for help）",
      "courseURL": "microsoftteams [NTUT-Sync] 110-1_294264_專題討論\n\nhttps://teams.microsoft.com/l/team/19%3aatqxbtPqstSITy6gp9jnffXRUK64pkgdP75y1GdqLRY1%40thread.tacv2/conversations?groupId=066ed3c9-2942-4b04-9062-7f8fe959d548&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218",
      "contactInfo": "Please feel free to contact the course organizer: wendywwh@nut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
