[{"name":"古碧源","email":"ku@ee.ntut.edu.tw","latestUpdate":"2021-09-17 16:07:13","objective":"本課程為本校「智慧鐵道學程」的選修課程，藉由課堂講授與實際場域參訪的方式，使修課學生能夠瞭解鐵道電力供應系統的內涵。鐵道電力供應系統架構雖然類似一般配電系統，但其負載的列車位置與功率都是動態變化，本課程是以同時段合院授課的方式，由具有實際經驗的本校教師、與鐵道電力業師共同授課，針對變電站、電車線與列車設備等三部分從最基本的設計分析、到保護協調與監控均予介紹。本課程開放並鼓勵跨校選修，作為有志從事鐵道機電系統工作的本國學生就業準備的最後一哩路課程，不開放 外國籍學生修課。\nThis elective course is one of the Smart Railway Program. Both lectures in classroom and field trip to railway power system sites are given to learn the unique feature of dynamic loads in contrast to ordinary power distribution systems. The topics cover railway substations, overhead contact systems, and protection and coordination. Lecturers from the industry are invited to give students hand-on experience prepared for work for various railway systems. As such, this is the last-mile course designed to prepare students to work for the electrical and/or mechanical branches of rail operators in Taiwan. No foreign students are admitted to select this course.","schedule":"1(9/24) :課程介紹，跨校生國籍查核與說明;\n2(10/1) :台鐵牽引電力系統概述、\n3(10/8) :台鐵變電站設備；\n4(10/15) :台鐵變電站保護協調；\n5(10/22) :傳統電車線；\n6(10/29) :硬式電車線(導電軌)；\n7(11/5) :台鐵變電站參訪(預定，視實際安排調整日期)；\n8(11/12) :台鐵電力車輛；\n9(11/19) :期中考；\n10(11/26) :捷運高壓交流電力系統；\n11(12/3) :捷運車輛機電系統概論；\n12(12/10) : 捷運直流電力系統與整流器；\n13(12/17) :捷運直流電力系統短路電流分析；\n14(12/24) :捷運電力品質；軌道電位與雜散電流(1)；\n15(12/31) :元旦補假(國定假日不補課)；\n16(1/7) : 軌道電位與雜散電流(2)；\n17(1/14) :無架空線系統案例:高雄輕軌；\n18(1/21) :期末考試。","scorePolicy":"期中報告(40%)；期末考(50%)；出席與平時考核(10%)。","materials":"使用任課教師蒐集台灣各鐵道系統的訓練教材與技術資料，以利有志從事鐵道機電系統工作的本國學生縮短學校與就業的距離。","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"評量方式維持筆試，若遠距上課比照109學年第二學期教師已經實施的遠距考試，教師用Google Meet 螢幕分享考題，並將電子檔傳送至上課班級群組。考試開始後老師在 Google Meet 逐一唱名點名，時間到學生必須在限定時間內以 email 寄交答案。","courseInfo":"教師公告於電機系網站連結之個人網頁 : 課程訊息公告專區。","courseURL":"meet.google.com/kyz-fthm-pkh","contactInfo":"學生加退選簽核及諮詢課程問題請由本系網站，打研究室分機或寫 email，也可以詢問班上同學上課網址，加入 Google Meet 在線上詢問。","additionalInfo":"本課程目前只有六位同學選課，請同學通知其他有興趣的同學上課網址，踴躍加選，否則將面臨停開。","lv2Method":"遠距上課"}}]
