[
  {
    "name": "李紹先",
    "email": "ssli@ntut.edu.tw",
    "latestUpdate": "2021-09-09 17:03:14",
    "objective": "從黑體輻射光譜，X-ray 光譜、氫原子光譜分析開始及光電效應等引入量子化的概念；進而推出物質與波動之二象性。經由波爾之半古典的氫原子模型，結合量子化的概念以解釋原子結構，並引入薛丁格方程式所求得之波函數與電子之空間機率的關係描述粒子波動特性，進而探討位能井與氫原子光譜模型。再由原子進而推廣至分子及固態物理之能帶理論，應用能帶理論於解釋固態晶體之光、電及熱學等特性。\nFrom the analysis of the spectra of black-body radiation、X-Ray、Hydrogen atom and photoelectric effect, the concept of quantization is introduced and the duality of matter and wave is also introduced. Combining the idea of quantization and the semi-classical hydrogen model of Bohr, the structure of atom is described. Solving the Schrodinger equation, the deduced wave function is related to the probability of finding the electron in space, a particle in the potential well and in a box. The concept of atom is expanded to the molecular and the energy band theory of solid state physics. The energy band theory deduced from the modern physics is applied to account the optical, electrical and thermal properties of solid states, wherefore the fundamental principles.",
    "schedule": "Chapter 2 波的粒子特性\nChapter 3 粒子的波特性\nChapter 4 原子結構\nChapter 5 量子力學\nChapter 6 氫原子的量子理論\nChapter 7 多電子原子\nChapter 8 分子\nChapter 9 統計力學\nChapter 10 固態",
    "scorePolicy": "Home work 30%\nMidterm exam 30%\nFinal exam 30%\nReport presentation 10%",
    "materials": "Concepts of Modern Physics - Arthur Beiser",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": "in-person lecture: depends on student ID. odd-numbered in the odd weeks, even-numbered in the even weeks ",
      "courseScoreMethod": "mid-term and final: remote written test. \nfinal report: online",
      "courseInfo": "please download the course lecture on i-campus website.",
      "courseURL": "https://teams.microsoft.com/_?culture=zh-tw&amp;country=TW&amp;lm=deeplink&amp;lmsrc=NeutralHomePageWeb&amp;cmpid=WebSignIn#/school/conversations/%E4%B8%80%E8%88%AC?threadId=19:AdVSFyhpoUDoDsO_Fm-u5yz47TGjTHI7-Vy8Ss8QHP01@thread.tacv2&amp;ctx=channel",
      "contactInfo": "email: ssli@ntut.edu.tw\noffice: Dept. of MMRE, room 403",
      "additionalInfo": null,
      "lv2Method": "分流上課"
    }
  }
]
