[
  {
    "name": "曾添文",
    "email": "f10403@ntut.edu.tw",
    "latestUpdate": "2021-09-01 17:27:32",
    "objective": "本課程在闡述化學工業中以環保出發的催化劑之原理與應用。內容包括催化劑之化學結構、反應性、製備、物性鑑定、反應動力學分析。由催化循環、反應機制、催化劑結構、動力學來說明催化反應之原理。除此，並著重於介紹各催化反應應用類型：催化反應在溶液中、酵素、沸石孔洞及重要之工業固相觸媒。\nThis course explores the principles and applications of catalysts for the environmentally benign chemical processes. Topics include the concepts in chemical structure and reactivity of catalyst, catalyst preparation, catalyst characterization, and micro kinetic analysis of catalytic processes. The principles are illustrated with catalytic cycles, reaction mechanisms, catalyst structures, and kinetics. Additionally, we emphasis on applications of catalysis in solution, enzymes, solid and surfaces, within the molecular-scale cages of zeolites and sieves, the most important industrial catalysts.",
    "schedule": "第1週:  Introduction\n第2-4週:  Basic Principles in Catalysis and Catalytic Process\n第5-6週:  Homogeneous Catalytic Process\n第7-8週:  Heterogeneous Catalytic Process \n第9週:   Midterm\n第10-11週:  Metal and Oxide Catalytic Process Development \n第12-13週:  Synthesis and Characterization of Solid Catalysts \n第14-15週:  Lab and Pilot Studies in Catalytic Process Development \n第16週:  Planning and Management of Future Catalytic Process Development\n第17週:  Special Reports by Students \n第18週:  Final",
    "scorePolicy": "期中考                                                                        50%\n                                                                     \n專題報告, 課堂討論, 出席率                                       50%\n--------------------------------------------------------------------------------------------------\n                            Total                                              100%",
    "materials": "1.　　Takashiro Muroi, “Asian Industrial Catalysts News,” ICL, Ibaragi, Japan (2016-2018)\n2.　　Masatake Haruta, et al, “Catalysis Society of Japan 2012 Annual Survey of Catalytic \n        Science and Technology,” Tokyo (2012) \n3.　　Patents, from US, GB, EU, Japan, Taiwan (R.O.C.), German, China (PRC), and other \n        countries \n4.　　Jens Hagen, “Industrial Catalysis,” 2nd ed., Wiley-VCH, Weinheim, Germany (2006)",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中考採實體紙筆測驗一次，期末考採專題報告，考完貨交期末報告時，請同學將試卷或報告照相後，把檔案寄到老師信箱: f1030tseng@gmail.com，收集後閱卷核給分數。",
      "courseInfo": "如果學期初就實施遠距教學，請同學推選代表一人，至化工館413室面談，告知老師手機號碼: 0918379251，並相互建立line通聯方式。",
      "courseURL": "想加選的學生請和老師通聯，手機號碼: 0918379251，並請同學至化工館413室面談後辦理加選。",
      "contactInfo": "請至化工館413室面談，老師手機號碼: 0918379251，分機2538\nOffice Hours: 星期一下午 14:00~18:00; 星期二下午 14:00~18:00",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
