[{"name":"沐海","email":"muhai@ntut.edu.tw","latestUpdate":"2021-09-08 18:52:21","objective":"The field of digital image analysis is growing rapidly in many application areas such as manufacturing, medicine, agriculture, transportation, and communication systems. This course aims to introduce the foundations of deep learning for digital image analysis from the fundamental theoretical concepts to applications. The class will provide students with an opportunity to explore the state-of-the-art deep learning models for object detection, image classification, and image segmentation with practical hands-on experience. The challenges of deep learning in the field of digital image analysis will be discussed in this class. The course will also explore some popular image datasets such as MNIST, CIFAR-10, and ImageNet, covering the image data preparation and labeling for deep learning. Evaluation metrics for deep learning models will be examined in detail. Students are free to use any programming language, however the programming examples in this course will be given in Matlab and Python.\n\n深度學習數位影像分析，在近代的製造、醫藥、農業、太空探索、運輸和通信系統等應用領域，正迅速發展中。本課程主要介紹深度學習數位影像分析基本理論基礎，以此概念實際應用到各領域中。課程將探索最先進的深度學習模型，如物件偵測、影像分類，和影像分割，提供實用的實務練習；最後討論數位影像分析深度學習的未來挑戰。課程也將介紹最新的公開影像數據集(例如MNIST，CIFAR-10和ImageNet)，並涵蓋用於深度學習中的影像數據前處理和樣本標籤註記，詳細探討深度學習模型的評估指標。本課程將使用Matlab和Python範例，實作教學練習，課程單元包含:\n●數位影像分析簡介\n●深度學習基礎\n●影像分析領域之深度學習基本介紹\n●卷積神經網絡\n●訓練卷積神經網絡\n●遷移式學習\n●深度學習數位影像數據標籤註記\n●深度學習模型評估方式\n●深度學習在數位影像分析領域之挑戰\n●超引數優化\n●激活函式\n●損失函式\n●優化函式\n●期末專題展示","schedule":"1.　　A gentle introduction to digital image analysis.\n2.　　Foundations of deep learning.\n3.　　Deep learning in the field of digital image analysis.\n4.　　Convolutional neural networks.\n5.　　Training convolutional neural networks.\n6.　　Transfer learning.\n7.　　Image data labeling for deep learning.\n8.　　Evaluating deep learning models.\n9.　　The challenges of deep learning in the field of digital image analysis.\n10.　　Hyperparameters.\n11.　　Activation functions.\n12.　　Loss functions.\n13.　　Optimization functions.\n14.　　Final project presentation.","scorePolicy":"Participation (20%) , Assignments (30%), Final Project (50%)\n出席率(20%)、作業(30%)、期末專案(50%)","materials":"Books: \n1- “Digital Image Processing and Analysis: Applications with MATLAB and CVIPtools”, 2017, by Scott E Umbaugh.\n2- “Deep Learning”, 2016, by Ian Goodfellow, Yoshua Bengio, and Aaron Courville.\n3- “Deep Learning Essentials: Your hands-on guide to the fundamentals of deep learning and neural network modeling”, 2018, by Wei Di, Anurag Bhardwaj, and Jianing Wei.\n4- “Artificial Intelligence for Humans, Volume 3: Deep Learning and Neural Networks”, 2015, by Jeff Heaton.\n\nOnline Books:\n1- “Practical MATLAB Deep Learning A Project-Based Approach”, 2020, by Paluszek, Michael, and Thomas, Stephanie.\n2- “Deep Learning with Python: A Hands-on Introduction Paperback”, 2017, by Nikhil Ketkar.\n\nSelected papers:\n1- LeCun, Y., Bengio, Y. and Hinton, G., 2015. Deep learning. nature, 521(7553), pp.436-444.\n2- Krizhevsky, A., Sutskever, I. and Hinton, G.E., 2012. Imagenet classification with deep convolutional neural networks. Advances in neural information processing systems, 25, pp.1097-1105.\n3- Redmon, J. and Farhadi, A., 2018. Yolov3: An incremental improvement. arXiv preprint arXiv:1804.02767.\n4- Badrinarayanan, V., Kendall, A. and Cipolla, R., 2017. Segnet: A deep convolutional encoder-decoder architecture for image segmentation. IEEE transactions on pattern analysis and machine intelligence, 39(12), pp.2481-2495.","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"Participation (20%) , Assignments (30%), Final Project (50%)\n出席率(20%)、作業(30%)、期末專案(50%)","courseInfo":"This class will be an online class and we will be using Google Meet for our class. Students are kindly required to follow the instructions below before joining Google Meet class:\n1- Stay in a quiet environment with no background noise.\n2- Make sure your microphone and speakers are working properly before the class begins.\n3- Leave your microphone muted during the class unless you have a question or would like to answer a question raised by the professor.\n4- Students must join Google Meet class using their school email addresses and Taipei Tech Gmail Service.","courseURL":"https://meet.google.com/ykh-fodi-oox","contactInfo":"Electrical Engineering Department, Lab414.\nTA: Joseph (童致翔)","additionalInfo":"Our class will start on September 28, 2021, at 13:10. Please be on time.","lv2Method":"遠距上課"}}]
