[{"name":"施佳瑩","email":"kcyshih@gmail.com","latestUpdate":"2021-09-03 14:23:22","objective":"本校科技大學的國文課程，以能力及素養之培植為導向，\n並以精深致用為授課標的，方能不負大學國文課程之名，\n並符合本校重視實務應用的優良傳統。\n依授課教師之取擇，課程可概分為兩大類。\n一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。\n二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。\n期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application.\n\nDepending on the choice of the instructor, the courses can be divided into two categories.\n1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity.\n2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability.\n\nIt is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.","schedule":"第一周：課程介紹與課堂用語\nWeek 1: Course Introduction and classroom Chinese\n\n第二周：中秋假期\nWeek 2: Chinese Autumn Festival\n\n第三周：他們的選擇（一）\nWeek 3: Their Choice (I)\n\n第四周：他們的選擇（二）\nWeek 4: Their Choice (II)\n\n第五周：國慶假期\nWeek 5: National Day Vacation\n\n第六周：新聞華語一（一）\nWeek 6: Reading in Chinese Newspaper (1-1)\n\n第七周：新聞華語一（二）\nWeek 7: Reading in Chinese Newspaper? (1-2)\n\n第八周：文化閱讀與成語（一）\nWeek8: Cultural Reading and Idioms (I)\n \n第九周：期中考\nWeek 9: Midterm\n\n第十周：傳統與現代（一）\nWeek 10: Traditional and Modern (I)　\n\n第十一周：傳統與現代（二）\nWeek 11: Traditional and Modern (II)\n\n第十二周：平溪天燈（一）\nWeek 12: Sky Lanterns at Pingxi (I)\n\n第十三周： 平溪天燈（二）\nWeek 13: Sky Lanterns at Pingxi (II)\n\n第十四周：文化閱讀與成語（二）\nWeek 14: Cultural Reading and Idioms (II)\n\n第十五周：新聞華語二（一）\nWeek 15: Reading in Chinese Newspaper (2-1)\n\n第十六周：新聞華語二（二）\nWeek 16: Reading in Chinese Newspaper (2-2)\n\n第十七周：文化閱讀與成語（三）\nWeek 17: Traditional and Modern (III)\n\n第十八周：期末考\nWeek 18: Final Exam","scorePolicy":"»　　出席 Attendance：15%\n»　　課堂作業 School Activities： 25%\n»　　期中紙筆測驗 Midterm Written Exam：30%\n»　　期末紙筆測驗 Final Written Exam：30%","materials":"1.　　《 當代中文課程 4》\nA Course in Contemporary Chinese 4\n2.　　《 當代中文課程 5》\nA Course in Contemporary Chinese 5\n3.　　《縱橫天下事：華語新聞教材 1》\nThe Roads Taken: Reading in Chinese Newspaper 1\n4.　　《 華語文閱讀測驗高級篇》\nEasy to Learn Chinese: Chinese Reading Tests (Advanced) \n5.　　《 華語趣味成語》\nEasy to Learn Chinese: Interesting Chinese Idioms\n6.　　課程相關影視作品\nRelated video clips","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"在符合防疫規範的前提下，保留學生須到校進行實體測驗的可能，如：期中考、期末考採實體紙筆測驗。請同學於考前注意教師發布之訊息。\nDuring the period of level 2 and 3 alert for Covid-19, the instructor and students meet at the scheduled course time on Google Meet. Under the premise of meeting the epidemic prevention regulations, students may take tests, such as mid-term and final examinations, in the classroom at school. Please pay attention to the information posted by the teacher before the exam.","courseInfo":"如果學期初就實施遠距教學，本課程採行同步遠距教學，學生須於上課時間準時加入線上課程。\nWhen distance learning is implemented at the beginning of the semester, this course takes synchronous distance learning mode, and students must join the online course on time during class time.","courseURL":"meet.google.com/ond-zrzm-nsp","contactInfo":"教師電子郵件信箱:\nkcyshih@gmail.com\n\nIf any questions, please contact the instructor by e-mail:\nkcyshih@gmail.com","additionalInfo":null,"lv2Method":"遠距上課"}}]
