[
  {
    "name": "狄雅南",
    "email": "ardilahayu@ntut.edu.tw",
    "latestUpdate": "2021-09-13 10:17:25",
    "objective": "This course teaches chemical process design in a plant-wide design, combines the core courses of the chemical engineering department, and demonstrates the process economic evaluation and optimization, process synthesis and energy integration in the chemical process through a process simulator. It is an integrated subject in the chemical course.",
    "schedule": "1st week : Concept of Process Design and Simulation\n2nd week: Introduction of process design\n3rd week : Thermodynamics (properties and regression) \n4th week : Process simulation \n5th week : Practical simulations\n6th week : Practical simulations\n7th week : Practical simulations\n8th week : Progress Presentation \n9th week : Process Synthesis and Energy Integration\n10th week:  Introduction of process synthesis and energy integration\n11th week: Unit operations (distillation, reactive distillation, heat exchanger, reactor, vessel, pump) and Steam and cooling water systems\n12th week: Engineering Economics and Optimization \n13th week: Engineering Economics and Optimization\n14th week: Economic decision and cost diagram\n15th week: Preliminary cost and cost data\n16th week: Final Presentation\n17th week: Review\n18th week: Final Project Report",
    "scorePolicy": "Progress Presentation 　　        　　　　          30 %\nFinal Presentation                                             30%\nFinal Project Report　　　　　　　　　　  35 %\n(Q&amp;A)　　                                                            5%",
    "materials": "1. Smith, Robin, Chemical Process Design and Integration, John Wiley &amp; Sons, Ltd, 2005\n2 Douglas, J. M. Conceptual Design of Chemical Processes, McGraw-Hill, 1988\n3. Peters, Max S., Plant Design and Economics for Chemical Engineers, McGraw Hill, 2004.\n4. Luyben, William L.; Tyreus, Bjorn D.; Luyben, Michael L.; Plantwide Process Control, McGraw-Hill, 1998.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Students can upload their progress, final presentations and final project report in a group through https://istudy.ntut.edu.tw/learn.",
      "courseInfo": "The public link will post through the i-Plus system before the class begin. Students can access teaching materials through https://istudy.ntut.edu.tw/learn",
      "courseURL": "https://istudy.ntut.edu.tw/learn.",
      "contactInfo": "Students can ask any time through the i-Plus system or offline discussions at Chemistry Hall-306 on Monday from 09:00-12:00",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
