[
  {
    "name": "楊元森",
    "email": "ysyang@ntut.edu.tw",
    "latestUpdate": "2021-09-16 13:23:13",
    "objective": "Complicated scientific computing, huge data processing, and image analysis intense the requirement of high-performance computing knowledge in the computer applications in engineering. Current popular computer architectures, in terms of high performance computing, are different from those a few decades ago, especially the shared-data architectures and GPU architectures in medium scale problems are getting much popular and widely used in practical applications. This course mainly focuses on OpenMP in details for shared memory architectures with C++ implementations and coding exercises of related scientific problems, as well as introduction to message passing interface (MPI) for distributed memory architectures and CUDA for GPU architectures. The problems include heat transfer problems, image processing and analysis, and matrix multiplications.",
    "schedule": "Current progress: \nW01: History and impacts of high-performance computing\nW02: Introduction to OpenMP and its exercise (I)\nW03: Introduction to OpenMP and its exercise (II)\nW04: Introduction to heat problems, from mathematical partial equations to computer solutions. \nW05: Introduction to dynamic arrays and OpenCV for matrix operations and visualization.\nW06: Heat problem and programming \nW07: OpenMP parallelization exercises\nW08: 2D visualization and image manipulation\nW09: Midterm\nW10: Image searching and matching with parallelization\nW11: Midterm presentations\nW12: 2D Fluid Dynamics\nW13: GPU/CUDA and matrix multiplication \nW14: Complexity analysis of summation on grid mesh architecture \nW15: Message-passing interface (MPI) and matrix multiplication exercise\nW16: Graph partitioning\nW17: Final presentations\nW18: Technical report writing",
    "scorePolicy": "Midterm (programming) 30% +/- 5%\nProposal presentation 15% +/- 5%\nFinal presentation and report 40% +/- 5%\nMisc. 15% +/- 5%",
    "materials": "Grama, A. (Ed.). (2003). Introduction to parallel computing. Pearson Education.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Under the premise of the government and university regulations, the lecturer will try to carry out the midterm and final examination online through Google Meet with all attendees' webcam on. He will try to run a rehearsal prior to the midterm and final examination. The online examination is open book, allowing Internet surveying, but no human communication is allowed.",
      "courseInfo": "You need to use the Google account given from NTUT (which typically is 110428xxx@ntut.org.tw) to attend the online lecture and examinations.",
      "lv2Method": "遠距上課"
    }
  }
]
