[
  {
    "name": "林宜玄",
    "email": "yishyuan@ntut.edu.tw",
    "latestUpdate": "2021-09-14 12:14:44",
    "objective": "二、教學目標：\n（一）　　研習教育政策、人力政策、科技政策之概念、內涵與發展\n（二）　　增進批判、分析、統整與應用之相關能力\n（三）　　探討教育相關主題及未來展望\n三、授課方式：\n  （一）教師講授：你知道嗎、研究生應有的態度與準備、你就是品牌、時間管理\n        是什麼、金字塔原理：思考、寫作、解決問題的邏輯。你以為你是誰、心\n        靈雞湯、正面思考的威力、黑天鵝效應、不錯的人生觀分享。\n（二）我的故事：請每位同學介紹家鄉的地理環境、人文特色、風土民情，自己的成長歷程，個人的特質、嗜好、專長、夢想，碩士班的生涯規畫、、、。\n（三）課外專書閱讀報告：請自行選定課外專書閱讀，進行專書內容分享及讀後感想與評析報告，並繳交閱讀報告。     \n（四）教育相關政策報告：請閱讀指定的教育相關政策報告，進行專題報告並繳\n        交專題報告。",
    "schedule": "四、授課內容及進度：\n※第一週、第二週（9/22、9/29） \n  1.說明授課方式與進度。\n  2.決定個人2次報告順序、5人組成一組及決定各組教育相關政策報告題目與\n    順序。\n  3.教師講授：你知道嗎、研究生應有的態度與準備、你就是品牌、時間管理是什     \n    麼、金字塔原理：思考、寫作、解決問題的邏輯。你以為你是誰、心靈雞湯、 正 \n    面思考的威力、黑天鵝效應、不錯的人生觀分享。 \n※第三週（10/6）專題演講\n※第四週（10/13）圖書館電子料資料庫搜尋與使用導覽\n※第六週（10/27）專題演講\n※第五週、第七週、第八週（10/20、11/03、11/10）\n  1.每週8-9人分別進行8分鐘的我的故事（請用powerpoint報告）。\n  2.報告同學需發給每位同學評分表，由非該週報告的同學進行評分。\n  3.報告人繳交報告（書面及電子檔）。\n※第九週（11/17）期中考週\n※第十週、第十一週、第十二週、第十三週（11/24、12/01、12/08、12/15）\n  1.每週6-7人分別進行10分鐘的課外專書閱讀報告及討論（請用power point\n    報告）。\n  2.報告同學需發給每位同學評分表，由非該週報告的同學進行評分。\n3.報告人繳交課外專書閱讀報告（書面及電子檔）。\n  4.非報告人每人繳交一頁心得報告。\n※第十四週（12/22）專題演講\n※第十五週、第十六週、第十七週（12/29、01/05、01/12）\n  1.4-5人組成一組，每週2組分別進行30分鐘的教育相關政策報告及討論（請\n    用power point報告）。\n  2.報告組需發給每位同學評分表，由非該週報告的同學進行評分。\n3.報告組成員共同繳交一份教育相關政策報告（書面及電子檔）。\n  4.非報告人每人繳交一頁心得報告。\n※第十八週（01/19）期末考週",
    "scorePolicy": "五、成績評量：\n（一）　　平時成績（包括：上課出席率、演講心得報告及討論發言狀況）：25%\n（二）　　我的故事（包括：課堂報告、書面報告）：25%\n（三）　　課外專書閱讀報告（包括：課堂報告、書面報告及心得報告）：25%\n（四）　　教育相關政策報告（包括：課堂報告、書面報告及心得報告）：25%",
    "materials": "六、備註：\n（一）我的故事：請介紹家鄉的地理環境、人文特色、風土民情，自己的成長歷程，個人的特質、嗜好、專長、夢想，碩士班的生涯規劃，每人進行10分鐘報告，盡量利用圖片、照片、實物，以說故事的方式介紹自己。\n（二）課外專書閱讀報告，每人選擇近2年出版值得分享的課外專書，閱讀後進行10分鐘報告（書面及電子檔），其餘同學需繳交一頁心得報告。\n    （三）外聘演講之次週應繳交1頁報告，報告內容包括學理上的評論、補充資          \n      料，心得感想等，有引用他人觀點時，仍應依APA格式，註明文獻。如因時\n      間安排致不能參與演講，應經教師同意，於二週內以參加其他相當份量之學\n      術研討會或演講之心得報告替代。\n    （四） 所有應繳交之報告，請提供書面及電子檔，由班長彙整轉交；所有報告      \n      務請留意學術倫理及智慧財產權問題。",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": "選課人數23人，符合政府室內防疫規範，仍採用實體上課 ",
      "courseScoreMethod": "參考評量標準",
      "courseInfo": "(1)加退選課期間尚未選課成功之同學，請至授課教師研究室。 (2)前三週教材請至北科i學園網頁下載 (3)第三週選課結束後，課程動態資訊將更新於北科i學園。",
      "courseURL": "1.9/22全校線上授課教學演練，採用遠距教學，學生不必到校上課，上課網址：https://meet.google.com/fkz-ztdw-qnm\n2.其餘時間均採用學生到校實體上課",
      "contactInfo": "課後於教室或授課教師研究室詢問",
      "additionalInfo": null,
      "lv2Method": "分流上課"
    }
  }
]
