[{"name":"傅遠智","email":"fuyc20@gmail.com","latestUpdate":"2021-09-15 12:02:05","objective":"The mission of Institutional Research is to support the evidence-based decision-making in education institutions. Therefore, in this course, the classmates would be asked to learn the programming language to deal with the real data and provide solid evidence to the leadership. You would be asked to fully engage in the data analysis during this semester. By the end of this course, you should be able to conduct complicated data analysis with confidence. Meanwhile, you should be able to provide productive suggestions for your supervisor's consideration.\nThis course not only prepare you as a qualified IR officers. It also lead you as a professional data analytician.","schedule":"Week 1: the introduction of the syllabus and course requirement\nWeek 2: the foundation of Institutional research \nWeek 3: the working environment in Stata\nWeek 4: data cleaning &amp; data manipulation\nWeek 5: Project Task I\nWeek 6: data visualization\nWeek 7: data modeling: multiple regression, logistic regression, quantile regression \nWeek 8: data reporting\nWeek 9: Project Task II\nWeek 10: team work in PIAAC data\nWeek 11: team work in PISA data\nWeek 12: team work in administration record data\nWeek 13: Advanced topic I:panel data, fixed effect and random effect\nWeek 14: Advanced topic II: instrument variable\nWeek 15: quasi-experiment I: Difference in Difference, Synthetic Control\nWeek 16: quasi-experiment II: Regression discontinuity, Coarsened Exact Matching, Propensity Score Method\nWeek 17: Special talk: Geographic Information System, Social network analysis\nWeek 18: Project Task III","scorePolicy":"1.Project task I: 30%\n2.Project task II: 30%\n3. Project task III: 30%\n4. class participation: 10%","materials":"Angrist, J. D., &amp; Pischke, J. S. (2008). Mostly harmless econometrics: An empiricist's companion. Princeton university press.","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"參考評量標準，採線上報告及操作方式。","courseInfo":"加退選期間尚未選課成功之同學，請與授課老師聯繫。","courseURL":"https://meet.google.com/brk-fzfr-zgh","contactInfo":"課後於教室詢問。","additionalInfo":"相關課程補充資料將於開學第一周提供網路社群連結供修課學生使用。","lv2Method":"遠距上課"}}]
