[
  {
    "name": "丁原智",
    "email": "ycding@ntut.edu.tw",
    "latestUpdate": "2021-09-21 19:24:51",
    "objective": "The blasting engineering course focuses on the introduction of explosives and their properties and characteristics, explosives and blasting theories, drilling and blasting design and operations, and environmental control of blasting.",
    "schedule": "第 1 週 Introduction \n第 2 週 Basic knowledge of explosive and blasting\n第 3 週 - makeup of a commercial explosive and basic properties and hazards of commercial\n第 4 週 - Understand and recognise the common explosives available in the surface mining industry.\n第 5 週 Assess the safety aspects, benefits and limitations of these explosives to make the correct selection of explosives for a particular application\n第 6 週 Blast design - Understand basic blasting terms and identify the rock characteristics that affect selection of explosives and blast design.\n第 7 週 Blast design - Understand the principles of how explosives break rock, Calculate a powder factor for any given blast\n第 8 週 Blast design - Design a blast from basic principles\n第 9 週 期中考\n第 10 週 Prime and charge - Outline the key safe handling procedures for loading and priming explosives\n第 11 週 Prime and charge - Decide what size, type and number of primers to use under different conditions and Safely charge explosives into blastholes\n第 12 週 Initiation system hook up - \n第 13 週 Shotfiring\n第 14 週 Storage and transport\n第 15 週 Environmental control of blasting - Recognise the effect of major rock jointing and structure on blast performance and specify ways of avoiding problems\n第 16 週 Environmental control of blasting - modify blasthole charging to suit the geology\n第 17 週 Misfire treatment\n第 18 週 期末考",
    "scorePolicy": "期中考 40%, 期末考 40%, 平時成績 20%",
    "materials": "handout",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中期末考筆試",
      "courseInfo": "MS Team, 10787@cc.ntut.edu.tw",
      "courseURL": "MS Team",
      "contactInfo": "email ycding@ntut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
