[{"name":"林欽隆","email":"link6636@yahoo.com.tw","latestUpdate":"2021-09-01 07:28:10","objective":"海洋環境是人類賴以生存和發展的自然環境的重要組成 部分，包括海洋水體、海底和海面上空的大氣，以及與海洋密切相關，並受到海洋影響的沿岸和河口區域。海洋環境問題的產生，主要是人們在開發利用海洋的過程中，沒有考慮海洋 環境的承受能力，低估了自然界的反作用，使海洋環境受到不同程度的損壞。首先是向海洋排放污染物；其次是某些不合理的海岸工程建設，給海洋環境帶來的嚴重影響；第三是對水產資源的濫捕，對紅樹林、珊瑚礁的亂伐亂採，也危及到生態平衡。上述問題的存在已對人類生產和生活均構成了嚴重威脅。為此，海洋環境保護問題已成為當今全球關注的熱點之一 。\n本課題是當今全世界共同關心的課題之一，網路資訊眾多，從聯合國環境署（UNEP）、美國海洋大氣總署（NOAA）及Green Peace Marine Conservation等眾多推廣，培養學生的海洋倫理意識並與海洋生態保育的理念接軌是本課程目標。\nThe marine environment is an important part of mankind's survival and development of the natural environment, including marine waters, seabed and over the sea, the atmosphere, and is closely related with the ocean, and by the marine influence coastal and estuarine areas. Generation of marine environmental issues, people in the process of development and utilization of the ocean, without considering the capacity of the marine environment, underestimated the nature of the reaction, the marine environment are subject to different degrees of damage. The first is the discharge of pollutants to the ocean; followed by some unreasonable Coastal Construction, the serious impact to the marine environment; aquatic resources from over-exploitation, the indiscriminate logging Luancai mangroves, coral reefs, and also endangering the ecological balance. The presence of the above problems pose a serious threat to human life and production. For this reason, the issue of protection of the marine environ","schedule":"第1週：課程介紹及準備\n第2週：緒論\n　　地球與海洋環境生態系介紹\n　　人類文明與科技發展沿革與海洋開發運用\n第3週：海洋環境與資源\n　　模組1-台灣的海洋環境\n　　台灣周邊海域環境\n　　台灣沿海海岸環境\n第4週：海洋環境與資源\n　　模組2- 海洋生物資源，海洋植物，微生物。\n第5週：海洋環境與資源\n　　模組2- 海洋生物資源-海洋漁業資源\n第6週：海洋環境與資源\n　　模組3-海洋非生物資源-海洋礦物，水資源\n第7週：海洋環境與資源\n　　模組4-海洋非生物資源-能源、動力源、觀光遊憩及航運\n第8週：海洋漁業資源的開發濫捕\n　　「魚線的盡頭」“The End of the Line”影片欣賞\n第9週：海洋漁業資源的開發濫捕與危機-2\n　　「魚線的盡頭」“The End of the Line”影片報告及討論\n第10週：海洋環境破壞與危機-1\n　　模組5-海洋的天然災害--颶風、颱風、風暴潮、海嘯等災害與防救\n第11週：海洋環境破壞與危機-2\n　　不願面對的真相影片觀賞（An Inconvenient Truth  AL GORE）\n第12週：海洋環境破壞與危機-3\n　　不願面對的真相影片研討（An Inconvenient Truth  AL GORE）\n第13週：海洋環境破壞與危機-4\n　　模組6- 海洋災害-海洋的人為災害\n-海洋污染的種類與防治：\n¬-海洋重金屬、化學物（油等）及輻射污染與防治\n第14週：海洋環境破壞與危機-5\n　　模組7- 海洋災害-海洋的人為災害-海洋廢棄物、垃圾與處理\n第15週：能源與環境\n　　模組8-能源與環境\n第16週：海洋環保與海洋經濟產業 \n　　模組-8海洋其他產業經濟與海洋環保\n第17週：綜合討論與結論\n第18週：期末考","scorePolicy":"　　每一修課學生按分配，須就課程綱要內主題，於學期內任選二個模組其中子題，就你所選擇子題做報告，報告以oint方式為之，每一子題就一發生案例，提出研析報告，並供上課同學研討。\n　　報告並於上課時發表分享，每篇10分鐘，由參加上課同學共同研討及評論，授課教師並於結束前作綜合結論。\n　　學期中有兩次海洋環境議題電影欣賞與討論，請於欣賞完電影後，各寫一份心得報告，於下周討論前一天繳交，報告以A4紙2頁為原則。\n　　報告並作為修課成績，本課程不另作期中或期末考試，成績以歷次報告內容，及上課參與討論發言狀況評定。其中2次主題報告各佔40%，2次心得報告各佔10%。","materials":"　　林欽隆（2016），「海域管理與執法」Sea management and Law Enforcement，五南出版社\n    ，邱文彥（1998a）。「海洋環境」，海洋戰略研討會論文。中華戰略學會、中國航運公司、國立台灣海洋大學等主辦。台北，聯勤信義俱樂部，1998年10月6日。\n　　台灣的海洋環境與海洋產業發展，唐存勇，國台灣大學 海洋研究所Email: tyt@ntu.edu.tw\n　　台灣海洋保護區的現與挑戰，邵廣昭、賴昆祺；中央研究院生物多樣性研究中心\n　　海洋政策白皮書，行政院海洋事務推動委員會編著，行政院研考會發行，2006年4月出版。。\n　　「海洋立國的基礎：海洋與海岸整體管理的跨世紀課題」，邱文彥（1995），中華民國都市計劃學會一九九五年年會及論文發表會，台南。\n　　台灣海洋，許惠等主編，行政院海岸巡防署發行，2005年8月10日出版。\n　　與執法」Sea management and Law Enforcement，五南出版社。","foreignLanguageTextbooks":false}]
