[{"name":"林祐正","email":"yclin@ntut.edu.tw","latestUpdate":"2021-09-16 08:00:02","objective":"Building Information Modeling (BIM) is increasingly important for applications disaster prevention and management recently. The course introduces the BIM use, modeling, design, development, and related applications for disaster prevention and engineering management. The course is a combination of lectures, readings, hands-on exercises, homework assignments, a midterm report and a final project. The course allows students to develop a BIM-related applications suitable to their own researches to meet disaster prevention or engineering management requirement.","schedule":"1.Building Information Modeling\n2.BIM Basics Introduction\n3.Parametric modeling\n4.Building Information Modeling for collaboration\n5.Applications of BIM in Design Phase\n6.Application of BIM in Construction Phase\n7.Applications of BIM in Operation Phase\n8. Applications of BIM in Disaster Prevention\n9. Special Topics in BIM\n10. Special Speeches in BIM","scorePolicy":"1. Assignments (30%)\n2. Midterm Report (30%)\n3. Final project presentation (15%) and final project report (25%)","materials":"BIM Handbook: A Guide to Building Information Modeling for Owners, Managers, Designers, Engineers and Contractors","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"Midterm and Final report will be adopted by online report  or  physical report based on the status of pandemic situation.","courseInfo":"The newest information will be updated and shared by Line.","courseURL":"https://sites.google.com/site/vincentcourses/%E5%BB%BA%E7%AF%89%E8%B3%87%E8%A8%8A%E6%A8%A1%E5%9E%8B%E7%90%86%E8%AB%96%E8%88%87%E6%87%89%E7%94%A8_1","contactInfo":"Room 208 (2683)\nyclin@ntut.edu.tw","additionalInfo":"1.First course will adopt distance learning to explain course introduction.\n2.Latest information will be updated on a rolling basis according to the status of pandemic situation.","lv2Method":"遠距上課"}}]
