[{"name":"曾俊儒","email":"ktseng@pddlab.org","latestUpdate":"2021-06-01 08:54:38","objective":"This course aims to teach postgraduate students to understand the basic theory and practice of medical design. Learn about the health and medical products/ systems/ services from the discovery of medical and user needs to the design of innovative healthcare products, which include the topics of how to generate the design concepts, understand the user and market needs, develop the engineering technologies and prototype, design pre-clinical testing and clinical trials, obtain medical certification and plan industrial management. To enable students to master the principles of interdisciplinary medical design, and teach them how to use innovative product design and development approach to guide professionals in medical backgrounds and design backgrounds to understand the key issues in developing successful health medical products in the market and address the needs of clinical services, propose innovative solutions for health care, and develop innovative health and medical products.","schedule":"The primary learning goals of the course are summarised as follows:\n•　　to learn the product development process for medical devices, systems and services combination therapies.\n•　　to learn the regulatory approval process and key regulatory agencies for new devices, systems, and services combinations.\n•　　to understand the roles of preclinical development, clinical development, and manufacturing scale-up processes in product development.\n•　　to appreciate the technical factors and business factors that are necessary for successful product development in the medical sector.\n•　　to appreciate ethical, social, and cultural considerations for novel medical products.\n•　　to understand emerging medical product categories.\n•　　to learn to analyze and critique contemporary real-world cases of medical product development.\n•　　By the end of the course, students will generate visionary concepts and commercialization strategies for new medical products.","scorePolicy":"Assignments: 50%\nClass participation: 25%\nFinal presentation: 25%","materials":"•　　Reading pack.\n•　　Paul G. Yock, Stefanos Zenios, Josh Makower, Todd J. Brinton, Uday N. Kumar, F. T. Jay Watkins, Lyn Denend, Thomas M. Krummel, Christine Q. Kurihara (2015) “Biodesign: The Process of Innovating Medical Technologies,” 2ND Edition, Cambridge University Press.","foreignLanguageTextbooks":true}]
