[
  {
    "name": "朴維鎮",
    "email": "eugenepark993@gmail.com",
    "latestUpdate": "2021-09-29 11:57:34",
    "objective": "本課程介紹資料分析與圖示的工具與方法，包括如何以精確的模式來描述資料、利用各種指標與圖形來探索給定資料的特性、特徵、或是規律性，並且可以根據所建立的資料模型來進行估計與預測。此外，我們也將探討如何產生各種機率分布的隨機樣本，以及各種最佳化問題求解。本課程將以 R 程式語言為工具。\nThis course introduces useful tools and methods for data analysis and graphics. The main topics of this course include models that are widely used in various fields to describe data and indices, plots for exploring characteristics and patterns of data, and estimation and prediction based on the data models. In addition, we will discuss how to generate random sample from several probability distributions and how to solve optimization problems frequently encountered in several areas. The tool used in this course is R.",
    "schedule": "Week 1 Introduction to ‘Data Analysis and Graphics’\nWeek 2 Introduction to R\nWeek 3 Operations in R\nWeek 4 Vector and matrix\nWeek 5 Tabulation and graphics\nWeek 6 Probability distributions – Part I\nWeek 7 Probability distributions – Part II\nWeek 8 Basic statistics Part I: Random variables, mean, median, standard deviation, variance, correlation, covariance\nWeek 9 Basic statistics Part II: Random variables, mean, median, standard deviation, variance, correlation, covariance \nWeek 10 Basic statistics Part III: Hypothesis tests\nWeek 11 Basic statistics Part IV: Hypothesis tests\nWeek 12 Simple linear regression – Part I\nWeek 13 Simple linear regression – Part II\nWeek 14 Multiple linear regression – Part I\nWeek 15 Multiple linear regression – Part II\nWeek 16 Presentation I\nWeek 17 Presentation II\nWeek 18 Presentation III",
    "scorePolicy": "Final Exam: 30 %\nAssignment: 15 %\nIndividual projects: 50 %\nAttendance: 5 %",
    "materials": "Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)\nSupplementary references: Will be noticed if necessary.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Take-home exam (Before classes, I will notify login code to students via email.)",
      "courseInfo": "Before classes, I will notify login code to students via email.",
      "lv2Method": "遠距上課"
    }
  }
]
