[
  {
    "name": "吳南葳",
    "email": "nwwu@mail.ntut.edu.tw",
    "latestUpdate": "2021-09-23 22:23:18",
    "objective": "Construction history could be considered as the key foundation to understand architectonic theories. Conventionally, architectural academies provide study aspects either in architectural histories in terms of development of architectural style and philosophy or in the latest progress of architectural materials and construction techniques. Moreover, theoretical debates of architecture also pay more attentions to philosophical discussions instead of physical construction presentation.\nNevertheless, architectonic theories mainly discuss the presentation of materials and construction systems. Therefore, construction methods of materials in fact affect the interpretation of architectonic theories significantly. As a result, this course can be divided into two sections: firstly the construction history of Eastern and Western worlds as well as modern period of time will be reviewed. Secondly the architectonic and relative theoretic debates will be discussed. The purpose of the course is to d",
    "schedule": "Week 01　　Introduction to the course: definition of construction history and architectonics\nWeek 02　　Theme 1-1 construction history of the East: timber and bamboo\nWeek 03　　Theme 1-2 construction history of the East: masonry construction\nWeek 04\n(10/15)　　Theme 4-1 Foundation of architectonic theories: conventional understanding\nReading A: Frampton ch.1\nWeek 05　　Theme 2-1 construction history of the West: masonry construction\nWeek 06\n(10/29)　　Theme 4-2 German Enlightenment: Bötticher, Semper, Wanger and Loos\nReading B: Semper’s four elements\nWeek 07　　Theme 2-2 Construction history of the West: framework system\nWeek 08\n(11/12)　　Theme 4-3 Modernism and tectonics: Mies van der Rohe and Louis Kahn\nReading C: Frampton ch.7\nWeek 09　　Mid-term week: proposal of final thesis \nWeek 10\n(11/26)　　Visit of restoration site\nWeek 11\n(12/3)　　Theme 5-1 Adam’s house and the primitive hut\nReading D: Adam’s house\nWeek 12　　Theme 3-1 construction history of the modern: iron and steel\nWeek 13\n(12/17)　　Theme 5-2 Principle of dressing, cladding and ripolin vs. surface and ornament\nReading E: Loos’s texts: principle of dressing\nWeek 14　　Theme 3-2 Construction history of the modern: reinforced concrete\nWeek 15　　holiday\nWeek 16\n(1/7)　　Theme 5-3 Tectonics in Postmodern discussion: Venturi and Koolhaas\nReading F: Venturi’s texts\nWeek 17\n(1/14)　　Theme 5-4 Atectonics and skeuomorph\nReading G: skeuomorph\nWeek 18　　Final week: thesis representation",
    "scorePolicy": "＊＊Attendance 20%\n＊＊Participation 30%\nEach participant needs to study a required article in advance and brief the article for all participants in the class of the required day for 20 minutes.\n  (Week 4) Frampton’s chapter 1 (____)\n  (Week 6) Semper’s four elements  (____)\n  (Week 8) Frampton’s chapter 7 (____)\n  (Week 11) Adam’s house (____)\n  (Week 13) Loos’s principle of dressing (____)\n  (Week 16) Venturi’s texts (____)\n  (Week 17) skeuomorph (____)　　\n＊＊Mid-term presentation: proposal for the final report 20%\nIn the first half of the courses, each participant has to find a project with vivid material expressions, which can be discussed in terms of tectonic theories and interpretations. The project can be international or domestic. It should be easier if the participant might find its design drawings. Students should present their plans of their final reports in the mid-term class about 10 minutes, in order to collect some feedback from colleagues and class instructor for further develop to achieve the final report.\n＊＊Research thesis 30%\nOne should submit his/her thesis by the noon of 1/21 (12:00pm) to Dr. Wu in person. The words of the thesis should not be less than 5000 words. It should be in thesis format (word) instead of brief presentation format (power point).\nEmployed materials of one’s chosen architectural project for the thesis should be clarified. Please note that the referred theories should be reviewed firstly. Aftermath, the discussion of material deployment should be referred to at least one of the architectonic or atectonic theories.",
    "materials": "BENJAMIN, A. 2006, Surface Effects: Borromini, Semper, Loos. Journal of architecture (London, England), 11, no. 1, 1-35.\nBÖTTICHER, C. G. W. 1992. The Principles of the Hellenic and Germanic Ways of Building with Regard to Their Application to Our Present Way of Building. In: HERRMANN, W. &amp; HUBSCH, H. (eds.) In what style should we build? : the German debate on architectural style. Santa Monica, Calif.: Getty Center for the History of Art and the Humanities.\nBROADBENT, G., BUNT, R. B. &amp; JENCKS, C. (eds.) 1980. Signs, Symbols and Architecture, Chichester: John Wiley &amp; Sons Ltd.\nFRAMPTON, K. 1996. Rappel  l'ordre, the Case for the Tectonic. In: NESBITT, K. (ed.) Theorizing a new agenda for architecture: an anthology of architectural theory 1965-1995. New York: Princeton Architectural Press.\nFRAMPTON, K., CAVA, J. &amp; GRAHAM FOUNDATION FOR ADVANCED STUDIES IN THE FINE ARTS. 1995. Studies in Tectonic Culture: the Poetics of Construction in Nineteenth and Twentieth Century Architecture, Cambridge, Mass., MIT Press.\nJENCKS, C. &amp; BAIRD, G. (eds.) 1969. Meaning in Architecture, London: Barrie &amp; Rockliff, the Cresset Press.\nKAHN, L. I. 1982. 1973: Brooklyn, New York. Perspecta, 19, 89-100.\nKOOLHAAS, R. 1994. Delirious New York: a Retroactive Manifesto for Manhattan, New York, Monacelli Press.\nLAUGIER, M. A. 1977. An Essay on Architecture, Los Angeles, Calif., Hennessey &amp; Ingalls.\nLE CORBUSIER &amp; ETCHELLS, F. 1927. Towards a New Architecture, London, John Rodker.\nLE CORBUSIER 1987. The Decorative Art of Today, London, The Architectural Press.\nLOOS, A. 2003. Ornament and Crime. In: GOSSEL, P. (ed.) Loos. Cologne: TASCHEN.\nLOOS, A., DREW, J., SUMMERSON, S. J. &amp; FRAMPTON, K. 1985. The Architecture of Adolf Loos: An Arts Council Exhibition, London, Arts Council of Great Brtain.\nLOOS, A., NEWMAN, J. O. &amp; SMITH, J. H. 1982. Spoken into the Void : Collected Essays, 1897-1900, Cambridge, Mass., Published for the Graham Foundation for Advanced Studies in the Fine Arts, Chicago, Ill., and the Institute for Architecture and Urban Studies, New York, N.Y., by MIT Press.\nMARCH, H. 1889. The Meaning of Ornament, or its Archaeology and its Psychology. Transactions of the Lancashire and Cheshire Antiquarian Society, 7, 160-192.\nMARCH, H. C. 1889. The Meaning of Ornament, or its Archaeology and its Psychology. Transactions of the Lancashire and Cheshire Antiquarian Society, 7, 160-92.\nPALLASMAA, J. 2005. The Eyes of the Skin : Architecture and the Senses, Chichester, Wiley-Academy.\nPINTARIÂC, V. H. &amp; WAGNER, O. 1989. Vienna 1900: the Architecture of Otto Wagner, London, Studio Eds.\nRYKWERT, J. 1972. On Adam's House in Paradise: the Idea of the Primitive Hut in Architectural History, New York, Museum of Modern Art.\nSCHWARZER, M. 1993. Ontology and Representation in Karl Bötticher's Theory of Tectonics. Journal of the Society of Architectural Historians, 52, 267-280.\nSEKLER, E. F. 1965. Structure, Construction, Tectonics. In: KEPES, G. (ed.) Structure in art and in science. London: Studio Vista.\nSEMPER, G. 1989. The Four Elements of Architecture and Other Writings, Cambridge, Cambridge University Press.\nVITRUVIUS, P., HOWE, T. N. &amp; ROWLAND, I. D. 1999. Ten Books on Architecture, Cambridge, Cambridge University Press.\nWAGNER, O. 1988. Modern Architecture: a Guidebook for His Students to this Field of Art, Santa Monica, Getty Center for the History of Art and the Humanities.\nWIGLEY, M. 1995. White Walls, Designer Dresses: the Fashioning of Modern Architecture, Cambridge, Mass.; London, MIT Press.\nㄒ",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Mid-term oral report will use Microsoft Teams as the interface for students to present.\nFinal reports should be submitted to distributed link by the deadline.",
      "courseInfo": "First class will also be online procasted on google meet in case if anyone has problems on microsoft teams. (https://meet.google.com/jpr-gfay-xog)\nThe course will still practice on the scheduled time, and the online interface will be Microsoft Teams , and the group code is ezwbj8z.\nZuvio will be used to count the attendance. \nThe class will be recorded and then uploaded the link to school course system.",
      "courseURL": "https://teams.microsoft.com/l/channel/19%3ae5rAlhI56WX0N0sO9mQVzFxocFqGWvTT4liJ4FDn2Xo1%40thread.tacv2/%25E4%25B8%2580%25E8%2588%25AC?groupId=5ffe0a88-4813-4136-895b-2ffa05201521&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218",
      "contactInfo": "office extension line 2926\nemail address: nwwu@ntut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
