[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2021-09-06 16:37:28",
    "objective": "In this class, we will work on increasing spoken fluency and building a larger vocabulary. The more you speak, the more you will learn, and the better you will do in the class (provided that you are also attentive to those around you and allow them a place to jump into the conversation). We will do many small and large group activities to facilitate conversation. \n\nThis is an English conversation class. In order to get a grade of a 75% or higher, you must speak exclusively in English in this class. (Failure to speak exclusively in English will automatically lower your grade to a 75%, and it may be even lower based on your performance in other areas. You will receive three grace cards for minor slip-ups.) Please speak only English from the moment you walk in the classroom door. Greet your classmates in English. Say goodbye in English. Make plans to work on your group presentations in English. Only by constantly speaking English will you find the holes in your vocabulary and reach fluency.",
    "schedule": "TBA\nReadings will be assigned each week, along with reading and vocabulary quizzes, and class presentations.",
    "scorePolicy": "30%　　Presentations (graded on criteria such as clarity, fluency, originality, creativity, and effort)\n30%　　Reading and Vocabulary Quizzes\n25%　　Participation &amp; English spoken (in student-led discussions, whole-class activities, etc.) \n15%　　Final Oral Exam/Improvisation",
    "materials": "Selected Podcasts / Radio Shows\nCopied Readings and Course Handouts\nStudent-selected texts",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Naturally, conversation classes are much more difficult when held online. However, we will use MS Teams, which allows us to do full-group and small-group conversations. Quizzes may be given orally or using a PPT, with students giving answers in chat messages.",
      "courseInfo": "Please note: only students from the Taipei Tech English department and with valid Taipei Tech ID numbers may take this class. We are using MS Teams. If you are thinking about enrolling and need to take a sample class, please contact me so that I can add your ID number. I am more likely to add you if you have attended all course sessions. Do not wait till the last week. You may also look for announcements on the course web page: https://britamericanlit.wordpress.com/conversation/",
      "courseURL": "Please see above. We will use MS Teams, but the course website is https://britamericanlit.wordpress.com/conversation/",
      "contactInfo": "I am most likely to be available for either online or in-person meetings during my office hours (Mondays from 3:10–5:00 and Friday from 10:10–12:00). Please make an appointment with 24-hours advance notice if possible.",
      "additionalInfo": "I will keep you posted on how to obtain the class materials.",
      "lv2Method": "遠距上課"
    }
  }
]
