[{"name":"黃少妤","email":"phsophia@gmail.com","latestUpdate":"2021-08-30 12:41:06","objective":"自20世紀中葉以來，建築論證的核心及與其他學門之間的關係開始出現清楚的變化，而這些變動是具有證據性地邁向與文化研究和哲學領域的連結。如此關係並非單向性發展，而是一種建立在互惠性過程中的擴張擾動。不僅是建築師和建築理論家越發接近文化理論的觀念，相當多數的文化研究學者、哲學家和社會學家正逐步涉入建築和建築環境的議題甚而提問。在承襲如此能動的知識轉換脈絡下，卻也呈現出建築師和建築專業學生在面對理解甚至運用此些思想家的論述上， 遇見相當程度的艱難挑戰，從而導致學門之間非預期的距離與迷霧。基於此，本課程將由兩項核心意圖所構成。首先，承襲跨學門能動脈絡，試圖將建築引入更廣泛的文化背景，並思考文化理論辯證如何對於建築討論提供擴充性的訊息。其次，提供建築在文化研究論述中的閱讀錨定點; 一方面有助解碼文化研究專詞，另一方面為閱讀關鍵思想家的論述提供一條較清晰的認知途徑。本課程將以幾位重要文化研究學者與哲學家為核心，透過其本身直接書寫建築，或其關鍵性影響當代建築師與建築評論家的重要著作為課程內容架構，進而以更活潑豐富的路徑反思何為建築之內涵。\nSince the mid-twentieth century, there is evidence of a strong shift in the center of debates within architecture and in its relationship with other academic disciplines, in particular with cultural studies and philosophy. It, however, was a reciprocal process. Not only are architects and architectural theorists becoming more close to ideas of cultural theory, but in great numbers of cultural theorists, philosophers and sociologists are to be found highly engaged with questions of architecture and the built environment. Yet, in recent, it is found that architects and students of architecture may confront struggling to deeply navigate those thinkers’ work resulting in unexpected distances and hazes between disciplines. Therefore, there are two intentions to form this module. Firstly, it attempts to introduce architecture to a broader cultural context, and to consider how debates from cultural theory might begin to inform a discussion about architecture (Leach 1997). Secondly, it tries","schedule":"W1: Introduction 批判建築與文化研究引導\nW2: Henri Lefebvre 01 (理論與書寫)\nW3: Henri Lefebvre 02 (建築)   \nW4: Henri Lefebvre 03 (城市)\nW5: Deleuze &amp; Guattari 01 (理論與書寫)\nW6: Deleuze &amp; Guattari 02 (建築)  \nW7: Guest speaker 01 \nW8: Jacques Derrida 01 (理論與書寫)\nW9: Jacques Derrida 02 (建築)  \nW10: Reading week 期中複習\nW11: Paul Virilio 01 (理論與書寫)\nW12: Paul Virilio 02 (建築)  \nW13: Paul Virilio 03 (城市)\nW14: Homi K. Bhabha 01 (理論與書寫)\nW15: Homi K. Bhabha 02 (建築)  \nW16: Homi K. Bhabha 03 (城市)\nW17: Guest speaker 02  \nW18: Final oral presentation 期末報告","scorePolicy":"Report (selected topic) 平時報告(課堂主題): 30%\nAn essay 期末報告(書面與簡報): 50%\nClass attendance 平時成績(出席與發言): 20%","materials":"Armitage, John. 2015. Virilio for Architects. London: Routledge.\nBallantyne, Andrew. 2007. Deleuze &amp; Guattari for Architects. 2007. London: Routledge.\nColeman, Nathaniel. 2014. Lefebvre for Architects. London; New York: Routledge.\nCoyne, Richard. 2011. Derrida for Architects. London: Routledge.\nCrysler, Greig, Stephen Cairns, and Hilde Heynen, eds. 2012. The SAGE Handbook of Architectural Theory. London: SAGE.\nHernandez, Felipe. 2010. Bhabha for Architects. London: Routledge.\nLeach, Neil, ed. 1997. Rethinking Architecture: A Reader in Cultural Theory. New York: Routledge.\nRendell, Jane, ed. 2008. Critical Architecture. London: Routledge.","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">線上報告與繳交電子檔案\nonline seminar and oral presentation, final reports are submitted by email</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">以遠距上課為主，課程錄影將視需求以適當方式提供學生於非課堂時間學習。Due to a limited number of students, it will be conducted as an online learning course mainly. Course recording will be provided as a special demand is required.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">https://meet94.webex.com/meet/pr1827325373</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">shaoyuhuang@mail.ntut.edu.tw\n#2932</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">建立學生常使用的網絡社團，即時更新課堂資訊與確保問題交流\nCreating an online platform to ensure latest materials and course discussions</div>\n\n  "}]
