[
  {
    "name": "陳玉敏",
    "email": "yumchen@umail.iu.edu",
    "latestUpdate": "2021-09-13 20:28:39",
    "objective": "本課程分為兩部分：（1）英文文法觀念的溫故知新，並引導學生將正確的文法觀念運用在閱讀與寫作上，學生可加強基本句型練習、句子改正及句型修正。相關討論包括直述句、引述句、句型變化與修飾;（2）英語修辭法：聽講溝通的有效原理原則。課堂討論主題包括：指稱、一致、倒裝等修辭觀念。修習本課後，學生對出現在相同邏輯意義語境中， 利用不同表達方式以凸顯各種語意的方式與內涵，當有更進一步的體認。\nThis course is divided into two parts: (a) The first part is designed for the students to  familiarize themselves with English grammatical framework in relation to reading and writing. A review of grammatical ideas at high level is reinforced by correcting sentence errors, and revising awkward usage of words or sentence structures. The main subjects include English sentence structures, verbal usages, conjunctions, and sequences. Related topics for class discussion cover direct and indirect speech, sentence transformation and modification of sentences; (b) The second half of the course focuses on English rhetoric--principles of effective written and spoken communication. Topics for class discussion include reference, coherence, reverse structures and some related rhetorical concepts. It is hoped that the students will know better the significance brought about by the variations of different expressions that occur in the similar linguistic contexts.",
    "schedule": "Week 1: Introduction  \nWeek 2: Verb tenses/ subject verb agreement\nWeek 3: Nouns/Pronouns\nWeek 4: Articles\nWeek 5: Modals, Part 1\nWeek 5: Modals, part 2\nWeek 7: The Passive\nWeek 8: Noun Clauses\nWeek 9: Adjective Clauses\nWeek 10: Mid-term \nWeek 11: Gerunds and Infinitives 1\nWeek 12:  Gerunds and Infinitives 2\nWeek 13: Coordinating conjunctions\nWeek 14: Adverb Clauses\n Week 15: Reduction of Adverb Clauses to modify Adverbial phrases\nWeek 16: Connectives that express cause and effect, contrast, and condition\n Week 17: Conditional Sentences and Wishes\n Week 18: Final Paper Due",
    "scorePolicy": "Grading Policy: \n\nParticipation / Attendance　　　　　　　　　　15%     \nPresentation　　　　　　　　　　　　　　　　15%　　\n4 assignments　　                          　　　　　　        20%  \nMid-term Paper　　　　　　　　　　　　　　25%\nFinal Paper　　　　　　　　　　　　　　　　25%  \nTotal　　　　　　　　　　　　`　　　　　　100%",
    "materials": "English Grammar by Betty S Azar\nHandouts",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "4 assignments　　                          　　　　　　        20%  \nMid-term Paper　　　　　　　　　　　　　　25%\nFinal Paper　　　　　　　　　　　　　　　　25%",
      "courseInfo": "請同學於開學前完成線上購書\nEnglish Grammar by Betty S Azar",
      "courseURL": "請於上課前完成線上訂書 English Grammar by Betty S Azar\nhttps://www.cavesbooks.com.tw/Caves_Search/TBSearch.aspx?key1=9780134275253&amp;querytype1=EAN\n上課網址：\nhttps://meetingsamer4.webex.com/meet/clairemicat",
      "contactInfo": "email",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
