[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2021-09-06 16:17:30","objective":"本課程旨在提昇學生撰寫結構完整段落和短文之能力, 並著重如何重寫、摘要、 轉述、 陳述、筆記、編排、起草、修改等相關技巧。\n\nThis course will help you organize and present your ideas in clear, fluent, logical paragraphs. Students will learn to analyze their own voice, style, and word choice with the goal of becoming more creative at the same time as they learn to write more clearly. We will workshop papers in small groups and as a class, helping students analyze their own and other students’ writing. Many weeks will also involve a review of important grammatical points.","schedule":"Please see hard copy for the week-by-week assignments. Students will be working on narrative, persuasion, and argument in their writing assignments. Students will learn college-level and professional writing with the focus on ideas, clarity, maintaining interest, organization, professionalization, thorough and ethical research, citation, and tone.\n\nStudents will do peer reviews of one another's written work and are expected to make extensive revisions to each draft.","scorePolicy":"ASSIGNMENTS\n•　　In order to receive credit for this course, you must complete all assignments, drafts, and revisions. \n•　　You are expected to make substantial revisions to each draft so that you can think about your issue as deeply and specifically as possible. \n•　　All assignments are due in hard copy at the beginning of class. (You will have technology problems. Make sure to print your paper early enough that you will not run into difficulties with non-functioning printers.) For formal papers I take off 5% if you are late to class on a paper due date (10% if you are fifteen or more minutes late), 10% if the paper is turned in within twenty-four hours after the due date (4:00 p.m. on Wednesday) and 20% if the paper is turned in within forty-eight hours of the deadline (4:00 p.m. on Thursday). You will not receive any credit for a paper turned in more than 48 hours late. Late papers should be turned in both by an e-mail Word document (which must open if you wish to receive credit) and in an identical hard copy. (The e-mail lets me know at what time you turned in your paper. However, I only grade hard copies, and you must put the paper in my box as well.) I hope that you will turn in all papers on time [losing 10–20% can be dangerous, especially if the paper is just so-so rather than excellent], but in the event that a paper is late, bring it to my office. If I am not in my office, put the paper my box. Please also immediately send me an e-mail alerting me that you have left a paper for me. If you wish to receive credit for a late paper, it is your responsibility to make sure that the paper gets to me safely. \n•　　In addition to the paper assignments, you will have informal writing exercises, grammar homework, quizzes, peer reviews, and presentations. Informal writing assignments, homework, and quizzes are not usually listed on the syllabus. \n•　　No credit is given for late homework. If you will be absent, give me the assignment ahead of time.\n•　　Please bring a notebook with removable pages to every class period. Begin freewrites on a new page. (I sometimes collect them. I sometimes don’t.) \n\nREVISION AND WORKSHOPS\n\nBe prepared to make multiple copies of drafts for peer review. You may take as many as three drafts home with you to read and comment on. We will then discuss these drafts in a workshop setting.  You will sometimes rate the usefulness of the comments received from other group members. Your ratings and my assessment of their comments will count towards their participation grade. During peer review, please give constructive criticism using the writing and editing techniques we will learn in this course. In order to receive participation and peer review points for each day, you will need to bring drafts that meet the assignment’s length requirements, to bring the correct number of copies of your draft, to fill out the peer-review sheets, and to stay on-task for the entire review session. \n\nPARTICIPATION\n\nAs your instructor, I am here to facilitate learning, to motivate and support you in your process of coming to terms with the language and culture of the college classroom. Your role as a student is to take responsibility for your learning by participating fully in class activities and discussions, peer groups, conferences, and assignments.\n\nSince this is a discussion-based class, please be particularly attentive to those around you. I want you to feel free to speak up, and I also want our discussions to be productive. Know that thoughtful questions are quite as valuable as other kinds of participation. Use this class as an opportunity to work on your skills at engaging in interesting and productive conversations. You probably don’t think about this fact much, but working at making productive discussion contributions is a way of refining communication skills that will serve you well in interviews, jobs, and social situations.\n\nI do put an actual numerical grade in my grade-book based on participation. Don’t let this fact make you","materials":"TEXTS\n•　　Course Packet and/or e-mailed readings and handouts. Please print these. \n\nSUPPLIES\n•　　A journal, pens, and loose-leaf paper for in-class writing and quizzes\n•　　A dry-erase marker and a cleaning cloth\n•　　A pocket folder in which to submit papers and drafts\n•　　Money, paper, and fresh ink cartridges for printing out or photocopying drafts and readings (Please always bring a copy of all readings with you to class). \n•　　A binder in which to keep all your class readings (highly recommended)","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"The course will be conducted via MS Teams. Students may take quizzes with oral or written questions by using the chat window. Assignments will be uploaded to a specific Google Drive folder. Group or individual writing conferences will be done via MS Teams.","courseInfo":"Please note: only students from the Taipei Tech English department and with valid Taipei Tech ID numbers may take this class. We are using MS Teams. If you are thinking about enrolling and need to take a sample class, please contact me so that I can add your ID number. I am more likely to add you if you have attended all course sessions. Do not wait till the last week. You may also look for announcements on the course web page: https://britamericanlit.wordpress.com/intermediate-writing/","courseURL":"As mentioned, you must be added to MS Teams, but here is the link to the class page: https://britamericanlit.wordpress.com/intermediate-writing/","contactInfo":"I am most likely to be available for either online or in-person meetings during my office hours (Mondays from 3:10–5:00 and Friday from 10:10–12:00). Please make an appointment with 24-hours advance notice if possible.","additionalInfo":"I will keep you posted regarding the course packet.","lv2Method":"遠距上課"}}]
