[{"name":"林懷恩","email":"linhe@ntut.edu.tw","latestUpdate":"2021-09-02 11:50:17","objective":"先修課程：負責教授同意。\n本課程旨在建立學生對於機械最佳化設計之基本概念，包含如何將設計問題的物理模型以數學模型形式建立目標函數，並依照給定限制條件求解目標函數之極值或最佳化值問題。課程內容共分為五個部分：(1) 最佳化設計中目標函數的數學分析基礎、(2) 常用之一維搜尋最佳化方法、(3) 無限制多維問題的最佳化方法、(4) 限制問題的最佳化方法、(5) 機械最佳化設計實例分析。\nThis course aims to establish the basic concept of mechanical optimization design for students, including how to establish the mathematical model of objective function from the physical model, and solve the problem by finding the extremum or the optimal value of the objective function according to the given constraints. The course content is divided into five parts: (1) Mathematical analysis basis of objective function in optimization design, (2) Commonly used one-dimensional optimization method, (3) Optimization method for unlimited multi-dimensional problem, (4) The optimization method of the restriction problem, (5) Example of the mechanical optimization design.","schedule":"第1週 課程內容簡介 \n\n第2週 概述：設計變數、目標函數、限制條件、最佳化設計的數學模型\n\n第3週 最佳化設計中目標函數的數學分析基礎：泰勒表示式、函數方向導數的極值點存在條件、無限制目標函數的極值點存在條件\n\n第4週 最佳化設計中目標函數的數學分析基礎：函數的凸性與凸函數及凹函數、目標函數的限制極值問題、最佳化設計的數值計算方法-迭代法及其收斂性\n\n第5週 常用之一維搜尋最佳化方法：搜尋區間確定、切線法、Fibonacci法與黃金分割法(0.618法)\n\n第6週 常用之一維搜尋最佳化方法：二次插值法與三次插值法、平分法、格點法\n\n第7週 無限制多維問題的最佳化方法：座標輪換法、最速下降法、牛頓法\n\n第8週 無限制多維問題的最佳化方法：共軛梯度法、共軛方向法及Powell法\n\n第9週 期中考Middle examination\n\n第10週 無限制多維問題的最佳化方法：變尺度法、單純形法、Hooke-Jeeves直接搜尋法\n\n第11週 無限制多維問題的最佳化方法：Rosenbrock法、Marquardt法、最小二乘法\n\n第12週 限制問題的最佳化方法：隨機試驗法、隨機方向搜尋法、復合形法\n\n第13週 限制問題的最佳化方法：可行方向法、可變容差法\n\n第14週 限制問題的最佳化方法：簡約梯度法、線性逼近法、消元法\n\n第15週 限制問題的最佳化方法： Lagrangian乘數法、懲罰函數法\n\n第16週 機械最佳化設計實例分析：軸類、桿件及連桿機構最佳化設計\n\n第17週 機械最佳化設計實例分析：凸輪機構、齒輪傳動之最佳化設計\n\n第18週 期末考Final exam","scorePolicy":"課程評分標準：\n1.　　Participation 出席成績 (10%)\n2.　　Homework作業 (20%)\n3.　　Middle examination期中考 (30%)\n4.　　Final examination 期末考 (40%)","materials":"參考書目\n1. 劉惟信, 機械最佳化設計, 第二版, 全華圖書, 1990/02\n2. Garret N. Vanderplaas, Numerical Optimization Techniques for Engineering Design\", Mc-Hill International Editions","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"若表定期中考及期末考日程疫情警戒等級仍已降至一級，本課程採取實體筆試。\n若表定期中考及期末考日程疫情警戒等級仍未降至一級，本課程之考試將改為線上測驗。","courseInfo":"若學期初疫情警戒等級仍未降至一級，本課程將採取遠距教學上課。\n首週課程連結請參考下列網址。\n其後之線上課程連結將公佈於學校網路學園系統，請同學務必上網查詢相關資訊。","courseURL":"最佳化設計線上課程\n9月 22日 (星期三) · 上午9:00 - 下午12:00\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/uyo-mwsu-fkb","contactInfo":"研究室617-1, 分機4840\n加退選相關疑問請先以電子郵件連絡老師\nEmail: linhe@ntut.edu.tw","additionalInfo":null,"lv2Method":"遠距上課"}}]
