[
  {
    "name": "黃少妤",
    "email": "phsophia@gmail.com",
    "latestUpdate": "2021-09-12 12:40:33",
    "objective": "都市主義 (Urbanism) 最早可追溯於十九世紀末建築工程師對於空間組織與城市關係的討論，其真正的崛起始於二十世紀初對於集中生產，空間組織網絡與政治經濟市民等都市中新興現象的討論。因日趨複雜化的都市發展與環境巨變的挑戰，九十年代開始陸續出現一系列以都市主義為基盤的跨學科整合性討論，而景觀都市主義 (Landscape Urbanism， 1997) 則在其中扮演相當關鍵的角色。不論是庫哈斯早期在？S/M/L/XL ? 中的批判或瓦爾德海姆在？都市景觀主義讀本？中的宣言，皆引指建築、景觀建築、都市設計與都市計畫學門，已逐漸形成一種彼此跨越亦彼此更新的領域狀態。這般？跨？都市主義架構，使各學門在理論發展與專業實踐上具有更開展性的方法，介入當代與未來的都市環境與城市生活。然而此跨都市主義的學理多在景觀學門的教學範疇內，但在建築專業教育中卻鮮有足夠的涉及與含括。\n本課程則基於此前提，欲將當代景觀都市主義學理，配合建築與都市主義思作為架構，一方面將景觀都市主義相關論述引入建築學習，另一方面欲擴充建築專業知識之本體，培養學生具有主體性的跨域知識建構。本課程結構以景觀與建築兩學門做為學理核心，同時為強化都市主義的實踐本質，將協同專家與景觀學人共同進\nThe term \"urbanism\" originated in the late nineteenth century with a focus on\nspatial organization of the city. The emergence of urbanism in the early twentieth century was associated with the rise of industrial distribution, spatial networks and citizenship etc. in the city. After 90’s, there were a series of new academic terms referring to this idea which created a base for interdisciplinary studies amongst related spatial terrains. Landscape Urbanism is regarded as one of the significant design and planning ethos especially in the twenty-first century. In Koolhaas’ early work S/M/L/XL and Waldheim’s representative collection The Landscape Urbanism Reader, they both shared account that architecture, landscape architecture, urban design and planning are moving toward shared form of ?emerging ‘practice. The body of knowledge about Landscape Urbanism has been largely developed within landscape discipline, yet merely in the architectural discourse especially in Taiwan.\nWith such pr",
    "schedule": "1. 09/23 課程介紹：都市景觀概論\nSession 1 景觀與都市主義\n2. 09/30  當代都市主義與景觀建築 -[建築都市主義概論]\n3. 10/07  都市的意象與後疫情城市觀察 [景觀都市概論][藍 / Fri]\n4. 10/14  歷史與都市主義 01 - 老城與衰微地區再生 [藍 / Fri]\n5. 10/21  歷史與都市主義 02 - 洪荒與匱乏 [藍 / Fri]\n6. 10/28  生態景觀與建築 [黃于玻老師專講]\n\nSession2 建築與都市主義\n7. 11/04 尺度的難題 - Bigness and Urbanism\n8. 11/11 當代都市主義與景觀建築之實踐 [周書賢業師專講]\n9. 11/18 嫌惡係設施與後工業城市 [期中考週]\n10. 11/25  Reading week (紙本報告繳交)\n11. 12/02 游擊與聚集 - 社會空間與建築\n\nSession3 田野與實作 \n12. 12/09 Fieldwork 01 田野調查 \n13. 12/16 Fieldwork 02 建築 / 景觀主題設計工作營 8hr+4hr\n14. 12/23 Practice 01\n15. 12/30 Practice 02\n16. 01/06 Practice 03\n17. 01/13 期末主題報告\n18. 01/20 期末主題報告 (紙本報告繳交)",
    "scorePolicy": "期末報告 30%- 綜合論述口頭簡報 (50%) 與一篇 500 字報告 (50%)\n期末報告的規格和排版須符合基本學術要求，完稿含題目關鍵詞與相關圖說資訊等項目。其他內容規範於課堂補充。\n主題報告 20%- 擇一課程主題撰寫一篇 500 字報告，包含課堂主題摘要關鍵字與心得。內容規範於課堂補充。\n設計成果 30%- 團隊合作練習，由當天業師與同學互評分數。\n平時表現 20%- 含出席狀況、參與討論和相關課程評量完成度 (整學期每人須滿足兩次發言，其餘則為加分)。\n報告須準時繳交，遲交半小時扣 5 分，含電子檔與紙本。細節另行公告。授課教師保有修正或調整評分項目之權利。\n\n\n課程內涵與核心能力之對應\n1. 整合及問題解決的能力\n2. 跨域之空間專業知識統整與運用之能力\n3. 加強國際景觀視野與多元文化的素養\n4. 建築設計之進階專業知識與實務練習\n5. 具備永續發展與因應氣候變遷之規劃設計能 \n6. 培養專業倫理、環境正義與社會關懷素養",
    "materials": "Chang, Shu, and Chun-Hsiung Wang. 2013. TAIPEI UNVEILED. 臺北．原來如此. Taipei: City Garden Press.\nCorner, James M. 1999. Recovering Landscape: Essays in Contemporary Landscape Architecture. New York: Princeton Architectural Press.\nColafranceschi, Daniela. 2007. Landscape +: 100 Words to Inhabit It. Barcelona: Editorial Gustavo Gili.\nCohen, Nahoum (1999) Cohen Urban Conservation. Cambridge, Mass : MIT Press.\nHou, Jeffrey, ed. 2010. Insurgent Public Space: Guerrilla Urbanism and the Remaking of Contemporary Cities. Ann Arbor, Michigan: Florence Taylor and Francis.\nJukilehto, Jukka （2005）。A history of Architectural Conservation. Oxford, UK: Elsevier Butterworth-Heinemann.\nKoolhaas, Rem. 1996. “Bigness or the Problem of the Large.” In SMLXL. New York: Monacelli Press.\nMadanipour, Ali. 2017. Cities in Time: Temporary Urbanism and the Future of the City. London: Bloomsbury Academic.\nWaldheim, Charles. 2006. The Landscape Urbanism Reader. New York: Princeton Architectural Press.\nZukin, Sharon，國家教育研究院譯，裸城﹣純正都市地的與死，台北：群學，2012.\n侯志仁等. 2019a. 反造再起：城市共生 ING (City Commoning). 台北：左岸文化.\n—. 2019b. 反造城市：非典型都市規劃術 (City Remaking). 台北：左岸文化.\n“台灣建築.” 2018.\n“台灣建築.” 2020.\n“台灣建築學會會刊雜誌.” 2014, no. 75.\n林芬郁. 2020. 公園地景百年流轉：都市計畫下的臺北，邁向現代文明的常民生活史。台北：貓頭鷹.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "線上報告與繳交電子檔案",
      "courseInfo": "建立學生常使用的網絡社團，即時更新課堂資訊與確保問題交流",
      "lv2Method": "遠距上課"
    }
  }
]
