[
  {
    "name": "楊韻華",
    "email": "yhyang@ntut.edu.tw",
    "latestUpdate": "2021-10-08 12:08:45",
    "objective": "Course Title:　　　　Public Speaking and Debates\nCredit Hours:　　　　2\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nOffice: 　　        General Education Building Rm.805 / Extension: 3941\nTerm Offered:　　　　Fall, 2021\nCourse Description: 　　This course aims to establish the foundation for English-major students to deliver public speeches in English. Students learn to select topics, collect essential information, analyze the audience, organize materials, improve delivery skills, distinguish different types of speeches, and further to evaluate their own and others’ speeches. Each student is expected to deliver at least 3-4 individual speeches, and 2-3 debates. Speech topics will be discussed and assigned to students. Any modifications of the speech topics will have to be approved by the instructor. All student speech sessions must be videotaped.(see note 1) \nCourse Requirements: 　　Students’ responsibilities in this class include:\n(1)　　Attending class regularly and to arrive on time: \n(2)　　Delivering speeches as scheduled: \ni.　　Students who are scheduled to give an in-class speech (for official grading) need to record a pre-speech on the scheduled day. (see note 2)\nii.　　Make-up speech will be only allowed when the failure to perform is due to an officially excused absence or incidents under extreme circumstances\niii.　　The ideal time duration for each speech is 4 to 6 minutes. The minimum length of speech time is 3 minutes, and the maximum 6. Violation of the time limit (less than 3 and more than 6) constitutes a failure w/o points awarded. The time length for debates will vary due to the different formats employed.\niv.　　It is essential to comply with the prescriptive requirements for each speech. Failure to follow will result in disqualification to complete the speech \n(3)　　Submitting to the instructor a speech file with inclusion of the outlined speech as well as the full-length speech script (with citation and references), the speech evaluation sheet, the self-evaluating commentaries of both the current and previous speeches, and also blank A-4 size lined sheets for notes and feedbacks(see Appendix 1 &amp; 2) when presenting the speech. Students who do not have the file ready and fail to comply with the outline format requirements (sampled and specified below_Appendix 3) forfeit the right to deliver the speech and hence receive zero points.  \n(4)　　Student speakers are also required to display their outline slide(s) during the speech. \n(5)　　Evaluating one’s own speech (by the self-evaluation guideline): Student speakers are required to watch their own videotaped speeches (both pre-speech and in-class speech) observe their own speeches, and compile all speech and debate evaluation for submission. Students are strongly advised to use their own videotaping devices for both the pre and in-class speeches. Post-class recordings will be arranged and produced in the Lab, if necessary. A complete portfolio (preferably on compact disc) including all recordings is required for submission at the semester end.",
    "schedule": "Week/ Date 　　Course Content　　Class Activities\nWk1　　Orientation \nGuidelines to Informative and Persuasive Speeches　　Instructor Lecture &amp; Discussion \nWk2　　Trial Speech 　　\nWk 3 　　Guidelines to Informative and Persuasive Speeches　　Classes Merged:Students required to attend two class sessions (TBD)\nWk4　　Informative Speech (1st group) 　　Extemporaneous (selected topics)\nWk5　　Informative Speech (2nd group)　　Extemporaneous (selected topics)\nWk6　　Persuasive Speech (1st group)　　Extemporaneous (selected topics)\nWk7　　Persuasive Speech (2nd group)　　Extemporaneous (selected topics)\nWk8　　Analytical / Rebuttal Speech Preparation 　　Classes Merged\nWk9　　Analytical / Rebuttal Speech (Affirmative &amp; Negative Rebuttal Speech)　　Extemporaneous\nWk10　　Analytical / Rebuttal Speech (Affirmative &amp; Negative Rebuttal Speech)　　Extemporaneous\nWk11　　Guidelines to Debate &amp; Debate Preparation (1) Guidelines to Debate &amp; Debate Preparation (2) 　　Classes Merged: Students required to attend two class sessions (TBD)\nWk12　　Debate Preparation  　　Instructor Session \nWk13　　Standardized Format Debate \nGroup 1 &amp; 2 　　\nWk14　　Standardized Format Debate \nGroup 1 &amp; 2 　　\nWk15　　Debate Preparation 　　\nWk16　　Cross-Exam Debate Group 1 &amp; 2 　　\nWk17　　Cross-Exam Debate Group 1 &amp; 2 　　\nWk18　　Final Debate Match 　　TBD",
    "scorePolicy": "Grading Policy: 　　(1) Academic honesty is prioritized in this class. Plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.  \n(2) No speech scripts allowed at delivery. The grading components are as follows:\n　　\nComponent　　Grade Percentage \nAttendGrading Policy: 　　(1) Academic honesty is prioritized in this class. Plagiarism will not be tolerated. Students will fail the course without contention once an incident of plagiarism is identified in their submitted writing or presented speech.  \n(2) No speech scripts allowed at delivery. The grading components are as follows:\n　　\nComponent　　Grade Percentage \nAttendance (note 3) 　　20-30% (full attendance) \nTrial Speech (1-2 minutes) (1) general topics 　　0-10% impromptu / or bonus points \nInformative Speech (2) based on TED talks \n(Introducing a concept, a process, an event, and an object )　　10% extemporaneous (note 4): 3 index cards allowed w/ necessary facts and data \nPersuasive Speech (3)\n(Lobbying for changes/ reforms, settling controversial issues, clarifying political and social myths)　　10% extemporaneous: 3 index cards allowed w/ necessary facts and data                   \nAnalytical / Rebuttal Speech for Debate (4)\n(Affirmative &amp; Negative Rebuttal Speech) 　　10% memorized \nGroup Debate 1 (Standard format) \nGeneral Interest Topic 　　15% (team performance grade 40% + individual debater performance 60%) \nGroup Debate 2 (Cross-Examination format) \nPolicy Debate　　15% (team performance grade 40% + individual debater performance 60%)\nFinal Debate Match (Lincoln-Douglas format / impromptu) (note 4) 　　0-10% (TBD) \nSpeech Assessment Portfolio (Speech outlines, scripts audios, commentary notes and peer evaluation entries) 　　Required (note 5) \nance (note 3) 　　20-30% (full attendance) \nNotes: \n1)　　Student speakers need to videotape their speeches (pre and in-class) each time and submit the digital recordings in the final portfolio at the end of the semester. \n2)　　Students who are scheduled on the day to give an in-class speech will start with a pre-speech recorded in the classroom. 30 minutes will be allowed for the pre-speech recording. Students who do not get to deliver an in-class speech (by arrangement or choice) can decide whether to use the pre-speech for official grading. It should be noted that speeches delivered in-class receives instructor’s comments and will be considered extra credits. For Class A, the pre-speech session starts at 8:10 to 8:40 in Rm 401. For Class B, the pre-speech starts at 10:10 to 10:40 in the Lab. More details of arrangement will be discussed. \n3) Students are obligated to attend all class sessions. Each absence will generate 10% point deduction of the semester grades on the 100% scale. \n4) All extemporaneous speeches allow speakers to deliver the speech with its outline and necessary visual aids, such as flash cards, posters and PPT slides. Student speakers who use a script at speech delivery will result in the total loss of the component grade. (For each speech, students shall keep the comments/grades (on speech card) for the purpose of monitoring their performance and the final result.) \n5) The implementation of the final debate match is likely to be subject to certain contingent occurrences as the class proceeds. Exact date, format and related matters will have to be discussed and determined later in the semester. \n6) Students are required to submit the speech assessment portfolio at the end of the semester. Failure to submit the portfolio will override the grades received in other grading components and thus results in a failing grade.\n(Course content and activities are to be adjusted for effective teaching and learning. The above syllabus is thus subject to modification as the class proceeds. Updated info will be provided when necessary.)",
    "materials": "Compiled handouts",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "In compliance with the University policy, the course will be conducted temporarily online until alert lifted.",
      "courseInfo": "All necessary information and instructions pertinent to class assignments will be provided via Google Classroom. It is the students' responsibility to follow all updated instructions. Not keeping track of due dates and scheduled work will result in the forfeiture, failing to be awarded the task credit points, and highly likely a failing semester grade.",
      "courseURL": "https://classroom.google.com/c/Mzg4NjkyMTg1OTgy?cjc=jvcodvr",
      "contactInfo": "Please refer to the syllabus.",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
