[{"name":"吉塔","email":"sangeetha@mail.ntut.edu.tw","latestUpdate":"2021-09-03 09:21:05","objective":"This course 'GREEN TECHNOLOGY' is a basic course taught entirely in English. The aim of this course is to provide introductory knowledge to students who have not studied Environmental Science as a subject. Human influence and its negative effects on the environment and sustainable green technologies that can be adopted by us to save this planet.  Different forms of renewable energy techniques will also be discussed in this class. This class also motivates students to improve their English language skills like conversing and discussing in English and will help them to deliver better English presentations. \n\n1.　　Green Technology- Introduction and Basics\n2.　　Green Energy sources\n3.　　Artificial photosynthesis\n4.　　Carbon Footprint\n5.　　Carbon Trading\n6.　　Sustainable Farming\n7.　　Green Architecture\n8.　　Bio energy Production\n9.　　MIDTERM EXAM\n10.　　Wastewater Treatment \n11.　　Nuclear energy\n12.　　Biomimetics\n13.　　Green Chemistry\n14.　　Sustainable procurement\n15.　　Electronics stewardship\n16.　　Green organizations\n17.　　Waste Diversion\n18.　　FINAL EXAM","schedule":"1. The students of this class will be separated into groups for weekly presentation purposes and every week the Teacher will assign a topic for the presentation.\n2. In every class, the Teacher will initially finish the power point presentation\n3. Then one person from every group has to give his/her presentation","scorePolicy":"1. The Teacher will conduct one Midterm exam and one Final exam throughout the semester\n2. The questions for the exams will be from the power-point presentation of the Teacher. \n3. The total score of exam will be for 100 marks, in which the Teacher will consider the assignment marks, class attendance and the weekly presentation of every student.","materials":"1.　　The Teacher will not use any textbooks/bibliography materials for the class.\n2.　　The students will have to study the Powerpoint presentations prepared and taught by the Teacher in every class","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">1. As this semester will be taught online, the teacher will ask all students to prepare assignments as midterm and final exams.\n2. The assignment marks will be considered for exam grades along with class attendance and the weekly presentation of every student.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">1. The University has asked to transform my class into online due to the pandemic issues. \n2. So my class will be online on Google meet every week Tuesdays from 9.45AM to 12PM.\n3. After I finish my presentation, the students will have to do their presentations\n4. Any doubts regarding the regulations of this class can be discussed during our online class</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Students who wish to join my class can register on the University Website and inform me at sangeetha@mail.ntut.edu.tw</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">1.　　Students can add or cancel my course on the University Website. \n2.　　I will login to my portal and accept their request. \n3.　　For any queries regarding my course mail me at sangeetha@mail.ntut.edu.tw</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
