[{"name":"林含怡","email":"hanyilin@ntut.edu.tw","latestUpdate":"2021-09-04 17:10:48","objective":"本課程旨在介紹英語全球化、全球英語，以及英語作為國際語言的發展與相關論述，並針對英語在全球擴散的現象，檢視相關的概念與理論。本課程將探討因英語全球化所造成，在社會語言學、文化、政治經濟與教育等方面的重要議題，以及與世界英語相關的議題與爭論。\nThis course aims to provide students with an overview of the spread of the English language around the world, the emergence of World Englishes/ Global Englishes, and the development of the popularization of English as a world lingua franca. It examines the various concepts and theories developed in academia to account for the unprecedented global expansion of English. Through readings and class discussion, this course will look at key sociolinguistic, cultural, politico-economic and educational issues arising from the spread of English as well as the current issues and debates surrounding World Englishes/ Global Englishes. Students will be encouraged to conduct original research on or detailed analysis of the implications of English as the international language.","schedule":"Syllabus\n1.　　Course Introduction\n2.　　The history of English\n3.　　The global spread of English \n4.　　Language change and diversity in English\n5.　　English in the inner circle\n6.　　English in the outer circle\n7.　　English in the expanding circle\n8.　　English as a lingua franca\n9.　　Tutorial (reading week)\n10.　　Attitudes towards English\n11.　　Teaching and learning Global Englishes\n12.　　Issues related to Global Englishes\n13.　　Issue: Global Englishes, ELF and language education\n14.　　Issue: The power and politics of English\n15.　　Issue: Commodification of English\n16.　　Issue: English, globalization and popular culture\n17.　　Issue: Englishization in higher education\n18.　　Term paper submission","scorePolicy":"30% Presentation\n30% Term paper\n40% In-class performance: class participation and discussion; homework reading and researching","materials":"Crystal, D. (2003) English as a Global Language. 2nd edition. Cambridge: Cambridge University Press.\nKirkpatrick, A. (2007) World Englishes: Implications for international communication and English language teaching. Cambridge: Cambridge University Press.\nJenkin, J. (2015) Global Englishes: A Resource Book for Students. (3rd Edition) London: Routledge.","foreignLanguageTextbooks":true}]
