[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2021-09-07 11:12:49","objective":"本課程將針對英語授課 (English as a medium of instruction, EMI)及學科與語言整合教學 (Content and Language Integrated Learning , CLIL)兩大領域範疇進行深入探究，本課程將探討不同主題包含：EMI/CLIL不同的理論架構、EMI/CLIL於不同學科上之應用、以及EMI/CLIL於不同教育階段的應用等主題，並透過課堂討論、小組活動、個案研究以及專題提案討論，提升學生對相關主題的知識建構與教學能力，建立其對EMI/CLIL主題於文獻探討之掌握及相關研究方法，並期將所學之知能應用在課堂教學中。\nThis course in an introductory course for English as a Medium of Instruction (EMI) and Content and Language Integrated Learning (CLIL). This course aims to cultivate students’ knowledge about EMI and CLIL and their applications in different disciplines across different educational levels. The elements of teaching subject areas in English will be discussed in class to equip students with the basic concepts and techniques for EMI and CLIL. Through various class activities such as lectures, discussions, case studies, group work, and larger projects, students will explore not only the theorical foundations for EMI and CLIL but also classroom pedagogy and methodological approaches related to EMI and CLIL. The promises and challenges of EMI and CLIL and emerging issues will also be discussed in this course.","schedule":"Week 1 Orientation\nWeek 2-7 Reading and discussing papers \nWeek 8-10 Midterm Demo\nWeek 11-15 Curriculum, course design and pedagogy\nWeek 16-18  Final Demo","scorePolicy":"Attendance 20%\nClass Participation 20%\nPaper Presentation(s)  30%\nClass Demo 30%","materials":"Compiled papers and course materials","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">In compliance with the University policy, the course will be conducted temporarily online until alert lifted.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">All course instructions will be provided on Google Classroom. Please make sure you keep close track of due dates and scheduled work.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">https://classroom.google.com/c/Mzg4NjkyMTg2MTA3?cjc=keoq6lb</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Please refer to the course syllabus.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
