[
  {
    "name": "蘇春𤂌",
    "email": "such@ntut.edu.tw",
    "latestUpdate": "2021-09-18 09:10:50",
    "objective": "Basic Electrical Engineering training for students with Mechanical Engineering major. The goal of this course is to get familiar with the building blocks of electrical systems in Mechatronic applications. Major topics include Electrical machines, Motor Drives, Power Amplifiers, Power Electronics, and OP-Amp related signal processing circuits. Lectures are given to illustrate the function of the each block in electrical systems. And then the students can conduct experiment to explore relevant circuits in order to obtain thorough understanding of their characteristics.",
    "schedule": "第1週: Class begins;\n第2週: Preview of electrical systems; \n第3週: Preview of experiments: Motor and Drive Diagnosis\n第4週: Exp: Influences of sensor positions on motor detection;\n第5週: Exp: Relationship between unbalance and vibration in motor;\n第6週: Exp: Effects of lubrication on stability of motor running; Effects of loadings on motor running;\n第7週: Exp: Relationship between test parameters and target motor;\n第8週: Exp: Measuring temperature of motor in operation.\n第9週:  Midterm examination\n第10週: Transformers; \n第11週: Electrical Machines;\n第12週: Basics of Power Electronics;\n第13週: Electrical Drives and Special Electric Machines;\n第14週: Dynamics of Electrical Machines and Drives;\n第15週: Presentations of group I;\n第16週: Presentations of group II;\n第17週:. Presentations of group III;\n第18週: Final examination",
    "scorePolicy": "1. Assignments &amp; reports;\n2. E- &amp; oral presentation; and\n3. Mid-term &amp; final exam.",
    "materials": "Textbook: Electrical Machines and Drives, Jan A. Melkebeek, Springer, 2018.\nReferences: \n1.　　Electric Motor Control, Sang-Hoon Kim, Elsevier, 2017.\n2.　　Analysis of Electric Machinery and Drive Systems, Paul C. Krause, Oleg Wasynczuk &amp; Scott D. Sudhoff, IEEE/Wiley, 2002.",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": "全班學生人數平分為一半: 每兩周到實驗室實作一次，未實作學生自行撰寫報告。 ",
      "courseScoreMethod": "實驗部分繳交實驗報告。\n課堂部分可到校則筆試；不可到校則繳交電子檔報告。\n無論疫情，皆須按進度繳交報告。",
      "courseInfo": "由教學助理聯絡修課學生，逕行通知。\n實作依照分流規劃；課堂課則學生到校、老師遠距教學。",
      "courseURL": "9/27使用google meet網址: \nmeet.google.com/jwv-uvoq-yub",
      "contactInfo": "such@mail.ntut.edu.tw\n開學前及平時可洽: 教學助理/陳彥廷/email: tim211454@gmail.com",
      "additionalInfo": "*實作課程依照分流規劃。\n◎課堂課則學生到校、老師遠距教學。三級警戒以上，則使用google meet, 學生及老師都遠距教學。(第一堂課至綜科館115室，依排定梅花座入座。)因應校規隨時變更，請盡早與教學助理取的聯繫，以便通知本課程進行方式。",
      "lv2Method": "分流上課"
    }
  }
]
