[{"name":"顏毅廣","email":"yknewman@gmail.com","latestUpdate":"2021-09-07 09:05:19","objective":"奈微米工程於生物醫學之應用日趨重要，量測與操作工具的開發與實際的生醫應用對象的大小尺寸具有密切的相關性，對於生物系統的充份瞭解是工程表現的重要過程之一。在此課程中將配合本校實驗室目前之相關研究設備進行原理講解與應用討論，包括之項目將由分子、細胞到組織之感測、分析與操縱。選修學生須依下列重點：奈微米生醫感測系統、奈米生醫材料、奈米生醫光電以及實驗室晶片等領域選擇期中期末報告之題目與計畫內容，主要要求在尋求創新思考方向，以求在原理或應用上的突破，積極推動跨領域與技術先進之整合性研究。\nThe application of nano-micron engineering in biomedicine is becoming more and more important. The development of measurement and operation tools is closely related to the size of actual biomedical application objects. A full understanding of biological systems is one of the important processes of engineering performance. In this course, the principle explanation and application discussion will be carried out with the current research equipment in our laboratory, including the sensing, analysis and manipulation of molecules. Elective students should choose the topics and project content of the mid-term report in the fields of nano-micron biomedical sensing system, nano-biomedical materials, nano-biomedical optoelectronics, and laboratory chips. The main requirement is to seek innovative thinking , In order to seek breakthroughs in principles or applications, and actively promote integrated research across fields and advanced technologies.","schedule":"Week　　Topics\n1　　Introduction of course, Grouping\n2　　CMOS MEMS Overview, Introduction of CIC for Chip design\n3 　　Introduction of BioMEMS and Chip design \n4　　Introduction of nano-bio-chip and Chip design\n5　　Review in Micro &amp; Nano Technologies  and Chip design\n6　　Project proposal presentation \n7　　Paper based sensors\n8　　Affinity principle and SPR and ELISA\n9　　cantilever biosensor I\n10　　cantilever biosensor II\n11　　Biosensor telecare overview\n12　　Bio Thin film  coating technology\n13　　TIRFM\n14　　MOCSER\n15　　FET and electrochemical biosensors\n16　　Final Project Presentation and demo\n17　　Final Project Presentation and demo \n18　　Final thesis report deadline\n\nLab Project List:\n\nProject 1　　Soft lithography (fabrication)\nMixing (Testing)　　PDMS &amp; Microscale Mixing,\n　　\nProject 2　　3D Printing (fabrication)\nHydrodynamic Focusing or chemical reaction (Testing)　　3D Printing based microfluidics\n　　\nProject 3　　Paper based sensor (fabrication)\nChemical or biological (testing) Paper based sensors\n\nProject 4　　Microcantilever sensor \n(characterization, testing)　　Microcantilever Chemical Sensor","scorePolicy":"1.　　Grading:　　Lab project:  55%\n　　 Team work 20% \n　　 Project proposal presentation 15% \n　　 Project final presentation 20% \n2.　　Q&amp;A in class: 15%   \n3.　　Final thesis report :  30%","materials":"上課投影片講義\nBioMEMS, Technologies and Applications \nBy Wanjun Wang (ME, LSU),  and Steven A. Soper (Chem. LSU)","foreignLanguageTextbooks":true,"covid19":{"lv2Description":"本課程為部分講授部分實作課，講授課則全部採遠距上課；實作課則學生將會分組，每組每周與老師或助教約時間來進行。如三級警戒則改以遠距教學以觀看實驗影片，並每位同學自行在家設計簡易相關實驗作為報告。\nThis course is part of the lecture and part of the practical class, and all the lectures are taught remotely; in the practical class, the students will be divided into groups, and each group will conduct an appointment with the teacher or teaching assistant every week. If the third level of alert is changed to remote teaching to watch experimental videos, and each student designs a simple related experiment at home as a report. ","courseScoreMethod":"期中考、期末考採線上報告。期末書面報告上傳。\nOnline reports are used for mid-term and final exams. The final written report is required to be uploaded.","courseInfo":"https://classroom.google.com/c/MzkxOTQ2MzA3NDc1\n請以北科提供的gmail 連上本課程google classroom。或是使用課程代碼\naq3gmt5加入google classroom。(僅開放加選同學進入)\n\nPlease use the gmail provided by NTUT to connect to the google classroom of this course. Or use the course code aq3gmt5 to join the google classroom.","courseURL":"https://meet.google.com/lookup/cmuzayamnm","contactInfo":"聯絡方式：綜合科館六樓617-3室\n電話(Tel)：(02) 2771-2171 轉 2030\nE-mail: ykyen@ntut.edu.tw\nOffice Hours: 每週一Monday  2~4 pm","additionalInfo":null,"lv2Method":"分流上課"}}]
