[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2021-06-06 17:04:47","objective":"本課程介紹研究方法和論文寫作知識，期能培養學生獨立研究和撰寫學術報告、論文的基本能力。主要分為三部份：（一）研究內涵與步驟,（二）主要的研究方法,（三）如何撰寫英文論文及報告。涵蓋主題包括：運用圖書館資源選擇研究主題、研究計劃的撰寫、問卷調查法、訪問法、觀察法、田野工作研究方法、文獻資料分析法（內容分析法）、個案研究法、相關研究法、實驗法、文學研究法，研究報告論文格式與寫作要領，如何撰寫文獻探討，參考書目寫法等。\nThis course aims at providing students with the fundamental knowledge and competence that they will need in doing research and writing research papers.  Its main purpose is to familiarize students with methods, procedures, and techniques that are applicable to quantitative and qualitative research as well as to improve their ability to write research papers.  The main topics for instruction include: the research process; major research methods; and the structure of a research paper.  The research methods primarily studied include the experimental method, descriptive research, ethnography, case study, observation, survey research (questionnaire and interviews), content analysis/documentary analysis, and critical approaches to literature.","schedule":"Please see the hard-copy syllabus for a weekly schedule. \n\nGeneral Topics:\nAn Introduction to Research\nFinding a Topic and Identifying and Using Scholarly Sources\nLibrary Research (at Taipei Tech and NTU)\nArchival Research (in Taiwan and abroad)\nHow to write a strong senior project in literature, cultural studies, or linguistics\nMLA Citation Style/MLA formatting\nWriting Processes/Writing Productivity\nEthical Research and Writing Practices (No plagiarism, no patchwriting, original work)","scorePolicy":"•　　You will have homework (including some that requires you to travel off campus), a group presentation, a short individual presentation, reading quizzes, and a research proposal/annotated bibliography. In order to receive credit for this course, you must complete all assignments.\n•　　All assignments are due in hard copy at the beginning of class. (You will have technology problems. Make sure to print your paper early enough that you will not run into difficulties with non-functioning printers.) For formal papers (e.g. your proposal and annotated bibliography) I take off 5% if you are late to class on a paper due date (10% if you are fifteen or more minutes late), 10% if the paper is turned in within twenty-four hours after the due date (before 1:00 p.m. on Thursday) and 20% if the paper is turned in within forty-eight hours of the deadline. You will not receive any credit for a paper turned in more than 48 hours late. Any late paper should be turned in both by an e-mail Word document and in an identical hard copy. I hope that you will turn in all papers on time, but in the event that a paper is late, bring it to my office. If I am not in my office, slip the paper under the door or put it my box. Please also immediately send me an e-mail alerting me that you have left a paper for me. If you wish to receive credit for a late paper, it is your responsibility to make sure that the paper gets to me safely. \n•　　As this class is more assignment-based than others that I teach, I will give 50% credit for late assignments turned in within 24 hours. No credit is given for later homework. If you know you will be absent, get me the assignment ahead of time.\n•　　On your many quizzes, you may use the handwritten notes you have taken in your reading notebook so long as these notes are a result of your individual effort on the reading and have not been borrowed from or shared with other students (which is scholastic dishonesty). \n\nGrade Percentages:\nPresentations: 20%\nQuizzes: 20%\nAssignments: 25%\nProposal and Annotated Bibliography: 25%\nParticipation: 10%\n\nAs you know, your course grade in this half of the course will be averaged with your course grade in the other half of the course. Please make sure to follow both professors’ rules on attendance, and try to get a high grade in this half of the course in order to balance out any low scores you might get (due to unforeseen circumstances) in the other. \n\nMost common reason students fail this course: Plagiarism/Patchwriting. Make sure you absolutely understand how to cite others' work ethically: being able to do so is the main goal of this course.","materials":"•　　Bullock, Richard, et al., editors. The Little Seagull Handbook. 3rd ed., Norton, 2017. \n•　　Course Packet and/or e-mailed readings and handouts. Please print these.","foreignLanguageTextbooks":true}]
