[{"name":"吳欣怡","email":"cinewu@mail.ntut.edu.tw","latestUpdate":"2021-05-29 23:53:51","objective":"This course aims to give the guidance to the film essay writing. In films, the off-screen elements usually play much profound roles than the on-screen ones. In the sense, the relation between the visuality and the hidden elements will be examined from scenes to scenes. Also, we will survey some of the philosophical, theoretical, and the critical literatures to further analyze the invisible aspects in the images.\n    During this course we will focus on the subjects of “Time” and “Film sounds”. Since both subjects are invisible and they are the cinematic elements that are significant to this art form. At the end of this course, the auteur films will be discussed. Course requirements include a midterm essay and an oral presentation. By the end of semester, each MA student is required to submit a term paper and each BA student can choose to write a term paper or make a short film by preference.","schedule":"WK 1: Introduction.\n\nWK 2: Media writing.\n(hang-out) from Eugenie Brinkema, “Writing about Media!” [2009]　　\n\nWK 3: Time and consciousness-1\nReading (R) Sokolowski, R.. 1999. ‘Ch.9 Temporality,’ Introduction to Phenomenology, Cambridge University Press. UK. pp 130-145. \nScreening (S) Ivan’s Childhood, 1962, Tarkovsky (Russia)\n\nWK 4: Time and consciousness-2\n(S) Ivan’s Childhood, 1962, Tarkovsky (Russia)\n\nWK 5: Time and consciousness-3\n(R) Butler, A.. 2007. “‘Motor-driven metaphysics’: movement, time and action in the films of Maya Deren,” Screen. Vol.48 (1), pp1-23.\n(S) “Lifeline,” Ten Minutes Older, 2002, Victor Erice (Spain)\n(S) Meshes of the Afternoon, 1943, Maya Deren (USA)\n\nWK 6: Time and consciousness-4\n(R) Corrigan, Timothy J.. 2007. “ Film Terms and Topics for Film Analysus and Writing,” A Short Guide to Writing about Film. The U. of Pennsylvania. pp 36-81.\n\nWK 7: Oral presentation-1\n\nWK 8: Oral presentation-2\n\nWK 9: Midterm\n\nWK 10: Film sounds-1\n(R) Michel Chion, 1994. Translated by Claudia Gorbman. “The AudioVisual Scene,” Audio-Vivsion: Sound on Screen. Columbia University Press. pp 66-94.\n(S) M, 1931, Fritz Lang (German).\n\nWK 11: Film sounds-2\n(S) M, 1931, Fritz Lang (German).\n\nWK 12: Film sounds-3\n(R) Silverman, Kaja. 1988. “Body Talk,” The Acoustic Mirror. IN: Indiana University Press. pp. 42-71.\n(S) The Wizard of OZ, 1939, Victor Fleming (USA).\n\nWK 13: Film sounds-4\n(S) Singin’ in the Rain, 1952 (USA).\n\nWK 14: Auteur film-1\n(R) Sarris, Andrew. 1962. “Notes on the Auteur Theory”.\n(R) Peter Wollen. 1972.“The Auteur Theory”.\n(S) Citizen Kane, 1929, Orson Welles (USA).\n\nWK 15: Auteur film-2\n(S) Touch of Evil, 1958, Orson Welles (USA).\n\nWK 16: Oral presentation-1\n\nWK 17: Oral presentation-2\n\nWK 18: Feedback","scorePolicy":"＊Attendance and strong participation in class. 20%\n＊Midterm essay (1000 words). 30% \n＊Oral presentation. 20% \n＊Final essay (1000 words). 30% \nThe essay has to be proofread by a professional editor before submitting.","materials":"Refer to the syllabus.","foreignLanguageTextbooks":true}]
