[{"name":"陳心怡","email":"hichen@ntut.edu.tw","latestUpdate":"2021-06-15 11:44:23","objective":"本課程為任職於英語教育之教師所設計，主旨在於分析數位教材於英語教學中的角色。藉由電腦/科技輔助語言教學、電腦媒介溝通、以及線上教學相關理論、研究與應用的研討來瞭解數位教材如何輔助英語學習。因應數位教材與學習者特性所採用之評量、評估、以及施測方法亦將是本課程重點。\nThis course is designed for in-service English teachers to analyze the pedagogical role of electronic courseware in the language classroom. Theories and studies of CALL (computer-assisted language learning), TELL (technology-enhanced language learning), CMC (computer-mediated communication), and online learning will be discussed to understand the utilization of electronic courseware in assisting English learning. Assessment, evaluation, and testing measurements in responding to electronic courseware and to learner characteristics will also be discussed.","schedule":"A detailed course schedule will be announced on the first week.","scorePolicy":"A total of 100 points will be granted. Your grade will be based on the quality of your work in the following areas. \n\n1. Attendance, participation in discussions and assignments (20%) \nBoth in class and on-line discussion are required. Assignments will be assigned throughout the semester.\n\n2. Discussion Leads (2-3) (20%)\nArticle presentations and discussion leads: For every class there will be a few readings which everyone should do, and 1 supplemental reading, which an assigned student should present to the class. \n\n3. Activity design (20%)\nYou should create a technology-enhanced unit of materials to teach a topic, theme, or area (vocab, grammar, listening, reading, pragmatics, culture, etc.), preferably something you can eventually actually use in your classroom. The unit should be about 5-10 pages (student handouts not included if any). You will present your materials in class on a given date.  \n\n4. Final Project and Presentation (40%)\nYou should write a graduate-level quality paper as a final project, between 15-20 pages. For the paper I can accept a research project proposal, a literature review, a pedagogical experiment using your materials, or a theoretical piece. You will present a brief summary of your project to the class on the last two weeks of the semester and should submit the final paper by the due date.","materials":"A collection of book chapters and journal articles will be selected as course readings. Articles may be selected from the following journals including Language Learning &amp; Technology, Computer-Assisted Language Learning, ReCALL, Computers &amp; Education, System and other related journals.","foreignLanguageTextbooks":true}]
