[{"name":"陳岡伯","email":"kpchen@ntut.edu.tw","latestUpdate":"2021-06-05 20:19:54","objective":"本課程以當代文學批評和文化理論為基礎，探討小說與戲劇改編成電影的過程中，文字轉化成視覺意象之間的差異，期能提升多元化的思辯及表達能力。\nDrawing upon modern literary criticism and cultural theory, this course aims to examine the difference between works of literature and the distinctive medium of the cinema. Students will be offered a variety of discussion which stimulates the kinds of critical thinking that lead to a better understanding of the process of transposition from literature to film.\n\nThe course follows the history of Western literature, approaching representative literary works from Classical antiquity, the Middle Age, Renaissance, the Enlightenment, the Romantic Period and the nineteenth century, to the modern time. Students will watch films related to or adapted from the literary texts, after which the instructor will give a lecture and conduct in-class discussion. By the end of the semester, the students will be familiarized with the key ideas of each important literary era or movement and formulate their own critical interpretations of literature and its visualization.","schedule":"Week 1: Introduction to the course\n\nWeek 2-3: Classical Antiquity\nFilm viewing: Troy (2004)\nLiterary text: Homer's Iliad\n\nWeek 4-5: The Middle Age\nFilm viewing: Kingdom of Heaven (2005)\nLiterary text: The Song of Roland\n\nWeek 6-7: Renaissance\nFilm viewing: Shakespeare in Love (1998)\nLiterary text: William Shakespeare's Romeo and Juliet and sonnets\n\nWeek 8-9: the Enlightenment\nFilm viewing: The Devil's Advocate\nLiterary text: John Milton's Paradise Lost\n\nWeek 10-11: the Years of Revolution\nFIlm viewing: Quills (2000)\nLiterary text: Marquis de Sade's Justine, or the Misfortunes of Virtue\n\nWeek 12-13: the Romantic Period\nFilm viewing: Red Dragon (2002)\nLiterary text: William Blake's poetry\n\nWeek 14-15: the Victorian Age\nFilm viewing: Interview with the Vampire (1994)\nLiterary text: Bram Stoker's Dracula\n\nWeek 16-17: the Twentieth Century\nFilm viewing: The Hours (2002)\nLiterary text: Virginia Woolf's A Room of One's Own and Mrs. Dalloway\n\nWeek 18: Group presentations","scorePolicy":"Attendance and participation: 30%\nGroup presentation: 30%\nFinal paper: 40%","materials":"Reading materials will be distributed by the instructor.","foreignLanguageTextbooks":true}]
