[{"name":"蔡逸萍","email":"ctsai@ntut.edu.tw","latestUpdate":"2021-09-11 21:31:20","objective":"The working languages of this course are Chinese and English. \n\n本課程為中英口譯基礎課程，讓學生了解各類型口譯實務。學生認識口譯員具備之技術與語言能力，以漸進方式學習基礎視譯與短逐步口譯。課程著重於強化學生公開演說能力、口譯聽力技巧、重述演練、一心多用與短期記憶重述運用以及基礎逐步口譯筆記與摘要之模擬演練。\nThis is an introductory course to Chinese-English interpreting. The course provides a practical insight into different modes of interpreting and introduces skills and aptitude integral to interpreting progressively. Students learn basics of sight translation and short consecutive interpreting. Topics include public speaking, active listening skills, paraphrasing, multitasking, recall and memory, and gist extraction followed by basic CI note-taking techniques.","schedule":"(Zuvio: 79954234)\n\nPLEASE NOTE THAT THIS SYLLABUS IS SUBJECT TO CHANGE DUE TO EVOLVING CORONAVIRUS CONCERNS.\n\nWEEK　　SESSION THEME\n1　　Introduction\n2     　　Interpreting as a Profession\n3     　　Public speaking/Paraphrasing\n4     　　Paraphrasing\n5    　　Sight translation (ST) I \n6　　ST II\n7　　ST III \n8   　　ST IV \n9    　　Mid-term exam\n10    Review of Midterm  \n11    Active listening and analysis\n12   　　Memory retention and recall \n13   　　Short Consecutive Interpreting (CI)\n14   　　Note-taking for CI: Skills and strategies I\n15   　　Note-taking for CI: Skills and strategies II\n16   　　Note-taking for CI: general topics I\n17   　　Note-taking for CI: general topics II\n18   　　Final exam","scorePolicy":"(THE FOLLOWING POLICY IS SUBJECT TO CHANGES)\n\nAssessment\n-　　30% on mid-term exam\n-　　30% on final exam\n-　　10% on attendance\n-       10% on practice logs\n-　　20% on continual assessments: in-class performance; homework assignments","materials":"1. See class handouts\n2. Selected readings:\n-　　劉敏華. 逐步口譯與筆記. 書林出版有限公司. 2008 (required)\n-　　Pöchhacker, Franz, and Miriam Shlesinger. The Interpreting Studies Reader. London and New York: Routledge, 2002.\n-　　Gile, Daniel. Basic Concepts and Models for Interpreter and Translator Training. John Benjamin Publishing. 2009","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"If face-to-face teaching is moved to an online environment, all session themes on the syllabus will proceed online, including exams.","courseInfo":"PLEASE LOG ONTO THIS WEBSITE ON SEPTEMBER 20 2021 (MONDAY) TO CONFIRM WHETHER OR NOT THIS CLASS GOES ONLINE. IF IT DOES, CLICK THE FOLLOWING LINK TO ENTER THE GOOGLE MEET CLASSROOM ON TUESDAY.","courseURL":"Interpreting B\n9月 28日 (星期二) · 下午1:10 - 3:00\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/oza-xpkv-xpz","contactInfo":"email: ctsai@ntut.edu.tw","additionalInfo":null,"lv2Method":"遠距上課"}}]
