[{"name":"蔡逸萍","email":"ctsai@ntut.edu.tw","latestUpdate":"2021-09-06 16:10:27","objective":"PLEASE NOTE THAT THE WORKING LANGUAGES OF THIS INTERPRETING TRAINING COURSE ARE ENGLISH AND CHINESE.\n\nThe course aims to provide students with practical insights into different modes of interpreting in a variety of intercultural settings. A theoretical introduction will prepare students for further research in this area. This course centers around the training of sight translation and consecutive interpreting. Students will practice and develop main skills of active listening, de-verbalization, memory retention, quick reflexes, gist extraction, paraphrasing and note-taking. More emphasis is placed upon learning to zero in on the main idea under heavy time pressure and re-activate passive memories with the aid of note-taking. General and technical speeches in politics, business, world affairs and other fields will be used. Note that the working languages for this interpreting training course are Chinese and English. \n\n\n本課程旨在帶領學生認識不同形態的跨文化場合，所用到的各種口譯模式。認識基礎口譯理論，讓學生為未來可能從事之學術研究做準備。本課程主要教授視譯與逐步口譯。學生演練並培養口譯相關技巧，涵蓋積極聆聽、脫離源語句法結構、記憶保留、快速反應、摘要、重述及筆記。課程重點在熟練如何在高度時間壓力下，即刻聚焦演說片段的主旨，並透過筆記重啟被動記憶。課程使用教材，包含一般性與技術性主題，如政治、商業、時事等。學生修習本課程使用的工作語言是中文與英文。","schedule":"(Zuvio: 79955635)\n\nTHIS SYLLABUS IS SUBJECT TO CHANGE DUE TO EVOLVING CORONAVIRUS CONCERNS.\n\nWEEK　　SESSION THEME\n1　　Introduction\n2     　　Professional Interpreting: Theory vs Practice\n3     　　Paraphrasing \n4     　　ST I\n5    　　ST II\n6　　ST III\n7　　ST IV\n8   　　ST V\n9    　　Midterm \n10    Review of Midterm\n11    Active listening, memory and recall: Strategies and coping tactics\n12   　　Short CI \n13   　　Note-taking for CI: Skills and strategies I\n14   　　Note-taking for CI: Skills and strategies II\n15   　　Note-taking for CI: Skills and strategies III\n16   　　Long CI I\n17   　　Long CI II\n18   　　Final exam","scorePolicy":"(THE FOLLOWING POLICY IS SUBJECT TO CHANGES)\n\nAssessment\n　　30% on mid-term exam\n　　30% on final exam\n　　40% on continual assessments:  in-class performance; attendance to lectures; practice logs; homework","materials":"Selected readings\nBooks\n-　　劉敏華. 逐步口譯與筆記. 書林出版有限公司. 2008.\n-　　Gile, D. (2009). Basic concepts and models for interpreter and translator training. Amsterdam/Philadelphia: John Benjamins.\n-　　Pöchhacker, F. (2004). Introducing Interpreting studies. London, New York: Routledge. \n-　　Pöchhacker, Franz, and Miriam Shlesinger. (2002). The Interpreting Studies Reader. London and New York: Routledge.\n\nTop journals in the field:\n-　　Perspectives: Studies in Translation Theory and Practice\n-　　Target – International Journal of Translation Studies\n-　　Meta – Journal des traducteurs\n-　　The Translator: Studies in Intercultural Communication\n-　　Translation and Interpreting Studies\n-　　Across Languages and Cultures\n-　　Translation Studies\n-　　The Translator and Interpreter Trainer\n\n(See also class handouts)","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">If face-to-face teaching is moved to an online environment, all session themes on the syllabus will proceed online, including exams.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">PLEASE LOG ON TO THIS WEBSITE ON SEPTEMBER 20 2021 (MONDAY) TO CONFIRM WHETHER OR NOT THE THURSDAY CLASS GOES ONLINE. IF IT DOES, CLICK THE FOLLOWING LINK TO ENTER THE PRESCRIBED GOOGLE MEET CLASSROOM.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Interpreting: Theory and Practice (MA )\n9月 23日 (星期四) · 下午1:10 - 4:00\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/gpg-iduz-cfd</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">email: ctsai@ntut.edu.tw</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
