[
  {
    "name": "劉祐綸",
    "email": "y.l.liu@ntut.edu.tw",
    "latestUpdate": "2021-09-02 13:22:36",
    "objective": "In day-to-day life, consumers and companies generate large amounts of data all over the web that could provide valuable and useful business insights.  Marketing research is the process of harnessing the Internet data and putting the data to meaningful use. Marketing research provides a link between the consumer and public, through information that is used to identify and define marketing opportunities and problems, to initiate marketing action, and to improve marketing performance. This module aims to provide students with an understanding of the methods used in digital marketing research, and their roles in supporting marketing decisions. The module addresses the stages of the digital marketing research process, from identification of the problems and definition of the research objectives, to the presentation, visualisation and interpretation of research findings.",
    "schedule": "1　　Introduction to marketing research\n2　　Quantitative Methods I - Experiment Part A\n3　　Quantitative Methods II - Experiment Part B\n4　　Example paper discussion – Experimental method [Presentation I]\n5　　Quantitative Methods III - Survey Part A\n6　　Quantitative Methods IV - Survey Part B\n7　　Quantitative Methods V - Survey Part C\n8　　Mid-term exam week (no class)\n9　　Example paper discussion – Survey method [Presentation II]\n10　　Qualitative methods I - Projective Techniques\n11　　Qualitative methods II - Interview and Diary studies\n12　　Qualitative methods III - Coding\n13　　Example paper discussion – Qualitative method [Presentation III]\n14　　Mixed Method\n15　　Discussing findings, drawing recommendations and conclusions writing the research report",
    "scorePolicy": "Group video presentation (30%)\nIn-class group exam (open book, administered on computer; 3 hours) (40%)\nIndividual report (30%)",
    "materials": "Sponder, M. and Khan, G. (2017). Digital analytics for marketing. 1st ed. New York: Routledge. ISBN- 10: 0789750309",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Group video presentation: Online presentation\n\nIn-class exam (administered on computer): Students will use their own PC/laptop for the test. Different datasets and slightly different questions will be applied. Students are expected to receive their exam questions and datasets via email, and will have to analyse the data and send solutions within 3 hours.\nIndividual report (30%): Submit via NTUT-I Plus",
      "courseInfo": "The first two sessions (weeks) will be online (on Google meet). Will discuss the teaching/learning mode of the following week in class.\n\nLearning materials will be available on NTUT i-Plus a week before the teaching session starts.",
      "lv2Method": "遠距上課"
    }
  }
]
