[{"name":"葛瑞斐","email":"griffith@ntut.edu.tw","latestUpdate":"2021-09-08 14:53:43","objective":"通過每週閱讀和課堂討論，本課程將有助於培養學生的英語會話、聽力和閱讀技能。 在練習這些技能的過程中，我們將專注於理解西方語言和文化的核心思想，從而理解西方文化的人（他們的價值觀、動機、原則）的核心思想。 [本課程過去的主題包括：怪物與人類； 喜劇和幽默； 善惡的本質； 西方英雄； 棒球與社會； 美的理念和重要性； 探索與發現]。 檢查圍繞這樣一個主題的論文和電影，我們將考慮這個重要的想法告訴我們關於西方社會及其人民的什麼。\n\nThrough weekly readings and class discussion, this course will help develop students’ English conversation, listening, and reading skills.  In the course of practicing such skills, we will focus on an idea central to understanding the language and the culture of the West, and thus an idea central to understanding the people (their values, motivations, principles) of Western culture.   [Past topics for this course include: Monsters and the Human; Comedy and Humor; The Nature of Good and Evil; The Hero in the West; Baseball and Society; The Idea and the Importance of Beauty; Exploration and Discovery].   Examining essays and films centered around such a topic, we will consider what the significant idea tells us about Western society and its people.","schedule":"Week 　　\n1: 　　Introduction\n　　\n2-5:　　Unit 1　　\n\n6-8:　　Unit 2\n\n9:　　Midterm week\n\n10-13:  Unit 3\n\n14-17: Unit 4\n　　\n18:　　Finals week","scorePolicy":"Grades: \n　　 　　Midterm  50%\n　　　　Final　　    50%\n\nAttendance:   \n　　a combination of 3 absences or late days or classwork zeroes =  -10 points from course grade\n　　a combination of 4 absences or late days or classwork zeroes =  failing course grade","materials":"No","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">A paper submitted online and an oral exam online.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">All necessary information and instructions pertinent to class assignments will be provided via Google Meet. It is the students' responsibility to follow all updated instructions. Not keeping track of due dates and schedules work will result in the forfeiture, failing to be awarded the task credit points, and highly likely a failing semester grade.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">***Tuesday,  5:00 p.m. – 6:00 p.m.***\nlink: https://meet.google.com/mpx-ufuf-sbk\n***Wednesday, 4:00 p.m.– 6:00 p.m.***\nlink: https://meet.google.com/zno-ywum-znn</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Please refer to the syllabus.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
