[{"name":"劉如熹","email":"rsliu@ntu.edu.tw","latestUpdate":"2021-09-07 23:49:29","objective":"先修課程：指導教授同意\n1. 科技研發專案管理之個案研究. 有關科技開發案之技術開發管理, 人力責任管理及時間任務管理等PDCA (Plan, Do, Check, Action)之實務探討。\n[Case studies of science and technology research and development project management technology development and management of development projects related to science and technology, human responsibility and time management task management PDCA (Plan, Do, Check, Action) investigate the practice]\n2. 本課程將涵蓋以材料化學核心技術(配方與合成、分析與應用)為基礎，發展各種具可應用於光轉換為光、電與熱之新材料，其將分別應用於發光二極體、水分解與生醫熱療之介紹。 \n(This course will cover the core technology to Materials Chemistry (formula and synthesis, analysis, and application), based on the development of various tools that can be used to convert light into light new materials, electricity, and heat. It will be applied to each light-emitting diode, water Introduction of decomposition and Biomedical hyperthermia)\n3.本課程將兼具學術研究與產學研發(實務)。其中並將教授如何製作專利及論文地圖。\n[This course will both academic research and research development (practice). Where and how to make patent and paper maps will be taught in this course.]","schedule":"開課前提供 (To be announced before the class)","scorePolicy":"80%：聽講情形，出席狀況與發問狀況 (A listening situation, attending status, ask questions)。\n20%：專利地圖製作與報告(Making and report the patent map)。","materials":"Google patent, US patent, European Patent, Taiwan patent, and China patent.","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">期末報告採線上報告</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">上課時間會於第一次上課 9/28 (星期二) 2:00pm 公布</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">線上會議軟體：webex meeting （軟體下載網址：https://www.webex.com/zh-tw/downloads.html） \n線上會議號：579976593</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Tel: 0913710312 (劉如熹)</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
