[{"name":"劉立雯","email":"fancyface551221@yahoo.com.tw","latestUpdate":"2021-09-15 09:26:03","objective":"認識英文學術論文的語法、文體、結構組織等特質，並探討英文報告及論文撰寫方式。\n\nThis course helps students  familiarize with the syntax, style, and organization used in English research papers.","schedule":"Week 1 Course Introduction &amp;Rubric explanation\nWeek 2 Chapter 1 Expository Essays\nWeek 3 Ditto\nWeek 4 Chapter 2 Classification Essays\nWeek 5 Ditto\nWeek 6 Chapter 3 Process Essays\nWeek 7 Ditto\nWeek 8 Chapter 4 Cause /Effect Essays\nWeek 9 Midterm Exam, Thesis abstract assignment begins\nWeek 10 Midterm discussion , Chapter 4 Cause /Effect Essays\nWeek 11 Chapter 5 Extended Definition Essays\nWeek 12 Ditto\nWeek 13 Chapter 6 Problem Solution Essays\nWeek 14 Ditto \nWeek 15  Chapter 7 Summary /Response Essays\nWeek 16 Ditto\nWeek 17 Final Exam\nWeek 18 Final Exam discussion, Thesis abstract discussion","scorePolicy":"Midterm Exam Assignment: 20 %\nFinal Exam Assignment: 20%\nAssignments: 40%\nThesis Abstract:20%\nAttendance : +10%\n\n110-1 課程規則\n\n1. 每次上課均點名兩次\n2. 上課前點名出席且下課前點名出席者 該次上課視為出席且加分\n3. 上課前點名未出席但下課前點名出席者 該次上課視為遲到, 不加分但承認該次上課出席\n4. 上課前點名出席但下課前點名未出席者該次上課視為早退, 不加分但承認該次上課出席\n5. 上課前點名未出席且下課前點名未出席者 視為該次上課缺席不加分\n6. 上課無個人教材者不加分\n7. 考試違規與否由監試教師認定\n8. 監試教師認定該次考試違規後 ,該次考試成績零分\n9. 學期總成績由所有考試(包括期中期末考)的平均分數加上出席率加分以及上課優良表現及優良作業加分而成\n10. 學期總成績達60分(含)以上但未達70分, 且總出席次數多於10次(含)者, 得於第18週本科目上課時間(或由授課教師宣佈時間)補考該(幾)次考試(且以一次為限), \n11. 補考該(幾)次成績及格( 70 或以上)時,成績以70%認定, 補考該(幾)次成績不及格( 69 或以下)時,成績則以原始分數記算, 且本科目學期總成績至多為70分\n12. 因公假而補考者之成績則仍以100%認定但需出示授課教師認定之有效學校公假單\n13. 補考缺席視為放棄補考機會,分數以原成績計算\n\n1.　　The class roster will be called twice during each class session.\n2.　　Those who are present in the classroom, both before the class begins and before the class ends, will be considered attending the required class session and be rewarded one bonus point.\n3.　　Those who are not present in the classroom before the class begins, but are present before the class ends, will be considered late for the class session and will not be rewarded any bonus points.\n4.　　Those who are present in the classroom before the class begins, but are not present before the class ends, will be considered as having left early for the class session and will not be rewarded any bonus points\n5.　　Those who are not present in the classroom, either before the class begins or before the class ends, will be considered absent from the class session and will not be rewarded any bonus points.\n6.　　A bonus point will not be awarded to those who do not have their own class materials.\n7.　　It is the discretion of an exam proctor to decide whether an academic misconduct has taken place. \n8.　　If an academic misconduct is identified by an exam proctor, a zero will be given on the exam.\n9. The final semester grade is composed of the average of the total number of tests, including the midterm and final exam, plus the bonus points for full attendance in class and extra credits on outstanding class performance or homework\n10.　　Those who earn 60 points and higher, but lower than 70 points, on the semester final grade and who are present in class for 10 or more class sessions are eligible for the make-up exam held on week 18 during class time (or at a time otherwise announced by the instructor). The make-up exam session will only be held once.\n\n11.　　The make-up exam score will be counted as 70% of the original score if it exceeds 70, but it will remain as it was when it is below 70. And the semester final grade for those who take the make-up exam will be 70 at most even if it exceeds 70 after make-up exam score is taken into account.\n\n12.　　Those who missed their exam(s) due to official absences will receive their original score instead of 70% on make-up exams after presenting the school absence note to the class teacher.\n\n13.　　Those who qualify for a make-up exam, but do not show up on time, will be considered as having been given the opportunity to take the make-up exam and their final grade will be their original grade.","materials":"Longman Academic Writing Series 5 Essays to research papers\nBy Alan Meyers\nPearson Education, 2014\n請上網購買東華書局的書, 博客來MOMO應該都可買到\nplease purchase textbook online","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"Midterm Exam Assignment: 20 % (Online )\nFinal Exam Assignment: 20% (Online )\nAssignments: 40% (Online )\nThesis Abstract:20% (Online )\nAttendance : +10%  (Online )","courseInfo":"Class Time:Mondays 7:20 ~ 10:00 PM The first 3 weeks will meet online with Google Meet classroom, the rest of the class type is to be announced upon school official announcement. 前3 週上線上課, 之後上課型態等學校公告再說\nOnline-Classroom: Google Meet, or Teams","courseURL":"Contact Teacher Mary Jane  through Line for more class info\n加劉立雯老師Line: chinaskirt ,加Line 後 老師會告知上課網址","contactInfo":"上網簽核 Log on to school system to add this course.\n有問題問劉立雯老師Line: chinaskirt\nAsk Teacher Mary Jane through Line messenger if you have questions","additionalInfo":"本課程為碩班生英檢補救課程(博班生必修課程), 碩班生修習本課程的先決條件為: 在本課程結束之前必須向老師出示多益考試無550 分之證明, 如無法出示該證明, 系上不承認本課程為畢業條件之一\n如有疑問請洽系助伯","lv2Method":"遠距上課"}}]
