[{"name":"李文志","email":"wjlee@cc.shu.edu.tw","latestUpdate":"2021-09-04 00:09:59","objective":"本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.","schedule":"第一週  1.課程內容與說明2.運動場館與器材介紹\n第二週  體適能檢測(一)、體脂肪檢測\n第三週  體適能概論：1.何為體適能2.如何解讀體適能檢測結果\n第四週  心肺適能訓練理論跑步機訓練(一)中強度長時間訓練\n第五週  心肺適能訓練理論跑步機訓練(一)中強度長時間訓練\n第六週  心肺適能訓練理論跑步機訓練(二)間歇訓練\n第七週  心肺適能訓練理論跑步機訓練(二)間歇訓練\n第八週  心肺適能訓練理論跑步機訓練(三)高強度長時間訓練\n第九週  心肺適能訓練理論跑步機訓練(三)高強度長時間訓練  \n第十週  期中考筆試、體脂肪檢測\n第十一週 肌肉適能訓練理論：如何雕塑體型\n第十二週 肌肉適能訓練實務\n第十三週 柔軟度訓練理論：如何改善身體柔軟度\n第十四週 柔軟度訓練實務\n第十五週 運動處方設計與應用\n第十六週 運動與肥胖\n第十七週 期末考試、體脂肪檢測\n第十八週 補考","scorePolicy":"1.出席勤惰；30%\n2.學科考試：30%\n3.運動處方設計及實作：20%\n4.體適能成績：20%","materials":"1.健康體適能理論與實務，華格那書局\n2.抗老化 你需要大重量訓練：怪獸訓練總教練何立安以科學化的訓練 幫助你提升肌力、骨質、神經系統 逆轉老，遠流\n3.肌力訓練聖經：基礎槓鈴教程，楓書坊","foreignLanguageTextbooks":false,"covid19":{"lv2Description":"1、教師到校授課。學生採實體與遠距兩組教學，並隔週交換。\n2、遠距學習學生觀看非同步教材。\n3、遠距教材以教師規定之運動影片、文章閱讀心得，或規定運動項目作個人運動影片記錄、運動問題測驗等。\n4、如學生人數少於20人，保留實體授課。 ","courseScoreMethod":"一、術科技能40%(視疫情情況可實體與視訊測驗)\n    (一)期中測驗20%、(二)期末測驗20%\n二、出勤考核60%\n    (一)出缺席狀況30%、(二)繳交作業狀況30%","courseInfo":"1、老師的E-mail: wjlee@mail.shu.edu.tw\n2、請加入上課Line群組: http://line.me/ti/g/DAgM3V0ZG_\n3、老師的Line ID:leolee007","courseURL":"Google Meet Id: oba-yvsg-kue","contactInfo":"1、老師的E-mail: wjlee@mail.shu.edu.tw\n2、請加入上課Line群組: http://line.me/ti/g/DAgM3V0ZG_\n3、老師的Line ID:leolee007","additionalInfo":null,"lv2Method":"分流上課"}}]
