[
  {
    "name": "孫殷同",
    "email": "ytsun@ntut.edu.tw",
    "latestUpdate": "2021-09-22 14:00:42",
    "objective": "Introducing special topics of modern and critical manufacturing technology. Including:1. Simulation and verification platform based on computerized manufacturing systems. 2. gamification-based manufacturing flow control and multi-skilled training. 3. Manufacturing experiments and analytical evaluation.",
    "schedule": "Week(s)___Tentative Topic(s)\n======    =============\n01-05      Introduction and Computer Integrated Manufacturing (CIM)\n06-07      Applications of CIM: reverse engineering (RE) and \n                   augmented reality (AR) multi-tasks training\n08-09      Midterm project delivery\n10-14      Introduction of manufacturing flow control with \n                   gamification: famous production game \n                   for the real-world technology breakthrough\n                   (https://www.youtube.com/watch?v=zZqotxA8_t4&amp;t=15s)\n15-16      Manufacturing experiments and numerical evaluation\n17-18      Final project delivery",
    "scorePolicy": "Participation: 15%\nGroup projects:  70%\nStudy report (in A4 size): 15%\n*** Generally speaking, a prospective student needs a university account and passcode , that are related to your NTUT portal entry, first. He or she then needs to adapt such personal login information by using (your alphanumerical login portion excluding the first letter)@cc.ntut.edu.tw and your corresponding passcode for the above “Microsoft Teams” link. ***",
    "materials": "Instructor's notes",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "We will use the following link for our first class on 9/22 from 14:10 to 14:30, and on 9/29 from 14:10 to 17:00, and so on. Thank you for your cooperation in these regards.\nMidterm and final projects are delivered via convenient online platforms such as i-Study (i - 學園).\nImportant messages will be broadcasted to student members’ email accounts on regular basis to keep you fully updated, including your grade status.\nWe abide by our university online classroom called Microsoft Teams, and its link is as follows.",
      "courseInfo": "emailing to ytsun@mail.ntut.edu.tw; calling 上班日週二、四 9:30~11:30; 14:30~16:30 27712171 #2050; or making an appointment\nOur MS Team ID is: \"299220_Special topics of modern manufacturing technology 現代製造技術特論\"",
      "lv2Method": "遠距上課"
    }
  }
]
