[{"name":"李傑清","email":"lee123@ntut.edu.tw","latestUpdate":"2021-09-05 23:02:56","objective":"本課程將以近期著作權法著名案例的評析，培養學生關鍵的基礎能力，再導入若該著作為人工智慧自行創作或人類以人工智慧為輔具所創作之法律爭議，鼓勵學生從比較法考察及跨域科法整合之觀點，剖析立法、司法或行政所面臨的問題，並探求可能解決問題的具體措施或建議方案。\nThis course will analyze recent well-known copyright cases, expecting that relevant fundamental capability of students can be built.  Further, legal issues will be introduced in dealing with the copyright work created by AI itself, or created by human beings who are aided by AI.  Besides, efforts will be made to encourage students to analyze the problems encountered in legislative, judiciary, and administrative sectors, with considerations on comparative law and with viewpoints from integration of law and technology, and to propose concrete measures and suggestions that may help to solve the problems.","schedule":"本課程之案例式教學，將融入PBL及翻轉教室教學法，重視團隊合作之分組討論，並依多數同學的興趣增修或調整下列主題：\n\n1-2. AI技術發展與智慧財產權\n    何謂AI技術？當前產業應用現況、展望及其與智財權之關連\n3. AI創作物與著作權法-我國法、中國大陸法之觀點\n    AI創作物的類型？如何認定其之創作主體及客體？\n4. AI創作物與著作權法-美國法、英國法等英美法系之觀點　　\n    國際公約及英美法系相關規定及判決之介紹及分析\n5. AI創作物與著作權法-德國法、日本法等大陸法系之觀點　　\n    歐盟或大陸法系相關規定及其決議或判決之介紹及分析\n6. AI創作與著作人格權、署名權\n    師生共同探討AI本身可否為創作者?得否行使禁止醜化權?如何回復損害?\n7. AI創作與重製、改作權　　\n    AI創作與3D列印、媒體侵權、金魚案、應用美術、同人誌等案例\n8. AI創作與公開口述、播送、上映、公開傳輸權　　\n    AI創作與戲謔仿作、電競直播、微電影(短視頻)、youtube傳輸等案例  \n9. AI創作與散布權、輸入權、真品平行輸入　　\n    探討AI創作之色情光碟、遊戲軟體之權利耗盡原則、國際權利耗盡原則等\n10. AI創作與鄰接權、製版權　　\n    探討國際公約及國內外法制對表演人權利之保護，是否適用於AI創作的\n    演奏等?     \n11. AI創作與著作合理使用\n      探討AI創作與嬌蕉包仿作、谷阿莫侵權爭議等案例\n12. 網路服務業者與AI創作之保護　　\n      探討網路服務業者對AI記者有侵權爭議的創作是否應予及如何保護?有無\n      責任避風港條款的適用等?\n13. AI創作與網路著作權保護　　\n     探討學習型AI所需數位資料得否豁權利人之授權? AI自行生成或剪輯合\n     成的語文或視聽創作是否有侵害著作權人之爭議?\n14. AI創作與資料庫保護　　\n     探討編輯著作與資料庫保護、AI結合大數據分析及應用等爭論\n15. AI創作與著作權的侵害、鑑定及救濟\n     探討如何鑑定AI創作之侵權行為、損害賠償；或被侵權時是否可能救濟?\n16-17. 各組或個人擇一研究主題，進行專題報告　　\n     針對各組分工合作；或個人報告及回應問題等情況進行綜合評量\n18. 彙整教學成效及檢討　　\n     師生共同交流學習經驗及心得分享","scorePolicy":"1. 學生課前準備情形、出缺席率及對教師授課時之提問、討論及回應等（20%）。\n2. 各小組依不同主題分工、討論、分析及報告之準備過程及臨場表現（20%）。\n3. 各組準備期末報告之分工合作；或個人完成報告之表現等（40%）。","materials":"1. 張麗卿等著，人工智慧與法律衝擊，元照，2020年4月。\n2. 托比‧沃爾許著、戴至中譯，人工智慧創造的世界，經濟新潮社，2019年11月。\n3. 章忠信，著作權法逐條釋義，五南，2019年9月。\n4. 陳銘祥、吳尚昆、陳昭華、張凱娜，智慧財產權與法律，元照，2019年9月。\n5. 曾勝珍，智財權新研發：財經科技新興議題，五南，2019年5月。\n6. 劉靜怡等著，人工智慧相關法律議題芻議，元照，2018年11月。\n7. John Frank Weaver著、鄭志峰譯，機器人也是人 : 人工智能時代的法律，元照，2018年。\n8. 阿爾帕汀 (Alpaydin, Ethem)著、蕭俊傑、劉一慧譯，機器學習 : 探索人工智慧，2018年。\n9. 蕭雄淋，著作權法實務問題研析（二），五南，2018年6月。\n10. 曾勝珍，智慧財產權法專論：智財法與財經科技的交錯，五南，2018年5月。\n11. 王怡蘋，著作權法與商標法論文集，元照，2018年2月。\n12. 國內、外著作權相關法制或判決的比較、分析。","foreignLanguageTextbooks":false,"covid19":{"lv2Description":"因修課人數10人以內，若疫情未較嚴峻，將多以實體方式授課，以利交流討論。另於必要時提供線上連結，滿足特殊情況同學的需求。 ","courseScoreMethod":"若疫情轉為三級，將採線上報告及交流討論。","courseInfo":"前幾次上課多採實體授課，因應疫情，將再機動調整。","courseURL":"meet.google.com/smk-dwsg-rmv","contactInfo":"分機：3046\nE-MAIL:lee123@mail.ntut.edu.tw","additionalInfo":null,"lv2Method":"分流上課"}}]
