[{"name":"郭政淳","email":"kuojona@gmail.com","latestUpdate":"2021-09-01 09:15:13","objective":"本課程提供學生及職前專業人士必備之英語文語言技巧，強調電資專業領域之英文溝通能力之訓練。課程內容依學院專業內容區分並整合英語文之聽說讀寫之能力為未來全球化移動及以英語專業溝通人才培育為目標。\nThis course aims to provide pre-service Electrical Engineering and Computer Science students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.","schedule":"Week 1 Holiday-No Class\nWeek 2 Course Introduction / Specialized Vocabulary \nWeek 3 Learning Specialized Vocabulary: Lists and Tools \nWeek 4 Holiday-No Class \nWeek 5 Vocabulary Learning and Assessment: Teacher's Demo\nWeek 6 Computer Science (I)\nWeek 7 Computer Science (II)\nWeek 8 Information Technology (I)\nWeek 9 Midterm Exam\nWeek 10 Information Technology (II)\nWeek 11 Electrical Engineering (I)\nWeek 12 Electrical Engineering (II)\nWeek 13 Informative Speech (I): The Physical Message\nWeek 14 Informative Speech (II): The Visual Message\nWeek 15 Informative Speech (III): The Story Message\nWeek 16 Student Presentation\nWeek 17 Presentation Review\nWeek 18 Final Exam","scorePolicy":"Attendance 　　      15%\nIn-class Activity    15%\nHomework 　　      15%\nPresentation          15%\nExams　　              40%","materials":"Electrical Engineering for College of Electrical Engineering and Computer Science. Book 1&amp;2.北科之英ESP Series.\n\nOther Materials (to be announced)","foreignLanguageTextbooks":true,"covid19":{"lv2Description":null,"courseScoreMethod":"期中考採學校英文期中會考之成績  \n若學校因疫情決定停辦期中會考  將在北科i學園平台舉辦本班自己的期中考\n考試範圍為課程內容","courseInfo":"本課程對於疫情的因應措施為遠距教學\n所有學生可透過北科i學園的課程網頁得到相關訊息\n還未在名單內  但有興趣加選的同學  \n務必在第二周加入課程  (第一周為假日)\n然後評估自己是否要加選\n(註: 顧及英語教學品質  本課程有人數上限  \n授課老師有權利決定是否讓同學加選此課程)","courseURL":"https://meet.google.com/faa-hbxy-bvg\n\n(請注意本連結只有在學校公布遠距授課才生效)","contactInfo":"老師辦公室: 共同科館206室  \n分機 3939","additionalInfo":null,"lv2Method":"遠距上課"}}]
