[
  {
    "name": "李鳳然",
    "email": "minehdj@gmail.com",
    "latestUpdate": "2021-12-10 11:52:04",
    "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "第 1 週：課程進度與內容介紹、彼拉提斯的簡介與呼吸練習\n\n第 2 週：彼拉提斯墊上動作與動作串聯組合 1\n\n第 3 週：彼拉提斯墊上動作與動作串聯組合 2\n\n第 4 週：彼拉提斯墊上動作與動作串聯組合 3\n\n第 5 週：彼拉提斯墊上動作與動作串聯組合 4\n\n第 6 週：彼拉提斯墊上動作與動作串聯組合 5\n\n第 7 週：彼拉提斯墊上動作與動作串聯組合 6\n\n第 8 週：彼拉提斯墊上動作與動作串聯組合 7\n\n第 9 週：彼拉提斯墊上動作與動作串聯組合 8\n\n第 10 週：彼拉提斯墊上動作與動作串聯組合 9\n\n第 11 週：彼拉提斯墊上動作與動作串聯組合 10\n\n第 12 週：彼拉提斯墊上動作與動作串聯組合 11\n\n第 13 週：彼拉提斯墊上動作與動作串聯組合 12\n\n第 14 週：彼拉提斯 × 芭蕾\n\n第 15 週：＊元旦補假＊\n\n第 16 週：期末評量\n\n第 17 週：期末評量\n\n第 18 週：補考週",
    "scorePolicy": "※評量方式\n1. 出席 (40%)：課堂出席率。\n    (1) 全勤與準時者，學期總成績加 2 分。\n    (2) 遲到單次扣 2%、請假單次扣 3%、曠課單次扣 10%。\n    (3) 請假請於下一堂上課時提出證明。\n    (4) 遲到 30 分鐘以上或課程中未告知原因而消失 20 分鐘以上者，依曠課乙次計       算。\n    (5) 曠課４次則本課程以不及格計算。\n2. 課程參與 (15%)：課程參與程度、動作操作、服裝儀容。\n3. 課程紀錄 (15%)：上課動作筆記與身體感受。\n4. 期末評量 (30%)：按照抽籤內容執行動作，於期末檢測當天口頭說明與動作示範。\n\n※課程注意事項\n1. 本課程最高原則：安全第一！上課當日有任何身體不適的問題，請務必馬上告知教師。\n2. 請穿著適合運動的服裝，如 T-Shirt、運動長褲，切勿穿著牛仔褲或時裝，並自備水。\n3. 請準時至上課地點上課，若無法前來上課，請事先告知，除緊急情況或突發   \n    事件例外，並依規定完成請假手續。\n4. 未經老師許可切勿使用行動電話。進教室，請關靜音。\n5. 請勿穿鞋進入韻律教室，於教室鐵櫃擺放整齊。\n6. 課堂中請勿出現任何故意危及他人或自身安全之行為。\n7. 每一堂課皆會點名，每位學生出席狀況將會詳實紀錄。\n8. 若對於課程有任何的疑問，請當下向教師提問或以 E-mail 陳述。",
    "materials": "王怡璇 (譯) (2018)。彼拉提斯解剖書。臺北市：木馬。(Abby Ellsworth, 2018)\n張靜芬 (譯)(2006)。彼拉提斯入門學習百科。臺北市：城邦。(Alycea Ungaro, 2006) \n邱俊傑 (2017)。彼拉提斯與核心復健運動。臺北市：原水。\n謝菁珊 (2004)。PILATES 彼拉提斯塑身新風格。台北市：城邦讀書花園。",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": "9/24 遠距教學 —0924 (五) 14:10-16:00，加入 Google Meet，視訊通話連結：https://meet.google.com/vde-adeb-ezi\n\n教師到校授課，學生人數或超過 20 人，採實體與遠距兩組分流上課。\n【實體上課】原時間到原教室上課\n【遠距上課】提供線上教材，請學生按線上教材規定事項完成該週課程內容，並於指定時間內繳回該週線上作業。 ",
      "courseScoreMethod": "1. 出缺席情形與學習態度\n2. 線上作業繳交：按照各週線上作業內容實際操作並錄影，且於規定時間內上傳。\n3. 期中作業：自選 3 種動作，錄製影片，影片內容須包含動作名稱、動作實際操作、呼吸配合、動作注意事項。\n4. 期末作業：按照抽籤內容，自行編排與串連動作，並拍攝動作影片且於規定時間上傳。",
      "courseInfo": "開學第一週：9/24 為遠距同步教學 — 於上課時段（14:10-16:00），加入 Google Meet，視訊通話連結：https://meet.google.com/vde-adeb-ezi",
      "lv2Method": "分流上課"
    }
  }
]
