[
  {
    "name": "陳昭伶",
    "email": "zipsarah@mail.ntut.edu.tw",
    "latestUpdate": "2021-09-21 16:27:14",
    "objective": "This course aims to provide pre-service management students/professionals with the adequate skills of the English language and communicative competence to facilitate their current academic and future career pursuits. Students are encouraged to utilize their domain expertise to participate in professional communication in English. Centered on the training of professional use of the English language, the ESP curriculum as the crux of a highly-integrated work of domain knowledge and the English learning development embodies the indispensable credentials required for a global profession.",
    "schedule": "The detailed schedule will be distributed on the first day of class.",
    "scorePolicy": "1.School-wide English Proficiency Test: 20% \n2.Attendance 20% (7% reduction per absence; Five unexcused absences from class will result in automatic failure of the course)\n\nPlease provide a valid proof of illness (medical certificate or record of hospitalization) within 10 days of the date of absence.\n\n3.In-Class Performance &amp; Assignments 40% \n4.Presentation (Peer Evaluation) 20 %",
    "materials": "TBA",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "Mock TOEIC Speaking Tests at the beginning and end of the semester/assignments/group presentation will be conducted online.",
      "courseInfo": "Please refer to Zuvio for all the important information.\nhttps://irs.zuvio.com.tw/ \nPlease download 「Zuvio 校園」app in the App Store or Google Play and log into your account. You can join my class (進階專業英文) on zuvio by typing course code 80194022\n\nhttps://www.microsoft.com/zh-tw/microsoft-teams/group-chat-software\nGo to Microsoft Teams by signing in your student ID number@cc.ntut.edu.tw and your password on Taipei Tech Portal.",
      "courseURL": "9/22第一周上課 Teams 會議連結\n https://teams.microsoft.com/l/meetup-join/19%3Ab7Nf6h-T7OY1cg9_ZqxQc7jQDqROEsINftZpKFXUpbc1%40thread.tacv2/1632156848754?context=%7B%22Tid%22%3A%22dfb5e216-2b8a-4b32-b1cb-e786a1095218%22%2C%22Oid%22%3A%221cab4483-2fa3-418f-a728-083006f6040f%22%2C%22MessageId%22%3A%221632156848754%22%7D",
      "contactInfo": "zipsarah@mail.ntut.edu.tw\nExt: 1148",
      "additionalInfo": "9/24!! 110-1 辦理抵大一共同英文/大二多元英文課程 English Course Waiver\nhttps://eng.ntut.edu.tw/p/406-1091-111818,r551.php?Lang=zh-tw",
      "lv2Method": "遠距上課"
    }
  }
]
