[{"name":"蔡逸萍","email":"ctsai@ntut.edu.tw","latestUpdate":"2021-09-11 15:20:30","objective":"本課程旨在帶領學生讀、理解並分析國際時事,提高學生之英文能力，透過對多元主體之解析，讓學生了解單字用法，句型結構，特殊術語和慣用俚語等，提升閱讀能力，另外配合聽力技巧學習，提升理解能力。本課程著重英文閱讀，聽力與口說能力，鼓勵學生以英文討論國際時事，發表見解，拓展對世界的認識。\nThis course intends to enhance students’ reading, speaking and listening abilities by using quality newspapers, journals, interviews and podcast. It will help students enrich their vocabulary and acquire key English expressions and sentence patterns used in different realms like politics, arts, entertainment, science &amp; technology, sports, business and health. Students learn to read, discuss and debate global issues through diverse forms of activities. This course familiarizes students with world affairs and broadens their perspective of the world.","schedule":"(Zuvio: 79954534)\n\nPLEASE NOTE THAT THIS SYLLABUS IS SUBJECT TO CHANGE DUE TO EVOLVING CORONAVIRUS CONCERNS.\n\nWEEK　　SESSION THEME\n1　　Introduction\n2　　Journalistic English: Print, broadcast and online media \n3     　　World affairs in a nutshell\n4     　　Public health crisis I\n5     　　Public health crisis II\n6　　Politics from afar II\n7    　　Politics from afar II\n8    　　In-class Midterm \n9    　　Campus-wide English Proficiency Test \n10    Tech industry and economy I\n11    Tech industry and economy II\n12   　　Society and culture I\n13   　　Society and culture II\n14   　　What’s trending\n15   　　Group presentation I\n16   　　Group presentation II\n17   　　Group presentation III/Discussion sessions\n18   　　In-class Final","scorePolicy":"(THE FOLLOWING POLICY IS SUBJECT TO CHANGES)\n\nCampus-wide English Proficiency Test 20%\nIn-class midterm 20%\nAttendance, assignments and class participation 15%\nOral presentation 25%\nIn-class final 20%","materials":"See class handouts","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"If face-to-face teaching is moved to an online environment, all session themes on the syllabus will proceed online, including presentations and exams.","courseInfo":"* 請於9月20日上本網站，確認本課程是否線上上課。\n\nPLEASE LOG ONTO THIS WEBSITE ON SEPTEMBER 20 2021 (MONDAY) TO CONFIRM WHETHER OR NOT THIS CLASS GOES ONLINE. IF IT DOES, CLICK THE FOLLOWING LINK TO ENTER THE PRESCRIBED GOOGLE MEET CLASSROOM ON WED..","courseURL":"English for World Affairs\n\n9月 22日 (星期三) · 上午10:10 - 下午12:00\n如何加入 Google Meet 會議\n視訊通話連結：https://meet.google.com/wxq-ofqb-ykq","contactInfo":"email: ctsai@ntut.edu.tw","additionalInfo":null,"lv2Method":"遠距上課"}}]
