[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2021-09-06 16:35:28","objective":"本課程著重教導學生閱讀文章，並藉由文章訓練學生字彙建構、語言解析及聽力會話、思維啟發能力。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。","schedule":"(Estimated)\n\nWeek 1: Intro, Read “Why Clay Shirky Banned Laptops, Tablets and Phones from His Classroom”\n\nDo Related vocabulary homework.\n\n(As always, if a reading or assignment is listed here, is must be completed before you come to class. The units from American Headway, listed below, are advisory. I will assign additional American Headway homework in class; please take good notes and contact a friend for the assignment if you are absent. ) \n\nUnit One—American Headway: What makes us Human? \n\nWeek 2: Unit One—American Headway (cont.) \n\nWeek 3: Unit 2—American Headway: In So Many Words\nArticles in your discipline projects/show and tell\n\nWeek 4 +5: My Fair Lady\n\nWeek 6: Unit 3--Enough is Enough\n\nWeek 7: Unit 3\n\nWeek 8: Review/Oral exam\n\nWeek 9: Midterms\n\nWeek 10: Unit 4, Not all it Seems: Show and Tell projects\n\nWeek 11: Unit 4\n\nWeek  12–13, Unit 5, Culture Clashes\n\nWeek 14–15: Fruits of War\n\nWeek 16–17: Review\n\nWeek 18: Exam","scorePolicy":"Homework: 25%\nQuizzes/Tests: 25%\nParticipation, Skits, and Presentations: 20%\nMidterm: 20%\nIn-class final: 10%\n\nThese percentages may be modified at my discretion. \n\nPlease note that cell phones may not be used in my classes. You may read why not on my course website, on the page \"Why I have a Screen-Free Policy in Class\": https://britamericanlit.wordpress.com/screen-free/.","materials":"American Headway 5\nOnline readings and other materials. (Please print these, read them in hard copy, and bring them to class.)","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Class will be conducted via MS Teams, and quizzes will be taken via MS Teams. Homework will also be turned in via MS Teams chat. Students may have video or online projects. There is the possibility that midterm or final tests may be conducted in person, but that will depend on school policy. Students may occasionally have online individual or group chats with the professor via Teams.</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Classes are held via MS Teams during regular class time. If you are thinking about enrolling and need to take a sample class, please contact me so that I can add your ID number. Only students with valid Taipei Tech ID numbers may take the class. Until the MS Teams site is up and running, you may also look for announcements on the course web page: https://britamericanlit.wordpress.com/general-english/</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Class will be held via MS Teams. The class website is as follows: https://britamericanlit.wordpress.com/general-english/</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">I am most likely to be available for either online or in-person meetings during my office hours (Mondays from 3:10–5:00 and Friday from 10:10–12:00). Please make an appointment with 24-hours advance notice if possible.</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">I will keep you posted on how to obtain the books.</div>\n\n  "}]
