[{"name":"李禮仲","email":"Lawrencelee61@hotmail.com","latestUpdate":"2021-09-08 01:08:36","objective":"本課程主要在介紹中華民國憲法、探討憲政體制的運作、人民權利義務的規範及相關法律的適用等問題。期能使學生認知國家民主法治的實施狀況，維護社會秩序與個人基本權利，進而體現人性尊嚴的價值。\nThis course focuses the discussions on the Constitution of the Republic of China,constitutional mechanism, the rights and obligations for the people and legitimate operations of the society. It is our hope that the students may have a better understanding on how the democracy is performed in our country as well as on how to preserve social security and basic human rights of the individuals-with the realization of human dignity as our extreme goal.","schedule":"Week Teaching Unit\n 1. Course Introduction \n2. The basic concepts of the Constitution ( on ) \n3. The basic concept of the Constitution ( under )\n 4. basic human rights Subjects \n5. basic human rights Subjects ( lower )\n 6. Equal rights \n7. Freedom fundamental rights \n8. the basic social rights ( on ) \n9. integrated activities \n10. basic social rights ( under ) \n11. ensure that the basic rights of human rights \n12. the new Human rights ( non-listed basic rights connotation ) \n13. the human rights issue and argued ( pending Issues )\n 14. Human Rights Movement (Part 1) \n15.  Human Rights Movement (Part 2) \n16. The reality and dilemma of human rights \n17. Group report \n18. Activity: Human rights incident book","scorePolicy":"Operation 40% Group work (group report, visit documentary) 20% Designated work \n                        (domestic human rights headlines, international human rights articles) 20%\nAttend 20%      Enthusiasm for learning (attendance rate, participation in discussions, etc.)\nReport 40%    Group report","materials":"1. Assigned reading: (1) handout (please courses to the department website page download ppt outline). (2) Modern human rights declarations, conventions, covenants and agreements (according to the subject needs, download them from the Internet for reference). For example: Universal Declaration of Human Rights (1948) , United Nations \"Declaration of the Rights of Children\" (1959) , Convention on the Rights of the Child (1989) , United Nations \"Declaration on the Elimination of Violence against Women\" (1993) , Covenant on Civil and Political Rights (1976) , \"Economy , Social and Cultural Rights Covenant (1976), etc. (3) The Constitution of the Republic of China and its amendments. (4) Xu Qingxiong ( Min 96) , Introduction to the Constitution. Yuanzhao Publishing Company. 2. Recommended reading  waiting for announcement.","foreignLanguageTextbooks":true,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">If students are unable to attend classes and exams at the school due to the pandemic alert, students will use individual or group online reports instead</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">All teaching is recorded and played in class or synchronized with Google Meet video.</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">Google Meet</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">Any inquiries about course issues, I can be reached via  lawrencelee61@hotmail.com or by mobile phone 0922-001-883</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
