[{"name":"鄭以旋","email":"gyscheng@gmail.com","latestUpdate":"2021-09-03 15:11:51","objective":"本課程將介紹經濟學領域的英語用語，以及經濟學的基本概念與應用，使學生有能力理解與分析社會上的重要議題，包括自由市場的優勢、稅賦與市場機制，以及國際貿易競爭等。課堂討論的議題包括供需機制、市場、稅賦、國際貿易、收入等。另外也將討論分析個案與新聞報導，讓學生學習不同觀點，獲得靈感，並且能使用英語來討論與呈現相關社會議題。\nThis course will be devoted to introducing the use of English in the field of economics, as well as discussing fundamental ideas and their applications and policy, so that students will be capable of considering important issues facing the society: the advantages of a free society, taxation and its interference with the market mechanism, and competition in international trade. Some of the important topics to be covered include Supply and Demand, Markets, Taxation, International Trade, and Income. The analysis of case studies and news excerpts will not only allow them to gain new perspectives and greater insights concerning issues; hopefully, they will also acquire the ability to use English in the discussion and presentation of relevant current issues.","schedule":"Outline:\nWeek　　Date　　Content\n1　　Sep 22　　Introduction\n2　　Sep 29　　Class\n3　　Oct 6　　Class\n4　　Oct 13　　Writing workshop I \n5　　Oct 20　　Class\n6　　Oct 27　　Group presentations \n7　　Nov 3　　Group presentations \n8　　Nov 10　　Class\n9　　Nov 17　　Mid-term week (no class)\n10　　Nov 24　　Class\n11　　Dec 1　　Class\n12　　Dec 8　　Class\n13　　Dec 15　　Writing workshop II and writing test \n14　　Dec 22　　Class\n15　　Dec 29　　Class\n16　　Jan 5　　Class\n17　　Jan 12　　Class\n18　　Jan 19　　Final exam","scorePolicy":"Attendance policy:\nEight or more absences from Week 2 onwards will result in a grade of 0% for the course.   \n\nAssessment:\nGroup presentation (speaking)　　　　20%\nSchool Mid-term　　　　　　　　20%\nWriting test*　　　　　　　　　　10%　　　　\nFinal exam* (reading and listening)　　　　40%\nAttendance and participation　　　　10%　　　　\n\n* At the lecturer’s sole discretion, a make-up Writing Test or Final Exam may be granted upon presentation of a valid proof of illness (medical certificate or record of hospitalization) within 10 days of the date of absence.","materials":"Textbook: NCKU ESP Program English for Economics\n\nReadings (subject to change):\n\n•　　Nick Srnicek, “Chapter 2: Platform Capitalism,” Platform Capitalism, 2016.\n•　　Thomas Piketty, “Introduction,” Capital in the Twenty-first Century, 2013.\n•　　Steven D. Levitt and Stephen J. Dubner, “Chapter 5: What Makes a Perfect Parent,” Freakonomics, 2005.\n•　　Abhijit Banerjee and Esther Duflo, “Chapter 1: MEGA Make Economics Great Again,” Good Economics for Hard Times, 2019.","foreignLanguageTextbooks":true}]
