[{"name":"黃偉雄","email":"weihsiunghuang@gmail.com","latestUpdate":"2021-09-06 17:34:10","objective":"本課程主要在使學生明瞭中國及西洋人生哲學的歷史發展，並介紹人生哲學的內在涵義，分別探究人的意義、特性、人性論、真善美聖等問題；兼及人生哲學的當代意義：包括各種人生觀、生命的尊嚴、愛與婚姻及修養等探究。使知、情、意能融為一體，藉以確立個人理性的生命追尋目標。\nThe purpose of the course is to enable students to realize historical development in Chinese and Western philosophy of life by introducing the inner connotation of philosophy of life and studying the issues on the meaning and characteristics of life, humanism, virtue, good and beauty, etc..  Furthermore, this course introduces the meanings of philosophy of life in relation to the contemporary life, such as various kinds of philosophy of life, dignity of life, love and marriage, moral cultivation. It aims to integrate knowledge, passion and intention, for setting up the goal that personal rational life should pursue.","schedule":"第1週：哲學是什麼？；第2週：思想方法；第3週：人性的真相；第4週：神話與悲劇；第5週： 蘇格拉底；第6週：西方倫理學；第7週：存在主義的形成；第8週：存在主義的發展；第9週：期中考；第10週：中國哲學的起源；第11週：儒家的風格；第12週：道家的智慧；第13週： 藝術與審美；第14週： 宗教與永恆；第15週： 教育與自我；第16週：文化的視野；第17週： 拓展生命；第18週：期末考。","scorePolicy":"期中考（非採開書open book考試）：30%，期末考（非採開書open book考試）：40%，平時考察（含期中報告15%、出席率15%）：30%。","materials":"教材：傅佩榮著，《哲學與人生》，天下文化公司，2018年。參考書1：Michael J. Sandel著，樂為良譯，《正義：一場思辨之旅》，雅言文化公司，2009年。","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">授課順序：依課綱，講授內容：以講座方式為主，搭配簡報及教科書。教授方式：以「教學全都錄」系統錄影上課內容，請同學線上自主學習。評量方式及配分比例：期中考（３０％）採開書（open book）考試作答，網路寄回答案卷（自製，以PDF格式存檔）評分；期末考（４０％）採開書（open book）考試作答，網路寄回答案卷（自製，以PDF格式存檔）評分；期中報告（３０％），網路寄回報告（自製，以PDF格式存檔）評分。期中、期末考試題目及報告題目，均將在上課宣佈，詳見上課錄影內容。學期中返校上課，則回歸平常上課評量方式。</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">授課順序：依課綱，講授內容：以講座方式為主，搭配簡報及教科書。教授方式：以「教學全都錄」系統錄影上課內容，請同學線上自主學習。 遠距教學期間在家線上自主學習，視同出席，每次得到總成績1分。期中、期末考試題目及報告題目，均將在上課宣佈，詳見上課錄影內容。返校實體上課，則回歸平常上課評量方式。</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">本校教學全多錄網址：https://istudy.ntut.edu.tw/learn/index.php</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">連絡信箱：weihsiunghuang@gmail.com</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">選課同學一律加入Line課程討論群組</div>\n\n  "}]
