[
  {
    "name": "黃偉雄",
    "email": "weihsiunghuang@gmail.com",
    "latestUpdate": "2021-10-22 10:58:19",
    "objective": "本課程主要在使學生明瞭中國及西洋人生哲學的歷史發展，並介紹人生哲學的內在涵義，分別探究人的意義、特性、人性論、真善美聖等問題；兼及人生哲學的當代意義：包括各種人生觀、生命的尊嚴、愛與婚姻及修養等探究。使知、情、意能融為一體，藉以確立個人理性的生命追尋目標。\nThe purpose of the course is to enable students to realize historical development in Chinese and Western philosophy of life by introducing the inner connotation of philosophy of life and studying the issues on the meaning and characteristics of life, humanism, virtue, good and beauty, etc..  Furthermore, this course introduces the meanings of philosophy of life in relation to the contemporary life, such as various kinds of philosophy of life, dignity of life, love and marriage, moral cultivation. It aims to integrate knowledge, passion and intention, for setting up the goal that personal rational life should pursue.",
    "schedule": "第 1 週：哲學是什麼？；第 2 週：思想方法；第 3 週：人性的真相；第 4 週：神話與悲劇；第 5 週： 蘇格拉底；第 6 週：西方倫理學；第 7 週：存在主義的形成；第 8 週：存在主義的發展；第 9 週：期中考；第 10 週：荒繆之超 越；第 11 週：中國哲學的起源；第 12 週：儒家的風格；第 13 週：道家的智慧 ；第 14 週：藝術與審美 ；第 15 週：宗教與永恆 ；第 16 週：教育與自我；第 17 週：文化的視野 ；第 18 週：期末考。",
    "scorePolicy": "期中考（非採開書 open book 考試）：30%，期末考（非採開書 open book 考試）：40%，平時考察（含期中報告 15%、出席率 15%）：30%。",
    "materials": "教材：傅佩榮著，《哲學與人生》，天下文化公司，2018 年。參考書 1：Michael J. Sandel 著，樂為良譯，《正義：一場思辨之旅》，雅言文化公司，2009 年。",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "授課順序：依課綱，講授內容：以講座方式為主，搭配簡報及教科書。教授方式：以「教學全都錄」系統錄影上課內容，請同學線上自主學習。評量方式及配分比例：期中考（３０％）採開書（open book）考試作答，網路寄回答案卷（自製，以 PDF 格式存檔）評分；期末考（４０％）採開書（open book）考試作答，網路寄回答案卷（自製，以 PDF 格式存檔）評分；期中報告（３０％），網路寄回報告（自製，以 PDF 格式存檔）評分。期中、期末考試題目及報告題目，均將在上課宣佈，詳見上課錄影內容。學期中返校上課，則回歸平常上課評量方式。",
      "courseInfo": "授課順序：依課綱，講授內容：以講座方式為主，搭配簡報及教科書。教授方式：以「教學全都錄」系統錄影上課內容，請同學線上自主學習。 遠距教學期間在家線上自主學習，視同出席，每次得到總成績 1 分。期中、期末考試題目及報告題目，均將在上課宣佈，詳見上課錄影內容。返校實體上課，則回歸平常上課評量方式。",
      "courseURL": "本校教學全多錄網址：https://istudy.ntut.edu.tw/learn/index.php",
      "contactInfo": "連絡信箱：weihsiunghuang@gmail.com",
      "additionalInfo": "選課同學一律加入 Line 課程討論群組，邀請網址：https://line.me/R/ti/g/DkMWIsrdEL，以便進入課程討論群組。",
      "lv2Method": "遠距上課"
    }
  }
]
