[{"name":"何鳳嬌","email":"fengchiao@ntut.edu.tw","latestUpdate":"2021-09-06 16:40:47","objective":"近百年是台灣政治、社會、經濟、文化劇烈變動的時代。從清季西洋勢力的大舉進入，清廷推動自強新政以應變；爾後台灣淪入殖民統治，在近代化及同化政策下台灣的變革更為迅速；而從台灣光復迄今，不論是經濟發展、政治民主、教育普及等等，使台灣進入已開發國家之林。這些變革與發展，是台灣民眾集體努力的總成績，但其間也有許多引領風騷的人物，他們分佈於各個不同的領域，歷史家對他們的評價或正或負，成就與貢獻的多寡也有爭議，不過透過這些人物事蹟的探討，可了解個人與群體、時代、環境的互動關係，也更能掌握近百年台灣史發展的脈絡。\nNever has Taiwan experienced so big changes in politics, social structures, economics and cultural movements as in the last century. In Ching Dynasty, the Westernized power entered and the Ching court initiated innovative campaigns to work against; then Taiwan under the colonial rule by Japan, modernization  and colonialism changes Taiwan a lot ; in past half century KMT's rule has advanced such great deal in the fields of economic development, democracy and education as to stand among the developed countries. Though it is the collective efforts of the Taiwanese people that contribute to the alteration and development, there exist some of the outstanding figures in various fields, who might receive positive as well as negative comments from the historians and who might initiate a controversy concerning their contribution. This course explores the most influential individuals and the events that happen around, in the hope to understand the interaction between each of them and the groups","schedule":"進度表\n一　　    第一週（9月20日）放假\n二　　  課程介紹  第二週（9月27日）\n三　　  劉銘傳與台灣建省  第三週（10月4日）\n四　　     第四週（10月11日）放假\n五　　  唐景崧與台灣民主國的成立第五週（10月18日）\n六      伊能嘉矩與台灣歷史研究的建立 第六週（10月25日）\n七    後藤新平與台灣統治基礎的奠定  第七週（11月1日）\n八    新渡戶稻造與台灣新式糖業的發展   第八週（11月8日）\n       期中考　　第九週（11月15日）\n九　　璣永吉與台灣米作的改良  第十週（11月22日）\n十　　蔣渭水與臺灣文化協會  第十一週（11月29日）\n十一　　林獻堂與臺灣議會請願運動（上）  第十二週（12月6日）\n十二　　林獻堂與臺灣議會請願運動（下）  第十三週（12月13日）\n十三　　簡吉與臺灣農民運動的發展  第十四週（12月20日）\n十四　　謝雪紅與臺灣共產黨的成立（上）  第十五週（12月27日）\n十四　　謝雪紅與臺灣共產黨的成立（下）  第十六週（1月3日）\n十五　　陳儀與臺灣接收  第十七週（1月10日）　　\n期末考　　第十八週（1月17日）","scorePolicy":"評量標準\n一、考試\n1.期中報告40％，期末考40％（按學校行事曆，不另通知）\n2.平時考10％（不定期舉行）\n二、讀書心得報告40％（撰寫三千字以上、繳交紙本），11月8日（含）前交。\n三、平時成績10％（上課表現、出席率）","materials":"參考書目\n張炎憲主編，《20世紀臺灣歷史與人物》。臺北縣，國史館，2002。\n張炎憲等編，《臺灣近代人物誌1-5》。臺北，自立晚報出版社。\n黃昭堂(著)，黃英哲(中譯)，《臺灣總督府》。臺北：前衛出版社，1994。\n黃富三，《林獻堂傳》。南投：國史館臺灣文獻館，2004。\n吳密察，《臺灣近代史研究》。臺北：稻鄉出版社，1990。\n黃昭堂(著)，黃英哲(中譯)，《臺灣總督府》。臺北：前衛出版社，1994。\n矢內原忠雄(著)，周憲文(中譯)，《日本帝國主義下的臺灣》。臺北：帕米爾出版社，1997。\n涂照彥(著)，李明峻(中譯)，《日本帝國主義下的臺灣》。臺北：人間出版社，1992。\n若林正丈，《臺灣抗日運動史研究》。東京：研文出社，1983。\n近藤正己，《總力戰與臺灣：日本植民地崩壞的研究》。臺北：刁江書院，1996。\n林繼文，《日治末期臺灣戰爭動員體係之研究》。臺北：稻鄉出版社，1996。","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">11/15(一)繳交期中報告(40%)1/17(一)期末考(40%)</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">1.加退選課期間尚未選課成功之同學，請上i學園。\n2.第三週選課結束後，課程變動資訊將更新於i學園。</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">hppts://meet.google.com/people-299536</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">請寄電郵或逕洽教師代理人</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\">班級line群組</div>\n\n  "}]
