[{"name":"鄭麗玲","email":"liling@ntut.edu.tw","latestUpdate":"2021-08-05 12:48:12","objective":"經常在餐桌上作為調味的胡椒、灑在咖啡上的肉桂，你知道它們在台灣的歷史嗎？19世紀英國商人為了走私台灣的樟腦不惜炮打台南安平港，轟毀熱蘭遮城遺跡，難道只因為衣櫥急需樟腦丸？想知道台灣茶葉的歷史、番蕃薯的歷史嗎？這些一般史書中不會記載，或者簡單提到的東西，如果作為主角，可以看到怎樣的歷史面貌呢？本課程我們將這些統統看作物質史，以不同東西與台灣的關連，串連為台灣物質史。當然，除了課堂所提到的主題之外，你還可以想到更多隨著時代演進，新的「物質」在台灣發展的歷史。\nHave you ever wondered when and how the spicy black pepper served on dining table and the aromatic cinnamon added to coffee were imported into Taiwan?  And have you ever suspected the real motive of the British merchants who attacked the historic sites like Zeelandia and Anping Fort in Tainan in the 19th century only for the desperate needs of camphor? What about tea and sweet potatoes? These trivial and ordinary materials in daily life have never played the main roles in the documents of history; they, however, would take us into a totally different page if endowed with a broad scale of importance? This course is therefore aimed at the intertwining connection of such kinds of materials with the development of history in Taiwan.","schedule":"週次　　課程主題　　　　   　　　　講義進度\n一、 中秋節放假　　　　　　　　\n二、課程說明\n三、南島語族的遷徙　　　　《槍砲、病菌與鋼鐵—人類社會的命運》　　　　　　　　　　　　　　 \n                                                〈老鼠麵包樹與豬 南島語族的遷徙〉\n四、 南島語族的遷徙 \n五、台灣(原生)植物與諺語　　《福爾摩沙植物記》\n六、多種角度看檳榔　　　　《福爾摩沙植物記》　　\n七、稻與薯　　　　　　　　《福爾摩沙植物記》\n八、甘蔗　　故事，「跨越時代的甜味—『糖』甜蜜成癮專題介紹」\nhttps://storystudio.tw/article/gushi/february-featurett-intro/　　　　\n九、期中考週\n十、樟樹與樟腦\n十一、茶(維多利亞時代的茶，福鈞的故事)《植物獵人的茶盜之旅》p239-259\n十二、鴉片　　　　　　　　《台灣統治與鴉片問題》\n十三、台灣植物大命名時代　　《早田文藏—台灣植物大命名時代》\n十四、高山的植物—以台灣為名\n十五、課堂報告（一）〈萬頃花田萬斛珠-日治時期臺北地區香花產業史初探〉\n十六、課堂報告（二）波蘿麵包沒有菠蘿/ 陳玉箴〈漢餅、台灣子、麵包〉\n十七、咖啡或茶—喫茶店\n十八、期末考週","scorePolicy":"期中評量30%\n課堂報告及作業70%，包括以下項目：\n每人5分鐘指定題目之課堂報告（口頭報告後，第十七週繳交個人書面報告）\n課後作業約4篇\n\n**使用自編講義**","materials":"參考書目\n吉爾斯．米爾頓《荳蔻的故事—香料如何改變世界歷史？》，台北：究竟，2001\n吳永華《早田文藏—台灣植物大命名時代》，台北：前衛，2008\n莎拉．羅斯《植物獵人的茶盜之旅》，台北：麥田，2014\n潘富俊《福爾摩沙植物記》，台北：遠流，2007\n劉明修著．李明峻譯《台灣統治與鴉片問題》\n賈德．戴蒙《槍砲、病菌與鋼鐵—人類社會的命運》台北：時報，1998\n蓋瑞．保羅．納卜漢《香料漂流記》\n參考網站\nhttps://storystudio.tw/article/gushi/february-featurett-intro/","foreignLanguageTextbooks":false}]
