[
  {
    "name": "陳春山",
    "email": "louischen@ntut.edu.tw",
    "latestUpdate": "2021-09-17 21:01:53",
    "objective": "著重培養學生的下列能力：&nbsp;\n(1)建立以「發揮生命熱情、造福社會、利人利己」為人生核心價值、生命信念&nbsp;。\n(2) 探索人生具體目標，規畫人生。\n(3) 培育創業精神、組織領導能力。\n\n新創事業面臨許多的挑戰，包括：避與大企業競爭，找到存活的依據、從無到創立強勢品牌、創立或擴張自有市場/消費者據點等。本課程旨在啟發修課同學創業的興趣並協助修課同學思考新創事業如何平衡有限資源以迎向挑戰。\n新創企業已發展成熟的企業是不一樣，主要是因為新創事業的資源有限，創業家必須同時兼顧許多面向並回應顧客所需。本課程旨在協助修課同學思考創建企業應注意的各種面向評估自己的創能力。\n課程包含了三大部份，第一部份為創新與創業概念啟發；第二部份在辨別市場機會與發展市場；最後第三部份為新創事業行銷管理。行銷活動能夠將企業的產品及服務傳遞給顧客；並將產品、服務及企業本身的資訊帶到市場上；將顧客資訊回饋給企業。創業行銷管理能夠幫助創業者向潛在投資者及企業夥伴銷售創意以獲得資源，也讓創業家透過創新的商業手法來充分利用稀少的資源。\nManagers must have excellent leadership skills in order to A start-up company has lots of challenges, such as: niche market located and brand diffusion. The course intends to encourage the participant to become an entrepreneur and handle with these challenges. A start-up company is different from well-developed one due to limited resources. Usually, to response customer’s requirement, the entrepreneur must take multiple criteria into consideration simultaneously.\n    The course includes three parts. Part I build students’ concept about innovation and entrepreneurship. Part II is about market identification. Part III is about marketing management of a start-up company. The efficient marketing activities enable business to approach customer’s requirement, to bring their customer product (or services) and get customer’s feedback. Also, the marketing management helps entrepreneur to reach their potential investor to obtain more resources.",
    "schedule": "1\n課程介紹—設計「幸福科技、創業創新」的人生職涯\n2\n「智慧科技發展」為全球幸福社會\n3\n探索「經濟倫理」為全球社會幸福\n4\n「AI創業創新」為全球社會幸福\n5\n「全球永續的創業創新」為全球幸福社會\n6\n「社會企業創業」為全球幸福社會\n7\n「大健康產業的創業創新」為全球幸福社會\n8\n期中心得\n9\n「品牌創業創新」為全球幸福社會\n10\n 「金融科技創新」為全球幸福社會\n11\n「文創創業創新」為全球幸福社會\n12\n「服務業數位創業創新」為全球社會幸福\n13\n「健康服務與資訊之創業創新」為全球幸福社會\n14\n「軟體創業創新」為全球社會幸福\n15\n學生「幸福科技」個案報告\n16\n學生「幸福科技」個案報告\n\n邀請演講者\n1. 彭裕民 副院長 (工研技術研究院)\n2. 曾國棟 永續長 (大聯大)\n3. 郭智輝 董事長 (崇越科技)\n4. 陳進財 董事長 (穩懋)\n5. 程淑芬 投資長 (國泰金)\n6. 簡又新 董事長 (TAISE)\n7. 朱志洋 董事長 (友嘉集團)\n8. 宿文堂 副總 (聯發科)\n9. 王年清 副董 (迅得機械)\n10. 黃顯華 董事長 (福邦創管) \n11. 何子明 獨立董事 (Azeus)\n12. 陳政興 董事長 (均豪精密)\n13. 詹文男 董事長精英電腦\n14. 李昌鴻 副總暨事業群總經理 佳世達科技\n15. 魏美蓉 台灣區總經理 韋萊韜悅管理顧問人才與獎酬諮詢",
    "scorePolicy": "上課筆記 (50%)\n期末報告 (50%)",
    "materials": "幸福人生、創新創業",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中：上課筆記及心得\n期末：創業 BP",
      "courseInfo": "實施遠距教學 \n上課(使用軟體google meet/MS teams/Zuvio) 線上會議室上課\nline 群組加入方式/務必加入  http://line.me/ti/g/KkFSQ7nMXP",
      "courseURL": "Teams課程團隊連結\n團隊代碼是 xv42fsn\nPlease also join the line group for this course: http://line.me/ti/g/KkFSQ7nMXP",
      "contactInfo": "Prof Chen:  louischen358@gmail.com\nTA楊欣芸:   t109AC2003@ntut.org.tw",
      "additionalInfo": "每週有上課小筆記要交，上課精彩演講、討論，一定要出席",
      "lv2Method": "遠距上課"
    }
  }
]
