[
  {
    "name": "鄭麗玲",
    "email": "liling@ntut.edu.tw",
    "latestUpdate": "2021-09-15 00:26:52",
    "objective": "現代人對圖像與影像十分熟悉，對世界各地的歷史卻可能很陌生。本課程將藉由圖像與影像的引領，使修課者瞭解世界各地不同的歷史發展、生活樣貌與思考模式。活潑而多面向的思考與多元價值，是創意之能源源不絕的根本，藉由影像呈現出不同文化、思考與生活方式，協助學生跳脫單一思考與僵化的價值觀。另一方面，學習相關歷史，將可培養學生日後利用本地素材進行相關圖像創作的基礎知識，激發各式文化創作的創意。\nThis course will help students learn about the historical development, lifestyles, and patterns of thought in different cultures of the world with the aid of visual images in photos or films, static or animated. Powerful, vigorous and multidimensional thinking is definitely the key to the endless source of creativity. The use of images can facilitate the cultivation of such thinking ability by bringing up the multiple phases of world cultures, lifestyles and ways of thinking, thereby freeing students from one-dimensional and narrow-minded viewpoint. Once they gain a comprehensive understanding and insights of world history, hopefully they will be actively inspired to create brilliant works of visual art based on local materials in Taiwan.",
    "schedule": "一、中秋節放假\n二、課程介紹\n三、單元一： 奧運與台灣\n四、影片：翻滾吧！男孩\n五、國慶日補假\n六、單元二：波斯帝國與伊朗(古代波斯帝國大航海時代\n七、伊斯蘭世界、20 世紀的中東\n八、影片：茉莉人生\n九、期中考週\n十、單元三：亞洲焦點—日本明治維新與台灣\n十一、單元三：亞洲焦點—日本明治維新與台灣\n十二、影片：鹿鳴館、片格轉動的台灣顯影\n十三、單元四：失落的世界—兩次大戰與20 世紀\n十四、單元四：失落的世界—兩次大戰與20 世紀\n十五、影片：來自硫磺島的信、布達佩斯大飯店\n十六、單元五：大數據與數位時代—影片：神通情人夢\n十七、我的電影\n十八、期末考週",
    "scorePolicy": "期中評量30%\n課堂報告及作業70%\n課堂報告及作業70%，包括以下項目：\n個人課堂報告2回：\n1. 影片觀後內容摘要與心得口頭報告，5分鐘\n2.我的電影：分享個人喜愛的電影或紀錄片，需切合課程有歷史性質的內容，於口頭報告後，第十七週繳交個人書面報告）\n3.課後心得作業約2~4篇",
    "materials": "自編講義\n竹村豐俊原著，林玫君主編 ，《台灣體育史日治時代 上下》，台北：中央研究院台史所，2020.12\n林明德《日本近代史》，台北：三民，2006。\n林玫君&lt;太陽旗下的鐵人--張星賢的田徑世界&gt;，\n金湘斌，《日本時代台灣運動員的奧運夢 –林月雲的三挑戰與解開裹腳布的女子運動競技》，台北：秀威，2021.7\n周婉窈《少年台灣史》，台北：玉山社，2014。\n《新編世界文化史》",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中考、期末考採實體紙筆測驗或採線上報告",
      "courseInfo": "依9月13日教務處公告：\n9/22(三)-9/28(二)進行全校線上授課教學演練，所有課程均採遠距方式進行（實習實驗類課程及體育課可提出替代做法），學生不必到校。\n9/29(三)-10/10(日)仍以遠距教學為主",
      "courseURL": "https://teams.microsoft.com/l/team/19%3a5Avr8YTXhH_h8nOfGXbtSiXnJV19Ai5eVoYNuGdLoRc1%40thread.tacv2/conversations?groupId=f67d96db-1f22-4545-957d-77bc7d87785a&amp;tenantId=dfb5e216-2b8a-4b32-b1cb-e786a1095218",
      "contactInfo": "研究室分機3037\n研究室位置: 共同科館大樓3樓304\nOffice Hours :尚未確定\nEmail: liling@mail.ntut.edu.tw",
      "additionalInfo": "本課程將保留學生一學期有三至五次到校上課及進行實體考試\n到校上課或考試的同學，一律採固定座位、上課十分鐘後點名並拍照。可實體授課或分流實體課程時，採固定座位、固定成員方式進行，落實點名。\n上課時師生應全程佩戴口罩且落實手部消毒，上課期間禁止飲食。",
      "lv2Method": "遠距上課"
    }
  }
]
