[
  {
    "name": "詹傑勝",
    "email": "jasonjan@gmail.com",
    "latestUpdate": "2021-09-08 12:26:24",
    "objective": "工業化導致人口從鄉村往都市遷徙，其後果不只是在人類生活環境的改變或者是流行病學問題。都市化過程也造成自然環境改變，生物棲地減少的問題。該課程希望透過了解都市中生態棲地的改變，如何影響鳥類以及其他生物的生存，使學生意識到人類的都市化，對其他物種的衝擊。並從中思考，在便利的都會社會生活以及休閒活動之外，該如何在都市生活中建設生態友善的校園。\nIndustrialization brings about domestic migration from rural areas to cities. The consequences include not only environmental changes for human life or related epidemiological issues. The process of urbanization also causes changes of natural environment, reducing habitat for wildlife. This course aims to provide students a scope to aware how habitat changes in urban areas impact birds and other wildlife and to design environment-friendly campus in additional to convenient urban social life and leisure activities.",
    "schedule": "第1週　　課程介紹\n第2週　　社會科學與自然科學的關聯\n第3週　　都市化的人口遷徙、人口老化與休閒\n第4週　　古代典籍中的鳥類。郊區生態。社會研究方法, 休閒活動問卷設計\n第5週　　台北科技大學中的鳥類與生態觀察\n第6週　　都市生態跳島化與公園生態廊道\n第7週　　周邊華山特區、大安森林公園與忠孝國小的生態環境觀察\n第8週　　外來物種認識，鳥類、爬蟲類、魚類、植物對生態的衝擊\n第9週　　期中考\n第10週　　公園生態化倡議與校園生態化倡議，分組規劃生態友善校園\n第11週　　石碇茶鄉  台北市新北市水岸生態與垃圾\n第12週　　台北科大校園外的其他市區的生態島觀察-台北植物園\n第13週　　分組生態友善校園規劃第一次報告(含文字與影像紀錄)\n第14週　　台北科大校園外的其他市區的生態島觀察-關渡平原\n第15週　　台北科大校園外的其他市區的生態島觀察-富陽生態公園\n第16週　　規劃生態友善校園分組期末報告(含問卷調查文字與影像紀錄)\n第17週　　規劃生態友善校園分組期末報告(含問卷調查文字與影像紀錄)\n第18週　　期末總結討論",
    "scorePolicy": "期中考　　50%\n課堂參與 10%\n出席　　20%\n報告　　10%\n成果展覽10% (影像紀錄部分, 請自行準備設備，單眼相機或是類單眼相機, 攝錄影的鏡頭焦段至少200mm 以上, 照片畫素約一千五百萬以上)",
    "materials": "社會學概論 第十二章 經濟、消費與休閒 第14章 人口、都市化與環境 George Ritzer著, 吳鴻昌等譯 2017 雙葉書廊。\n鳥與史料 周鎮著 1992 臺灣省立鳳凰谷鳥園。\n臺灣野鳥手繪圖鑑 蕭木吉著 2015 行政院農委會林務局。\n寂靜的春天，卡森(Rachel Carson)著，李文昭譯。\n公園生態化倡議-荒野保護協會https://www.sow.org.tw/blog/129/20170523/5461。",
    "foreignLanguageTextbooks": true,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "期中考實體紙筆測驗, 期末考線上報告, 期中五次上課採室外生態觀察",
      "courseInfo": "上課時間依照課程系統排定時間, 三分之二採遠距教學, 有五週到六週需要室外生態觀察, 相關教材置於北科i學園, 有英語教材需要閱讀, 需要準備焦段200mm以上單眼相機或是類單眼相機紀錄生態. 手機無法紀錄鳥類.",
      "courseURL": "https://meet.google.com/pmo-hgtm-vfw",
      "contactInfo": "共同科館501-4研究室, email: jasonjan@ntut.edu.tw",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
