[
  {
    "name": "陳雪芳",
    "email": "hfang5335@gmail.com",
    "latestUpdate": "2021-09-12 10:45:00",
    "objective": "所有人際圈都有倫理問題。家庭有家庭倫理，學校有學習倫理，在職場中則存在著職場倫理關係，有待個人學習理解、奉行。職場倫理是人與組織之間的關係，也就是在職場中的人際關係，其牽涉正確的工作態度、正確的價值觀念以及正確的人際關係等層面。\n職場倫理涉及到職場中個體或群體對於人際互動判定對錯是非，若不具備或不健全的職場倫理觀念將會導致職場人際圈秩序混亂或被破壞，引來觸犯法律規定底限之懲處不利後果。因此，企業懲戒法律案例形同職場倫理負面教材，可藉之推演人際互動規則、體會個案經驗，以思考合宜的人際往來互動的拿捏取捨。\n職場倫理議題牽涉禮貌、法律與溝通技巧等多元問題面向。本課程除從理論面演繹職場倫理內涵，亦採企業懲戒個案探討方式，來協助學生習得適應融入職場生活所需之人際相處知識。\nAll kinds of relationship involve ethic issue. There is learning ethic in school, while there exists workplace ethic in a company we need to understand and follow.\nEthic of workplace is the relationship between individuals and organizations, meaning a social relationship of workplace. It involves several aspects, including correct work attitudes, values, and personal relationships.\nWorkplace ethic involves ideas individuals and groups hold in workplace to judge right or wrong about behavior. Without correct or sound ethic in workplace may result in chaos or destruction of order among social networks, or offend the legal baseline. Thus, enterprise punishment cases equal negative examples for workplace ethic. By reasoning rules between personal interactions, and experiencing lawsuits, it allows to consider appropriate social interactions among individuals. \nWorkplace ethic involves topics of manners, laws and communication skills. This course provides not only theoretical perspective.",
    "schedule": "第 01 週：職場面面觀\n第 02 週：工作的價值與衝突 \n第 03 週：職場倫理的意涵\n第 04 週：職場必修的學分 -- 職涯發展\n第 05 週：工作的價值\n第 06 週：企業文化與工作守則\n第 07 週：職場中的人際關係\n第 08 週：辦公室 EQ\n第 09 週：期中考試\n第 10 週：法律、道德與倫理\n第 11 週：商業禮儀\n第 12 週：無法置身事外的人性戰場\n第 13 週：浮潛不定的職場規則\n第 14 週：最佳的同事距離\n第 15 週：(開國紀念日遇例假補假)\n第 16 週：形象禮儀\n第 17 週：就業競爭力\n第 18 週：期末報告",
    "scorePolicy": "上課參與表現：10%\n出席情形：20%\n期中考試 (110/11/19)：30%\n期末報告 (111/01/21)：40%",
    "materials": "教科書\n丁志達（2014）。職場倫理。揚智出版社\n\n參考書籍 (延伸閱讀)\n許書揚（2013）。CEO 最在乎的事：職場倫理與工作態度。天下雜誌\n鄭仰峻（2010）。職場倫理。華都文化\n魏成晉（2010）。在公司這些事，沒有人會教你。文經閣出版社\n王淑俐（2016）。生涯發展與規劃：為職涯發展做準備。揚智出版社 \n李開復（2006）。做最好的自己。聯經出版公司 \n楊基寬（2006）。七千萬的工作。寶瓶文化事業有限公司 \n李昊（2005）。上班族辦公室生存手冊 -- 別成為公司裡有能力的廢人。\n                              廣達文化出版社 \n田臨斌（2010）。從 CEO 到樂活家：白領打工仔，45 歲退休全記錄。\n                              博客思出版\n 陳敬旻（2008）。不抱怨的世界，譯自 Will Bowen (2007). A Complaint \n                              Free World。時報出版",
    "foreignLanguageTextbooks": false,
    "covid19": {
      "lv2Description": null,
      "courseScoreMethod": "(1) 期中考試：採實體紙筆測驗為原則，考試教室另行公告。屆時將依疫情指揮中心準動式調整，必要時再行修正並公告。\n(2) 期末報告：以 google classroom 進行線上繳交。",
      "courseInfo": "(1) 教材下載：北科 i 學園 及 google classroom\n(2) 上課平台： Google Meet 遠距教學平台 https://meet.google.com/wex-uodu-xur",
      "courseURL": "Google Meet 遠距教學平台 https://meet.google.com/wex-uodu-xur",
      "contactInfo": "同學詢問相關問題之管道\nE-mail：hfang5335@gmail.com",
      "additionalInfo": null,
      "lv2Method": "遠距上課"
    }
  }
]
