[{"name":"陳圳卿","email":"cceugene@ntut.edu.tw","latestUpdate":"2021-09-10 15:13:20","objective":"輔具是輔助器具的簡稱，舉凡日常生活，能使活動更容易、方便的各種用具皆屬之，正確的使用輔具可以改變身心障礙者或老年人原本有障礙的生活，走入社會，降低社會成本。本課程為專案導向課程，課程中除教授輔具設計基本概念，透過實際個案訪談分析目標對象，以工作坊形式找出使用者痛點，進而發展解決方案，提出適切的輔具資源，以幫助身心障礙者或老年人族群。\nAssistive device is the abbreviation of auxiliary equipment. For everyday life, all kinds of utensils that make activities easier and convenient belong to it. Correct use of assistive device can change the life of people with physical and mental disabilities or the elderly who have obstacles, and enter the society and reduce Social costs. This is a project-oriented course. The course introduces the concept of auxiliary equipment; students can also analyze target audience through different case studies. During workshops, it helps students indicate users’ pain points and develop the solutions. The goal of this course is to come out with the resources to help people with disabilities or the elderly.","schedule":"週次/日期　　小時　　課程內容　　課程模式　　教師　　地點\n1　　9/23 (四)　　2小時15:35-17:15　　課程簡介　　Lecture　　陳圳卿、林立 北醫\n2　　9/30(四)　　3小時15:35-18:05　　1.輔具使用者介紹 2.政府身障者數據分享 3.分組報告：資訊收集數據呈現　　Workshop1-1　　林立、林欣蓓 北醫\n4　　10/7(四)　　2小時15:35-17:15　　人因/通用設計　　Lecture　　彭志維 北醫\n5　　10/14(四)　　3小時15:35-18:05　　1.無障礙環境介紹 2.成長障礙環境家裡及工作活動環境 3.分組報告：分享所描繪退休後的夢想家園 Workshop1-2　　林立、林欣蓓　　北醫\n6　　10/28(四)　　3小時15:35-18:05　　1.輔具介紹 2.實際接觸合適行動輔具，身心障礙鑑定架構及申請流程 3.分組報告：根據ICF鑑定面向進行身障者訪綱擬定　　Workshop1-3　　林立、林欣蓓　　北醫\n7　　11/04(四)　　3小時15:35-18:05　　1.失能與高齡同理心體驗式學習介紹 2.親身故事強化學生同理心 3.分組報告：身障體驗活動與心得分享、行動輔具體驗與發想　　Workshop1-4　　林立、林欣蓓　　北醫\n\n8　　11/13(六)　　6小時9:10-16:00　　找出痛點1/訪談TA 觀察訓練/訪談問題發現 訪談問題發表　　Workshop2　　陳圳卿、林立、彭志維　　北科\n\n9　　11/27(六)　　6小時9:10-16:00　　找出痛點2/聚焦收斂 概念成形 聚焦收斂/概念成形　　Workshop3　　陳圳卿、林立、彭志維　　北科\n\n1/17(一)　　17:00前　　繳交期末發表資料，請上傳至雲端資料夾  ; 檔案名稱請編列：創新設計與智慧輔具-【系別+姓名】\n\n1/20(四)　　3小時15:35-18:05　　期末發表　　Presentation　　陳圳卿、林立、彭志維　　北醫\n\n工作坊日期待開課後確認","scorePolicy":"課堂出席　　40\n工作坊出席　　30\n期末專題分組報告　　30","materials":"依授課老師指定","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"課程之講授部分採線上簽到，期末報告採遠距線上進行，工作坊為實體參與(符合防疫空間規範)以評分。","courseInfo":"1. 本課程講授部分使用線上軟體進行，同學不需到校。上課連結、上課教材、作業規定與繳交、上課錄影檔連結皆由課程助教協助於課程LINE群組公告。\n2. 工作坊為實體參與，工作坊地點將依中央防疫規範另訂北科校內空間，相關細節將於第一次上課時公告。","courseURL":"待課前公告","contactInfo":"研究室(設計館七樓701-3)分機4573\nEMAIL: cceugene@ntut.edu.tw","additionalInfo":null,"lv2Method":"遠距上課"}}]
