[{"name":"陳圳卿","email":"cceugene@ntut.edu.tw","latestUpdate":"2021-09-05 17:40:53","objective":"本課程之目標為透過課堂講授、移地教學以及設計思考工作坊之操作，讓學生能透過大學社會責任專案的導入，以社會設計理論為基礎，教育部苗圃計畫跨域設計思考工作坊為教學途徑，習得執行社會設計創新思考之知識與實作。課程的安排包含社會設計以及設計思考4D流程 (discover, define, develop and deliver) 的講授，雙師雙日跨域工作坊的執行，師生實際至主題操作的場域進行現地踏查以掌握與分析實際的問題，最後藉由創新提案的發表提交課程的成果。本課程期望能培養學生跨域整合知識應用與實作、以及創新思考問題解決的能力。\nThis course aims to allow students to understand the knowledge and practice of social design thinking by means of lecturing, field study and design thinking workshop. This course will be supported by the Miaopu project and University Social Responsibility Project, with the aim to incorporate cross-discipline design thinking and social design practicing. The course includes lecturing of social design theory and 4D (discover, define, develop and deliver) process of design thinking, two-day workshop and field study of aboriginal tribe. The outcome of this course is the proposal of innovative solution based on the problems uncovering by the workshop. It is expected that students can obtain the capability of applying cross-discipline knowledge and innovative problem-soving.","schedule":"週數　　單元主題　　作業/測驗\n第1週 課程介紹/背景說明　　\n第2週 社會設計 隨堂討論\n第3週 設計思考 隨堂討論\n第4~17週　　跨領域設計思考工作坊(永續建築)：\n工作坊安排為兩個周末進行，時間為09:00~17:00，不含中午時段計7小時，雙周末共14小時。　　工作坊實作\n第18週 檢討與改進 期末報告","scorePolicy":"出席與隨堂討論10%\n工作坊參與60%\n期末報告30%","materials":"設計思考改造世界，提姆‧布朗著，吳莉君譯，聯經出版公司。\n設計思考全攻略，賴利・萊佛、麥可・路里克、派翠克・林克著，周宜芳譯，天下雜誌出版社。","foreignLanguageTextbooks":false,"remarks":"\n<b>本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n\n※「一級」警戒：實體授課。\n\n※「三級」(含)以上警戒：課程全採遠距授課。\n\n※「二級」警戒授課方式說明如下：</b>\n\n<b>●上課方式：</b>遠距上課\n\n<div style=\"background:transparent;color: blue;font-size:12pt\"> </div>\n\n<b>●評量方式：</b><div style=\"background:transparent;color: blue;font-size:12pt\">課程之講授部分採線上簽到，期末報告亦採遠距線上進行，工作坊及部落踏查(待確認)為實體參與以評分。</div><hr>\n<b>如果學期初就實施遠距教學或分流上課，本課程所採行之因應方式：</b>\n\n<b>●課程訊息公告：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">1. 本課程講授部分使用Google Meet進行，同學不需到校。上課連結、上課教材、作業規定與繳交、上課錄影檔連結皆公告於ZUVIO，請同學務必加入ZUVIO (本課程代碼：79952332)。\n2. 工作坊與部落踏查(待確認)為實體參與，工作坊地點將依中央防疫規範另訂校內空間，相關細節將於第一次上課時公告。</div>\n\n<b>●上課網址：</b><div style=\"background:transparent;color: blue;font-size:12pt\">第一次上課連結：https://meet.google.com/pbp-dsen-jyr</div>\n\n<b>●學生加退選簽核及諮詢課程問題管道：</b>\n<div style=\"background:transparent;color: blue;font-size:12pt\">研究室(設計館七樓701-3)分機4573\nEMAIL: cceugene@ntut.edu.tw</div><hr>\n<b>●補充說明資訊：</b><div style=\"background:transparent;color: blue;font-size:12pt\"></div>\n\n  "}]
