[{"name":"張家銘","email":"arthur.itri@gmail.com","latestUpdate":"2021-07-10 16:10:14","objective":"根據工研院「預見2030科技大未來」問卷調查，未來最重要實現的科技場景，第一名是「無人機物流服務」。同區域訂貨靠無人機幾分鐘就能送達，改寫了物流產業。全球無人機的新聞能見度越來越高，對全球經濟發展的影響，日益重要。航太分析公司Teal Group針對商業無人機市場進行研究，預估全球無人機市場於2028年時預期將接近800萬架合計143億美元。主要原因是美國聯邦航空總署(FAA)主導領空開放的政策，形成商業上的應用大大增加。專業型無人機的服務應用相當多元，主要包括服務應用平台，物資運送，以及空中通訊平台。今年開始，將是擴大商業化應用市場的關鍵期。此外，國內新創公司已開始投入小型垂直起降(VTOL)載人航空器研發。預期未來全球無人機需求數量非常可觀，並逐步形成目前主流民用航空器外的另一個新興市場。\nAccording to the questionnaire survey of \"Foreseeing the Great Future of Science and Technology in 2030\" by the Industrial Technology Research Institute, the most important technology scenario to be realized in the future is \"UAV logistics service\". Orders in the same area can be delivered within a few minutes by drones, rewriting the logistics industry. The visibility of global drone news is getting higher and higher, and its impact on global economic development is becoming increasingly important. Aerospace analysis company Teal Group conducts research on the commercial drone market. It is estimated that the global drone market is expected to be close to 8 million in 2028, totaling 14.3 billion U.S. dollars. The main reason is that the Federal Aviation Administration (FAA) has led the airspace opening policy, which has greatly increased its commercial applications. The service applications of professional drones are quite diverse, mainly including service application platforms, material delivery, and air communication platforms. It is expected that this year will be a critical time for expanding the commercial application market. In addition, domestic start-up companies have begun to invest in the research and development of small vertical take-off and landing (VTOL) manned aircraft. It is expected that the global demand for drones will be very substantial in the future, and will gradually form another emerging market outside the current mainstream civil aircraft.","schedule":"第01週　　航空工程概論\n第02週　　多旋翼無人機概論與航空氣象學\n第03週　　飛行原理、 民用航空法與無人機法規\n第04週　　多旋翼無人機設計原理(一)\n第05週　　多旋翼無人機設計原理(二)、無人機飛行控制概論(一)：\n                STM32 Cortex CPU硬體模組(Part-1)\n第06週　　多旋翼無人機設計原理(三)、無人機飛行控制概論(二)：\n                STM32 Cortex CPU硬體模組(Part-2)\n第07週　　飛行控制作業系統RTOS(一)：飛行控制 PID演算法(Part-1)\n第08週　　飛行控制作業系統RTOS(二)：飛行控制 PID演算法(Part-2)\n第09週　　期中考\n\n第10週　　飛行座標系統 (四元數架構與原理)與\n                ATC 航管塔台專業通訊術語(Air Traffic Control)\n第11週　　四旋翼無人機基礎飛行訓練(一)：停懸及前進、後退\n第12週　　四旋翼無人機基礎飛行訓練(二)：五邊飛行\n第13週　　四旋翼無人機基礎飛行訓練(三)  :  G2 飛行術科， 矩形航線及\n                任務模式飛行、8字水平圓型飛行訓練\n第14週　　專題:\n                固定翼無人機製作：組裝與調校(一)\n                無人機飛航練習(一)\n第15週　　專題:\n                固定翼無人機製作：組裝與調校(二)\n                無人機飛航練習(二)\n第16週　　無人機空拍、微電影製作\n                無人機飛航練習(三)\n第17週　　交通部民航局無人機考照學科與術科，技術分析與演練\n第18週　　期末考\n\nWeek 01 Introduction to Aviation Engineering\nWeek 02 Introduction to Multi-rotor UAVs and Aeronautical Meteorology\nWeek 03 Principles of Flight\n                Civil Aviation Law and UAV Regulations\nWeek 04 Design Principles of Multi-rotor UAV (1)\nWeek 05 Design Principles of Multi-rotor UAV (2)\n                Introduction to UAV Flight Control (1): STM32 Cortex CPU hardware \n                module (Part-1)\nWeek 06 Design Principles of Multi-rotor UAV (3)\n                Introduction to UAV Flight Control (2): STM32 Cortex CPU Hardware\n               Module (Part-2)\nWeek 07 Flight Control Operation System RTOS (1): Flight Control PID \n               Algorithm (Part-1)\nWeek 08 Flight Control Operation System RTOS (2): Flight Control PID \n               Algorithm (Part-2)\nWeek 09 Mid-term exam\n\nWeek 10 Flight coordinate system (Quaternion structure and principle) and\n               ATC Professional Communication Terminology for Air Traffic Control\n              Tower (Air Traffic Control)\nWeek 11 Basic Flight Training of Quadrotor UAV (1): Hovering and Forward and\n               Backward\nWeek 12 Basic Flight Training of Quadrotor UAV (2): Pattern\nWeek 13 Basic Flight Training for Quadrotor UAVs (3) G2 Flight Technique\n               Division: Rectangular Route and Mission mode flight, figure 8 horizontal\n               round flight training\nWeek 14 Topic:\n                Fixed-wing UAV production: assembly and adjustment (1)\n                UAV flight practice (1)\nWeek 15 Topic:\n                Fixed-wing UAV production: assembly and adjustment (2)\n                UAV flight practice (2)\nWeek 16 UAV aerial photography and micro film production\n                UAV flight practice (3)\nWeek 17 UAV examination subject and technical subject, technical analysis and \n               drills, Civil Aviation Administration of the Ministry of Communications\nWeek 18 Final Exam","scorePolicy":"平時報告與表現:50%\n期中考:25%\n期末考:25% \n\nWeekly report and performance: 50%\nMid-term exam: 25%\nFinal exam: 25% (ATC Test)","materials":"USA FAA “Pilot Handbook 2016”(English Version)\nUSA FAA “Air Traffic Control 2015”(English Version)\nUSA FAA “Helicopter Flying Handbook 2019”(English Version)\nUnmanned Aircraft Systems: UAVS Design, Development and Deployment,\nAustin Reg(John Wiley &amp; Sons Inc.出版)\nTeacher teaching materials (教師自編講義)","foreignLanguageTextbooks":true}]
