[{"name":"譚華德","email":"nitiwat2012@gmail.com","latestUpdate":"2021-08-04 18:24:07","objective":"1. 在臺灣與東南亞交流日益增加的情況下，東南亞語言的學習需求也會隨之提高。而「泰國」所擁有的社會經濟條件優勢，以及泰國政府有意推動的文化創意產業，相信也將為臺灣帶來一陣「泰語學習風潮」。 2. 課程以培養基礎泰語溝通能力、激發學習泰語興趣，以及跨文化理解為宗旨。課程架構包括泰國語言教學及元化議題討論，使其在具備泰語溝通基本實力之外，更能對泰國各方面情勢與文化、思想、禮節、風俗習慣、宗教禁忌等，都具有深度認識。 3. 泰語教學方面，秉持聽、說、讀、寫同時並進的教學理念，由字母的發音、寫法、唸法、聲調、順序及拼字系統的學習開始，奠定良好的泰語基礎，搭配最常用的單字、句型、文法與日常實用會話，使學生可以拼寫、閱讀泰文短文，並能以泰語進行日常對話。 4. 泰國文化方面，以專題的方式，講述政治、經濟、社會、地理、歷史與文化等各個層面的泰國，呈現出不同於一般刻板印象中的泰國，培養學生對泰國的正確認識及態度。本學期先針對泰國目前的經濟與文化面進行概說；下學期則探討泰國歷史、地理、政治與社會。\n1. With the interaction between Taiwan and Southeast Asia getting more and more frequent, the need for learning Southeast Asian languages has been highly increasing. Thailand owns the advantages of social economy; moreover, Thailand government intends to promote cultural creativity industries. Hence, learning Thai definitely becomes a new trend in Taiwan. 2. This course aims to help students build the foundation of speaking basic Thai, and arouse students’ interests in learning Thai. Also, it helps students get to know cross-cultural differences. In addition to learning Thai, students have to discuss the issues related to Thai culture. Accordingly, students are not only able to make conversations, but have further understanding of Thai culture, thinking, manners, customs and religious taboos etc. 3. In terms of learning Thai, listening, speaking, reading and writing, these four skills are equally important. Student will be trained to learn all these four skills together. At first, s","schedule":"第 1 週 \n課程簡介\n(1) 學生自我介紹 (學泰文的目的)\n(2) 如何學好泰文? (方法與訣竅)\n(3) 認識泰語發音與拼字寫法(4大結構18種拼字組合)\n(4) 說明上課方式、作業與評分方式，學生準備兩本作業本\n\n第 2 週 \n第 1 課 : 泰文數字\n(1) 數字練習\n(2) 對話練習\n(3) 寫作業\n\n第 3 週 \n第 2 課 : 泰文母音\n(1) 母音練習\n(2) 對話練習 \n(3) 寫作業\n\n第 4 週\n舉辦「美食週」\n\n第 5 週 \n第 5 課 : 泰語發音與拼字: 第1種拼字組合\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 6 週 \n第 4 課 : 泰語發音與拼字: 第2種拼字組合\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 7 週 \n第 5 課 : 泰語發音與拼字: 第3種拼字組合 (上)\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 8 週 \n總複習\n\n第 9 週 \n期中考 (考筆試) \n\n第 10 週 \n期中考 (考口試)\n\n第 11 週 \n第 6 課 : 泰語發音與拼字: 第3種拼字組合 (下)\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 12 週  \n第 7 課 : 泰語發音與拼字 : 7個簡化母音\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 13 週 \n第 8 課 : 泰語發音與拼字: 第4-6種拼字組合\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 14 週  \n第 9 課 : 泰語發音與拼字: 第7-9種拼字組合\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 15 週\n第 10 課 : 泰語發音與拼字: 第10-12種拼字組合\n(1) 單字與句子練習\n(2) 對話練習\n(3) 寫作業\n\n第 16 週 \n總複習 \n\n第 17 週 \n期末考 (考筆試) \n\n第 18 週 \n期末考 (考口試)","scorePolicy":"1.參與課程和閱讀測驗      20%\n2.寫作業                              20%\n3.對話考試                          10%             \n4.期中考 (筆試)                  25%\n5.期末考 (筆試)                  25%\n    總分                              100%","materials":"指定教材\n《泰語基礎 1 : 泰語拼字與寫法》譚華德◎編著 (課本 + MP3 = 400元)\n參考書目\n1.《泰語基礎1 : 泰語拼字與寫法》譚華德◎編著\n2.《泰語基礎2 : 泰語發音與規則》譚華德◎編著\n3.《泰語基礎3 : 泰語句型與文法》譚華德◎編著\n4.《泰語超實用生活會話與閱讀系列》譚華德◎編著\n5.《泰語國小教材1-6年級》泰國教育部◎編著","foreignLanguageTextbooks":false}]
