[{"name":"李來春","email":"f10666@ntut.edu.tw","latestUpdate":"2021-09-08 17:26:33","objective":"課程規劃的目標為以互動設計的理論為基礎，實務導向為原則，使學習者能將學術界的理論與產業界的實務加以結合以充實對於互動設計具有的了解。學習的內容包含互動設計系統構成要素、實務與理論基礎、方法與技術、科技支援與應用等單元，各單元並包含不同互動設計個案的研討，使理論能與實務進行驗證。課程亦安排至相關領域業界的參訪以及互動相關展覽參觀，以加深對於互動設計實務的印象與了解。\nThe course aims to develop broad understanding on interaction design for students, based on theory and practice course structure. Course topics include essential factors of interactive system, interaction design theory and practice, methods and techniques, technical support and application. Course also incorporates case studies, company visits and exhibitions relevant to interaction design to enhance the understanding of integrating theory and practice.","schedule":"Introduction to the course (Holiday--Mid-Autumn Festival)\nW2 First principles of interaction design-user experience\nW3 First principles of interaction design-user experience\nW4 Interaction design VS Human-computer interface – Dialogue with computer  \nW5 Human factors of human-computer interface\nW6 Human-computer interface usability\nW7 Human-computer interface user experience design\nW8 Interaction design VS Exhibition technology - Interactive exhibition of the infinite charm of technology \nW9 Mid-term report\nW10  Analysis and Research on Applied Exhibition Design\nW11  Analysis of performance design\nW12  Interactive application analysis\nW13  Application of super exhibition design\nW14  Interaction design VS Digital learning- The future trend of interactive learning\nW15  Digital learning under the evolution of interactive technology\nW16  Interactive digital learning techniques and tools\nW17  Application cases of interactive digital learning\nW18  Final term-group report","scorePolicy":"Attendance 20%\nMid-term report 35%\nFinal term-group report","materials":"Lai-chung Lee, Hsiao-yue Tsao, Chun-Ching Chen (2018), Introduction to Interaction Design, Taipei: Chuan Hwa Book Co., Ltd.","foreignLanguageTextbooks":false,"covid19":{"lv2Description":null,"courseScoreMethod":"the mid-term and final-term reports will be presented in the online teaching","courseInfo":"We will use the Microsoft Teams or Google Meet online teaching tool, all students  can be able to attend the online teaching condition either you are in Taiwan or still staying in your country.","courseURL":"https://istudy.ntut.edu.tw/learn/index.php","contactInfo":"contact mobile number 0930-051043","additionalInfo":"nil","lv2Method":"遠距上課"}}]
