[
  {
    "name": "張致遠",
    "email": "tofar@mail.ntut.edu.tw",
    "latestUpdate": "2022-02-16 21:42:32",
    "objective": "錯誤控制技術是推動現代行動通訊超大量傳輸、超高可靠度與超低延遲等特性的重要技術之一。本課程旨在介紹現代無線行動通訊之錯誤控制技術之設計原理與應用，內容涵蓋：(1) 無線行動通訊技術之錯誤控制技術簡介 (2) 基礎通道編碼理論與通道容量之介紹 (3) 渦輪碼之原理與設計 (4) 低密度校驗矩陣碼之原理與設計 (5) 極化碼之原理與法設計 (6) 混合式自動重送請求技術之原理與設計。\nError control technology is one of the key enablers for boosting the strict performance of modern mobile communication systems (e.g., extremely-high data rate/reliability and ultra-low latency). This course aims at helping students acquire the knowledge about the applications and design principles of the error control techniques adopted in modern mobile communication systems, covering: (1) Introduction to error control techniques for mobile communication systems, (2) Introduction to basic channel coding theory and channel capacity, (3) Principles and designs of turbo codes, (4) Principles and designs of low-density parity-check (LDPC) codes, (5) Principles and design of polar codes, and (6) Principles and design of hybrid automatic retransmission requests (HARQ) technologies.",
    "schedule": "Weeks 1-2 Introduction to error control techniques\nWeeks 3-4 Review of basic channel coding theory and channel capacity\nWeeks 5-7 Principles and designs of low-density parity-check (LDPC) codes\nWeeks 8-9 Project I\nWeeks 10-12 Principles and designs of iterative decoders\nWeeks 13-16 Principles and design of hybrid automatic retransmission requests (HARQ) technologies\nWeeks 15-17 Project II presentation\nWeeks 18 Project II demo",
    "scorePolicy": "Participation 10%\nHomeworks 40%\nProjects 50%",
    "materials": "Lin and D. J. Costello, Jr., Error Control Coding, 2nd ed. Upper Saddle River, NJ: Pearson Prentice Hall, 2004.　　　　\nW. Ryan, S. Lin, Channel Codes: Classical and Modern. Cambridge University Press, 2009.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\">Epidemic Distance Learning Planning:\n\nGoogleMeet-based lecturing would be adopted; the link will be announced on NTUT iSchool.</div></b></b>"
  }
]
