[
  {
    "name": "林靜娟",
    "email": "cclin@ntut.edu.tw",
    "latestUpdate": "2021-12-27 21:47:06",
    "objective": "現代性源自於歐洲獨有的歷史文化與社會，在工業化、理性化和民主化的推波助瀾下綻放開來，促使人們從神話、威權和中心性解放出來，擺脫傳統社會的制約。透過現代性的反證精神和批判性概念，歐洲幾乎於整個二十世紀初開展出驚人的物質和人類意識的進程。而建築的生產與整個社會、經濟、政治和審美價值緊密相關的專業，又是如何以自身作為對於現代性的批判？\n本課程將以辨明現代性概念為主軸，透過阿道夫・魯斯 (Adolf Loos)、西格弗里德・吉迪恩 (Sigfried Giedion)、華特・班雅明 (Walter Benjamin)、恩斯特・布洛赫 (Ernst Bloch)、和威尼斯學派 (Venice School) 的論說作為理解現代性含混而艱澀的觀念，並藉由藝術和建築作品的探索，作為對於現代性的批判與理念的參照，包括前衛派藝術對於建築的衝擊、新巴比倫的城市景觀社會反論、建築的擬仿和批判等等。\nThe term “Modernity” originated from the unique European history, culture, and societal condition, bloomed with the development of industrialization, rationalization and democratization. That have inspired human to liberate from mythology, authority and centrality, and get rid of the constraints of traditional society. With the antithesis and critical concepts of modernity, Europe has carried out an amazing progress of material and human consciousness almost throughout the twentieth century. How does architecture as a profession closely related to the entire society, economy, politics, and aesthetic approach, in the process of production implemented itself as a critique of modernity?\n    In the beginning of the class, it would be most important to identify the concepts of Modernity. The discourses of Adolf Loos, Sigfried Giedion, Walter Benjamin, Ernst Bloch, and the Venetian School help to clarify the vague and difficult concepts of modernity. Through the exploration of art and arc",
    "schedule": "W1   課程概述\nW2   \"Space\"(essays written in 1975 and 1976), from Architecture and \n         Disjunction, pp. 25~98, The MIT Press. \nW3   \"Program\"(essays written between 1981 and 1983), from Architecture and \n         Disjunction, pp. 99~170, The MIT Press. \nW4   \"Disjunction\"(essays written between 1984 and 1991), from Architecture \n         and Disjunction, pp. 171~259, The MIT Press.\nW5   《巴黎的現代性》\nW6   《巴黎的現代性》\nW7   《巴黎的現代性》\nW8   《建築與現代性》",
    "scorePolicy": "每週討論             30%\n每週口語報告      30%\n期中報告             20%  \n期末專題報告      20%",
    "materials": "1.  Bernard Tschumi, Architecture and Disjunction, The MIT Press.\n2.  巴黎的現代性\n3.  建築與現代性",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"></div></b></b>"
  }
]
