[
  {
    "name": "吳斯偉",
    "email": "swu@ntut.edu.tw",
    "latestUpdate": "2022-02-24 14:47:28",
    "objective": "隨著科技的發展與產值快速成長，網路、電商、商業新模式等各式創業大行其道，成為許多創業者的新選擇，本課程邀請國內知名創業楷模或創業成功典範之企業經理人分享創業成功之經驗。以真實具體的創業經驗為教材，讓學生更深刻體驗創業家之精神。希冀以觀摩學習典範企業的具體經驗，帶領學生學習企業創新與創業的思維，進而激發學生追求成就的渴望，強化青年學子對人生願景的規劃。\nAlong with the prosperous development of Internet, the output value of E-commerce is growing fast. Launching a business on the internet has become a new choice for many entrepreneurs. We invite the domestic business manager, as the model of outstanding and successful enterprise, to share his experiences of achievement with students. By offering the real and specific examples, business manager will make students learn further about the enterprisers' entrepreneurship. Through their experiences, we hope students can learn innovations and creations of enterprise; furthermore, students can be inspired to pursue their ambition to strengthen their wills to plan the future.",
    "schedule": "請注意上課日期\n\n第一次上課: 2/23  經營管理系 吳斯偉老師 課程簡介與說明\n第二次上課: 3/9    創業講座一\n第三次上課: 3/16  創業講座二\n第四次上課: 3/30  創業講座三\n第五次上課: 4/13  創業講座四\n第六次上課: 4/20  創業講座五\n\n詳細情形於第一次上課時公布",
    "scorePolicy": "※上課規定與評分方式\n出席 45% 　課堂表現 5%　心得報告 50%\n一、點名暨作業繳交方式\n         18：30 前助教會在門口發心得單暨點名單 (心得報告＋問卷調查)\n　　 20：30 演講結束後繳交，可寫到 21:00\n二、遲到暨遲到扣分方式\n　　 18：40 之後列入遲到，遲到次數累積兩次視同曠一次，以此類推\n三、曠課扣分方式\n　　第１次缺席扣 5 分　第 2 次缺席扣 15 分 (總共扣 20 分)\n　　第 3 次缺席扣 25 分 (總共扣 45 分)　※注意：3 次沒到就不及格\n四、請假方式\n　　請同學備妥證明文件於下次上課交給助教蕙甄或工作人員\n　　或事前寄信到助教信箱 (a806686@gmail.com)\n五、課堂表現加分方式\n　　於課程進行 Q&amp;A 時提出問題（問完請主動找助教登記學號）",
    "materials": "此為講座課程",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div style=\"\"> 若因疫情而暫停實體上課時，將使用學校的 Microsoft Teams 課程名稱：創業講座 — 創業是一場馬拉松\n\n若有問題，請聯繫主課老師 吳斯偉 email: swu@mail.ntut.edu.tw</div></b></b>"
  }
]
