[{"name":"林淑玲","email":"shuling@ntut.edu.tw","latestUpdate":"2009-03-16 17:50:18","objective":"使學生對財務報表有完整的觀念架構及認識，並具備財務報表理論與應用之基礎，以對財務報表能充分利用與分析。本課程內容包含：運用財務報表解析公司價值、短期流動性分析、財務預測、資本結構與清償能力分析、產業與競爭策略分析、風險分析、營運績效與獲利能力分析、償債能力分析、成長潛力分析、企業評價方法等。\nThe objectives of this course is targeted to propose a systematic framework and techniques of financial statement analysis, and to help students understand the real implication of financial statement of business. Besides, This course help students to find the course beneficial in their lives as they are rewarded with an understanding of both the techniques of analysis of financial statement and the expertise to apply them. The goal of this course is to give students a distinct competitive advantage in an increasingly competitive marketplace as it continues to set the standard in showing the keys to effective financial statement analysis. \nFinancial statement analysis copes with knowledge of industry analysis, industry competitive level and management, to analysis the corporate diversity dimensions of financial performance, and dig into the inherent content and information under the financial statement. The objective is to propose many individuals, including investors, creditors, consultants, managers, auditors, directors, analysts, regulators, employees, and politicians, to make the optimal decision-making. As a result, we are all aware of the exciting and dynamic field of financial statement analysis, as well as its enormous implications for relevant users. Consequently, the contents of this course including the follows: Overview of financial statement analysis, analysis objectives and financial reporting, short-term liquidity, forecasting and pro forma analysis, capital structure and solvency, return on invested capital , profitability analysis, industry and competitive strategy analysis, growth potential analysis, risk analysis, and earnings-based analysis and valuation, etc.\n","schedule":"週次 日期   課程 進 度\n一   2/17   Introduction\n二   2/24   Ch 1: Overview of Financial Statement Analysis（財務報表分析綜覽）\n三   3/3　　   Ch 7: Cash Flow Analysis（現金流量分析）\n四   3/10   Ch 7: Cash Flow Analysis（現金流量分析）\n五   3/17   Ch 8: Return on Invested Capital（投入資本之報酬）\n六   3/24   Ch 8: Return on Invested Capital（投入資本之報酬）\n七   3/31   Ch 8: Profitability Analysis（獲利能力分析）\n八   4/7　　   Ch 8: Profitability Analysis（獲利能力分析）        \n九   4/14   期中考試：【課外書籍報告】\n十   4/21   Ch10: Credit Analysis: Liquidity（信用分析：流動性） \n十一 4/28   Ch10: Credit Analysis: Capital Structure &amp; Solvency\n（信用分析：資本結構＆償債能力）\n十二 5/5　　   Appendix 10B: Predicting Financial Distress（附錄10B：預測財務危機）\n十三 5/12   Ch11: Equity Analysis（股權分析）\n十四 5/19   Ch11: Valuation（企業評價）\n十五 5/26   Ch11: Valuation（企業評價）\n十六 6/2　　  『上市(櫃)公司財務報表診斷』個案分析報告\n十七 6/9　　  『上市(櫃)公司財務報表診斷』個案分析報告\n十八 6/16   期末考試\n","scorePolicy":"1.出席及課程參與討論狀況：25%。\n2.課堂實作＆個案分析與研討：25%。（題目將另行公布於教學網站）\n3.『課外書籍閱讀』分組報告(另行公佈)：25%。\n4.『上市(櫃)公司財務報表診斷』個案分組報告：25%。\n \n","materials":"Textbook: 教師自編講義＆ Wild, J. J. and K. R. Subramanyam, R. F. Halsey (2009) Financial Statement Analysis, 10th ed., McGraw-Hill Publishing Companies， (華泰文化事業: 02-21621217~122 or 113)。\nReference: \n1.盧文隆，『財務報表分析：分析企業&amp;闡釋人生』，2008年4月，（華立圖書）。\n2.Revsine, L., D.W. Collins, and W.B. Johnson (2004) Financial Reporting and Analysis, 3th ed., Prentice Hall Publishing Companies (新陸書局)。\n3.謝劍平，『財務報表分析』，2006年6月初版，（智勝文化事業）。\n4.李元棟等，『財務報表分析』，2006年5月初版，（全華科技圖書）。\n5.郭敏華，『財務報表分析評價應用』，2004年8月再版，（智勝文化事業）。\n","foreignLanguageTextbooks":false}]
