[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2009-03-05 18:08:23","objective":"English Romantic poet Percy Bysse Shelley famously observed that “poets are the unacknowledged legislators of mankind.”  Unacknowledged they may be.  But poetry remains unique among the linquistic arts as the one which most fully synthesizes orality with the written text, the intellectual rigor of philosophy with the immediacy of direct perception, and the world of the individual imagination with the mythologies, folk rituals and customs held as the common cultural heritage of entire groups of people. In this course we will try to bring the written word off the page and into new life through discussion, performance and the use of supplementary materials such as music, film and visual art. In order to understand how literature interacts with the performatory, healing and divinatory arts, we will look at literature through an anthropological lens first suggested by anthropologist Victor Turner who used the notion of liminality to describe the function of ritual in a tribal context. Liminal space can be thought of as a doorway or threshold through which the artist passes, or upon which he balances.  Turner, whose work was based on fieldwork among the Ndembu of Zaire, posits ritual as not only recreating, but indeed creating the categories by which humans perceive reality.  Ritual and art create a liminal space in which man-made divisions dissolve before the deeper intuition of unity in all things.  To such ends, the liminal makes use of, among other devices, nonsense, monstrous images, sacred symbols, masks, clowns and gender reversal.  The ritual, thus viewed, becomes a realm of pure possibility, essentially ambiguous, unsettled, unsettling.  In this course we will study how Turner’s notion of liminal (or liminoid) space can be applied in a variety of contexts, beginning with the orally transmitted ancient (or contemporary tribal) shaman’s song and moving towards written language in the form of epical literature and systematized forms of divination.  These are in turn re-inscribed in Gnostic and Hermetic texts which support the sumbolon or symbol, mot as a direct representation of reality, but as a connection with a higher, magical reality.  Finally we will move to consider how Turner’s liminoid space has been reconfigured in 20th Century and contemporary literature and film  \n\n     This course will provide an examination of poetry in relationship to musics of the world, particularly Scottish ballads, British and American folk-rock, reggae, blues, jazz and hip-hop. Projected films include:  The Harder They Come, Cocteau’s Orpheus, and Marcel Camus’ Black Orpheus.  We will also examine selections from the Sixteen Cowries Divination of West Africa, the I Ching of China, and the Tarot. Through exposure to poetry, art, song, film, history, mythology literary theory and consciousness studies, students will be able to acquire a more sophisticated, nuanced view of culture in its aesthetic expression, and a greater appreciation for the manner in which art and culture continually shape and reshape one another.  \n","schedule":"February 17　　INTRODUCTION:  Music “Mr. Tambourine Man” by Bob Dylan; “Hoochie Coochie Man” by Willie Dixon.  Assignment:  Robert Duncan “Toward the Shaman.”\n\nFebruary 24:　　The Shaman’s Ambit.  Assignment:  Sappho poems and “The Descent of Inanna” \n\nFebruary 3　　Sappho’s Lyrics and The Descent of Inanna  Assignment:  Taliesin’s Riddle; Shaman’s Songs.  \n\nFebruary 11　　Native American Spirituality I/ Assignment:  “The Great Vision” of Black Elk\n\nFebruary 18　　Native American Spirituality II/ Assignment:  Trickster Myth\n\nFebruary 25　　Ballad Forms and Folk Songs I/FILM\n\nMarch 3　　Ballad Forms and Folk Songs II/FILM\n\nMarch 10　　Hoodoo (Delta) Blues I/ 16 Cowries Divination\n\nMarch 17　　(Chicago) Blues II\n\nMarch 24　　Jazz I\n\nMarch 31　　Jazz II/FILM\n\nApril 7　　　　Writing Assignment #1 DUE/FILM\n\nApril 14　　Presentations I\n\nApril 21　　Presentations II\n\nApril 28　　Other Recuperations of Shamanism:  Gnostic Speculation:  Blake, etc.\n\nMay 5　　　　Other Recuperations of Shamanism:  Hermetic Speculation:  Surrealism/　　　　　　　　Divination: Tarot\n\nMay 12　　Other Recuperations of Shamanism:  Dismemberment of the Word I:  St. 　　　　　　John of the Cross, St Dionysus, Dada/ Divination: I Ching\n\nMay 19　　Other Recuperations of Shamanism:  Dismemberment of the Word II:  　　　　　　Burroughs\n\nMay 26　　Presentations I\n\nJune 2　　　　Presentations II\n\nJune 9　　　　FINAL PAPER DUE\n\n","scorePolicy":"GRADING\n\n25%　　Midterm Paper　　　　　　　　\n25%　　Journal Writing\n25%　　Final Paper　　　　　　　　　　\n25%　　Participation and Presentation\n","materials":"　","foreignLanguageTextbooks":false}]
