[{"name":"蘇昭瑾","email":"f10913@ntut.edu.tw","latestUpdate":"2009-02-24 08:09:41","objective":"Surface science and chemistry play important roles in many real processes: they are intimately involved in heterogeneous catalysis, in thin film production, in semiconductor devices fabrication, and in nano-technology. Over the past half century, chemists and physicists have developed elaborate instrumentation to elucidate the arrangement of the atoms on the surface, the surface composition, and the surfaces reactivity, which all impact significantly in many aspect of high-tech. related science. Therefore, I have design this course to elucidate the gas-solid interfacial phenomena, principles and techniques of surface science and its application to meet the increasing demand for analysis of solid surfaces in both the “academic” and “technological” fields.","schedule":"02/17\nPrinciple　　Introduction to Surface Science\n02/24-03/17　　　　From Single Crystal, Single Crystal Surfaces to Structure of Solid Surfaces\n03/24-03/31　　　　Adsorption, Bonding and Kinetics of Surface Adsorption\n04/07 　　　　Get Ready to Surface Science\n04/08　　Mid Term Examination\n04/15\nTechnique\nElectron-material Interaction\n04/21-04/28　　　　Electron Spectroscopy:\nX-ray photoelectron Spectroscopy (XPS) Auger Electron Spectroscopy (AES)\n05/05\nLow Energy Electron Diffraction (LEED)\n05/12-05/19　　　　Scanning Probe Microscopy:\nScanning Tunneling Microscopy (STM)\nAtomic Force Microscopy (AFM)\n05/26　　　　Temperature Programmed Desorption (TPD)\n06/02　　　　Surface Vibrational Spectroscopy (HREELS, FT-IR)\n06/09　　Final Examination\n06/16　　Final Report\n","scorePolicy":"Mid Term Examination: 35%　　　　Final Examination: 35%\nFinal Report: 20%　　　　　　　　Absent and Tardy: 10%\n","materials":"1.　　Surfaces, Gary Attard and Cobin Barnes, Oxford Chemistry Primers Vol.59, Oxford Science Publications. 1998, ISBN 0-19-855686-1\n2.　　Principles of Adsorption and Reaction on Solid Surfaces, Richard I. Masel, Wiley Series in Chemical Engineering, 1996, ISBN 0-471-30392-5 (handout)\n3.　　http://www.uksaf.org/tutorials.html\nhttp://www.siu.edu/~cafs/surface/\nhttp://www.xpsdata.com/useful_books.htm#Specialty%20Topics\nhttp://www.physics.rutgers.edu/lsm/pages/\n","foreignLanguageTextbooks":false}]
