[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2009-02-26 18:05:35","objective":"本課程藉由各式議題，讓同學深刻瞭解全球化的浪潮及國際競爭力的迫切性；並佐以大使們周遊列國的國際視野分享，透過了解台灣與其他國家在經濟文化教育上的比較，讓同學們能完全接受多元文化的不同點，進而去尊重多元文化，而後，達成融合多元文化的視野；最後，讓同學們對於國際觀的態度能更積極主動，鼓勵同學以具體行動關懷國際事務。　　\nCourse Description: This course aims to broaden students' views on a multitude of global concerns. Globalization is a reality and shaping a new identity, by which individuals and nations constructs their strength of empowerment. Honorable ambassadors and envoys stationed in Taiwan are invited to share their insightful views based on their substantial knowledge and abundant international exchange experiences. It is hoped that all NTUT students openly embrace diversified cultures as well as actively participate in all world events.\nCourse Objectives:  At the successful conclusion of this course, students shall be able to \n(1)　　demonstrate a thorough understanding of diplomatic views of the world\n(2)　　understand the complexity of international diplomacy \n(3)　　identify opportunities and benefits of participating in global cultural, political and economic activities\n(4)　　examine different ways of how diplomatic work influences politics, economy, cultural development and multilateral cooperation at both global and regional levels\n(5)　　articulate what it means and requires to be a globally competent citizen and prospective leader\n","schedule":"Weekly Syllabus\n\nWeek/ Date　　Lecture Session Issues 　　Session Speaker \n1_ Feb. 19　　Orientation / Introduction to Globalization: the Multiple Faces of Rising powers  　　Dr. Yun-Hua Yang\n3_ Mar. 5 　　New International Frontier: Taiwan Merchants at Foreign Land 　　\n4_ Mar. 12　　Global Views: A Kaleidoscope　　\n5_ Mar. 19　　New ROC Diplomatic Views 　　\n6_ Mar. 26　　Ambassador’s Epic Stories 　　\n7_ Apr. 2　　Cultural Diversification and Global Competitiveness: Taiwan and the World 　　\n","scorePolicy":"Course requirements: \nEach student must fulfill the following requirements:   \n(1)　　Students are required to attend all lectures; punctuality is prioritized. Lateness for twenty minutes (after 6:50 pm) is considered as an unexcused absence. \n(2)　　A brief reflection regarding each lecture is required for all students enrolled in this class. Reflection papers can be written in either Chinese or English. The minimum word count is 300 in English and 500 in Chinese for each paper. In addition, one final reflection paper to review the course is required.  All papers need to be typed. Handwriting materials are not permitted for submission and grading. \n(3)　　Students are invited to share with the class their ideas and opinions regarding the previous and current lecture(s). \n(4)　　Participate in course activities and respond to questions in class discussion if necessary. \n\nGrading:\nAssignment:\n(1)　　Five lecture reflection papers 10% each \n(2)　　One final reflection paper 10%　　60%\nAttendance (Each absence will result in a penalty of grade deduction of 10%.)　　40%\n*(The grading policy is subject to contingent alternations as the class proceeds.)\n\n","materials":"N/A","foreignLanguageTextbooks":false}]
