[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2009-03-05 22:05:42","objective":"為什麼要閱讀或研究莎士比亞? Catherine Belsey 回答道：是為了莎翁的獨特性。如她所言：「莎士比亞不僅是英語世界上流社會文化的精華，亦為其整體文化的精髓。」因為莎劇的辭彙，迄今仍通用於英語世界，並已融入日常生活之結構中。這現象不僅發生在現在的英國，自莎翁的時代開始，莎翁的語彙在全世界就從未停止流通過。何況，莎翁震撼人心的詩歌和劇場藝術，無人出其右的人性掌握，以及非凡的人生哲學思維與洞見，向來受到世人的珍愛。如世人常謂：莎士比亞的語言可觸發我們的想像力，為我們在人生的各個層面(包括職業層面)提升溝通效率。為了這些重要的理由，本課程將引導學生欣賞莎士比亞的若干劇作。","schedule":"Syllabus\n02/16  General Introduction \n\n02/23  Hamlet\n\n03/02  Hamlet\n\n03/09  Hamlet\n\n03/16  Hamlet\nOral Presentation on Hamlet\nStudent 1: Josephine　　　　Student 2: Jasmine　　　　Student 3: Grant\n\n03/23  King Lear\n\n03/30  King Lear\n\n04/06  King Lear\n\n04/13  King Lear\nOral Presentation on King Lear\nStudent 1: Vita　　　　　　Student 2: Nook 　　　　Student 3: Monica\n\n04/20  Othello\n\n04/27  Othello\n\n05/04  Othello\n\n05/11  Othello\nOral Presentation on Othello\nStudent 1: Gloria　　　　Student 2: Clare　　　　Student 3: Annie\n\n\n05/18  Macbeth\n\n05/25  Macbeth\n\n06/01  Macbeth\n\n06/08  Macbeth\nOral Presentation on Macbeth\nStudent 1: Eva Chen　　　　Student 2: Grant\n\n06/15  Position papers presentation.\n\n","scorePolicy":"Grading policy:\nAttendance and class performance: 30%, oral presentation: 30%, position papers: 40%\n","materials":"Requirements\nReadings:\nBooks: All refer to annotated editions that provide useful background information, a performance history, and invaluable notes.\nHamlet (Norton Critical Edition)\nKing Lear (Arden Shakespeare)\nOthello (Arden Shakespeare)\nMacbeth (New Cambridge Shakespeare)\n\nOral presentation:\nYou are required to deliver two oral presentations: one on a particular play and the other on your position paper, which usually focus on some controversial issues in and about the texts you have read. For the presentation on a particular play, you may concentrate on any aspect of the play chosen (a scene, an act, an issue, a problem, a dramatic element, a dramatic convention, a dramatic device, a theme, etc.) and discuss it in relation to the play and/or all of the four plays. For the presentation on your position paper, you will be given 15 minutes for the task and leave 4 minutes for discussion. The length of the position paper is 4-5 pages. For detailed advice on writing a position paper, you may consult this website: http://web.ceu.hu/writing/position.htm.\n","foreignLanguageTextbooks":false}]
