[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2018-02-07 15:33:59","objective":"本課程幫助學生習得敘述、描寫、推論、議論、省思、說明等文體方面的寫作技巧，並指導學生從閱讀、圖片、日常生活事件，及課堂討論內容中取材，以加強邏輯思考和流暢寫作能力。\nThis course aims to develop and reinforce students' strengths to create unified and coherent pieces of composition in a variety of styles--narrative, descriptive, argumentative, reflective, and expository. Students will be guided to write in response to readings, pictures, events in their daily lives, and discussions from the class. Thought-provoking topics dealing with current issues are used to stimulate and foster critical writing strategies. This course enables students to write and discuss logically and clearly; they also need to incorporate grammatically newly-built vocabulary into their writing.","schedule":"February 26 (Monday), moved from March 1\nMarch 8/15, Ch 2 Reading for the central idea\n　　Appendix, Ch 23 Articles\n　　Task: Find a topic and relevant articles, a story about the topic\nMarch 22/29, Ch 3 Supporting the central idea\n　　Ch 9 Basic editing, Ch 10 Sentence fragments\n　　Task: Identify central idea and supporting data, defining the topic\nApril 5, holiday\nApril 12/19, Ch 4 Unity and coherence\n　　Chs 17~19 Punctuation 1, Chs 20~22 Punctuation 2 and mechanics\nApril 26, mid-term paper due\nMay 3/4 (from May 10), Ch 5 Summarizing and responding to reading\n　　Ch 11 Fused sentences and comma splices, Ch 12 Verb tense and voice\nMay 15 (from May 17)/24, Ch 6 Evaluating reading selections\n　　Ch 13 Subject-Verb agreement, Ch 14 Pronoun agreement and reference\nMay 31/June 7, Synthesizing ideas from reading selections\n　　Ch 15 Pronoun case, Ch 16 Misplaced and dangling modifiers\nJune 14/21, Oral presentations\nJune 28, papers due\nEND","scorePolicy":"Final paper/presentation: 20%/20%\nMid-term paper: 10%\nWeekly homework: 30%\nSeat work and quizzes: 20%\nEND","materials":"McDonald, Stephen and William Salomone. 2012. The writer's response: A reading-based approach to writing. Boston: Cengage. 978-0-495-90626-1","foreignLanguageTextbooks":true}]
