[{"name":"楊士萱","email":"shyang@ntut.edu.tw","latestUpdate":"2017-12-10 20:58:23","objective":"This course Linear Algebra\n- is a mathematics course.\n- is useful and fundamental to EECS (and many other discipline) students.\n- emphasizes both computations and concepts.\n- asks you to use mathematical software packages (MATLAB, Scilab, or GNU Octave).\n- guides you to read an English textbook.\n- requires hard work.","schedule":"1. Linear Equations \n- To understand the basic terminologies and notations of matrices and systems of linear equations, in the forms of vector equation and matrix equation.\n- Solving a system of linear equations with the Gaussian elimination: reducing a matrix to its echelon form. \n- To interpret a system of linear equations in various ways.\n- First exposure to key concepts such as linear independence and linear transformation. \n* Test #1\n2. Matrix Algebra \n- To learn basic matrix arithmetic operations: addition, subtraction, multiplication power, transpose, and inverse.\n- To summarize the concepts for systems of n linear equations in n unknowns. \n* Midterm Exam\n3. Vector Spaces \n- Introduction to vector spaces. \n- Fundamental subspaces of a matrix: column space, row space, and null space.\n- Basis and dimension of a vector space. \n* Test #2\n4. Eigenvalues and Eigenvectors\n- To understand the meaning of eigenvalues and eigenvectors of a matrix, and the approaches to find them. \n- Diagonalization of a matrix (linear transformation).\n5. Orthogonality and Orthogonal Bases \n- To introduce inner product of vectors, and thus the geometric concepts of length, distance, and angle (perpendicularity).\n- To be familiar with the use of orthogonal bases.\n- Least-Squares approximation. \n* Final Exam","scorePolicy":"1. Written exercises, 20%. Hand in your homework every Wednesday right before class. (The lowest score will be discarded.) 請於一上課時繳交紙本\n2. Programming assignments (12%) and MATLAB/Scilab projects (8%). Submit the assignments through 北科i學園 (TaipeiTech iSchool, http://www.ischool.ntut.edu.tw/).\nFor Parts 1 and 2, discussion is encouraged but plagiarization (抄襲) is prohibited.\n3. Two 50-minute tests, 10% each. (20%)\n4. Midterm exam and final exam, 20% each. (40%)\n5. Attendance and warm-up quizzes, 5% (extra, 包含上課和習題演習，習題演習參加4次即可獲得習題演習出席的最高分)","materials":"Textbook: \nDavid. C. Lay, Stephen R. Lay, and Judy J. McDonald, Linear Algebra and its Applications, Fifth Edition, Pearson Education Limited, 2016. （偉明書局代理）\n\nGood References :\n1. Introduction to Linear Algebra with Applications by J. Defranza and D. Gagliardi. \n2. Elementary Linear Algebra by Howard Anton. \n3. Linear Algebra and Its Applications by Gilbert Strang.\n\nClassroom Rules (上課規範):  “尊重自己、也尊重他人學習的權益”\n1. 請準時上課，不遲到早退。\n2. 非經允許，上課時不可使用手機、平板、筆電等電子用品。手機請關機或調成靜音。\n3. 上課時請專心於此課程之學習，非討論時間請避與他人交談。\n4. 如有短暫急事，得在不影響他人上課的情形自行離開教室，處理後迅速回來。\n5. 如有事無法出席請盡量事先請假，並須有相關證明文件。\n6. 違反以上規範者，將視情節輕重扣分。","foreignLanguageTextbooks":true}]
