[{"name":"王怡鈞","email":"bnwntut8@ntut.edu.tw","latestUpdate":"2018-02-23 15:27:08","objective":"(English description is shown in the last paragraph)\n\n由於雲端運算的快速發展，大量資料收集與儲存技術已成瓶頸，大數據技術與管理提供一套具延展性與容錯能力的分散儲存與計算架構, 能有效處理大量複雜數據資料的儲存與運算。\n\n本課程除介紹現有的大數據生態與趨勢，並針對目前軟硬體架構的處理瓶頸，提供系統組態與部署、服務層級協定、監控與管理等系統性規劃的解決方案，並導入跨領域的工程管理科學知識。課程簡扼論述大數據技術與管理的重要，並在Hadoop生態系統中，以Cloudera Hadoop為應用範例，實作說明其重要性。\n\n課程內容包括：大數據的概念、應用生態與趨勢、Hadoop硬體規格與基礎架構規劃、叢集組態與部署、叢集服務層級協定、叢集監控與管理、相關生態技術、線上操作實習、以及概略介紹Hadoop認證與準備。\n\nBecause we are generating more data and faster than ever before. Although we can store and process the data, there are problems using existing techniques. For example, both accessing the data from disk in distributed systems and getting data to the processors are of the typical bottlenecks. Apache Hadoop Big Data technology is capable of eliminating the bottlenecks by its unique methods for storing and processing data per common application scenario.\nThe course will introduce Apache Hadoop core technologies and administration with its major listed below:\n　　Big Data in demand and its application trend\n　　Core technologies of Hadoop for Big Data management \n　　Management tool to simplify Hadoop Administration  \n　　Hadoop cluster deployment\n　　YARN applications including MapReduce  \n　　Hadoop cluster hardware and software \n　　Deployment of Hadoop ecosystem projects: Sqoop, Flume, Hive and Impala \n　　HDFS configuration for high availability\n　　Hadoop security \n　　Cluster resource scheduling and configuration \n　　Cluster monitoring and management\n　　Hadoop certification program\n        Hands On Lab","schedule":"「大數據技術與管理」課程進度表(Syllabus, preliminary)\nTue. 18:30-21:10\n\nWeek#週次               課目(視需要調整) - Subject to change per needs and circumstances \n1      2/27　　　　Syllabus &amp; organization of all mission cases from the class\n2      3/06　　　　Big Data demand and trend\n3      3/13　　　　Core technologies for Big Data management\n4      3/20　　　　Hadoop cluster deployment\n5      3/27　　　　MapReduce  \n6      4/03　　　　YARN Applications\n7      4/10　　　　Hadoop Distributed File System \n8      4/17　　　　Hands On Lab-1\n9      4/24　　　　期中考 (Mid Exam or Report)\n10    5/01　　　　Planning Hadoop Cluster\n11    5/08　　　　Hands On Lab-2\n12    5/15　　　　Hadoop ecosystem projects - Sqoop and Flume \n13    5/22　　　　Hadoop I/O \n14    5/29　　　　Case Study and Demonstrations-I\n15    6/05　　　　Case Study and Demonstrations-II\n16    6/12　　　　Hadoop security &amp; Managing resources \n17    6/19　　　　Hadoop Certification Program &amp; Cases presentations \n18    6/26　　　　期末考(Final Exam or Report)","scorePolicy":"1.作業- Assignment including Report, Hands on Lab  and Presentation：40%\n2.期中考 或 研讀報告 (Mid-Term Exam or Study Report)：30%\n3.期末考 或 研讀報告 (Final-Term Exam or Study Report)：30%","materials":"Reference: 參考書目 ( 參考資料:視需要隨課提供)\n\n1.　　Hadoop: The Definitive Guide, Fourth Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Tom White\n2.　　Hadoop Essentials, First Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Shiva Achari.\n3.　　Hadoop Operation, First Edition, September 2012, Published by O’Reilly Media, Inc., Editor: Eric Sammer","foreignLanguageTextbooks":true}]
