[{"name":"陳嬿汝","email":"yanruchenkimki@gmail.com","latestUpdate":"2018-01-19 17:38:59","objective":"【Objectives   課程目標】\n1.　　能使用漢語拼音。 \nBe able to use Hanyu Pinyin System.\n2.　　具備認讀漢字之能力，以及學會漢字的結構、筆順及寫法。 \nHave the ability to recognize and read Chinese characters, and to learn the structure, stroke orders and writing of Chinese characters.\n3.　　了解華語基本文法、語序及架構。 \nLearn basic Chinese grammar, word order and structure.\n4.　　具備使用華語自我介紹、認識朋友、買東西等日常會話之能力。\nHave the ability to have daily conversation in Chinese to give self-introduction, to make friends, and to go shopping, etc.\n\n【Class Expectations  上課要求】\n學習語言就像是學習樂器或進行運動訓練，都需要不斷的練習和堅持。所以，上課前的準備、上課準時，上課時主動參與都非常重要。根據這門課的評分標準，如果你常常缺課、常常遲到，或是沒有準備就來上課，期末成績一定會受到影響。 \nLearning a foreign language is like learning to play a musical instrument or training for a sport. They all require commitment and practice. Therefore, preparation before class, as well as punctual attendance and active participation in class is the key to your success in this class. According to our grading system, absences, coming to class late or without preparations will inevitably result in a lower final grade.\n\n【Class Policies   上課規定】\n1.　　上課缺席：如果需要請假，請一定要在上課以前寄電子郵件告訴老師。\nAbsences: Formal request for excused absences in writing is required. Please send e-mail to notice Chen laoshi before class.\n2.　　每次上課一開始的時候都會有小考，曠課的同學不能補考，請假的同學那次小考成績不會計算。如果你因為家庭或健康因素無法參加期中考試和期末考試，請儘快告訴陳老師安排補考。\nEach class will begin with a quiz on the lecture and material assigned. No make-up quizzes will be given for unexcused absences. If you have to miss midterm exam or final exam due to family or medical emergencies, you should inform Chen laoshi immediately and make up the test as soon as possible.","schedule":"【Learning Schedule  學習進度】\n週次　　日期　　課程內容\n1　　　　2/28 　　二二八放假                  Peace Memorial day (NO CLASS)\n2　　　　3/7　　        大綱解說                      Introduce syllabus\n3　　　　3/14　　        第三課  你喜歡什麼？        Chapter 3.  What do you like?\n4　　　　3/21 　　第三課  你喜歡什麼？        Chapter 3.  What do you like?\n5　　　　3/28　　        第三課  你喜歡什麼？        Chapter 3.  What do you like?\n6　　　　4/4　　        兒童節放假                  Children's Day (NO CLASS)\n7　　　　4/11         第三課  你喜歡什麼？        Chapter 3.  What do you like?\n8　　　　4/18　　        第三課  你喜歡什麼？        Chapter 3.  What do you like?\n9　　　　4/25　　        期中考                      Midterm exam \n10　　　　5/2　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n11　　　　5/9　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n12　　　　5/16　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n13　　　　5/23　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n14　　　　5/30　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n15　　　　6/6　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n16　　　　6/13　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n17　　　　6/20　　        第四課  這個東西多少錢？    Chapter 4.  How much is it?\n18　　　　6/27　　        期末考                      Final exam","scorePolicy":"【Course Grading  課程評分】\n 出缺席與課堂表現　　Attendance and class performance　　20%\n 每次上課小考　　Quizzes　　20%\n 作業　　Homework　　20%\n 期中考　　Midterm exam　　20%\n 期末考　　Final Exam　　20%\n\n※請準時交作業，如果遲交一次扣10分，遲交第二次則為0分。\nPlease hand in your homework on time. The first time you do not hand in the homework, 10 points will be taken away. Your grade will be 0 from the second time.\n\n※如果超過三次沒來上課（包含請假及曠課），則期末總成績將降低10分。例如，原來的期末成績是90分，缺席三次就變80分，缺席六次就變70分，以此類推。\nIf you are absent for classes for three times or more (including both excused and unexcused absences), your final grade will be automatically lowered by 10 points (e.g. \"90\" will be lowered to \"80\" and so on) for every three absences you have.","materials":"教師自編教材             \nTeacher self-compiled materials","foreignLanguageTextbooks":false}]
