[{"name":"胡憲倫","email":"allenhu@ntut.edu.tw","latestUpdate":"2018-02-20 15:16:16","objective":"Global environmental and sustainability problems, such as pollution, climate change, poverty etc. are so huge and complicated, hence for solving those problems one must analyze and see things from a boarder and systems perspective, so that one will not fix one problem but create another problem to somewhere else or sometime in the future. In this course, students will be taught how to think in a holistic way when dealing with global environmental and sustainability problems and solve them from systems perspective. Students also will also be taught the systems dynamic modeling technique, and SD software, Stalla, will be used for students to practice how to solve problem dynamically. Actually, similar technique will also be applied to individuals for helping their personal life.\n全球環境及永續發展問題的解決，必須從宏觀的視野分析及規劃，並擬定能適合符合當地的策略及做法，方能竟其功。本課程著重在從系統的角度，辨別及解決環境問題。學生將會學到了解何謂系統思考、環境系統運作的基本原理、環境系統化管理的工具，以及環境系統動態模擬軟體Stella，並學習如何實際模擬各種環境問題。","schedule":"1. Overview of Environmental Systems; Systems Thinking, Systems Analysis and Systems Management Tools\n綜覽系統、系統思考、環境系統分析及環境系統管理等議題\n2. System Structure and Behaviors \n系統的基本介紹及系統行為\n3. Systems and Us\n系統與我們(生活中的系統)\n各種基模(Archetype)的學習與應用\n4. Creating Changes- in Systems and in Our Philosophy\n如何運用系統特行來創造個人及世界的美好\n5. Dr. Lin’s Lecture\n6. Stella Software Practice (I)\nStalla軟體操作介紹（一）\n7. Stalla Software Practice (II)\nStella軟體操作介紹（二）\n8. Stalla Software Practice (III)\nStella軟體操作介紹（三）\n9. Basic Modeling Concepts in Environmental Systems Models\n10. Strategies for Analyzing and Using Environmental Systems Models;\n11. Modeling Surface Water Contamination\n12. Modeling Mobile Source Air Pollution Inventories\n13. Atmospheric Chemistry and Pollution Transport","scorePolicy":" Participation and Homework：30 %  \n Tests：30 %\n Team Project (Report and Oral Presentation)： 40 %","materials":"教科書\n1.　　Meadows, D.H. Thinking in Systems, A Primer, Chelsea Green Publishing, 2008\n2.　　Deaton, M.L. and J.J. Winebrake, Dynamic Modeling of Environmental Systems, Springer, 2000\n3.　　isee systems. Introduction to Systems Thinking, STELLA Software, 2004\n參考書目\n4.　　Ford, A. Modeling the Environment- An Introduction to System Dynamics Modeling of Environmental Systems, Island Press, 1999\n5.　　王承豪譯，約瑟夫．歐康納，艾思．麥克德摩/著，系統思考實用手冊－第五項修鍊完全攻略本，世茂，1999年\n1.　　陶在樸著，系統動態學－直擊「第五項修鍊」奧秘，五南，2003\n2.　　高中一(譯)，Meadow, D., Randers, J. and D. Meadows著，成長的極限－三十週年最新增訂版，臉譜，2007\n3.　　齊若蘭譯，Peter Senge原著，必要的革命-個人與組織如何共創永續社會，天下文化，2010\n4.　　其他補充資料","foreignLanguageTextbooks":true}]
