[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2017-12-15 18:15:33","objective":"課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。","schedule":"Course Aims:\n\nThe course provides students with skill-based instructions in learning how to read literary and cultural texts. Desired learning outcomes include reading skill development, vocabulary building, language analysis, and critical thinking. Reading materials encompass a variety of viewpoints on global topics centered on social issues, the environment, psychology, business, and technology. Extended activities are designed to encourage students to go beyond the assigned materials, and to put what they have acquired from the readings into listening, speaking and writing practices.\n\nFocus for Spring 2018: Art and Life (Wednesday)\n\nWeek 1: Public holiday (no class) \nWeek 2: Introduction: Keats, ‘This Living Hand,’ Borges, ‘Borges and I’\nWeek 3: Rope (dir. Hitchcock)\nWeek 4: Rope \nWeek 5: Nietzsche 　　\nWeek 6: Public holiday (no class) \nWeek 7: Ibsen, The Master Builder 　　　　　　\nWeek 8: Ibsen\nWeek 9: Mid-term examination\nWeek 10: Screening of Terrorizers (dir. Edward Yang)　　　　　　　　\nWeek 11: Terrorizers　　　　\nWeek 12: Terrorizers　　\nWeek 13: The Story of the Stone (Chapter 1) \nWeek 14: The Story of the Stone (Chapter 1) \nWeek 15: Freud, ‘Creative Writers and Day-Dreaming’　　　　\nWeek 16: Freud　　　　 \nWeek 17: Final examination　　　　　　　　　　　　\nWeek 18: Voluntary guided tour: (TBA)","scorePolicy":"Teaching Approach:\n\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend lectures, participate in discussions in tutorials, take a mid-term examination, give a group presentation, and write an essay. \n\nAssessment:\n\nParticipation and Quizzes　　　　　　10%\nGroup Presentation　　　　　　　　　　20%\nMid-term exam　　　　　　　　　　        30%\nFinal exam　　　　　　　　　　　　30%    \n　　　　　　　　　　　　　　      100%","materials":"Bibliography 　　\n\nBorges, Jorge Luis.  ‘Borges and I.’ Labyrinths. Trans. James E. Irby. New Directions Publishing Corp. 1962. \nButler, Judith. Precarious Life: The Powers of Mourning and Violence. London and New York: 2004. \nCalvino, Italo. ‘Why Read the Classics?’ Trans. Patrick Creagh. The New York Review of Books 33.15 (9 October 1986).\nFreud, Sigmund. ‘Creative Writers and Day-Dreaming.’ 20th Century Literary Criticism. Trans. James Strachey et al. Ed. David Lodge. London and New York: Longman, 1972. 36-42.\nIbsen, Henrik. ‘The Master Builder.’ The Master Builder and Other Plays. Harmondsworth: Penguin, 1958. 121-212.\nKeats, John. ‘This Living Hand, Now Warm and Capable....’ John Keats: The Major Works. Oxford: Oxford University Press, 2008. 331.\n---. ‘Why the Novel Matters.’ 20th Century Literary Criticism. Ed. David Lodge. London and New York: Longman, 1972. 131-185.\nRope. Dir. Hitchcock. Writ. Hume Cronyn and Patrick Hamilton. Perf. James Stewart, John Dall and Farley Granger. 1948. Warner Bros. Pictures, 2006. DVD. \nThe Terrorizers. Dir. Edward Yang. Writ. Edward Yang and Hsiao Yeh. Perf. Cora Miao, Bao-ming Gu, and Wang An. 1986. Central Motion Pictures. DVD.","foreignLanguageTextbooks":true}]
