[{"name":"談玉儀","email":"tanyuhyi@gmail.com","latestUpdate":"2018-04-13 11:34:15","objective":"課程旨在以跨領域的思考方法，融合文學與批判理論，探討特定主題如何在作品中呈現，思考在不同文化背景和歷史脈絡中的意義，以訓練學生運用和整合在其他學科，甚至其他學術領域學到的能力：諸如藝術和文學風格，社會和哲學思潮等。透過對文本（文學、電影、和其他藝術領域）的細讀和理論的思考和運用，學生可進一步應用跨領域專題研究的方法。可能的專題包括：文學與復仇文化、文學與音樂、電影中的愛與慾、文學與哲學等。","schedule":"週次　　月/日　　內                      容\n第1週　　3/1　　　　Orientation and General Introduction (literary devices and theoretical approaches)—ppt 1\n　　加入Facebook社團名稱: 1062電影中的愛與慾\n　　Film Appreciation: Sally Potter’s Tango Lesson\n第2週　　3/8　　Section 1 / Postmodernism: Georges Bataille —ppt 2\n　　Reading: “Introduction” and “Eroticism in Inner Experience” from Erotism (p. 29-39)—handout1 (w) \n第3週　　3/15　　Section 1 / Postmodernism: Sally Potter—ppt 3\n　　Reading: Potter’s Tango Lesson screenplay (p. 1-12) — handout 2 \n　　Theory Application: Tango Lesson\n第4週　　3/22　　Section 1 / Postmodernism: Roland Barthes—ppt 4\n　　Reading: “The Death of the Author” and “From Work to Text”— handout 3\n第5週　　3/29　　Section 2 / Feminism: Laura Mulvey—ppt 5 \n　　Reading: “Visual Pleasure and Narrative Cinema” — handout 4\n　　Theory Application: Alfred Hitchcock’s Rear Window\n　　Group Oral Report 1 (張乃婷/ Phuong Thuy)\n第6週　　4/5　　Holiday \n第7週　　4/12　　Section 2 / Feminism: Judith Butler —ppt 6\n　　Reading: “Subversive Bodily Acts” from Gender Trouble (p. 128-141) — handout 5 (W)\n　　Theory Application: Sally Potter’s Orlando\n　　Group Oral Report 2 (Luke / Dong)\n第8週　　4/19　　Section 2 / Feminism: Virginia Woolf—ppt 7\n　　Reading: A Room of One’s Own— handout 6 (W)\n　　Theory Application: Marleen Gorris’ Mrs. Dalloway (1997)\n　　Group Oral Report 3 (黃敏輝/辛芳誼/姚思綺)\n第9週　　4/26　　Section 3 / Psychoanalysis: Sigmund Freud —ppt 9\n　　Reading: “The Uncanny”, “Fetishism” and “Chapter 5: The Material and Sources of Dreams” from The Interpretation of Dreams — handout 8\n　　Theory Application: Scorsese’s The Age of Innocence\n　　Group Oral Report 4 (Ngoc Uyen/Le Thanh Tam/Le Thi Bang Tam)\n第10週　　5/3　　Section 3 / Psychoanalysis: Julia Kristeva 1 —ppt 10\n　　Reading: “New Forms of Revolt” and “Noëlle McAfee’s “Inner Experience and Worldly Revolt”— handout 9\n　　Theory Application: The Grandmaster and The Assassin (王家衛的宮二與侯孝賢的聶隱娘)\n　　Group Oral report 5(周杰霆/邱致恆/顏郁哲)\n第11週　　5/10　　Section 3 / Psychoanalysis: Final Project Sample 1—ppt 8\n　　PPT Review and Film Appreciation: Kar Wai Wong’s In the Mood for Love (王家衛的《花樣年華》)\n第12週　　5/17\n補課到\n19:00　　Section 3 / Psychoanalysis: Final Project Sample 2 \n　　General Discussion and reading Teresa’s sample paper “Against the Lure of the Fetish” — handout 7 \n第13週　　5/24　　Section 3 / Psychoanalysis: Julia Kristeva 2 —ppt 11\n　　Reading: “Stabat Mater” and “Motherhood Today”— handout 10\n　　Theory Application: Terence Davies’ The House of Mirth\n　　Group Oral report 6 (江志堯/廖文/陳嵩元)\n第14週　　5/31　　Section 3 / Psychoanalysis: Jacques Lacan —ppt 12\n　　Reading: “The Mirror Stage as Formative of the Function of the I as Revealed in Psychoanalytic Experience”— handout 11\n　　Theory Application: 2046\n　　Final Paper Briefing (Abstract, Key words, outline, works cited due)\n第15週　　6/7　　Section 3 / Psychoanalysis: Melanie Klein 1—ppt 13\n　　Reading: “The effects of early anxiety-situations on the sexual development of the girl” — handout 12\n第16週　　6/14　　Section 3 / Psychoanalysis: Melanie Klein 1—ppt 14\n　　Reading: Klein’s “Mourning and its relation to manic-depressive states (1940)” — handout 13\n　　Theory Application: Iain Softley’s The Wings of the Dove (1997)\n第17週　　6/21　　Individual Final Oral Report (1) \n第18週　　6/28　　Individual Final Oral Report (2)","scorePolicy":"A. Attendance and Participation in Discussion (20%)出勤:\n　　   It is necessary to be punctual in the class. Regular attendance and voluntary participation in the class and discussion are cordially invited and will be valued, especially on responding feedbacks to the reports. You are expected to come to class with well-preparation of your assigned readings and reports. If you miss more than 2 classes, you will not only lose your 10% attendance score but also your grade and reading progress will be so seriously affected that you would confront the problem of failing this course. 2 times of being recorded as arriving late is considered as 1 absence. However, the best policy is to be punctual and well-prepared to discuss the assigned reading materials and handouts. It is advisable for any student with special medical problem who informs the teacher of his/her health situation regularly.    \nB. Theory-application Oral Presentation (30 %) 口頭報告\nEach group (2 persons) will be assigned to give one oral presentation (30 %), which is required to be demonstrated around 15-20 minutes. The timer will be ready for the control of the time. The pattern of an oral presentation would be suggested as follows. (1) A presentation must be relevant to the understanding of one assigned theoretical article and a theory-application to a related theory. (2) Highly encouraged for each student is the use of audiovisual materials (powerpoint format slides with pictures, videotapes, audio recordings, web pages) to the teacher 2 days earlier to the teacher’s mail-box or facebook (3) The use of related recommended books and websites reference (as attached at the end of teacher’s powerpoints) will make each presenter’s score higher. (4) For sharing a presenter’s thought to other class member, s/he should print out the report. The student who is absent from the oral report will be penalized with 0 score unless the student provides the teacher with a reasonable rationale.\nC. Abstract + Key Words (10%) and the Final-paper Oral Presentation (10%)\n   The students are expected to hand in their abstracts and key words and do a very 2-3 mins short briefing on their proposed approach on the 14th week, so that the teacher could know whether their approach and writing method are on the proper direction. It is preferable for the students to prepare audiovisual materials to make their draft oral reports more effective on the final-paper oral presentation held on the 17th and 18th weeks. Make sure that every student in the class has one copy of the audiovisual materials. At the same time, the student would have a chance to receive the feedbacks from either the teacher or other classmates who could not only point out his/her blindness and weakness but also give the draft-holder some suggestions to improve his/her final paper.          \nD. Final Paper (30 %)\nThe students are expected to have the necessary background in analyzing and responding to literature, as well as the ability to conduct independent research and to write correctly documented research essays using MLA format (the latest version). The teacher could require revisions of any paper that is hard to read because of mechanical errors and inherent structure. The students are encouraged to get extra help with basic writing skills in college level.     \nFor the written paper, you are required to demonstrate an understanding of a thematic written paper with an appropriate theory that you’ve learned from this course in the context of two given films, The Tango Lesson and In the Mood for Love (which counts for 30 %). As for the thematic focus, you could concentrate on one of the following aspects: (1) literary devices (such as a comparative/contrastive analysis of character(s), tone, setting, symbolism, plot, and point of view), (2) a theoretic appreciation of either of one approach from the psychological, postmodernist, and feminist methods. The written final paper must have at least 3 parts, namely the “Introduction,” “Body,” and “Conclusion,” your thesis statement should be","materials":"Theory and Criticism (Norton 2001 or 2010 2nd version) and other handouts Supplemental readings and materials may be assigned at the instructor’s discretion.","foreignLanguageTextbooks":true}]
