[{"name":"蘇評揮","email":"jphhu@yahoo.com","latestUpdate":"2018-02-21 18:55:23","objective":"新能源車輛技術發展與實務工程Green Vehicle Technology Development and its Industry Engineering Practice(1)　　Teaching Objective\n　　To educate student to have a general comprehensive knowledge on green vehicle industry status, regulation, policy, powertrain technology and its Industry Engineering Practice including the development and maintenance processes of the powertrain, transmission, energy, control systems, and the industry practice at the product development center or the service station of the car company. \n　　The powertrain system will include the mild-hybrid, full hybrid, pure motor drive, and fuel cell systems. The energy system will include the introduction of the lead acid, nickel-metal hydride, and lithium-ion batteries, and their charging-discharging mechanism and its management devices.\n　　This class will lead the students to be able to learn the process of the green vehicle development and also to have an\nopportunity to receive the lectures from the car maker experts on the car maker product development center or the service station.\n本課程在於讓學生對於新能源車輛產業及其工程實務有廣泛的了解，產業面包括產業現況、法規、政策、動力系統技術，工程實務則涵括動力、傳動、能源、控制等系統之開發及維護，及車輛業界產品開發中心及維修廠之企業參訪。課程中之動力系統將包括半複合動力、全複合動力、純電動車及氫燃料電池系統，能源系統將討論鉛酸電池、鎳鐵電池、鋰電池，及其充放電機制及管理系統。","schedule":"　　The class will start from the introduction of the green vehicle industry status, regulation, policy, powertrain technology and then followed by its Industry Engineering Practice on the car maker company. In order to train the student presentation capability, the class will be divided into several teams to present the progress bi-weekly. The lecture will also to be delivered by the industrial experts, and the contents will be as follows. \ni.　　Overview of world automotive industry; Internet of Vehicle, Green Vehicle Industry, and Business Model Innovation driven of Automotive Mega-Trend, status, and technology development -3 Wks\nii.　　From the Intelligent Transportation System (ITS) to Connected Vehicle or Internet of Vehicles including infrastructure, enabling technology, and standards for the better system operation – 3 Wks \niii.　　Fundamental Technologies on Green Vehicle Powertrain; Mild-Hybrid, Full-Hybrid, Pure Electric, and Fuel-Cell, -4Wks\niv.　　Fundamental Technologies on Green Vehicle Energy System; the introduction of the lead acid, nickel-metal hydride, and lithium-ion batteries, and their charging- discharging mechanism and its management devices -4Wks \nv.　　Green Vehicle Key Component Supplier Chain Development, Manufacturing, Quality Assurance-2Wks\nvi.　　Green Vehicle Industry Practice on Product Development, and Maintenance Service Practice and Level Certification- 2Wks","scorePolicy":"Teaching Methodology and Teaching Activities\n　　Lecture, team presentation, mid-term, and final tests will be covered as the attached chart.\n　　Bi-weekly presentation 25%\n　　Mid-Term test and presentation 35%\n　　Final test and presentation 40%","materials":"Textbook(s) and References\n　　Class notes will be prepared through government policy, industrial real-world practice, and up-to-dated mega trend to be integrated as an industrial general practices.","foreignLanguageTextbooks":false}]
