[{"name":"張文中","email":"wchang@ntut.edu.tw","latestUpdate":"2017-12-14 18:11:44","objective":"This Advanced Robotics and Automation Applications (ARAA) course is offered only for upto 14 graduate students with programming experience and prerequisite course 3105003 Modern Control Theory.  ARAA mainly focuses on experimental work on mobile robots and manipulators with topics of interest related to:\n高等機器人與自動化應用(ARAA)適合研究生修習，因設備因素限14人，須修過相關課程如3105003現代控制理論並具備程式能力。主要聚焦於移動式機器人與機械手臂實驗，相關主題如下：\n1. Spatial descriptions and transformations 空間描述與數學轉換 \n2. Manipulator kinematics 機械手臂運動學 \n3. Manipulator inverse kinematics 機械手臂反向運動學\n4. Linear control of manipulator 機械手臂之線性控制 \n5. Robot vision 機器人視覺 \n6. Optical inspection 光學檢測 \n7. Mobile robot obstacle avoidance 機器人避障 \n8. Quadcopter control 飛行器控制 \n9. Industrial automation applications 工業自動化應用 \n10. Experimental topics: manipulator and robot control, robot control system based on visual sensing, optical detection system 實驗項目：機械手臂及機器人操控、結合視覺感測之機器人控制系統、光學檢測系統","schedule":"1st Week 第1週. Introduction 簡介\n2nd Week 第2週. Mobile Robot Obstacle Avoidance-Mobile Robot Kinematics 移動式機器人避障-移動式機器人運動學\n3rd Week 第3週. Mobile Robot Obstacle Avoidance-Mobile Robot Obstacle Avoidance 移動式機器人避障-移動式機器人避障實驗\n4th Week 第4週. Optical Inspection Applications-Image Processing 光學檢測應用-影像處理實驗\n5th Week 第5週. Optical Inspection Applications-Optical Inspection 光學檢測應用-光學檢測實驗\n6th Week 第6週. Manipulator Control-Manipulator Control Simulations 機械手臂操控-機械手臂控制模擬\n7th Week 第7週. Manipulator Control-Manipulator Position Control Programming 機械手臂操控-機械手臂位置控制程式撰寫\n8th Week 第8週. Manipulator Control-Manipulator Gripping Task Experiment 機械手臂操控-機械手臂自動抓取實驗\n9th Week 第9週. Manipulator Control-Manipulator Precise Gripping Task Experiment 機械手臂操控-機械手臂精密抓取實驗\n10th Week 第10週. Vision-Based Control of Robots-Vision-Based Control of PTZ Camera 機器人之視覺控制-攝影機視覺控制實驗\n11th Week 第11週. Vision-Based Control of Robots-Mobile Robot Control with Onboard Vision 機器人之視覺控制-移動式機器人車載視覺控制實驗\n12th Week 第12週. Vision-Based Control of Robots-Control of Quadcopter and Vehicular Platform 機器人之視覺控制-四軸飛行器暨移動型載具控制\n13th Week 第13週. Final Project 1 期末專題1\n14th Week 第14週 Final Project 2 期末專題2\n15th Week 第15週. Final Project 3 期末專題3\n16th Week 第16週. Final Project 4 期末專題4\n17th Week 第17週. Fianl Presentation and Demo 期末簡報及展示","scorePolicy":"The final grade will be a weighted average of attendance 10%, experimental results 65%, and final project 25%.","materials":"Robotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke\nPublication Year: 2013 | ISBN 3642201431 | 1st Edition","foreignLanguageTextbooks":true}]
