[{"name":"王淑華","email":"","latestUpdate":"2018-03-13 12:16:51","objective":"An advanced study of English poetry with a comparative and cross-cultural perspective, this course focuses on the modern and the contemporary. Students are encouraged to read aloud, appreciate, analyze, appraise, appropriate and perform (sing, dance, draw, act) and write about the poems they learn. \n\n英國浪漫派詩人雪萊曾說，「詩人為人類立訂法則，雖然他們是沒有獲得認可的立法者」。或許詩人的確尚未普獲認可。但是詩一直是語言藝術中最獨特的一種，充分融合了口語功能和書寫文本的特性，不但兼具了哲學的深度和直接知覺的立即性，更巧妙結合了個人的想像世界和人類共同的文化傳承-神話、民間儀式和風俗。本課程將引導學生跳脫文字，透過討論、表演，以及音樂、電影和視覺藝術等方式進入嶄新的詩的世界。課程重點特別強調世界的詩歌和音樂的密切關聯，尤其是蘇格蘭歌謠、英國和美國的搖滾民謠、雷鬼、藍調、爵士以及嘻哈音樂。相關的則電影包括Dali和Bunuel的「安達魯之犬」、Cocteau的「奧菲斯」，以及 Marcel Camus的「黑人奧爾非」。透過詩、藝術、歌曲、電影、歷史、神話和文學理論等不同管道的薰陶，學生更能夠理解文化中具有美學深度的表達，並掌握其中的細膩和幽微，也就更能進一步深切體認藝術和文化相互形塑的魅力。","schedule":"Week 1.  Introduction of texts: Anthologies, E-Books, Internet resources. \nWeek 2.  What is Poetry / Selected Poems\nWeek 3.  How to read a poem / Selected Poems \nWeek 4.  Denotation and Connotation / Selected Poems \nWeek 5.  Imagery / Selected Poems \nWeek 6.  Spring Break / Tomb-sweeping Holidays\nWeek 7.  Figurative Languages (1) / Selected Poems\nWeek 8.  Figurative Languages (2) / Selected Poems \nWeek 9.  Mid-term Exam\nWeek 10.  Figurative Languages (3) / Selected Poems \nWeek 11.  Allusion / Selected Poems \nWeek 12.  Tone / Selected Poems \nWeek 13.  Meaning and Idea / Selected Poems\nWeek 14.  Poetry and Music\nWeek 15.  Poetry and Visual Arts\nWeek 16.  Student Performance \nWeek 17.  Student Performance\nWeek 18.  Final Exam","scorePolicy":"In addition to a weekly group presentation, students are expected to come to class well-prepared and ready for discussion. Your final grade will be determined by\n1. IN-class participation (60%); \n2. Mid-term exam (20%); \n3. Final exam (20%).\n\nHappy reading and Have a great semester!","materials":"英美詩歌品析導讀, 張錯/譯著, 書林, 2016 (ISBN 9789574456826)\n英詩十三味, 朱乃長/編譯, 書林, 2009 (ISBN:9789574453092)\nSound and Sense- An Introduction to Poetry, Laurence Perrine (reprint by Bookman)\nSelected poems from the Norton Anthologies\nThe Concise Columbia Book of Poetry (William Harmon) -E-Book, and the Internet.\nFrontier Taiwan: An Anthology of Modern Chinese Poetry (Michelle Yeh; N.G.D. Malmqvist)-E-Book.\nHow to Read Chinese Poetry: A Guided Anthology (Zong-Qi Cai)-E-Book.","foreignLanguageTextbooks":true}]
