[{"name":"陳匡正","email":"kchen34@gmail.com","latestUpdate":"2017-12-21 22:50:32","objective":"This course tries to make students obtain fundamental knowledge of intellectual property rights by means of various materials. Moreover, students will understand importance of intellectual property in a knowledge based economic era by systematic lectures. Furthermore, students have abilities of independent analyses and thinking about intellectual property issues to solve practical questions in daily life with interactive learning methods.","schedule":"Week 1 (2018/2/26~2018/3/4) Overview: Introduction of Intellectual Property Rights (IPRs).\nWeek 2 (2018/3/5~2018/3/11) Copyright: Definition of Copyright Works, Works Made For Hire, and Moral Rights.\nWeek 3 (2018/3/12~2018/3/18) Copyright: Economic Rights, Term of Protection, and Fair Use.　　\nWeek 4 (2018/3/19~2018/3/25) Copyright: Plate Rights, Remedies for Infringement of Rights, Limitations on Liability for Internet Service Providers, and Penal Provisions.\nWeek 5 (2018/3/26~2018/4/1) Patent: Categories of Patents and Protection of Employees’ Legitimate Rights.\nWeek 6 (2018/4/2~2018/4/8) Tomb Sweeping Day \nWeek 7 (2018/4/9~2018/4/15) Patent: Overviews of Invention Patent, Utility Model Patent, and Design Patent.\nWeek 8 (2018/4/16~2018/4/22) Trademark: Definition, Application, Registration of Trademarks, Clauses for Refusal of Registration, Period of the Trademark Right, and Renewal of Period of the Trademark Right.\nWeek 9 (2018/4/23~2018/4/29) Trademark: Case Studies of the Use of Trademark, Limits on Effect of Registered Trademark, Opposition, Invalidation, and Revocation.\nWeek 10 (2018/4/30~2018/5/6) Trademark: Certification Mark, Collective Mark, Collective Trademark, Infringement Remedies, and Penal Provisions.\nWeek 11 (2018/5/7~2018/5/13) Trademark: Opposition, Invalidation, and Revocation.\nWeek 12 (2018/5/14~2018/5/20) Trademark: Certification Mark, Collective Mark, Collective Trademark, Infringement Remedies, and Penal Provisions.\nWeek 13 (2018/5/21~2018/5/27) Trade Secrets: Requirements and Kinds.\nWeek 14 (2018/5/28~2018/6/3) Trade Secrets: Ownerships and Applications.\nWeek 15 (2018/6/4~2018/6/10) Trade Secrets: Infringements, Remedies, and Related International Agreements.\nWeek 16 (2018/6/11~2018/6/17) Non-compete Clauses of Trade Secrets, Overviews of the Plant Variety and Plant Seed Act, Optical Disk Act, and Integrated Circuit Layout Protection Act.\nWeek 17 (2018/6/18~2018/6/24) Conclusions; Final Project Report (I).　　\nWeek 18 (2018/6/25~2018/7/1) Final Project Report (II).","scorePolicy":"1. Final Project Report 50%.\n(1) Presentations 30%.\n(2) Final Reports (Paper Works) 20%.\n2. Attendance 30%.\n3. Participation and Performance 20%.","materials":"1. PowerPoint.　　\n2. Ming-Yang Hsieh, Intellectual Property Law (2016).\n3. Hsiung-Lin Hsiao, Copyright Law (2015).\n4. Chao-Hua Chen, Theories and Practices of Trademark Law (2015).\n5. Chi-Cheng Yen, New Patent Law and Examination Practices (2015).\n6. Sheng-Chen Tseng, Trade Secrets Law (2009).","foreignLanguageTextbooks":false}]
