[{"name":"曾添文","email":"f10403@ntut.edu.tw","latestUpdate":"2016-02-03 17:03:17","objective":"介紹單位換算與有效數位，元素的原子結構、化學方程式平衡與計算，反應熱，氣體與氣體定律，大氣層與環境污染，週期表，化學鍵，化合物的分子結構，熱力學，動力學，反應機構，平衡常數，氧化與還原，酸鹼反應，電化學，混合物的分離及現代科技材料，奠定良好化學基礎。","schedule":"1~2週. Chemical foundations: chemistry: an overview, the scientific method, units of measurements, uncertainty in measurements, significant figures, learning to solve problems systematically, dimensional analysis.\n3~4週. Atoms, molecules, and ions: the early history of chemistry, fundamental chemical laws, Dalton’s Atomic Theory, early experiments to characterize the atom, the modern view of atomic structure, molecules and ions, an introduction to the periodic table, naming simple compounds.\n5~6週. Stoichiometry: counting by weighting, atomic masses, the mole, molar mass, percent composition of compounds, determining the formula of a compound, chemical equations, balancing chemical equations, stoichiometric calculations, the concept of limiting reactants.\n7~8週. Types of chemical reactions and solution stoichiometry: the comment solvent, the nature of aqueous solutions, the composition of solutions, types of chemical reactions, precipitation reactions, stoichiometry of precipitation reactions, acid-base reactions, balancing oxidation-reduction equations \n9~10週. Gases: pressure, the gas laws of Boyle, Charles, and Avogadro, ideal gas law, gas stoichiometry, Dalton’s Law of Partial pressures, the kinetic molecular theory of gases, effusion and diffusion, real gases, characteristics of several real gases.\n11~12週. Thermochemistry: The nature of energy, enthalpy and calorimetry, Hess’s Law, standard enthalpy of formation, present sources of energy, new energy sources.\n13~14週. Atomic structure and periodicity: electromagnetic radiation, the nature of matter, the atomic spectrum of hydrogen, the Bohr model, the quantum mechanical model of the atom, quantum numbers, orbital shapes and energies, electron spin and the Pauli Principle, polyelectronic atoms, the Aufbau Principle and the periodic table, periodic trends in atomic properties, the properties of a group.\n15~16週. Bonding: general concepts. Types of chemical bonds, electronegativity, bond polarity and dipole moments, ions, energy effects in binary ionic compounds, partial ionic character of covalent bonds, the covalent chemical bond, covalent bond energies and chemical reactions, the localized electron bonding model , Lewis structures, exceptions to the Octet rule, resonance, molecular structure: the VSEPR model.\n17~18週. Covalent bonding: orbitals. Hybridization and the localized electron model, the molecular orbital model, bonding in homonuclear diatomic molecules, bonding in heteronuclear diatomic molecules, combing the localized electron and molecular orbital models, photoelectron spectroscopy.","scorePolicy":"一學期中共考5次加以平均","materials":"General Chemistry\nSteven S, Zumdahl; Susan A. Zumdahl; Hsiu-Fu Hsu\nCengage Learning Asia Pte Ltd., 2015.","foreignLanguageTextbooks":false}]
