[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2015-09-03 21:33:48","objective":"本課程整合心理學、社會學、 決策行為學等理論，介紹消費者的產品購買思維，以及產品消費行為，並討論企業如何應用消費 者行為分析的各項研究發現與理論，以提高行銷規劃與市場活動 效能。課程內容包括：1.消費購買的行為模式。2.消費行為的心理學與社會學基礎。3.消費者認知過程與心理發展。4.社會互動關係與購買行為。5.產品涉入對消費行為的影響。6.情境因素對消費行為的影響。7.態度的形成與改變。8.消費者行為分析在行銷管理的應用。學生修習本課程之後，將對行銷規劃之主要變數，如產品設計、零售企劃、廣告促銷、定價策略等，有一扎實的行為科學方面的理論基礎。","schedule":"次　　主題　　內容與個案\n1.　　9/17 　　課程介紹　　分組 網路資源介紹 個案討論方法介紹\n2.　　9/24 　　消費行為概論　　Ch1-Ch3與補充資料\n3. 10/1　　消費行為概論　　Ch1-Ch3與補充資料\n4. 10/8　　購買後行為　　Ch3\n哈佛商學院HBS Case1: IKEA\n1.請分析採購家俱的消費者行為,通常消費者會有哪些困難?\n2.家俱業者提供哪些服務來解決困難?\n3.分析美國的家俱市場\n4.IKEA提供給消費者什麼價值?商業模式為何?\n5.IKEA如何在美國拓展市場?\n5.10/15　　消費者動機、涉入與價值觀　　Ch4\n哈佛商學院HBS Case2: Starkbucks\n1.請解釋StarBucks在1990年成功的因素?在這段期間他所提供的顧客價值與品牌形象為何?\n2.為何StarBucks滿意度下滑?\n3.2002年的StarBucks與1990年的StarBucks有何不同?\n4.StarBucks應該要投資$40Million的labor提升方案嗎?\n6. 10/22　　參考群體與創新\n　　Ch 12\n哈佛商學院HBS Case3: Tivo in 2000\n1. Analyze the situation from the consumer's standpoint. What is TiVo? What factors facilitate its adoption? What factors make adoption difficult? Who is TiVo best suited for?\n2. Now adopt the standpoint of the networks, the advertisers, and the cable/satellite\ncompanies: what do they want TiVo to be? Thinking about the competition: What are Microsoft’s potential strengths and weaknesses in this market?\n3. How would you describe and characterize TiVo’s action plan as given at the end of the case? How do you evaluate the planned communication campaign? Does your situation analysis suggest an alternative plan?\n7.10/29　　停課　　校外評鑑\n8. 11/5　　家庭與創新\n　　Ch14\n哈佛商學院HBS: Case4: Swatch\n1. Why was the Swatch so successful? In what ways was the Swatch different than any watch the industry had ever seen?\n2. What elements of the original Swatch marketing plan were most critical to the brand’s success? Do you agree with the original product strategy? the channel strategy? The promotional strategy? What about the pricing strategy? \n3. Prior to the introduction of the Swatch, what kinds of watches were popular among consumers? In what ways was a Rolex different from a Timex, or from a gold-plated Seiko? How did consumers make buying decisions?\n\n9. 11/12 　　消費者知覺、學習與記憶　　 \n哈佛商學院HBS:Case 5 Dove\n1. What is a brand? Why does Unilever to want fewer of them? \n2. What was Dove’s market positioning in the 1950s? What is its positioning in 2007? \n3. How did Unilever organize to do product category management and brand management in Unilever before 2000? What was the corresponding structure after 2000? How was brand meaning controlled before 2000 and how is it controlled at the time of the case? \n4. Spend a little time searching blogs, using Google Blog Search, Technorati, BlogRunner, or any other blog search engines, to get a sense of what people are saying about Dove today. What does this discussion contribute to the meaning of the brand? \n10. 11/19　　網路行銷\n　　補充網路行銷\n哈佛商學院HBS: Case6:Avon.com\n1.　　Should Edwards recommend to Jung that Avon sell directly to consumers? What would the other elements of this strategy look like? Would the commission levels change? Which product would be sold online and which would not?\n2.　　What would Edwards hope to gain from such a strategy?\n3.　　How should Avon manage the conflict that such a strategy would create?Are there other strategies that would take advantage of the Web without creating this conflict? What would their principal objectives be?\n11. 11/26　　消費者態度\n與情緒　　Ch7-8\n哈佛商學院HBS: Case7: Marvel\n1.請問Marvel 的Vice Chairman Peter Cuneo應該要追求何種的策略方向？\n2.為何Marvel 的轉型是成功的？你認為這個成功只是暫時的？還是會持續的？\n3.請說明Marvel漫畫（comic books），玩具(toys)與授權(licensing)三個事業部的重要性？以及三者有何綜效？\n4.你是否認為Marvel的成功只靠著蜘蛛人一個角色？Marvel是否該發展一些較不知名的角色？要如何做？\n12. 12/3　　新產品開發　　哈佛商學院HBS: Case8: ColgatePalmolive Precision Toothbrush\n1. What changes are occurring in the toothbrush category? Assess ColgatePalmolive’s competitive\nposition.\n2. How is the toothbrush market segmented? Compare consumer behavior for toothbrushes and\ntoothpaste.\n3. W","scorePolicy":"二、評分方式:\n個案討論(40%)  個案心得報告(30%) 期末考考個案(30%)\n個案討論: 共12個，所有同學需繳交12個心得(哈佛商學院HBS個案)報告，於當天上課時繳交\n本課以個案討論為主，講課或文選討論為輔。上課前必須準備好當天要討論之個案與文選。學生須準備篇個案，須於上課前繳交一頁個案問題與答案之書面資料。\n上課規則如下：\n9:10—9:10 相關教材補充說明10:10—10:40 休息時間與小組討論(分5組,每組上課時抄兩個個案筆記)10:40—12:00  80分鐘個案討論(請準時入座)","materials":"消費者行為  Consumer Behavior 洞察生活、掌握行銷  Life and Marketing\n \n作者 : 曾光華\n出版日期 : 102年06月二版\n書號 : MK302\n規格 : 471頁 / 16K / 平裝 / 雙色\nISBN : 9789866264924","foreignLanguageTextbooks":false}]
