[{"name":"吳南葳","email":"ms.nw.wu@gmail.com","latestUpdate":"2015-09-14 23:33:51","objective":"本課程主要在教導學生對西方(歐洲及西亞)認識歷史建築之演進過程與思考涵構，並使學生具備西方文化歷史與思想的相關知識，其主要授課內容如下：1.在範圍上--自古埃及、西亞、古典建築、基督教建築、中世紀的大教堂時代以至文藝復興及17、18世紀的建築歷史。2.在思想上--自希臘的文化與哲學思想談起，以至各時代之政治、宗教與社會文明之演進，瞭解歷史涵構及其對建築的表現。3.在建築上─針對每一時期的建築表現，瞭解其構造方法、材料應用及相關細部特徵。","schedule":"第一週（9月14日）、新生入學說明會（停課）\n第二週（9月21日）、課程介紹：歷史的觀念＆史前文明、古埃及建築（金字塔）\n第三週（9月28日）、中秋節補假\n第四週（10月5日）、古埃及建築（陵墓與神廟）＆西亞建築＆希臘建築：克里特島與邁錫尼文明\n第五週（10月12日）、希臘建築：希臘神廟與古典柱式、奧林匹亞與特耳菲 [本週登記期中報告題目]\n第六週（10月19日）、希臘建築：雅典衛城與希臘化時期\n第七週（10月26日）、羅馬建築之共和與帝國時期，劇場、圓形競技場及馬車競賽場\n第八週（11月2日）、羅馬建築之哈德連皇帝與萬神殿\n第九週（11月9日）、（期中考週）準備期中報告（第十週上課繳交）\n第十週（11月16日）、羅馬建築之羅馬浴場與帝國晚期 [本週繳交期中報告]\n第十一週（11月23日）、中世紀之早期基督教、拜占庭、仿羅馬\n第十二週（11月30日）、中世紀之哥德\n第十三週（12月7日）、文藝復興之布內勒奇、亞伯提與達文西\n第十四週（12月14日）、文藝復興之布拉曼德、米開朗基羅與帕拉底歐\n第十五週（12月21日）、文藝復興在歐洲其他地方與矯飾主義\n第十六週（12月28日）、巴洛克\n第十七週（1月4日）、巴洛克、洛可可＆期末考前複習\n第十八週（1月11日）、（期末考週）期末考","scorePolicy":"期中報告\n蒐集資料並參觀體驗一棟指定列表中之日治時期西洋歷史風情建築。報告內容應包括：1. 該建築本身基本資料（平立面與照片）；2. 陳述該建築之西洋歷史風情之符碼；3. 參觀後心得感想（該建築風格等有何啟發）；4. 報告同學本人與參觀建築物之合照。（圖面數量不限，文字至少1000字）\n\n成績比重\n平常成績　　　　30%（抽點出席率與課程參與）\n期中報告　　　　40%（除非事前說明之特殊理由或原訂報告日期隔週提出病假證明，經老師許可後由\n    老師決定補報告日期，但成績打八折；其他狀況若報告當天缺席，本項成績以零分計）\n期末考試　　　　30%（若非事前說明且經老師應允補考，或提出病假證明，缺席者本項成績以零分計）","materials":"傅朝卿，2009，《圖說西洋建築發展史話》\n霍普金斯、畢爾德，謝孟蓉譯，2011，《羅馬大競技場的故事》\n金恩，吳光亞譯，2002，《圓頂的故事：文藝復興建築史的一頁傳奇》\n徐明松，2003，《古典、違逆與嘲諷： 從布魯涅列斯基 到帕拉底歐的文藝復興建築》\n米勒，鄭明萱譯，2010，《聖彼得大教堂建築的故事》\n傅朝卿，2009，《圖說台灣建築文化資產日治時期篇》\n黃士娟，2012，《建築技術官僚與殖民地經營1895-1922》\nMusgrove, John (ed.) (1987). Sir Banister Fletcher’s A History of Architecture. London: Butterworths.\nPevsner, Nikolaus (1960). An Outline of European Architecture. Baltimore, Mayland: Penguin Books.\nWatkin, David (ed.) (1986). A History of Western Architecture. London: Laurence King.Allsopp, Allsopp, Bruce (1970). The Study of Architectural History. London: November Books.\nLawrence, A W (1996). Greek Architecture. 5th Edn, London: Yale UP.\nWad-Perkins, J B (1981). Roman Imperial Architecture. Harmondsworth: Penguin.\nColdstream, Nicola (2002). Medieval Architecture. Oxford: Oxford University Press.\nKrautheimer, Richard (1965). Early Christian and Byzantine Architecture. London: Yale University Press.\nCalkins, Robert (1998). Medieval Architecture in Western Europe: from AD 300 to 1500. Oxford: Oxford University Press.\nConant, Kenneth J (1992). Carolingian and Romanesque Architecture, 800-1200. Harmondsworth: Penquin.\nBranner, Robert (1961). Gothic Architecture. New York: G. Braziller.\nThompson, M.W. (1991). The Rise of the Castle, Cambridge: Cambridge University Press.\nThompson, M.W. (1987). The Decline of the Castle, Cambridge: Cambridge University Press.\nKing, Ross (2000). Brunelleschi's Dome: The Story of the Great Cathedral in Florence, London: Penguin.\nFanelli, Giovanii and Michele Fanelli (2004). Brunelleschi’s Cupola: Past and Present of an Architectural Masterpiece, Firenze: Mandragora.\nMurray, Peter (1969). The Architecture of the Italian Renaissance, Thames &amp; Hudson.\nTavernor, Robert (1962). Palladio and Palladianism, London: Thames &amp; Hudson.\nSummerson, J (1993). Architecture in Britain 1530-1830, London: Harmondworth.\nGlendinning, Miles, Ranald MacInnes and Aonghus MacKechnie (1996). A History of Scottish Architecture: from the Renaissance to the Present Day, Edinburgh: Edinburgh University Press.\nBlunt, Anthony (1953). Art and Architecture in France 1500-1700, Yale University Press.\nVidler, Anthony (1989). The Writing of the Walls, Oxford: Butterworth Architecture.","foreignLanguageTextbooks":false}]
