[{"name":"林宜玄","email":"yishyuan@ntut.edu.tw","latestUpdate":"2015-07-29 15:53:39","objective":"一、課程名稱：專題討論（一）\n二、教學目標：\n（一）　　研習教育政策、人力政策、科技政策之概念、內涵與發展\n（二）　　增進批判、分析、統整與應用之相關能力\n（三）　　探討教育相關主題及未來展望\n三、授課方式：\n  （一）教師講授：你知道嗎、如果讓我重做一次研究生、態度萬歲、一句話的力\n量、一塊地總有一粒種子適合、喜歡自己。35歲前要做的33件事、窮人與富人的距離0.05mm、90/10 的定律、複雜世界的簡單規律、每個人都可能扣錯第一顆釦子、傷痕實驗。\n（二）讓我告訴你我是誰-000的故事：請每位同學介紹家鄉的地理環境、人文特色、風土民情，自己的成長歷程，個人的特質、嗜好、專長，碩士班的生涯規畫、、、。\n（三）課外專書閱讀報告：請自行選定課外專書閱讀，進行專書內容分享及讀後感想與評析報告，並繳交閱讀報告。     \n（四）教育相關政策報告：請閱讀指定的教育相關政策報告，進行專題報告並繳交專題報告。","schedule":"四、授課內容及進度：\n※第一週、第二週、第三週（9/16、9/23、9/30）\n  1.說明授課方式與進度。\n  2.決定個人2次報告順序、2-3人組成一組及決定各組報告題目與順序。\n  3.教師講授：你知道嗎、如果讓我重做一次研究生、態度萬歲、一句話的力量、一塊地總有一粒種子適合、喜歡自己。35歲前要做的33件事、窮人與富人的距離0.05mm、90/10 的定律、複雜世界的簡單規律、每個人都可能扣錯第一顆釦子、傷痕實驗。           \n※第四週、第五週、第六週、第七週、第八週（10/07、10/14、10/21、10/28、11/04）\n   1.每週3-4人分別進行20分鐘的讓我告訴你我是誰-000的故事（請用power \n     point報告）。\n   2.報告人繳交報告（書面及電子檔）。\n   3.非報告的學生須對每位報告學生進行評分及繳交評分表。\n※第九週（11/11）期中考週\n※第十週、第十一週、第十二週、第十三週（11/18、11/25、12/02、12/09）\n  1.每週4-5人分別進行15分鐘的課外專書閱讀報告及討論（請用power point\n    報告）。\n  2.報告人繳交課外專書閱讀報告（書面及電子檔）。\n  3.非報告人對每位報告學生進行評分及繳交評分表，並每人繳交一頁心得報告（書\n    面及電子檔）。\n※第十四週、第十五週、第十六週、第十七週（12/16、12/23、12/30、01/06）\n  1.2-3人組成一組，每週2組分別進行30分鐘的教育相關政策報告及討論（請用\npower point報告）。\n  2.報告組成員共同繳交一份教育相關政策報告（書面及電子檔）。\n  3.非報告人對每組報告學生進行評分及繳交評分表，並每人繳交一頁心得報告（書 \n    面及電子檔）。\n※第十八週（01/13）期末考週","scorePolicy":"五、成績評量：\n（一）　　平時成績（包括：上課出席率、演講心得報告及討論發言狀況）：25%\n（二）　　讓我告訴你我是誰-000的故事（包括：課堂報告、書面報告）：25%\n（三）　　課外專書閱讀報告（包括：課堂報告、書面報告及心得報告）：25%\n（四）　　教育相關政策報告（包括：課堂報告、書面報告及心得報告）：25%","materials":"六、備註：\n（一）讓我告訴你我是誰-000的故事：請介紹你家鄉的地理環境、人文特色、風土民情，自己的成長歷程，個人的特質、嗜好、專長，碩士班的生涯規劃，每人進行 20分鐘報告，盡量利用圖片、照片、實物，以說故事的方式介紹自己。\n（二）課外專書閱讀報告，每人選擇近2年出版值得分享的課外專書，閱讀後進行 15分鐘報告，其餘同學需參與評分並繳交一頁心得報告（書面及電子檔）。\n（三）教育相關政策心得報告，每2-3人組成一組，閱讀指定的教育相關政策報告， 各組選擇一項相關政策進行 30分鐘報告並繳交報告，其餘同學需參與評分並繳交一頁心得報告（書面及電子檔）。\n  （四）外聘演講之次週應繳交2頁報告，報告內容包括學理上的評論、補充資 料，心得感想等，有引用他人觀點時，仍應依APA格式，註明文獻。如因時 間安排致不能參與演講，應經教師同意，於二週內以參加其他相當份量之學 術研討會或演講之心得報告替代。\n（五） 所有應繳交之報告，請提供書面及電子檔，由班長彙整轉交；所有報告    將掛網，所以務請留意學術倫理及智慧財產權問題。","foreignLanguageTextbooks":false}]
