[{"name":"陳雅玫","email":"ymchen@ntut.edu.tw","latestUpdate":"2015-09-05 23:15:38","objective":"This course aims to introduce the \"globalization turn\" and \"technological turn\" in translation studies after the 1990s. An exploration will be made into their possible implications for translation practice and the translator's qualifications. Translation issues to be addressed may include the following: globalization/localization and translation, technology and translation, transcreation (creative translation), advertisement/marketing and translation, video game translation, website translation, tourism translatio, popular science translation, quality control, community/crowdsourcing translation and fansubbing. Through concrete examples of authentic translations, this course will enable students to better understand how the new trends in translation studies can guide translation practice, and lead students to rethink the translators professional qualifications. Also included in the course are practical English'/Chinese translation exercises and translation commentaries, which can assist students in keeping abreast with the new trends and formulating appropriate translation strategies.","schedule":"Week 1: introduction\nWeek 2: globalization/localization and translation  \nWeek 3: transcreation (creative translation) (1)\nWeek 4: transcreation (creative translation) (2)\nWeek 5: transcreation (creative translation) (3)\nWeek 6: online community/crowdsourcing translation(1)\nWeek 7: online community/crowdsourcing translation (2)/ fansubbing (1)\nWeek 8: fansubbing (2)\nWeek 9: group translation projects\nWeek 10: video game translation (1)\nWeek 11: video game translation (2)\nWeek 12: website translation (1)\nWeek 13: website translation (2)\nWeek 14: tourism translation (1)\nWeek 15: tourism translation (2) \nWeek 16: popular science translation (1) \nWeek 17: popular science translation (2) \nWeek 18: group translation projects","scorePolicy":"1. attendance &amp; participation: 25%\n2. oral presentations: 35%\n3. one translation and commentary task: 15%\n4. two group translation projects: 25%","materials":"　","foreignLanguageTextbooks":false}]
