[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2015-09-04 12:51:19","objective":"以消費者為重心已蔚為目前市場行銷的重要潮流。了解消費者決策過程也成為行銷領域研究的主流。一般而言，消費者的購買決策制定過程決定產品與服務的購買結果，主要包括五個階段：(1)問題察覺、(2)資訊搜尋、(3)方案評估、(4)購買選擇、(5)購後過程。消費者的購買決策制定過程深受各種不同因素之影響。本課程強調如何藉由理論概念、實例討論與實作方式進一步了解消費者，並將此知識應用於行銷策略上。此外網際網路為一整合媒體,有別於傳統之行銷環境,在網際網路上消費者與媒體可以產生高度的互動,並且也可能產生虛擬經驗.本課程也從消費者行為理論出發,探討在網際網路環境下之消費者行為。課程以哈佛式個案討論為主。","schedule":"次　　主題　　內容與個案\n1.　　9/17 　　課程介紹\n江啟先　　分組 課程介紹\n2.　　9/24 　　消費行為概論\n江啟先　　Ch1-2\n3. 10/1　　消費行為概論\n江啟先　　Ch3\n4. 10/8　　耿慶瑞\n行銷策略個案\n　　哈佛商學院HBS Case1: 2010 Cola Wars Continue: Coke and Pepsi in the Twenty- First Century\n\n1. Why is the soft drink industry so profitable?\nCompare the economics of the concentrate business to the bottle business: why is the profitability so different?\nHow has the competition between Coke and Pepsi affected the industry’s profit?\nCan Coke and Pepsi sustain their profits in the wake of flattening demand and the glowing popularity in non-carbonated drink?\n\n5.10/15　　購買後行為\n江啟先 \n　　Ch4\n6. 10/22　　耿慶瑞\n品牌定位個案　　Ch5\n\n哈佛商學院HBS: Case2: Swatch\n1. Why was the Swatch so successful? In what ways was the Swatch different than any watch the industry had ever seen?\n2. What elements of the original Swatch marketing plan were most critical to the brand’s success? Do you agree with the original product strategy? the channel strategy? The promotional strategy? What about the pricing strategy? \n3. Prior to the introduction of the Swatch, what kinds of watches were popular among consumers? In what ways was a Rolex different from a Timex, or from a gold-plated Seiko? How did consumers make buying decisions?\n\n7. 10/29　　消費者動機、涉入與價值觀\n江啟先\n　　Ch5\n8. 11/5 　　知覺學習態度\n江啟先\n　　Ch6-7\n9 11/12　　科技產品接受度個案\n耿慶瑞　　哈佛商學院HBS Case3: Tivo in 2000\n1. Analyze the situation from the consumer's standpoint. What is TiVo? What factors facilitate its adoption? What factors make adoption difficult? Who is TiVo best suited for?\n2. Now adopt the standpoint of the networks, the advertisers, and the cable/satellite\ncompanies: what do they want TiVo to be? Thinking about the competition: What are Microsoft’s potential strengths and weaknesses in this market?\n3. How would you describe and characterize TiVo’s action plan as given at the end of the case? How do you evaluate the planned communication campaign? Does your situation analysis suggest an alternative plan?\n\n10 11/19　　文化\n劉佳蒨\n　　Ch11\n\n11. 11/26　　消費者\n情緒\n劉佳蒨　　Ch8\n12. 12/3　　耿慶瑞\n內容行銷個案　　哈佛商學院HBS Case 4:Marvel\n1.請問Marvel 的Vice Chairman Peter Cuneo應該要追求何種的策略方向？\n2.為何Marvel 的轉型是成功的？你認為這個成功只是暫時的？還是會持續的？\n3.請說明Marvel漫畫（comic books），玩具(toys)與授權(licensing)三個事業部的重要性？以及三者有何綜效？\n4.你是否認為Marvel的成功只靠著蜘蛛人一個角色？Marvel是否該發展一些較不知名的角色？要如何做？\n\n13. 12/10　　 \n消費者人格、自我概念與生活型態\n劉佳蒨　　Ch9\n14. 12/17　　購買情境\n劉佳蒨\n　　Ch10\n15. 12/24　　　　\n哈佛商學院HBS Case 5: Aqualisa Quartz: Simply a Better Shower\nQ1: What is the Quartz value proposition to plumbers? To consumers?\nQ2. Why is the Quartz shower not selling?\nQ3. Aqualisa spent three years and 5.8 million developing the Quartz. Was the product worth the investment? Is Quartz a niche product or a mainstream product?\nQ4. Aqualisa currently has three brands: Aqualisa, Gainsborough, and ShowerMax. What is the rationale behind this multiple brand strategy? Does it make sense?\nQ5. What should Rawlinson do to generate sales momentum for the Quartz product? Should he change his marketing strategy to target consumers directly, target the DIY market, or target developers? Should he lower the price of the Quartz? Or should he do something different altogether?\n16. 12/31　　參考團體與意見領袖\n劉佳蒨　　Ch10\n17. 1/7　　社會階層\n劉佳蒨　　Ch13\n18. 1/14　　耿慶瑞\n品牌溝通個案　　哈佛商學院HBS:Case 6 Dove\n1. What is a brand? Why does Unilever to want fewer of them? \n2. What was Dove’s market positioning in the 1950s? What is its positioning in 2007? \n3. How did Unilever organize to do product category management and brand management in Unilever before 2000? What was the corresponding structure after 2000? How was brand meaning controlled before 2000 and how is it controlled at th","scorePolicy":"二、評分方式:\n個案討論(40%)  個案心得報告(60%) \n個案討論: 共6個，所有同學需繳交6個心得(哈佛商學院HBS個案)報告，於期末前繳交\n本課以個案討論為主，講課或文選討論為輔。上課前必須準備好當天要討論之個案與文選。學生須準備篇個案，須於上課前繳交一頁個案問題與答案之書面資料。\n個案上課規則如下：\n6:40—7:30 相關教材補充說明7:30—8:00 休息時間與小組討論(分3組,每組上課時抄兩個個案筆記)8:00—9:20  80分鐘個案討論(請準時入座)","materials":"消費者行為  Consumer Behavior 洞察生活、掌握行銷  Life and Marketing\n \n作者 : 曾光華\n出版日期 : 102年06月二版\n書號 : MK302\n規格 : 471頁 / 16K / 平裝 / 雙色\nISBN : 9789866264924","foreignLanguageTextbooks":false}]
