[{"name":"范書愷","email":"morrisfan@ntut.edu.tw","latestUpdate":"2015-11-11 16:52:41","objective":"This class will help students familiarize themselves with the trend of theoretical basis of the quality management and strengthen their ability in both theoretical research and practical application. First, the course covers basic statistics so that students will be acquainted with research methods and analysis techniques. Second, the six sigma management tools will be reviewed and the process for its implementation will also be addressed. The system- and the organization-level quality as well as the Kano Model for attractive quality will be discussed. The curriculum of this class includes the introduction of empirical models integrated with case study so that the students will be strengthened in the capabilities of real world problem solving and quality improvement. Finally, the big data opportunity, extracting insight from an immense volume, variety and velocity of data, in context, beyond what was previously possible, will be addressed. Applications for big data analytics could include smarter healthcare, multi-channel, finance, log analysis, homeland security, traffic control, telecom, search quality, manufacturing, trading analytics, fraud and risk, retail, among others. \n\n本課程將使學員熟習各項品質管理的理論基礎與發展趨勢，強化理論研究與實務應用能力。首先，課程涵蓋基礎統計使學員具備研究方法與分析技術能力，了解收集、統整和分析資料。其次，討論量化的六標準差管理相關工具及專案推行流程，以系統化思維探討問題並提出有效可行的解決對策，持續提升品質及客戶滿意。最後，介紹制度面及組織管理面的全球品管概念，闡述創造魅力品質之重要理論模型及影響服務品質關鍵因素。課程中以實務模式介紹為基礎，並配合個案分析以實例討論加強同學分析及解決實際問題的能力。課程第三階段將介紹大數據分析緣起與理論基礎，大數據分析與企業經營間的關聯，並輔以大數據分析案例讓學員對於大數據應用面有更深層的認識。","schedule":"Week 1: 品管的演變與品質的意義\nWeek 2: 品質管理的範圍與目標\nWeek 3: 品管組織的定位與工作心態\nWeek 4: 品管績效與組織文化\nWeek 5: 研發品質與策略品質\nWeek 6: 品質意識的推廣\nWeek 7: 六標準差概述\nWeek 8: 二維品質與品質機能展開\nWeek 9: 製(流)程管制\nWeek 10: 測量系統分析\nWeek 11: 田口品質工程\nWeek 12: 實驗設計與分析\nWeek 13: 大數據介紹，企業所面臨困境與大數據間之關聯\nWeek 14: 大數據分析方法論\nWeek 15: 大數據商運模式探討\nWeek 16: 大數據分析案例探討\nWeek 17-18: 大數據分組報告","scorePolicy":"Term Project Presentations 30%\nTerm Project Reports  40%\nAttendance &amp; Class Participation 30%\n\n專題口頭報告 30%\n專案書面報告 40%\n出席與課程參與 30%","materials":"參考書目: \n“Implementing Six Sigma: Smarter Solutions Using Statistical Methods”, Forrest W. Breyfogle, III, Wiley, New York, 2003.\n“Six Sigma for Electronics Design and Manufacturing”, Sammy G. Shina, McGraw Hill, NJ, 2002.\n「全面品質管理」，簡聰海，李永晃，高立圖書有限公司，民國93年。","foreignLanguageTextbooks":false}]
