[{"name":"胡憲倫","email":"allenhu@ntut.edu.tw","latestUpdate":"2015-08-17 22:00:04","objective":"瞭解生命週期思維(Life Cycle Thinking)與生命週期管理(LCM)對環境問題解決的重要性；學會生命週期評估(LCA)的原理及方法，並學會如何評估產品每個生命週期階段的環境及社會衝擊；學習LCA的軟體操作及其應用；學會應用LCA來解決環境問題及政策制定，包括產品環境化設計、碳足跡及碳標籤等。","schedule":"課程綱要：(胡老師的部分，含每週授課進度，共12週)\n1.　　企業永續發展及生命週期與系統思考介紹(Corporate Sustainability, Systems Thinking and Life Cycle Management)\n2.　　ISO 14040系列與生命週期評估(LCA含軟體)介紹 (Introduction to LCA, including LCA Software)\n3.　　生命週期評估方法(LCA Methodology)：目標及範疇之界定與盤查分析(Goal and Scope Definition and Inventory Analysis) 交專題題目與大綱\n4.　　生命週期評估方法(LCA Methodology)：生命週期衝擊評估與生命週期結果闡釋、不確定及敏感度分析(Life Cycle Impact Assessment and Interpretation and Uncertainty and Sensitivity Analysis)\n5.　　簡化的生命週期評估及生命週期永續性評估(Streamlined LCA and Life Cycle Sustainability Assessment)\n6.　　期中考(Mid-term Exam) \n7.　　LCA 應用(LCA Applications)：碳足跡與水足跡分析及標籤(Carbon and Water Footprinting and Labeling)\n8.　　LCA 應用(LCA Applications)：綠色產品設計與發展(Green Product Design and Development)\n9.　　LCA 應用(LCA Applications)：廢棄物管理、生產製程及土木與營建工程(Waste Management, Production Processes and Civil and Construction Engineering) 交專題初稿\n10.　　專題報告\n11.　　專題報告\n12.　　期末考(Final Exam) 交專題定稿－含簡報","scorePolicy":"作業及讀書報告： 20%   上課出席： 10 %   期中考試：20%\n期末考試： 25%    其他：專題報告(書面及口頭)* 25%","materials":"教科書\n　　Baumann, H. and A.-M. Tillman, The Hitch Hiker’s Guide to LCA- An Orientation in Life Cycle Assessment Methodology and Application, Studentlitteatur AB, 2004\n　　Hunkeler, D. et al., Life Cycle Management, SETAC, 2001\n　　中華民國國家標準，環境管理－生命週期評估 14040, 14044 and 14049，經濟部標準檢驗局，2008\n　　Sonnemann, G., Castells, F. and M. Schuhmacher (2004) Integrated Life Cycle and Risk Assessment for Industrial Processes, Lewis, Publishers\n　　Allen, D.T and D.R. Shonnard, Chapter 13 of Green Engineering- Environmentally Conscious Design of Chemical Processes, Prentice-Hall Inc., 2002\n　　其他中英文文獻（隨課堂發放）\n參考書目\n　　Guinée, J.B. (ed.), Handbook of Life Cycle Assessment- An Operational Guide to the ISO Standards, Kluwer, 2001\n　　Jensen, A.A. and A. Remmen (ed.) UNEP Guide to Life Cycle Management-A Bridge to Sustainable Products (Final Draft), UNEP, 2004\n　　Graedel, T.E., Streamlined Life-Cycle Assessment, Prentice Hall, 1998","foreignLanguageTextbooks":false}]
