[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2015-07-08 19:25:40","objective":"本課程精選有關教育與文化之文章，引導學生從閱讀中印證，比較各種文化和教育現象，並鼓勵學生從各種不同角度蒐集資料，俾使課堂討論呈現時代性與多元化的觀點。","schedule":"09/16　　Introduction\n09/23　　Michael K's birth, childhood, disposition, and occupation; Anna K and her \n        illness; the settings of the novel (pp. 3-16)\n09/30　　The Ks' application and wait for travel permits (pp. 16-28)\n        Oral Presentation 1: \n10/07　　The death of Anna K in a hospital in Stellenbosch; Michael K robbed by a \n        soldier (pp. 28-41)\n        Oral Presentation 2: \n10/14　　Michael K forced to labor; walking to Prince Albert; living on charity; arriving \n        at Prince Albert; and hunting goats (pp. 41-54)\n        Oral Presentation 3: \n10/21　　Michael K learning a lesson, burying his mother's ashes, and beginning his \n        life as a cultivator; the unexpected visit of a deserter from the army; the Visagie \n        grandson's assignment; Michael K running away (pp. 54-67)\n        Oral Presentation 4: \n10/28　　Michael K's life in the mountains and in the Jakkalsdrif labor camp (pp. 67-80)\n        Oral Presentation 5: \n11/04　　The function of the camp; Michael K's negotiation with a guard; Michael K \n        forced to labor; the condition for leaving the Jakkalsdrif camp (pp. 80-93)\n11/11　　Oosthuizen's wrath; Robert's influence; Michael K shouting for help; Michael  \n        K's escape from the camp and return to the Visagie farm; Michael K's life on the farm \n        (pp. 93-106)\n11/18　　Michael K's confidence, fear, and anxiety; his hiding in a cave; his freedom; the \n        idea of the parasite; his dreams; his appetite (pp. 106-119)\n        Oral Presentation 6: \n11/25　　Michael K discovered by the soldiers; Captain Oosthuizen's recognition of \n        Michael K; heavy explosions—end of Part One—Michael K's detention at the \n        Kenilworth camp (pp. 119-132)\n        Oral Presentation 7: \n12/02　　The medical officer's narration about Michael K; Noël and the medical officer's \n        investigation of Michael K (pp. 132-145)\n        Oral Presentation 8: \n12/09　　Michael K's refusal to eat; the medical officer's undelivered letter to Michael K; \n        Michael K's escape from the Kenilworth rehabilitation camp (pp. 145-159)\n        Oral Presentation 9: \n12/16　　More prisoners sent to the Kenilworth camp; the medical officer's desire to \n        follow Michael K; the medical officer's exploration of the significance of Michael K's \n        refusal to eat; the medical officer's comment on Michael K (pp. 159-167)\n        General Discussion on The Childhood of Jesus: All\n12/23　　Michael K's return to Sea Point, Cape Town; his harassment by a pimp and two \n        prostitutes; his pursuit of an independent living as a gardener (pp. 169-184)\n12/30　　Review \n01/06　　Final Exam\n01/13　　Discussion","scorePolicy":"attendance: 20%; quiz and presentation: 30%; final exam: 50%","materials":"Coetzee, J. M. Life &amp; Times of Michael K. New York: Penguin, 1983.\n___. The Childhood of Jesus: A Novel. Penguin, 2014. 978-0143125761.","foreignLanguageTextbooks":false}]
