[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2015-08-27 23:12:49","objective":"1.There is recognized that an increasing demand from all sides for more local concerns in creative city in general, and a need of architecture and urban planning professionals’ involvement in particular. Thus this course is mainly to provide an overview of the development and planning of creative city, discuss the way of urban planning is concerned with achieving a between creativity and well-being of the city and to explore the development issues, new methods and strategies to cope with.\n2.目前全世界超過一半以上的人口生活在城市，人數仍快速增加中，相伴而來的環境、經濟、社會與治理問題將如何處理？因此城市轉型是城市要繼續成長的必要過程，許多案例顯示創意城市是城市轉型的典範，可以作為城市轉型與再生的契機。創意城市是近年來先進國家鼓勵領導者、產業、市民從己身城市內思考、規劃、發揮創意與實現城市創新的觀念，以啟發城市找到自身的發展潛能，結合當地文化資產及地方特色，經由城市發展規劃提升創意經濟及城市的競爭力。本課程以文化創意、產業創新及城市規劃為主軸，包括研究創意城市定義、特徵、條件、構成、指標、類型、評估的基礎，進而探討與文化創意、產業創新、城市發展規劃的關連，並參考國內外城市的創新與再生案例，他們是如何在城市議題上思考、規劃與執行富有創意的行動，又如何將行動運用於城市規劃。課程經由互動分析創意城市與城市規劃的關連及作法，討論可供借鏡的發展策略與方案。","schedule":"The contents of the course including: \n1.Orientation and principles: it draws critical distinctions and sets out the planning principles that are used throughout the course. This section covers introduction to reinvent city, aims for creative city, and urban planning context on promoting sustainable development and healthy cities. Then the creative system, approach design principles, definitions and urban form are also included. \n2.Creative city checklists: this gives sustainable checklists for integrated creative city plan and specific activities that affect a locality, which including neighborhood decision-making, people and community, planning for movement, green-space system, urban form and design, creativity and sustainability impact. \n3.A creative urban planning process: this includes how to go about collaborative decision-making, and how to ensure policies are properly aimed at creative and sustainable development. It discusses the purpose and scope, planning process of collaborative creative city, collaborative approaches, and case studies.\n4.Provision of local need: this explores who lives in a locality, and how to increase local choice in housing, job, services, open space and movement. It emphasizes on people and community, local works, local facilities, planning for movement and case studies.\n5.Resources: this deals with policies and design for environmental creativity and sustainability at locality, which covers the crucial resources of culture, industry, energy, water, food, waste, biodiversity and case studies.\n6.Urban design synthesis: this provides integrated guidance on the physical development of cities in terms of density, shape, mix-use, and space at different scales. It includes urban character, key structuring elements, shaping towns and townships, designing places and case studies.","scorePolicy":"1.Time allocation: lectures, seminars, workshops, preparation, reading\n2.Field trip and case study \n3.Assessment: appearance, response, course work and seminar preparation, term paper","materials":"1. Florida, R.（2002）, The Rise of the Creative Class, New York: Basic Books.\n2.Landry, C. (2005)，Creativity and the City: Thinking Through the Steps, International Forum on Creative City: The Birth of Creativity, Dept. of Cultural Affairs, Taipei\n3.Landry, C.（2000）, The Creative City: A Toolkit for Urban Innovators, London: Earthscan.\n4.Smith, C. (2005)，The Creative city, International Forum on Creative City: The Birth of Creativity, Dept. of Cultural Affairs, Taipei\n5.UN-Habitat, (2004). Globalization and Urban Culture 20042005 Report, London: Earthscan.\n6.UN-Habitat, (2008). HARMONIOUS CITIES: State of the World’s Cities 2008/2009, London: Earthscan.\n7.United Nations Educational, Scientific and Cultural Organization (2012). Creative Cities Network, Retrieved September 15, 2012, from http://www.unesco.org/new/en/culture/themes/creativity/creative-industries/creative-cities-network","foreignLanguageTextbooks":false}]
