[{"name":"劉秋蘭","email":"pclliu@ntut.edu.tw","latestUpdate":"2015-07-21 17:03:11","objective":"法國文化資產理念先進，文化與紙設計為全球設計人士取經之地。本課程的設計背景起源於希望結合設計人才、文化資產與藝術的學者、學生與臺灣埔里本地紙業之能源，達成跨領域教學，提升學生的藝術文化底蘊，活化並促進紙設計研發能力，豐富創新本校通識教育課程、促進臺灣紙業與學生的設計水平。\n探究法國的文化資產，也是進而了解法國設計如何從文化中萃取精華再創作。讓同學由法國的案例，除了增進國際視野以外，進而思考本土及異國文化與紙設計的關係，為創意主題發想。","schedule":"週次　　課程內容　　指定閱讀/教學活動安排\n第1週　　文化資產的探源─何以成為文化資產　　18週的上課教材請參閱指定閱讀材料。\n教學活動 : 請同學就法國文化資產如何活化與運用到紙的設計上，作一個人有興趣的設計主題研發。\n第一週以培育邏輯思辨為主\n第2週　　法國觀點下的文化資產　　介紹法國是如何看待自身擁有的文化資產，並讓同學參與課堂討論，分享同學眼中的文化資產與其詮釋。\n第3週　　法國的有形文化資產與他國案例比較　　透過法國有形的文化資產，培養學生對於美的鑑賞能力，再加入他國案例帶入不同的思維邏輯，最後藉由國外案例提升同學的國際視野。\n第4週　　法國的無形文化資產與他國案例比較　　探討法國的無形文化資產與他國案例的差異，不同的文化又是如何看待無形的文化資產，最終讓同學分享他們對於無形文化資產的觀察與分析。\n第5週　　課群討論\n第6週　　設計與文化資產再活化　　探討文化資產該如何透過設計再活化，而設計又如何透過文化資產再創作，這兩者間的轉換以何種理論為基礎架構，便是本堂課要思辨及分析的內容。並讓同學參與討論，觀察兩者的關係。\n第7週　　設計師如何使用文化資產創作─案例分析I　　以案例帶入課程，讓同學能夠落實理論於創作，看設計師是如何融合文化與設計思維，說出打動人心的故事。\n第8週　　設計師如何使用文化資產創作─案例分析II　　加深案例的深度，以更深層的思考探討設計案例。並讓學生分析有興趣的案例，並條列其設計思維與轉換模式，以整合個人美感鑑賞與設計創作。\n第9週　　期中評量　　－\n第10週　　課群討論。\n第11週　　美的邏輯架構與建設　　將抽象的「美」落實至創作，讓圖學摸索出屬於自己的、美的思維。\n第12週　　設計工作坊─邀請具設計能力的學生與設計師共教共學　　將實作工作坊帶入課程，由具設計能力的學生與業界設計師幫助學生，落實紙的設計發想，並加入對於美的鑑賞與思維邏輯。\n第13週　　學生提出「紙」的設計主題和探索設計文化要點－學生作品初探　　紙的創作初探，藉由課程的理論落實設計的狂想，提出自我對文化的轉換。\n第14週　　學生提出「紙」的設計主題和探索設計文化要點－學生作品初探　　紙的創作初探，藉由課程的理論落實設計的狂想，提出自我對文化的轉換。\n第15週　　美的邏輯架構與建設　　透過實作的發想與設計思維的建設，再次統整同學對於美的感知與邏輯脈絡。並深化其思維的深度，以期在未來能夠應用至創作之中。\n第16週　　期末評量 － 邀請專家與同學互評學生創作　　請每位同學發表本學期「紙」的設計，綜合文化與對美的詮釋，轉換成具有邏輯架構的作品，並請專家評鑑。\n第17週　　期末評量 － 邀請專家與同學互評學生創作　　請每位同學發表本學期「紙」的設計，綜合文化與對美的詮釋，轉換成具有邏輯架構的作品，並請專家評鑑。\n第18週　　學生與老師座談－意見回饋　　－","scorePolicy":"文化資產設計案例報告(期中)50% + 紙作品模型與報告(期末)50%\n每次曠課扣總分10分。\n學習成果評量以同學的進步為最重要考量。","materials":"文化部文化資產局(2012)。借鏡：產業文化資產保存與再利用國外案例彙編。臺北，文化部文化資產局。\n文化部文化資產局(2012)。實踐：產業文化資產的轉型與再創造。臺北，文化部文化資產局。\n文化部文化資產局(2012)。機會：產業文化資產保存與再利用管理參考手冊\n。臺北，文化部文化資產局。\n文化部文化資產局(2012)。街角的記憶：區域型文化資產環境保存及活化計畫\n。臺北，文化部文化資產局。\n文化部文化資產局(2013)。臺灣文化場域意象採集：文化性資產清查手札。臺北，文化部文化資產局。\n李汾陽(2010)。文化資產概論。台北市 : 秀威資訊。\nMorrison, J. &amp; Twyford, J.(1994).Design and awareness, 設計能力與設計意識. Harlow: Longman 張建成譯(2002)，台北：六和。\nDormer, P.(1993).Design Since 1945.London: Thames and Hudson.\nJameson, Fredric (1989)。後現代主義與文化理論 (Postmodernism and Cultural Theories), 唐小兵譯。台北:合志。\nSparke (1986).The Design Source Book。李玉龍、張建成譯(1995) 新設計史。 London : Macdonald.台北：六合。\nNorman Tyler (1999)。Historic Preservation: An Introduction to Its History, Principles, and Practice。\nJudith L. Kitchen(1996)。Caring for Your Old House : A Guide for Owners and Residents。\n汪民安2006身體、空間與後現代性。南京：江蘇人民。","foreignLanguageTextbooks":false}]
