[{"name":"謝佳玲","email":"clhsieh@ntut.edu.tw","latestUpdate":"2007-09-15 16:44:14","objective":"本課程的目的在介紹句子結構的研究，引導學生對語法形式有更深層的瞭解，包含各種描述性或理論性的分析方法。學生可透過這門課獲得以下的訓練：\n一、熟悉句法學的核心概念，如合法度、語法範疇（如名詞、動詞、副詞、介詞）、語法關係（如主語、賓語、狀語）、詞組結構（如中心語、補述語、指示語）、語意角色（如主事、受事，歷事）、移位運作（如疑問、被動）。\n二、培養分析英語基本句型的能力，如限定與非限定子句、簡單、並列與複合句式、主動與被動語態、直述、祈使、疑問與感嘆句型，以及分屬各類語法範疇的附屬子句（如名詞子句、形容詞子句、副詞子句）。\n三、以「衍生理論」的架構為主軸，對現代句法理論以及句法分析的基本原則建立初步的認識。\n四、透過實際語料的解析，應用上述的知識與能力。\nThis course provides an introduction to the study of sentence structures. It directs students to progress to a deeper understanding of grammatical constructions, including various descriptive and theoretical approaches to representing them. By the end of this course, students will have\n1. become familiar with the core concepts of syntax, such as grammaticality, grammatical categories (e.g. nouns, verbs, adverbs, and prepositions), grammatical relations (e.g. subjects, objects, and adjuncts), constituent structures (e.g. heads, complements, and specifiers), semantic roles (e.g. agent, themes, and experiencers), and movement operations (e.g. interrogation and passivization).\n2. developed an ability to analyze the primary sentence structures of English, such as finite and non-finite clauses, simple, compound, and complex sentences, active and passive voices, declarative, imperative, interrogative, and exclamative sentence types, and embedded clauses belonging to distinct grammatical categories (e.g. nominal clauses, adjectival clauses, and adverbial clauses).\n3. been introduced contemporary syntactic theories (mainly within the framework of Generative Grammar) and the basics of linguistic argumentation.\n4. demonstrated the above knowledge and skills through analyses of linguistic data.","schedule":"1. Introduction\n2. 1. Chapter 1-3\n3. 1. Chapter 4-6\n4. 1. Chapter 7-9\n5. 1. Chapter 10-13\n6. Review\n7. 1. Chapter 14-17\n8. 1. Chapter 18-21\n9. Midterm Exam\n10. 2. Chapter 1-2\n11. 2. Chapter 3-4\n12. 2. Chapter 4-5\n13. 2. Chapter 6-7\n14. 2. Chatper 7-8\n15. 2. Chapter 8, 11\n16. 3. Part 1\n17. 3. Part 2\n18. Final Exam\n","scorePolicy":"1. Class attendance, lesson preparation, class participation: 10%\n2. Oral presentations, PowerPoint assignments: 40-50%\n3. Exams: 40-50%","materials":"1. Frank, Marcella. 1993. Modern English: A Practical Reference Guide. Englewood Cliffs, NJ: Prentice Hall Regents.\n2. Wardhaugh, Ronald. 2002. Understanding English Grammar: A Linguistic Approach. Oxford, UK; Cambridge, USA: Blackwell.\n3. Fromkin, Victoria and Robert Rodman. 2003. An Introduction to Language. (7th ed.). Orlando, Florida: Harcourt Brace College Publishers.","foreignLanguageTextbooks":false}]
