[{"name":"周至如","email":"cjchou@ntut.edu.tw","latestUpdate":"2008-05-01 14:59:47","objective":"The railway power system scheme and composition are first described including the main substations, traction power and facility power substations, transformers, feeders and accessories. Various types of power feeding to trains and related voltages and transformer configurations are introduced and compared with each other. In addition, the load flow and voltage variations are analyzed considering the train dynamic operation. The power quality issue in railway power system are investigated and analyzed especially for power harmonics and phase unbalances on utility side and customer side. Furthermore, the EMI issues especially on magnetic inductions and stray current problems along the railway and near around area are surveyed and their mitigation strategies are discussed. Some practical measures used in Taiwan area are also introduced and their availability are illustrated.","schedule":"第1週: Introduction to railway power system and fundamental theory review, scope and contents.\n第2週: Railway power system scheme and composition: main substation and traction power substations.\n第3週: Railway power system scheme and composition: facility power substation and feeders to trains.\n第4週: Railway power system scheme and composition: transformer configurations and power supply scheme and voltage.\n第5週: Load characteristics and load flow variations analysis.\n第6週:Voltage variation analysis on normal and fault situations for the railway power system of conventional railway system(CRS) and high-speed railway system (HSRS).\n第7週:Voltage variation analysis on normal and fault situations for the railway power system of metropolitan rapid transit system (MRTS).\n第8週: Load and voltage analysis considering load dynamic operations for CRS and HSRS.\n第9週: Midterm and reports, power quality issues introduction\n第10週: Load and voltage analysis considering load dynamic operations for MRTS.\n第11週: Analysis for various type fault occurred on train feeders of CRS and HSRS.\n第12週: Analysis for various type fault occurred on train feeders of MRTS.\n第13週: Study of power quality issues on railway power system about harmonics problems\n第14週: Study of power quality issues on railway power system about three- phase unbalances problems\n第15週: Discussion of EMI issues on railway power system about magnetic field problems, earth return current (stray current) problems\n第16週: Mitigation strategies for EMI on railway power system.\n第17週: Practical improved measures on railway power system in Taiwan area.\n第18週: Final Examination and report\n","scorePolicy":"期中考：30%  期末考：30%  平常成績：40%\n註：平常成績包括：出席率、作業（報告）及課堂表現\n","materials":"The object of this course is to discipline the students of graduated level to erect their fundamental on the railway power system analysis, and to promote the student's interest in learning more aspects about the railway electrification. In addition, with this course, the student will have the foundation to solve engineering problems in the railway power system and further study their related fields .\n\n本課程依進度進行授課，以課堂講解為主，輔以資料補充,主要教才為：\n [1].參考書目:\n(1).黃漢榮，軌道工程學，高立圖書公司，2003\n(2) 鄭國雄、張思，軌道工程，大中國圖書公司，民88。\n(3). 財團法人中華顧問工程司，軌道電機運用技術研發計畫，財團法人中華顧問工程司研究成果報告，2007\n(4) 簡金敏，電車線系統概要，交通部台北市地下鐵路工程處，民82。\n(5).交通部高速鐵路工程局，高速鐵路牽引動力主變電站設計與越區饋電之影響評估，交通部高速鐵路工程局研究成果報告，2002\n(6).許元泰，臺鐵東部電化路線電力供應系統，台灣鐵路局，民95。\n[2].Teaching materials provided by teacher(s)\n","foreignLanguageTextbooks":false}]
