[{"name":"林逾先","email":"line@ntut.edu.tw","latestUpdate":"2009-10-09 16:25:09","objective":"根據圖網理論，本課程介紹學生在物流規劃領域內，幾類有用的網路模式。課程主要含蓋下列三種類型的網路型態: (1) 覆蓋行程距離，包括“最短距離(成本)路線問題”與“交通流量指派問題”； (2) 車輛繞行，包括“中國郵差問題”與“旅行銷售員問題”；(3) 設施位址，包括非緊急與緊急設施地點的選定，即所謂的“中位地點問題”與“中央地點問題”。為使學生能順利完成作業起見，本課程將首先介紹IBM所發展的APL電腦語言給學生。\nBased on graph theory, this course introduces the network models useful in the planning of logistic flow from the business management point of view. The course covers three major areas in network flow, namely (1) traveling distance that includes “shortest distance (cost) problem” and “traffic assignment problem”; (2) vehicle routing that includes “Chinese postman problem” and “traveling salesman problem”; (3) facility location that includes the selection of emergency and non-emergency locations known as “median problem” and “center problem”, respectively. To facilitate the workout of the assigned problem by student, this course will first introduce the concise computing language APL developed by IBM.\n","schedule":"1  發給課程大綱及相關資料\n   Distribution of course outlines and relevant materials\n2  圖網理論的名詞、定義與符號\n   Definition of terms and notation in graph theory\n3  電腦語言APL簡介（一）\n   Introduction of computing language APL (I) \n4  電腦語言APL簡介（二）\n   Introduction of computing language APL (II) \n5  最短距離(成本)路線問題\n   Shortest distance (cost) problem\n6  計算複雜度與交通流量指派問題\n   Computational complexity and traffic assignment problem\n7  教師公務出國（停課）\n   Instructor out of office on business (No class)\n8  中國郵差問題（線路覆蓋問題）（一）\n   Chinese postman’s problem (Edge covering problem) (I)\n9  期中考\n   Midterm examination10 　　 \n10 中國郵差問題（線路覆蓋問題）（二）\n   Chinese postman’s problem (Edge covering problem) (II)\n11 最短收斂樹與旅行銷售員問題（節點覆蓋問題）\n   Minimum spanning tree and traveling salesman problem\n   (Nodecovering problem)\n12 單一調度站車輛繞行問題\n   Single-depot vehicle routing problem \n13 多重調度站車輛繞行問題\n   Multiple-depot vehicle routing problem \n14 中位地點問題（非緊急設施地點的選定）\n   Median problem (Location of non-essential facilities)\n15 中央地點問題（緊急設施地點的選定）\n   Center problem (Location of essential facilities)\n16 機率網路\n   Probabilistic networks\n17 複習\n   Review\n18 期末考試\n   Final Examination\n","scorePolicy":"課堂出席   　　Class attendance　　15%\n個人作業繳交   　　Individual assignments　　25%\n課堂小考　　         Class quiz　　20%\n期末考試　　         Final examination　　40%\n","materials":"指定用書 Textbook：\nUrban Operations Research by Larson and Odoni (MIT)\nPrentice-Hall (ISBN: 0-13-939447-8), USA, 1998.\n\n本課程將同時採用教師在課堂上所發給之教材。\nThis course will adopt the teaching materials handed out in the class by instructor.\n","foreignLanguageTextbooks":false}]
