[
  {
    "name": "陳偉凱",
    "email": "woeikaechen@ntut.edu.tw",
    "latestUpdate": "2022-01-24 18:09:27",
    "objective": "本課程探討應用物件導向方法從事軟體設計的過程與步驟，透過課程專題製作，學者將學習以 UML 記載分析與設計之結果，並使用一個物件導向語言 (如 Java 或 C++) 實作之。課程內容: 1. 物件導向模型 -- UML 介紹 2. 物件導向程式語言與環境 3. 物件導向軟體發展週期 3.1 物件導向分析 - 需求分析，使用個案，觀念模型，有限狀態模型 3.2 物件導向設計 - 實際使用個案，合作圖，類別圖，設計模板，3.3 程式撰寫 - 設計與程式之應對 4. 專題\nThis course familiarizes the students with the principles and techniques for object-oriented software development. The students will use UML and an object-oriented language such as Java or C++ to complete a term programming project. Course contents: 1. Object-oriented modeling with UML 2. Object-oriented languages and environments 3. Object-oriented software development process 3.1 Object-oriented analysis - requirement analysis, use case analysis, conceptual models, finite state machine models 3.2 Object-oriented design - real use cases, collaboration diagrams, class design diagrams, design patterns 3.3 Construction - mapping design to codes 4. Term project.",
    "schedule": "This course covers object-oriented modeling for developing software. Materials covered include class models, state models, and interaction models in UML, a reference process model based on Unified process, implementation issues, and software engineering principles. This course is thinking and programming-intensive. Students are required to complete a non-trivial software project in two iterations. Only object-oriented languages such as C++/Java/C# are allowed.\n2. There will be no exams; instead, there are 7 homework assignments and two project reviews. All assignments turned in must be typed (no handwriting will be accepted).",
    "scorePolicy": "Homework assignment schedule and grading policy:\nWeek 1　　Homework #1　　Project proposal　　0%\nWeek 2　　Homework #2　　Iteration 1: Use case　　8%\nWeek 4　　Homework #3　　Iteration 1: Domain model 　　8%\nWeek 6　　Homework #4　　Iteration 1: Design class diagram (3 weeks)　　8%\nWeek 7　　Homework #5　　Iteration 1: Implementation class diagram (4 weeks)　　8%\nWeek 11, 12　　Midterm oral review　　Project presentation and review.  　　14%\nWeek 12　　Homework #6　　Iteration 2: Use case and domain model　　8%\nWeek 14　　Homework #7　　Iteration 2: Design and implementation class diagram　　8%\nWeek i　　Exercise　　In-class exercise: 6-10 hours.　　18%\nWeek 17,18　　Final review　　Project presentation and review. 　　20%",
    "materials": "C. Larman, Applying UML and Patterns, 3rd Ed., Prentice Hall, 2004.",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 因應疫情調整之上課方式：\n1. 請使用北科 Teams 帳號登入 Microsoft teams，已選修本課學生會自動加入課程團隊，並請於上課時間使用團隊之「一般」頻道加入會議。\n2. 本課程上課、midterm/final review，以及 exercise 全部以線上 Teams 會議實施。</div>"
  }
]
