[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2021-12-29 15:04:33",
    "objective": "Feedback control is an interdisciplinary field in that control is applied to systems in every conceivable area of engineering.  Consequently, control is an active field of research and hence there is a steady influx of new concepts, ideas, and techniques.  Some of these elements develop to the point where they join the list of things every control engineer must know.  This is the course where students, especially EE majors, begin to acquire both traditional and modern topics in the field of control systems.  The core material covered in this course is to provide ample motivation, insight, and understanding in classical control.\n\nThe goals of the course can be summarized as below:\n　　Master design as well as analysis techniques.  Find good feedback control design with clear understanding.  Moreover, seeing them used.\n　　Learn to solve problems by constructing effective algorithms in computer languages like Matlab and Simulink.\n\nThe course is presented in a standard format of lectures, readings, and problem sets.  In addition to two midterms and a final examination, there will be a number of homework  quizzes equally spaced over the term, all in-class.  The quiz questions are based on assigned problem sets in the textbook.  All quizzes/examinations will be closed book.\n\nCourse outlines are as follows.\n1. Introduction 數學基礎簡介\n2. Transfer functions 轉換函數\n3. Signal flow graph 訊號流程圖\n4. Mathematical models 實際系統數學模式之求得\n5. State space equations 狀態方程式\n6. Stability analysis of linear systems 線性系統之穩定度分析\n7. Time domain analysis 控制系統之時域分析\n8. Root locus 根值軌跡圖\n9. Frequency domain analysis 控制系統之頻域分析\n10. Controller design in time and frequency domains 時域及頻域下之控制器設計",
    "schedule": "1. Introduction to control systems\n2. Dynamic models (I) 　\n3. Dynamic models (II) 　\n4. Dynamic response (I)\n5. Dynamic response (II)\n6. Dynamic response (III)\n7. Midterm examinations (I) 　\n8. Basic properties of feedback (I) 　\n9. Basic properties of feedback (II)\n10. Basic properties of feedback (III)\n11. The root-locus design method (I)\n12. Midterm examinations (II) 　\n13. The root-locus design method (II)\n14. The root-locus design method (III) 　\n15. The frequency-response design method (I)\n16. The frequency-response design method (II) 　\n17. The frequency-response design method (III) and introduction to state space approach\n18. Final examination 　",
    "scorePolicy": "The final grade will be a weighted average of class participation 10%, homework quizzes 15%, midterms 25%+25%, and final 25%.",
    "materials": "TEXTBOOK:　　Feedback Control of Dynamic Systems, Eighth Edition,\nPearson Education, Inc.\nby Gene F. Franklin, J. David Powell, and Abbas Emami-Naeini\n總代理：滄海圖書公司 Tel: 04-2708-8787\n\nREFERENCES: Automatic Control Systems by B. C. Kuo\nControl Systems by M. Gopal\nModern Control Systems by R. C. Dorf",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">The lecture will be based mainly, but not entirely, on material in the textbook.  Students are especially encouraged to read related textbooks in the field of control systems in addition to lecture notes of the course.</div>"
  }
]
