[
  {
    "name": "杜敏誠",
    "email": "mtu@ntut.edu.tw",
    "latestUpdate": "2022-01-03 14:07:43",
    "objective": "Most human settlements were close to rivers. Therefore, modifying river channels to reduce the chance and magnitude of floods has been the main focus of conventional ways to tame rivers. However, the traditional ways of cementing river channels destroy natural habitats and are not aesthetically pleasing. Fluvial ecological engineering is a new field, which achieves the purposes of flood prevention, landscaping, recreation, and ecological conservation by using natural materials and following natural hydrological trends of rivers. The course will first introduce the evolution of river engineering throughout history. Because ecological engineering has to conform with the natural trend of river evolving, principles of fluvial geomorphology will be then introduced in the class. After students have these basic understandings, the course will continue on introductions of concepts, methods, and procedures. Field cases of fluvial ecological engineering in Taiwan as well as other\ncountries will be introduced to students.",
    "schedule": "(Tentative)\nWeek 1: Introduction\nWeek 2: History of river management and rehabilitation\nWeeks 3-6: Fluvial geomorphology\nWeeks 7-8: Concepts and procedures\nWeeks 9-10: Midterm presentation (data collection)\nWeeks 11-12: Design steps\nWeeks 13-14: Case studies\nWeeks 15-16: Final presentation",
    "scorePolicy": "(Tentative)\n5% Submission of team members and project summary\n25% First oral report (10% Data completeness，10% Data collection efforts，5% Presentation skills)\n35% Final exam\n35% Final oral report (10% Slide design，10% Details of contents，15% Presentation skills)",
    "materials": "Materials compiled by the instructor\n\nReferences:\n林鎮洋，陳彥璋，吳明聖，(2004)，河溪生態工法，明文書局\nKnighton, D. (1998). Fluvial Forms &amp; Processes. Hodder Education, London, UK.",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">This is an English EMI (English medium instruction) class. The instructor will make sure that all students understand the material before moving on, but basic English listening and reading skills are still preferred.</div>"
  }
]
