[
  {
    "name": "黃博全",
    "email": "pchuang@ntut.edu.tw",
    "latestUpdate": "2022-01-04 17:13:15",
    "objective": "太陽能工程是一門利用太陽之能量來提供人類能源之科學，太陽能為取之不盡用之不絕，且為乾淨又穩定之來源，在油價高漲且地球環境保護需求日益殷切的今日，太陽能之能源應用，已成為今日最熱門之學科。\n本科目將由認識太陽、地球與太陽互動關係、地球上太陽能之基本熱輻射理論，結合各種不同形式之利用太陽能源有效裝置，討論太陽能之有效利用方式及相關系統技術。以期在既有太陽能利用技術上，發揮更有效率的太陽能源工程系統設計，奠定未來 21 世紀太陽能源利用之高效率化基礎。\n\nSolar energy engineering is a science that uses the energy of the sun to provide human energy. Solar energy is inexhaustible, and it is a clean and stable source. Today, when oil prices are rising and the demand for environmental protection is increasing, solar energy is an energy source. Application has become the most popular subject today.\nThis subject will discuss the effective use of solar energy and related system technologies by understanding the sun, the interaction between the earth and the sun, and the basic thermal radiation theory of solar energy on the earth, combining various effective devices for using solar energy sources. It is hoped that in the existing solar energy utilization technology, more efficient solar energy source engineering system design will be used to lay the foundation for the high efficiency of solar energy source utilization in the future 21st century.",
    "schedule": "周次　　授課內容　　作業\n1　　Ready week - Overall introduction　　\n2　　Chap. 1 Introduction to Solar Energy and Its Conversion for Use on Earth　　    \n3　　Chap 1 Introduction to Solar Energy and Its Conversion for Use on Earth　　Homework 1\n4　　Chap. 2 Fundamentals of Solar Radiation (I)　　\n5　　Chap. 2 Fundamentals of Solar Radiation (II)　　\n6　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (I)　　Homework 2\n7　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (II)　　Homework 3\n8　　Chap. 3 Fundamentals of Fluid Mechanics and Heat Transfer (III)　　\n9　　Chap. 4. Methods of Solar Collection and Thermal Conversions (I)　　\n10　　Chap. 4. Methods of Solar Collection and Thermal Conversions (II)　　Homework 4\n11　　Chap. 5 System Analysis, Component and Economics of Solar System (I)　　\n12　　Chap. 5 System Analysis, Component and Economics of Solar System (II)　　Homework 5\n13　　Chap. 6 Solar-Heating Systems (I)　　\n14　　Chap. 6 Solar-Heating Systems (II)　　Homework 6\n15　　Chap. 7 Solar Cooling and Dehumidification (I)　　\n16　　Chap. 7 Solar Cooling and Dehumidification (II)　　Homework 7\n17　　Chap. 8 Solar Electric Power and Process Heat (I)　　\n18　　Chap. 8 Solar Electric Power and Process Heat (II)　　Homework 8\n19　　Chap. 9 Natural Solar Conversion Systems (I)　　\n20　　Chap. 9 Natural Solar Conversion Systems (II)　　Homework 9\n21　　Research report presentation　　\n22　　Research report presentation",
    "scorePolicy": "作業、平時考、上課表現出席率 (20%)\n期中考 (或研究報告)(40%)，\n期末考 (40%)\n註：作業須於規定期限內繳交，逾期一週以內所得成績打 80% 計算，逾期一週以上者，以零分計算。",
    "materials": "教科書: Frank Kreith and Jan F. Kreider, Principles of Solar Engineering, Hemisphere Publishing Corporation, 1978\n\n參考書:.\n1.　　太陽能系統分析與設計\n2.　　Edward E. Anderson, Fundamentals of Solar Energy Conversion, Addison Wesley Publishing Company.\n3.　　黃文雄，太陽能之應用及理論，協志工業叢書。",
    "foreignLanguageTextbooks": true
  }
]
