[
  {
    "name": "宋裕祺",
    "email": "sungyc@ntut.edu.tw",
    "latestUpdate": "2022-02-02 09:31:13",
    "objective": "This course provides the students an insight into structural analysis. Some essential classical analysis methods are described. The purpose of this course is to make the students a better understanding of analytical principles of structures. The practical applications to structural engineering are also discussed.",
    "schedule": "Week 1：Introduction\nWeek 2：Background of Structural Analysis\nWeek 3：Justification of Stability Degree of Structure I\nWeek 4：Justification of Stability Degree of Structure II\nWeek 5：Analysis of Reactions of Statically Determinate Structure\nWeek 6：Analysis of Shear Force &amp; Bending Moment of Statically Determinate Beam\nWeek 7：Analysis of Axial Force, Shear Force &amp; Bending Moment of Statically Determinate Rigid Frame\nWeek 8：Analysis of Axial Force of Statically Determinate Truss I\nWeek 9：Analysis of Axial Force of Statically Determinate Truss II\nWeek 10：Analysis of Axial Force of Statically Determinate Truss III\nWeek 11：Midterm\nWeek 12：Virtual Work Theory\nWeek 13：Analysis of Influence Line of Statically Determinate Beam &amp; Rigid Frame\nWeek 14：Analysis of Influence Line of Statically Determinate Truss I\nWeek 15：Analysis of Influence Line of Statically Determinate Truss II\nWeek 16：Conjugate Beam Method I\nWeek 17：Conjugate Beam Method II\nWeek 18：Final",
    "scorePolicy": "Midterm    40% \nFinal   40%\nHomework   10%\nQuiz   10%",
    "materials": "Elementary Theory Of Structures, Yuan-yu Hsieh\nHandout of “Structural Analysis”, Dr. Yu-Chi, Sung",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >GoogleMeet for remote teaching in case of Covid-19 disease control</div>"
  }
]
