[
  {
    "name": "莊銘中",
    "email": "chuang252116@gmail.com",
    "latestUpdate": "2022-02-16 23:51:50",
    "objective": "人際關係是探討對自我的了解及對人的認知，包括性格、態度、魅力、溝通、壓力、挫折和情緒等重要課題的處理；幫助同學學習與各種不同品味、信念、立場與生活方式的人作有效率的溝通，開放的表達出自己的感覺與想法，以建立良好的合作關係，從而開發潛能、爭取更好的發展機會。溝通是人際關係中重要的手段，本課程提供學生對溝通知識的了解，並熟悉溝通的實務運用。課程重心涵蓋溝通的本質與觀念性架構，溝通的理論與模型，溝通的規劃、執行與控制，溝通的策略與技能。\nInterpersonal Relationship is to discuss about self-understanding and perception of other people, including how to handle key issues related to character, attitude, attractiveness, communication, pressure, frustration and emotion. It helps students to learn effective communication, open their minds to express personal feeling and thought, and try to communicate with other people having different tastes, convictions, standpoints and ways of living so as to establish a harmonic and cooperative relationship and develop personal potential and strive for better opportunity of development. The course discuss about the communication issue from business manager. It introduces the concepts of communication and the practice about communication. The core of the course include the knowledge of communication and structure、theory and models.",
    "schedule": "第一週      上課規範與課程說明\n第二週      導論\n第三週      人際關係與溝通理論\n第四週      溝通與表達\n第五週      語言溝通與非語言溝通\n第六週      傾聽技巧與同理心反應\n第七週      人際吸引與人際關係\n第八週      情緒管理與人際溝通\n第九週      期中考週\n第十週\n第十一週   人際衝突與協商\n第十二週   友情關係：贏取與維繫 \n第十三週   愛情關係：從浪漫到許諾\n第十四週   職場關係：求職\n第十五週   職場關係：面試\n第十六週   職場關係：在職\n第十七週   職場關係：離職\n第十八週   期末考週",
    "scorePolicy": "期中分享 30％\n期末分享 30％\n平時出席 40％",
    "materials": "人際關係與溝通－瞭解溝通技巧\n胡愈寧 葉肅科 著作\n華立圖書\nISBN 978-957-784-945-8\n每週上課以實例個案的分析與教師的職場與人際體驗，分享與講授內容為主，期中與期末評量以開放性考題為主，分享同學們對本課程的理解，共鳴，體認或啟發，以幫助同學們在未來的人生旅途中無論是職涯或是生涯，在職場、家庭、親子、朋友，同學，伴侶等人際關係以及應對與溝通中，起到能以智慧圓滿化解衝突，危機，尷尬與挫折，成為人生勝利組。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 疫情遠距教學規劃：\n開學第一週請全體修課同學加入群組，如因疫情改由遠距線上授課，將在群組引導同學們使用 teams 上課，同時以 line 群組同步配合遠距上課。</div>"
  }
]
