[
  {
    "name": "陳怡靜",
    "email": "sweetprettylover@gmail.com",
    "latestUpdate": "2021-12-25 00:46:56",
    "objective": "The Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application. Depending on the choice of the instructor, the courses can be divided into two categories. 1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity. 2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability. It is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.\nThis course is for IEECUS international students. Students have an ability to manage Chinese language in daily life.In the second and the third year, the training focuses on paragraph reading and term/character recognition-in addition to the teaching themes set in the first year. Writing courses are also added during this stage. We'll start from daily scenario and get advanced Chinese phrase in writing skill.\nStudents would learn how to interact with people in Taiwan.",
    "schedule": "W1 Introduction \nW2 Peace memorial's  day\nW3 overall review\nW4 Greetings\nW5 Thanks\nW6 Invitations\nW7 Children's day\nW8 Pre-Departure orientation and culture difference discussion\nW9  Field trip\nW10 Requests\nW11 Refusals\nW12 Complaining\nW13 Suggestions\nW14 Exaggerations\nW15 Praise\nW16 Threats\nW17 Assertions\nW18 Final exam",
    "scorePolicy": "Attendance 20%\nDiscussion and assignments 20%\nField trip 30%\nFinal exam 30%",
    "materials": "1. 實用生活華語：掌握語用情境溝通、對話的秘訣 釀出版\n2. 看圖學中文語法：基礎篇 聯經\n3. 看圖學中文語法：進階篇 聯經\n4. 情境華語 統一出版社\n5. 台灣萬花筒・華語看世界 新學林",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">Scaffolding learning</div>"
  }
]
