[
  {
    "name": "陳儀",
    "email": "",
    "latestUpdate": "2022-02-23 11:55:00",
    "objective": "本課程「國語文實務應用」，專為本校科技大學的同學而設計，以未來於職場（生存）與人生（生活、生命）之實務應用為教學標的。 \n    奠基於大學之前 12 年的國語文能力上，課程設計朝向多元實務應用的方向，以建構學生多元溝通表達之職場需求力為要，包括資訊蒐集力、資訊應用力、簡報製作力、文案企劃力、自我宣傳力、口語溝通力、採訪寫作力、理念論述力、創新思維力等諸多領域的能力，並重視啟發學生培養生活品味力，深化學生對於生命關懷力的體認，以契合本校重視實務應用的優良傳統，以及學生未來畢業後的實務需求。\nThis course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "第 1 週 課程說明、分享與對話\n第 2 週 道家思想介紹及《莊子》選讀\n第 3 週 《莊子》選讀\n第 4 週 履歷自傳介紹\n第 5 週 運動會停課\n第 6 週 履歷自傳寫作\n第 7 週 校慶補假\n第 8 週 蒲松齡〈嬰寧〉\n第 9 週 故事設計寫作\n第 10 週 儒家思想介紹及《論語》選讀\n第 11 週 《孟子》選讀\n第 12 週 企畫書介紹、發想與評估\n第 13 週 企畫書結構與內容\n第 14 週 小組發想與討論\n第 15 週 企畫書提案與設計\n第 16 週 企畫書小組提案報告\n第 17 週 企畫書小組提案報告\n第 18 週 期末考",
    "scorePolicy": "課堂出席與討論 30%\n活動與作業 40% \n期末考 20% \n國文會考 10%",
    "materials": "教師自編教材。\n朱熹著：《四書章句集注》，臺北市：國立臺灣大學出版中心，2016 年。\n蒲松齡撰，呂湛恩註：《全圖詳註聊齋志異》，臺北：廣文，1991 年。\n饒宗頤主編，陳鼓應、蔣麗梅譯注：《莊子》，香港：香港中華書局，2012 年。\n參考閱讀：\nCarmine Gallo 著，羅雅萱、劉怡女譯：《跟 TED 學表達，讓世界記住你：用更有說服力的方式行銷你和你的構想》，臺北市：先覺，2014 年。\nSam Horn 著，洪慧芳譯：《說出亮點吸引力》，臺北市：天下雜誌，2017 年。\n徐秀菁等合著：《南瓜變馬車 —— 應用文故事指導書》，臺北：五南，2018 年。\n清水久三子著，賴庭筠譯：《用對圖，簡報更有力：IBM 簡報教主傳授打動人心的圖表簡報術》，新北市：好優文化，2018 年。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1. 本課程將以北科 i 學園做為課程網頁。\n2. 如有加退選或課程問題請寄 email 給老師（yioocat@yahoo.com.tw）。\n3. 因應 COVID-19 疫情可能會調整授課方式、進度與評量方式。若無法實體上課，預計使用 Google Meet 於原定上課時間遠距上課，細節將再另行公布。</div></b></b>"
  }
]
