[
  {
    "name": "羅梅君",
    "email": "mcl@mail.she.edu.tw",
    "latestUpdate": "2022-01-10 17:44:56",
    "objective": "This lecture is designed for university-level students to learn how to create images and simple interactive multimedia related applications (including interactive art, live video processing, and data visualization) through a casual and concise introduction to computer programming. It’s presented in a non-threatening way that will ease students into programming and teach them to craft their own digital artwork and webpage/mobile apps and even combine works with hardware—no prior programming experience required. The Processing language taught using Python or Java or JavaScript (p5.js), will lead students to visualize the programming design concepts, through the production of computer graphics that illustrate the coding principles while being artworks. Over the course, students will learn the basics of drawing/designing simple shapes, move on to photo/image editing and video manipulation, and ultimately affect the physical world by using Processing with multimedia.\n本講座是專為大學水平的學生設計的，旨在通過對計算機編程的簡要介紹來學習如何創建圖像和與交互式多媒體相關的簡單應用程序（包括交互式藝術，現時視頻處理和數據可視化）。它是以非威脅性的方式呈現，可以使學生輕鬆編程，並教他們製作自己的數位作品和網頁 / 手機應用程式，甚至將作品與硬件結合在一起 - 學生無需要有先前編程經驗也可以很快上手。課程中將通過使用 Java 或 Python 或 JavaScript（p5.js）教授的處理語言，引導學生通過計算機圖形學的理論將編程設計的概念形象化，亦即經由編碼原理實踐電腦圖形的生成和藝術品的創作。在課程中，學生將使用多媒體處理應用軟體 (Processing)，首先學習繪製 / 設計簡單形狀的基礎知識，循序漸進地繼續進行照片 / 圖像編輯和視頻處理，期望最後實踐產生和實體世界響應相通並以多媒體形式呈現的 2D 和 3D 成品。",
    "schedule": "第 01 週:　　Hello: (The Beginning) Pixels, Processing, and Interaction\n第 02 週:　　Starting to Codes: Your First Program; Show; Save and New; Share\n第 03 週:　　Draw: Display Window; Basic Shapes; Draw Order; Shape Property; Draw Modes; Color; Custom Shape; Comments; Robot 1/Draw\n第 04 週:　　Variables: First Variables; Making Variables; Processing Variables; Little Math; Repetition; Robot 2/Variables\n第 05 週:　　Responses: Once and Forever; Follow; Modifying Global Variables; Click; Location; Type; Map; Robot 3/Responses\n第 06 週:　　Translate/Rotate/Scale: Translate; Rotate; Scale; Push and Pop; Robot/Translate, Rotate, Scale\n第 7 週:　　Media: Images; Fonts; Shapes; Robot 5/Media\n第 8 週:　　Mid-Term\n第 9 週:　　Motions: Frames; Speed and Direction; Tweening; Random; Timers; Circular; Robot 6/Motions\n第 10 週　　Functions (I): Function Basics; Make a Function \n第 11 週:　　Functions (2): Return Value; Robot 7: Functions\n第 12 週:　　Objects: Fields and Methods; Define a Class; Create Objects; Robot 8/Objects\n第 13 週:　　Lists: From Variables to Lists; List Operations; Repetition and Lists; Lists of Objects; Robot 9/Lists\n第 14 週:　　Data and Dictionaries (I): Data Summary; Dictionaries; CSV Files\n第 15 週:　　Data and Dictionaries (II): JSON;  Network Data and APIs; Robot 10/Data \n第 16 週:　　Extend I: Sound; Image and PDF Export \n第 17 週:　　Extend II: Android\n第 18 週:　　Final-Exam (Project)",
    "scorePolicy": "平時成績 (出席率、上課表現和作業):55%  期中成績：20%   期末考：25%\n上課表現包括：熱心教導同學，學習大進步，態度積極進取。 \n特別必須注意者：每周所交代規定之作業 (Homework) 若未繳交 (包含未完成基本該有的進度和功能，亦視同未繳交；就算是當周缺席未到課，仍然得繳交當周所交代的作業)",
    "materials": "使用教材 (教科書)\n1.　　Casey Reas and Ben Fry, Make: Getting Started with Processing, Second Edition, Maker Media, September 2015.\n\n參考書目\n2.　　Margaret Noble, Programming Media Art Using Processing: A Beginner's Guide, CRC Press, 2021.\n3.　　Yu Zhang (Author), Mathias Funk (Contributor), Coding Art: The Four Steps to Creative Programming with the Processing Language (Design Thinking) (English), Apress, 01/2021\n4.　　Casey Reas &amp; Ben Fry, Make: Getting Started with Processing, MAKER MEDIA, 2015.\n5.　　Lauren McCarthy, Casey Reas &amp; Ben Fry, Make: Getting Started with p5.js, MAKER MEDIA, 2016.\n6.　　Casey Reas and Ben Fry, Processing: A Programming Handbook for Visual Designers, Second Edition, The MIT Press. December 2014.\n7.　　Derek Runberg, The SparkFun Guide to Processing, No Starch Press, 2015.\n8.　　Daniel Shiffman, Learning Processing, Second Edition: A Beginner's Guide to Programming Images, Animation, and Interaction, Morgan Kaufmann, August 2015.\n9.　　Allison Parrish, Ben Fry, and Casey Reas, Make: Getting Started with Processing.py, MAKER MEDIA, 2016. (有中文翻譯本)\n10.　　Daniel Shiffman, The Nature of Code: Simulating Natural Systems with Processing, December 2012.\n11.　　Hartmut Bohnacker, Benedikt Gross, Julia Laub, and Claudius Lazzeroni,Generative Design: Visualize, Program, and Create with Processing, Princeton Architectural Press, August 2012.\n12.　　Jeffrey L. Nyhoff, Larry R. Nyhoff, Processing: An Introduction to Programming,  CRC Press, May 2017.\n13.　　Ira Greenberg, Dianna Xu, Deepak Kumar, Processing: Creative Coding and Generative Art in Processing 2, friends of ED, April 2013.\n14.　　Andrew S. Glassner, Processing for Visual Artists: How to Create Expressive Images and Interactive Art, A K Peters, August 2010.\n15.　　Penny de Byl, Creating Procedural Artworks with Processing A Holistic Guide, CreateSpace Independent Publishing Platform, May 2017. \n16.　　Nikolaus Gradwohl, Processing 2: Creative Coding Hotshot, PACKT, May 2013.\n17.　　Jan Vantomme, Processing 2: Creative Programming Cookbook, PACKT, September 2012.\n\nOther Materials from Websites.\n18.　　https://processing.org/\n19.　　http://learningprocessing.com/examples/           \n20.　　http://learningprocessing.com/exercises/\n21.　　http://learningprocessing.com/videos/\n22.　　http://learningprocessing.com/resources/\n23.　　https://www.youtube.com/user/shiffman              \n24.　　https://www.youtube.com/user/shiffman/videos  \n25.　　http://happycoding.io/tutorials/processing/          Processing Tutorials\n26.　　http://happycoding.io/tutorials/  \n27.　　https://en.wikipedia.org/wiki/Processing_(programming_language)",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 曠課 12 小時扣考 (以老師點名記錄為主，就算學校點名系統關閉之後的曠課時數也在計算在內)。</div>"
  }
]
