[
  {
    "name": "黃琛傑",
    "email": "conji2@yahoo.com.tw",
    "latestUpdate": "2022-02-16 10:40:38",
    "objective": "本課程「國語文實務應用」，專為本校科技大學的同學而設計，以未來於職場（生存）與人生（生活、生命）之實務應用為教學標的。 奠基於大學之前 12 年的國語文能力上，課程設計朝向多元實務應用的方向，以建構學生多元溝通表達之職場需求力為要，包括資訊蒐集力、資訊應用力、簡報製作力、文案企劃力、自我宣傳力、口語溝通力、採訪寫作力、理念論述力、創新思維力等諸多領域的能力，並重視啟發學生培養生活品味力，深化學生對於生命關懷力的體認，以契合本校重視實務應用的優良傳統，以及學生未來畢業後的實務需求。\nThis course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life. Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "第 1 週　　課程概說\n第 2 週　　和平紀念日放假\n第 3 週　　職場實務綜合應用：別當書呆子！（《孔子家語・六本》、《孔子家語・顏回》）\n第 4 週　　職場實務綜合應用：動機好，結果一定好？（《孔子家語・致思》）\n第 5 週　　職場實務綜合應用：「標準」是固定不變的嗎？（《論語・先進》、《淮南子・人間訓》）\n第 6 週       職場實務綜合應用：「勇敢」也分學位！（《莊子・秋水》、《韓詩外傳》）\n第 7 週　　兒童節放假\n第 8 週　　職場實務綜合應用：身正不怕影子斜？（《孔子家語・致思》、《孔子家語・在厄》）\n第 9 週　　期中考\n第 10 週　　職場實務綜合應用：《韓非子・說林（上）》研析\n第 11 週　　職場實務綜合應用：《韓非子・說林（上）》研析\n第 12 週　　職場實務綜合應用：《韓非子・說林（上）》研析\n第 13 週　　職場實務綜合應用：《韓非子・說林（上）》研析\n第 14 週     職場實務綜合應用：《韓非子・說林（下）》研析\n第 15 週　　職場實務綜合應用：《韓非子・說林（下）》研析\n第 16 週　　職場實務綜合應用：《韓非子・說林（下）》研析\n第 17 週　　職場實務綜合應用：《韓非子・說林（下）》研析\n第 18 週　　期末考",
    "scorePolicy": "會考                10%\n出席與發言     30 %\n期中考            30 %\n期末考            30%\n\n視疫情影響可能調整授課順序、講授內容、教授方式、評量方式及配分比例等。\n無法到課者，以閱覽課程錄影（見「北科 i 學園 PLUS）的方式學習。評量方式，則改為繳交期中與期末兩份報告，配分各佔 50 ％。",
    "materials": "自編教材        請自行至「北科 i 學園」下載",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 若疫情升級，無法到校上課，則調整教學方式為遠距教學\n遠距教學網址：meet.google.com/bmg-nhkj-dbu\n相關異動訊息，請留意「北科 i 學園 PLUS」公告欄\n教師聯絡方式：conji2@mail.ntut.edu.tw</div>"
  }
]
