[
  {
    "name": "黃如瑩",
    "email": "vinia@ntut.edu.tw",
    "latestUpdate": "2022-04-07 19:36:02",
    "objective": "Objectives 課程目標: \nWe will explore an array of intriguing social/cultural issues while enjoying a selection of stories, in multi-media forms, suitable for teenagers/young adults. \nThese stories serve as best materials (1) not only for language learning and cultural literacy (2) but also for the cultivation of full language skills. \nFor each story, we will engage in group discussions about the issues addressed in the text to cultivate our critical thinking.",
    "schedule": "I.Required texts 閱讀文本\n(1) Each student chose one English novel to read for the first halfof the semester\n(2) The Classic Fairy Tales. Ed. By Maria Tatar. New York; London: Norton, 2016.\n\nII. Affiliated FB Pages 臉書專頁\n(1) Young Heart 躍讀童心\nhttps://www.facebook.com/ViniaYoungHeart\n(2) 兒童與青少年文學\nhttps://www.facebook.com/Children.Teenagers.Literature\n(3) Think Film 電影心 \nhttps://www.facebook.com/Think-Film-% E9%9B% BB% E5% BD% B1% E5% BF%83-1974172409567281\n\n\nIII.　　Syllabus\nWeek 1: (1) Introduction \n(Please choose one novel to read for the whole semester.)\n(2) Dune by Frank Herbert \nTheme One: \u000bGoing through the labyrinth; \u000bThe Hero (ine)’s Journey \nWeek 2: The Giver  by Lois Lowry \nWeek 3: The Maze Runner  by James Dashner\nOr Pan’s Labyrinth by Guillermo del Toro\nWeek 4: The Hunger Games  by Suzanne Collins\nWeek 5: Life of Pi by Yann Martel\n.\nTheme Two: \u000bFacing deception; \u000bsolving mysteries \u000b\nWeek 6: Sherlock Holmes and John Watson  by Authur Conan Doyle\nWeek 7: The Girl with the Dragon Tatoos  by Stieg Larsson\nWeek 8: The Girl with the Pearl Earring by Tracy Chevalier \nOr The Best Offer by Giuseppe Tornatore\nWeek 9 (Mid-term exam week): \nThe Goldfinch  by Donna Tartt\n.\nTheme Three:  Looking for the Self \nWeek 10: The Perks of Being a Wallflower  by Stephen Chbosky\nWeek 11: The Little Women  by Louisa May Alcott (1832-1888)\nWeek 12: Alice in the Wonderland by C. S. Lewis, or The Wizard of Oz by L. Frank Baum\nWeek 13: The Golden Compass by Philip Pullman\nWeek 14: The Kite Runner  by Khaled Hosseini\n.\nTheme Four: Love and Passion\nWeek 15: Stardust  by Neil Gaiman\nWeek 16: The Book Thief  by Markus Zusak\nWeek 17:  The Shape of Water by Guillermo del Toro\nWeek 18 (Final examination week): Final project presentation",
    "scorePolicy": "1. Presence: 30% \n2. Homework and participation in classroom discussions: 30% \n3. Mid-term oral report with Prof. Huang on the novel of your choice: 10% \n4. Final presentation in the class on the novel of your choice:  10% \n5. Written final paper on the novel: 20%",
    "materials": "Reference books:\n(1) The 20th-Century Children's Book Treasury. By Janet Schulman. New York: Alfred A. Knopf., 1998.\n(2) The 20th-Century Children's Poetry Treasury. Selected by Jack Prelutsky. Illustrated by Meilo So. New York: Alfred A. Knopf., 1999.\n(3) Beatrix Potter: The Complete Tales.  Authorized Edition by Frederick Warne. London: Penguin, 2002.\n(4) The Family Storybook Treasury:  Tales of Laughter, Curiosity, and Fun. New York: Houghton Mifflin Harcourt, 2011.\n(5) Jan Brett’s Snowy Treasury. By Jan Brett. New York: Penguin, 2007.\n(6) The Quentin Blake Treasury. By Quentin Blake.  London: Jonathan Cape, Random House, 2012.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >This class has an affiliated LINE group. \nEvery student will be invited to join this group on the first day of the class.\n We will relay information and hold on-line meetings on this platform. \n本班設有專屬 LINE 群組，\n在第一次上課時邀請大家參加，\n做為平時聯絡與舉行遠距教學之用.</div>"
  }
]
