[
  {
    "name": "楊士萱",
    "email": "shyang@ntut.edu.tw",
    "latestUpdate": "2022-01-25 22:04:19",
    "objective": "線性代數為科學與工程的基礎數學工具，本課程教授線性代數的基本概念與運算技巧。課程大綱包括：矩陣、線性聯立方程組、線性轉換、向量空間、特徵值及特徵向量、正交性與最小平方估計。\nThis course Linear Algebra\n- is a mathematics course.\n- is useful and fundamental to CSIE (and many other discipline) students.\n- emphasizes both computations and concepts.\n- asks you to use mathematical software packages (MATLAB, Scilab, or GNU Octave).\n- guides you to read an English textbook.\n- requires hard work.\n本課程\n- 為數學課\n- 為資工領域 (及許多其他專業領域) 學生基礎課程\n- 計算與概念並重\n- 要求使用 MATLAB, Scilab, 或 GNU Octave 等套裝軟體\n- 引導同學閱讀英文教科書\n- 需要同學用功讀書",
    "schedule": "1. Matrix Operations (Sections 2.1 and 2.2) 矩陣運算\n- To learn basic matrix arithmetic operations: addition, subtraction, multiplication power, transpose, and inverse. 矩陣加、減、乘、乘方、轉置、反矩陣\n2. Linear Equations (Sections 1.1 to 1.5) 線性方程式\n- To understand the basic terminologies and notations of matrices and systems of linear equations, in the forms of vector equation and matrix equation. 線性聯立方程組、向量方程式、矩陣方程式\n- Solving a system of linear equations by reducing a matrix to its echelon form. 解線性聯立方程組、階梯型式\nTest #1\n3. Introduction to Linear Independence and Linear Transformation (Sections 1.7, 1.8, and 2.3) 線性獨立與線性轉換\n- First exposure to key concepts such as linear independence and linear transformation. 線性獨立與線性轉換初探\n- More about the matrix inverse. 更多有關反矩陣\n- To summarize the concepts for systems of n linear equations in n unknowns. 綜整 n 個變數 n 個線性方程式\nMidterm Exam\n3. Vector Spaces (Chapter 4) 向量空間\n- Introduction to vector spaces. 向量空間簡介\n- Fundamental subspaces of a matrix: column space, row space, and null space. 矩陣子空間：行空間、列空間、零空間\n- Basis, coordinate system and dimension. 基底、座標系統和維度\nTest #2\n4. Eigenvalues and Eigenvectors (Chapter 5) 特徵值與特徵向量\n- To understand the meaning of eigenvalues and eigenvectors of a matrix, and the approaches to find them. 矩陣特徵值與特徵向量的意義與計算方式\n- Diagonalization of a matrix (linear transformation). 矩陣的對角化\n5.  Orthogonality and Least Squares (Chapter 6) 正交性與最小平方\n- To introduce inner product of vectors, and thus the geometric concepts of length, distance, and angle (perpendicularity). 向量內積，長度、距離、角度 (垂直)\n- To be familiar with the use of orthogonal bases. 正交基底\n- Least-Squares approximation. 最小平方估計\nFinal Exam",
    "scorePolicy": "(視疫情影響可能會增減評分項次或調整配分比例)\n1. In-class attendance, Zuvio IRS practice and TA class attendance （上課點名 / 問答）, 5%. \n2. Written exercises （課本練習題、紙筆類型）, 12%. Hand in your homework before class. The lowest score will be discarded. \n3. Programming assignments and MATLAB/Scilab projects, 8%. Submit commands, results, and discussions through 北科 i 學園 +.\n4. In-class quizzes （隨堂考）, 20%. \n5. Two 50-minute tests, 10% each. (20%)\n6. Midterm exam and final exam, 20% each. (40%)\n本課程原則上不接受期中撤選，請非本班同學三思後再加選，另人數不得超過教室容量。\n\nClassroom Rules (上課規範):  “尊重自己、也尊重他人學習的權益”\n1. 請準時上課，不遲到早退。\n2. 非經允許，上課時不可使用手機、平板、筆電等電子用品。手機請關機或調成靜音。\n3. 上課時請專心於此課程之學習，非討論時間請避與他人交談。\n4. 如有短暫急事，得在不影響他人上課的情形自行離開教室，並請迅速回座。\n5. 如有事無法出席請盡量事先請假，並須有相關證明文件。\n6. 習題可討論但勿抄襲。\n違反以上規範者，將視情節輕重扣分。",
    "materials": "Textbook (教科書): \nDavid. C. Lay, Stephen R. Lay, and Judy J. McDonald, Linear Algebra and its Applications, Sixth Edition, Pearson Education Limited, 2022. （偉明書局代理）\nGood References (參考書):\n1. Introduction to Linear Algebra with Applications by J. Defranza and D. Gagliardi. \n2. Elementary Linear Algebra by Howard Anton. \n3. Linear Algebra and Its Applications by Gilbert Strang.",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">1. 同學如有加退選簽核或課程問題請 email: shyang@ntut.edu.tw，信件標題 [線性代數]_班級 (或隨班附讀)_名字。\n2. 課程其他資料將透過北科 i 學園 +、FB 或 Teams 公布。請同學加入 FB 社團 https://bit.ly/345XeUO \n3. 因應疫情可能會調整授課內容、授課方式、評分項目與配分。如果無法實體上課，預定使用 Teams 與 Zuvio 於原定上課時間遠距上課，細節再另行公布。</div>"
  }
]
