[
  {
    "name": "李凱誠",
    "email": "k11008@ntut.edu.tw",
    "latestUpdate": "2022-02-17 14:35:50",
    "objective": "「全民國防教育法」自民國 95 年 2 月開始施行，以國際情勢、國防政策、全民國防、防衛動員、國防科技五大主軸作為全民國防教育的課程規畫。「國際情勢」單元，主要論述區域安全與兩岸情勢發展，培育學生宏觀的國際視野；更進一步說明在全球化浪潮下，國際重要的安全議題及我國的因應之道。「國防政策」單元，在論述我國國防政策內涵及大陸政策的發展，使學生認識當前國防政策施政方針，增進國防安全知識；並介紹我國國家安全法制與危機管理機制，藉此體認國家安全的重要性，加強全民國防意識。「全民國防」單元，主要論述國家意識及全民防衛的概念、內涵與重要性，並介紹國防與經濟、文化、心理的關聯，讓學生理解國防事務其實與生活息息相關，加強全民國防意識，增進對國家的認同。「防衛動員」單元，在探討全民防衛動員的意義與功能，說明全民防衛動員對國家安全的重要性；並介紹青年服勤動員內涵，讓學生體會自己在全民防衛動員體系中所扮演的角色，進而涵養愛國意識，深化全民國防共識。「國防科技」單元，主要使學生了解武器系統概況，並認識國防科技發展與我國國防產業現況，引發對國防科技的興趣，進而認同國防、支持國防。\nIn order to meet the requirement of Act of All-Out Defense Education that put into action in February 2006, the curriculum of All-Out Defense Education Military Training planned by Ministry of Education is divided into five sections: International Situations, National Defense Policies, Civil Defense, Defense Mobilization, and Military Technology. In International Situations, the object is to cultivate students’ broader international perspectives through discussing Asian-Pacific regional security and the development of cross-strait relation. In Civil Defense, the object is to make students aware that national defense affairs are closely related to their daily life. In Defense Mobilization, the object is to let students recognize their roles in all-out defense mobilization system. In Defense Technology, the main object is to let students overview the development of weapon systems, and understand the current development of the nation’s defense technology and defense industry.",
    "schedule": "一、國防與政治\n上課週數：1\n單元主題：國防與政治基本概念、國防與政治的關係、國防政策制定與政治\n二、我國國家安全政策與法制\n上課週數：1\n單元主題：國家安全的本質與威脅、我國國家安全戰略與政策、我國國家安全法治與運作\n三、我國大陸政策與國防\n上課週數：1\n單元主題：我國大陸政策的發展、大陸政策與國防\n四、我國國防政策\n上課週數：2\n單元主題：我國國防政策主軸、我國國防戰略目標、我國軍事戰略構想、我國重要國防施政\n五、我國國防轉型與改革\n上課週數：3\n單元主題：國防轉型的分析指標、國防組織的變革、軍事戰略準則的演變、我國武器系統的建構與研發、綜合評估\n六、測驗\n上課週數：1\n七、國防政策與軍事戰略\n上課週數：3\n單元主題：我國國防政策、我國國防戰略與軍事戰略、國防轉型、國防武力、國防資源與災害防救\n八、兵役實務與募兵制生涯規劃\n上課週數：2\n單元主題：我國兵役制度沿革、徵兵作業程序、國軍志願役班隊簡介\n九、愛國教育\n上課週數：3\n單元主題：國軍使命與軍人信念的意含與實踐、辛亥革命與舞動國旗 - 革命先烈捨身成仁精神與現代青年愛國行動\n十、測驗\n上課週數：1",
    "scorePolicy": "依考試成績、出席情況、學習態度、課前準備、課堂討論時的表現、學期報告… 等綜合評量（依各授課教官上課要求為原則）",
    "materials": "自編教材",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1. 如疫情嚴重改為遠距授課時，視疫情發展與實際授課情況滾動調整課程內容、課程進度、評量方式、與評量標準。\n2. 相關資訊由各班班代轉知班上同學，如有問題亦可 email (k11008@ntut.edu.tw) 或電話 (校內分機 1906) 與老師聯絡討論。</div>"
  }
]
