[
  {
    "name": "王怡鈞",
    "email": "bnwntut8@ntut.edu.tw",
    "latestUpdate": "2022-01-21 18:08:09",
    "objective": "This is a science applied course that examines how the application of big data is made for our human to enhance technical and functional capabilities and how the big data processing efficiency can be facilitated and monitored to achieve well-defined objectives.\n\nAs it is well known that an optimized result made by Artificial Intelligence (AI) could not be significantly achieved without big data feedings. Nowadays, there are diversity of data type (mostly of non-structured ones) spreading on the air and pipelines, furthermore we are generating much more data and faster than ever before, and the application of big data does impact our daily life. Although we can store and process the data, there are problems using existing techniques to accommodate our most interests. For example, both accessing the data from disk in distributed systems and getting data to the processors are of the typical bottlenecks. \n\nThis course is designed to not only introduce students to Hadoop Big Data application and trend, but also its processing technology and ecosystems which are capable of eliminating the bottlenecks by its unique methods for storing and processing data per common application scenario. In addition, the course provides the platforms for students’ paper reading, group discussion, co-work assignment, case studies and presentation.\n\nThe course will introduce Hadoop core technologies and administration with its major listed below:\n\n　　Big Data in Demand and Its Application Trend\n　　Core Technologies of Hadoop for Big Data Management \n　　Management tool to simplify Hadoop Administration  \n　　Hadoop Cluster Deployment\n　　YARN Applications including MapReduce  \n　　Hadoop Cluster Hardware and Software \n　　Deployment of Hadoop Ecosystem Projects: Sqoop, Flume, Hive and Impala \n　　HDFS Configuration for High Availability\n　　Hadoop Security \n　　Cluster Resource Scheduling and Configuration \n　　Cluster Monitoring and Management\n　　Industrial Big Data and Ecosystems Development and Case Studies\n\n由於雲端運算的快速發展，大量資料收集與儲存技術已成瓶頸，大數據技術與管理提供一套具延展性與容錯能力的分散儲存與計算架構，能有效處理大量複雜數據資料的儲存與運算。\n本課程除介紹現有的大數據生態與趨勢，並針對目前軟硬體架構的處理瓶頸，提供系統組態與部署、服務層級協定、監控與管理等系統性規劃的解決方案，並導入跨領域的工程管理科學知識。課程簡扼論述大數據技術與管理的重要，並在 Hadoop 生態系統中，以 Cloudera Hadoop 為應用範例，實作說明其重要性。\n課程內容包括：大數據的概念、應用生態與趨勢、Hadoop 硬體規格與基礎架構規劃、叢集組態與部署、叢集服務層級協定、叢集監控與管理、相關生態技術。",
    "schedule": "(Syllabus, preliminary)\nTuesday. 18:30-21:10 (ABC)\n\nWeek#   Subject to change per needs and circumstances\n \n1      2/22　　        Syllabus &amp; organization of all mission cases from the class\n2      3/01　　        Big Data Application and Trend\n3      3/08             Core Technologies for Big Data Management-1\n4      3/15　　        Core Technologies for Big Data Management-2\n5      3/22             Hadoop Cluster Deployment\n6      3/29　　        Hadoop Distributed File System (HDFS)\n7      4/05             Public Holiday\n8      4/12　　        MapReduce\n9      4/19　　　　YARN Applications\n10     4/26　　        Planning Hadoop Cluster Hardware and Software\n11     5/03　　        Hadoop I/O\n12     5/10　　        Hadoop High Available, Failover, Fensing and Federation \n13     5/17　　        Resource &amp; Scheduler Management\n14     5/24　　        Hadoop Ecosystem Project Presentation and Q&amp;A -1\n15     5/31　　        Hadoop Ecosystem Project Presentation and Q&amp;A -2 \n16     6/07　　        Hadoop Ecosystem Project Presentation and Q&amp;A -3 \n17     6/14　　        Hodoop Security\n18     6/21　　        Final-Exam",
    "scorePolicy": "1. Assignment including Presentation, Comments and Q&amp;A：50%\n2. Final Exam: 40%\n3. Participations in class activities: 10%",
    "materials": "Reference:\n\n1.　　Hadoop: The Definitive Guide, Fourth Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Tom White\n2.　　Hadoop Essentials, First Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Shiva Achari.\n3.　　Hadoop Operation, First Edition, September 2012, Published by O’Reilly Media, Inc., Editor: Eric Sammer\n4.　　The Google File System;  https://static.googleusercontent.com/media/research.google.com/zh-TW//archive/gfs-sosp2003.pdf\n5.　　MapReduce: Simplified Data Processing on Large Clusters; https://static.googleusercontent.com/media/research.google.com/zh-TW//archive/mapreduce-osdi04.pdf\n6.　　Big Data associated, To-Be-Advised in class",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">If the coronavirus is alerted to Level-2 or 3, then the class  goes for \nOn-line class address: https://meet.google.com/rkg-kbgv-odo\nLINE Group address: https://line.me/R/ti/g/G54olti-X1\nTeacher's email: bnwntut8@ntut.edu.tw</div>"
  }
]
