[
  {
    "name": "朱子偉",
    "email": "twchu@ntut.edu.tw",
    "latestUpdate": "2022-01-28 16:44:23",
    "objective": "This course aims to introduce the configuration of system analysis and water resources system.  Secondly, it elaborate the theoretical bases and operation procedures of common deterministic mathematical programming methods (linear programming, dynamic programming and nonlinear programming).  Finally, several water resources systems based on the characteristics of surface water, reservoirs and cities will be depicted and perform the optimal and most effective planning, development, management and operation of water resources (including water quantity and water quality).\nObjectives:\n(1)To understand concepts and algorithms for optimization using linear, integer, network, nonlinear, and dynamic programming;\n(2)To understand the concepts of optimization as applied to water resources problems.",
    "schedule": "Unit 1: Planning and Analysis of Water Resource System\nUnit 2: Identification and Evaluation of Water Management Plans\nUnit 3: Objective Functions and Constraint Equations\nUnit 4: Linear Programming\nUnit 5: Network Programming\nUnit 6: Water Quality Modelling and Prediction\nUnit 7: Analytic hierarchy process",
    "scorePolicy": "practices：20%\nproject presentation：40%\nfinal exam：40%",
    "materials": "1.Loucks D. P., J. R. Stedinger, and D. A. 1981. Haith. Water Resource Systems Planning and Analysis. Prentice-Hall, Inc.\n2.Mays L. W. and Y. -K. Tung. 1992. Hydrosystems Engineering and Management. McGraw-Hill, Inc.\n3.Bazaraa M. S. and J. J. Jarvis. Linear Programming and Network Flows. 1977. John Wiley &amp; Sons, Inc.\n4.Phillips D. T. and A. Garcia-Diaz. Fundamentals of Network Analysis. 1981. Prentice-Hall, Inc.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因應疫情警戒等級規劃上課方式原則如下，請依照學校網頁所公布之訊息為準：\n● 上課方式：  遠距 或 分流上課\n● 評量方式：期中考、期末考採實體紙筆測驗，若在符合防疫規範的前提下，保留學生須到校進行實體測驗的可能，否則採遠距實體紙筆測驗。\n\n● 課程訊息公告：公布於北科 i 學園 +，並建立班級 line 群組。　　\n● 上課網址：在北科 i 學園 +\n● 加退選簽核及諮詢課程管道：分機 2630，twchu@ntut.edu.tw</div></b></b>"
  }
]
