[
  {
    "name": "劉傳銘",
    "email": "cmliu@ntut.edu.tw",
    "latestUpdate": "2022-02-14 17:32:21",
    "objective": "資料科學探索如何從大量、多元、非結構化的資料中發掘有價值的資訊，並有效提供相關的應用策略，探討的層面包括：資料處理及計算、資料儲存、數理統計及資料分析技術與應用等。本課程討論此一領域的進展，並使學生了解相關知識與技術工具，進而具備資料科學思維及應用能力。課程內容以廣度為主，主題包含資料管理、資料分析、資料視覺化、機器學習、深度學習，巨量資料等。\nData Science is an emerging multi-discipline field which is the intersection of computer science, statistics, and mathematics.  This course is designed to provide a hands-on introduction to Data Science by challenging students to build predictive models. In this course, we will discuss some fundamental components for efficiently and effectively handling the data.\n\nFor any inquiry, please use the following contact information:\nEmails: cmliu@ntut.edu.tw (school); 11107@cc.ntut.edu.tw (Microsoft Teams)\nLine ID: mobile.prof\nFB: facebook.com/howard.liu.5\nPhone: 4251 (in school)",
    "schedule": "-An Overview\n-Mathematical Preliminaries\n-Data Munging\n-Scores and Rankings\n-Statistical Analysis\n-Visualizing Data\n-Mathematical Models\n-Linear Algebra\n-Linear and Logistic Regression\n-Distance and Network Methods\n-Machine Learning\n-Case Study: Practical Applications\n-Project Demo",
    "scorePolicy": "Class Participation: 5%\nHomework/Report: 25％\nProject: 70% (Proposal 20% ; Final Demo 30%; Report 20%)\n\nFor any inquiry, please use the following contact information:\nEmails: cmliu@ntut.edu.tw( school); 11107@cc.ntut.edu.tw (Microsoft Teams)\nLine ID: mobile.prof\nFB: facebook.com/howard.liu.5\nPhone: 4251 (in school)",
    "materials": "Steven S. Skiena, The Data Science Design Manual, Springer-Verlag, 2017, ISBN-13: 978-3319554433\nReferences:\n- Cathy O'Neil and Rachel Schutt. Doing Data Science, Straight Talk From The Frontline. O'Reilly. 2014.\n- Jure Leskovek, Anand Rajaraman and Je\u000brey Ullman. Mining of Massive Datasets. v2.1, Cambridge University Press. 2014. (free online)\n- Kevin P. Murphy. Machine Learning: A Probabilistic Perspective. ISBN 0262018020. 2013.\n- Foster Provost and Tom Fawcett. Data Science for Business: What You Need to Know about Data Mining and Data-analytic Thinking. ISBN 1449361323. 2013.\n- Avrim Blum, John Hopcroft and Ravindran Kannan. Foundations of Data Science.\n(Note: this is a book currently being written by the three authors. The authors have made the first draft of their notes for the book available online. The material is intended for a modern theoretical course in computer science.)",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >In case of the need for distance learning, the on-line teaching will be given during the official class hours using Microsoft Teams (URL: https://shorturl.at/mEKLW).</div>"
  }
]
