[
  {
    "name": "左峻德",
    "email": "d1948@tier.org.tw",
    "latestUpdate": "2022-01-24 15:25:33",
    "objective": "在推動國家經濟發展，提升環境保護和創造國家競爭力，政府對於科技政策之擬定，及科技經費之持續支持十分重要，並以此培植科技人才、將科技研發成果加以推廣。為確保有限之科技資源能夠發揮其最高之效用，建立客觀及公正之績效評估制度實屬必要。本課程擬以最近影響人類生活環境甚巨之全球暖化現象 (Global Warming)，及其引發之綠能科技投資為例，探討綠能科技政策之擬訂，以及綠能產業經濟分析。\n綠色能源包括風能、太陽能、生質能、氫能與燃料電池、地熱能、海洋能與淨煤技術，發展綠能產業即具備「3E」平衡發展之功效，已成各國追求之目標。\n本課程預計將涵蓋以下主題：\nX 替代能源介紹（包括生質能源，如生質柴油與酒精汽油，以及氫能與燃料電池等）\nX 再生能源介紹（包括太陽能、風能、水力發電、地熱及海洋能等）\nX 二氧化碳捕捉與封存、淨煤專題\nXLED 專題等\nMany scientists conclude that the increased greenhouse effect is already accelerating global warming and leading to the climate change. Worldwide government are taking measures to tackle this issue and outlining strategies to bring the greenhouse effect under control.\nGreenhouse gas emissions in Taiwan are mainly from burning fossil fuels such as crude oil, coal and LPG and the energy imports have reached 99.22%. Therefore, the sustainable development in any country is to increase the proportion of self-generation of energy, reduce the emission of GHGs, and balance among Economic Growth, Environment Protection and Energy Supply.\nGreen energy (Renewable energy) covers the fields of solar and wind energy, biofuels which includes biodiesel and bioethanol, hydrogen energy and fuel cell, geothermal and ocean energy as well as clean coal combustion technologies (IGCC). Balancing development of '3E' can be achieved by developing green energy industries and which is also the goal every count",
    "schedule": "周次　　日期　　課程內容\n1　　2 月 23 日　　綠能產業發展策略 (1)\n2　　3 月 2 日　　綠能產業發展策略 (2)\n3　　3 月 9 日　　電業自由化 (1)\n4　　3 月 16 日　　電業自由化 (2)\n5　　3 月 23 日　　鋰電池\n6　　3 月 30 日　　智慧電網及能源管理\n7　　4 月 6 日　　校慶補假\n7　　4 月 13 日　　燃料電池\n8　　4 月 20 日　　期中報告\n9　　4 月 27 日　　3D 列印\n10　　5 月 4 日　　離岸風電及漁電共生\n11　　5 月 11 日　　電動車 (含電動機車) 及船\n12　　5 月 18 日　　再生能源憑證\n13　　5 月 25 日　　太陽能\n14　　6 月 1 日　　無人機\n15　　6 月 8 日　　生質能、小風機\n16　　6 月 15 日　　期末報告",
    "scorePolicy": "期中 40%、期末報告 60%",
    "materials": "無",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因應疫情需要，配合學校以 MSTeams 進行遠距教學 </div></b></b>"
  }
]
