[
  {
    "name": "狄雅南",
    "email": "ardilahayu@ntut.edu.tw",
    "latestUpdate": "2022-01-31 10:58:08",
    "objective": "Advanced Mass Transfer (MT) will be divided into theory of diffusion, interphase mass transfer theory, mass transfer in turbulent flow, mass transfer with chemical reaction, simultaneous mass and heat transfer, multicomponent diffusion.",
    "schedule": "1st week: Fick's law of binary diffusion (Ch. 17)\n2nd week: Temperature and pressure dependence diffusivities\n3rd week: Theory of diffusion in gases, liquids, colloidal, polymer\n4th week: Problem exercises\n5th week: Shell mass balances and boundary conditions (Ch. 18)\n6th week: Diffusion with homogeneous and  heterogeneous chemical reaction \n7th week: Diffusion into falling liquids \n8th week: Diffusion and chemical reaction inside a porous catalyst\n9th week: Midterm exam \n10th week: The equations of change for multicomponent systems (Ch. 19) \n11th week: Interface transport in nonisothermal mixtures (Ch. 22)\n12th week: Mass transfer and chemical reactions\n13th week: Combined heat and mass transfer by free convection \n14th week: Effects of interfacial forces on heat and mass transfer\n15th week: Transfer coefficients at high net mass transfer rates\n16th week: Review and problems exercise\n17th week: Group presentation\n18th week: Group presentation",
    "scorePolicy": "Mid-term　　        　　　　                                45 %\nFinal Exam/group presentations　　　　        35 %\nHomework, Classroom participants (Q&amp;A)　　20 %",
    "materials": "Bird, R.B., Stewart, W.E., Lightfoot, E.N., Transport Phenomena, 2nd Ed., John Wileyy &amp; Sons, New York (2007).",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >Students can ask any time through the i-Plus system or offline discussions at Chemical Engineering-411. This course will use English.\n\n*Online course will be offered depend on pandemic situation.</div>"
  }
]
