[
  {
    "name": "楊神珠",
    "email": "Pearlinself@gmail.com",
    "latestUpdate": "2022-01-25 18:41:45",
    "objective": "This course is to build up the financial experience/framework for students when making financial decisions. The focus is on setting out the basic principles of financial management and applying them to the main decisions faced by the financial managers. It helps students to understand various tools of financial management and use them effectively when making investment and financing decisions.\n\nLearning objective: By the end of the course, students should be able to:\n　　Relate the business strategy and execution for a running company financially in a competitive market\n　　Monitor and evaluate the business results with proper performance measurement models and metrics.\n　　Identify the strategic decisions to achieve financial higher returns and market dominance \n　　Explain a broad spectrum of business concepts and business functions whereas the meaning to financial\n　　Demonstrate how to run a business profitably through a simulation game\n　　Explore and identify the cause and effect relationship between the drivers and business performance\n\n本課程的目的在於幫助學生瞭解財務決策的理論架構，配合公司的決策。\n本課程主要著重於介紹財務管理的基本原理，以及其如何運用在財務經理所面對的主要決策上。希望學生於修習本課程後，能瞭解各種財務管理的工具，並能有效率地使用於投資與融資決策上。\nThis course will use an integrated Management Business simulation game as a major learning tool to illustrate how strategic and operational decisions should be made in a competitive dynamic environment. Students will learn to integrate and align key decisions in different business functions to simultaneously achieve a set of defined performance objectives of a company by evaluating decision alternatives and tradeoffs as well as optimizing the resource utilization. \n\nActing as a manager, students set the direction for the company to build up the business by making decisions related to its strategy, finance, market, operations, staffing and innovation. It aims to foster interdisciplinary decision-making in an inexact environment and to prepare students for the problems and issues of working in a changing and uncertain world.\n\nBusiness Simulation is a practical, integrative business course that requires teams of students to operate a simulated start-up business.\nThis course will use an integrated Management Business simulation game as a major learning tool to illustrate how strategic and operational decisions should be made in a competitive dynamic environment. Students will learn to integrate and align key decisions in different business functions to simultaneously achieve a set of defined performance objectives of a company by evaluating decision alternatives and tradeoffs as well as optimizing the resource utilization. \n\nActing as a manager, students set the direction for the company to build up the business by making decisions related to its strategy, finance, market, operations, staffing and innovation. It aims to foster interdisciplinary decision-making in an inexact environment and to prepare students for the problems and issues of working in a changing and uncertain world.\n\nBusiness Simulation is a practical, integrative business course that requires teams of students to operate a simulated start-up business.",
    "schedule": "Week 1--Competitive strategy\n　　Integration of business strategy and functional strategies\n　　Concepts of integrated planning and execution\nWeek 2--Benchmarking supply chain performance\n　　Drivers for supply chain key performance indicators (KPI) \n　　Supply chain operational reference (SCOR) model\n　　Benchmarking supply chain performance \nWeek 3--Business performance measurement models\n　　Balanced scorecard\nWeek 4--Learning MBS – Model 1 Game\n　　Basic modules and analytics\n　　Practice game\nWeek 5--Learning MBS – Model 2 Game\n　　Planning and execution on core functions of sales, purchasing, and production\n　　Practice game\nWeek 6--MBS – Model 3 Game \n　　Return on investment of R&amp;D and marketing\n　　Managing multiple retail markets\n　　Group breakout session for competition game: Round 1 \n　　Discussion and analysis of results\n　　Submit decisions for competition game: Round 2 (W)\nWeek 7--MBS – Model 3 Game\n　　Group presentation on planning and execution strategy (the two lowest ranked teams in competition game: Round 2) \n　　Group breakout session for competition game: Round 3 and 4\n　　Discussion and analysis of results\n　　Submit decisions for competition game: Round 5 (W)\nWeek 8--MBS – Model 3 Game\n　　Group presentation on planning and execution strategy (selected teams) Group breakout session for competition game: Round 6 and 7 \n　　Discussion and analysis of results\n　　Submit decisions for competition game: Round 8 (W)\nWeek 9.   Mid-Term\nWeek 10.  Outtings\nWeek 11--MBS – Model 4A Game (M4A)\n　　Group presentation on planning and execution strategy (the two highest ranked teams in competition game: Round 8) \n　　Group breakout session for competition game M4A: Round 1 and 2\n　　Discussion and analysis of results\n　　Submit decisions for competition game M4A: Round 3 (W)\nWeek 12--MBS – Model 4A Game (M4A)\n　　Additional information on financial leverage\n　　Group breakout session for competition game M4A: Round 4 and 5 \n　　Discussion and analysis of results\n　　Submit decisions for competition game M4A: Round 6 (W)\nWeek 13--MBS – Model 4B Game (M4B)\n　　Group presentation on planning and execution strategy (the two lowest ranked teams in competition game M4A: Round 6) \n　　Group breakout session for competition game M4A: Round 7 and 8\n　　Discussion and analysis of results\n　　Submit decisions for competition game M4B: Round 1 (M) and 2 (W)\nWeek 14--MBS – Model 4B Game (M4B)\n　　Group presentation on planning and execution strategy (selected teams)\n　　Group breakout session for competition game M4B: Round 3 and 4\n　　Discussion and analysis of results\n　　Submit decisions for competition game M4B: Round 5 (M) and 6 (W)\nWeek 15--MBS – Model 4B Game (M4B)\n　　Group presentation on planning and execution strategy (selected)\n　　Group breakout session for competition game M4B: Round 7 and 8\n　　Discussion and analysis of results\n　　Reflections on business planning and execution strategy\nWeek 16\n　　Reflections on Group business planning and execution strategy\nWeek 17\n　　Review of the all background theory\n　　Overview and Problem Solving \nWeek 18\n　　Final Exam",
    "scorePolicy": "Final course grade will be determined by the following criteria and point distribution.\nGroup game planning and review/analysis  * 10\nGroup competition games 　　　　　　　　  30\nGroup case presentation/Participation　　       20\nFinal exam and peer evaluation　　　　       40\n　　　　　　　　　　　　                \n         　　　　Total　　　　　　 　　 　　 100\n* Each group will have a chance to present their game planning and review/analysis (for about 10-15 minutes) as assigned by the instructor. If any group is selected to make more than one presentation, the better score will be used for final course grade computation. \nA post-game review/analysis (individual work in the format of a one-page report) is required for every member of the group with the overall worst performance of competition games M3B and M4B for no credit. The purpose of this extra work is to help diagnose the planning and execution problems from one’s own understanding and perspective. Further points will be deducted from individual group members if the review/analysis is deemed to be less satisfactory.",
    "materials": "Will advise in the class\nIf Taipei Tech announces distance learning, the course will be conducted online, such as Webex, Google meet, MS team \nThe announcement will be informed via email at shenchu.yang@gmail.com",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If Taipei Tech announces distance learning, the course will be conducted online, such as Webex, Google meet, MS team \nThe announcement will be informed via email at shenchu.yang@gmail.com</div></b></b>"
  }
]
