[
  {
    "name": "劉宛淯",
    "email": "graceliu.university@gmail.com",
    "latestUpdate": "2022-02-22 12:42:38",
    "objective": "本課程專門設置了兩個主要的構面，課程規劃著重於培育未來之企業領導與管理人才與而設置。全球化的競爭使得各專業領域之企業領導者面臨益加複雜之企業決策，高階主管面臨 \"兩難\" 甚至 \"多難\" 的多元選擇情況下，企業目標與經濟決策時常產生衝突，” 倫理” 的議題因此成為當今高階管理之重要課題之一！ 再者，本課程第二個構面為策略管理，透過教導策略目標的擬定、執行、組織結構以及如何因應組織內外部環境的轉變能帶給 IMBA 課程之年青學子多項關鍵之能力，同時，配合個案，學生們也將學習有關策略思考之分析架構，組織管理與併購和多角化議題等方面相關管理能力之建構。\nMore than ever, business leaders are facing even more challenges in the turbulence environment, not just economic aspects but also legal and ethical aspects. Two important parts are introduced in IMBA program, which is business ethics and strategic management. The purpose in this course is specifically designed for developing future leaders for corporations &amp; organizations in various business domains. How to simultaneously achieve the corporate objectives and fulfill the ethical responsibilities without compromising fundamental principles and standards of conduct when facing dilemma is imperative for us to learn and ponder upon. Moreover, the topic in strategic management integrates cutting-edge research on topics including competitive advantage, corporate governance, diversification, strategic leadership, technology and innovation, and corporate social responsibility through both theory and case studies. With this vision and mission in mind, the lecturer is committed to inspire the st",
    "schedule": "In the era of technological &amp; social growth at an exponential speed, more than ever, business leaders across the globe are facing even more challenging issues, not just economic aspects but also legal and ethical aspects.  In this elite IMBA program of NTUT, this course is specifically designed for developing future leaders for corporations &amp; organizations in various business domains.  \nHow to simultaneously achieve the corporate objectives and fulfill the ethical responsibilities without compromising fundamental principles and standards of conduct when facing dilemma is imperative for us to learn and ponder upon. \nWith this vision and mission in mind, the lecturer is committed to inspire the students’ talent within as in all the other executive management programs.  \nThis IMBA course will equip all participating international students with multiple pillars of those grounds in being great leaders in the future, including building fundamental mindset and value system for managing challenging issues both economically and ethically, framework of strategic thinking and organizational structuring, and practical cross-cultural business cases and simulations. \nAll IMBA students who participate in this course will be expected to be well-prepared with passionate learning attitude to JOIN proactively group discussions, cross-cultural idea brainstorming, business scenario simulation, deductive-and-inductive reasoning practice, individual and team projects, and business case studies. \nIt Is My Since Wish and Mission to develop You, to become great leaders of the future for bettering our world humanity advancement!  This course is specifically designed to develop and enhance all the wonderful qualities essential for You.\n\nWeek 1    : Business Ethics Course Orientation \nWeek 2~3: Global Cases Practices &amp; Sharing\nWeek 4~5: Harvard Business Case study and analysis 1\nWeek 6~7: Business ethics simulation and presentation A \nWeek 8~9: Harvard Business Case study and analysis 2\nWeek 10~11: Harvard Business Case study and analysis 3\nWeek 12~13: Business ethics simulation and presentation B\nWeek 14~15: Harvard Business Case study and analysis 4\nWeek 16~17: Harvard Business Case study and analysis 5\nWeek 18:  Final Project Presentation",
    "scorePolicy": "Participation 30%\nIn-Class Presentations and Assignments 50%\nFinal Project 20%",
    "materials": "* Harvard Business Cases \n* International materials\n* Related Books, papers, and video Materials",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If NTUT announces distance learning: \n1.The online course platform is: Googlemeet; the www link will be announced here in this section when necessary. \n2.To submit homework, please send it to professor:\nGraceLiu.University@gmail.com</div>"
  }
]
