[
  {
    "name": "陳  諒",
    "email": "",
    "latestUpdate": "2022-02-15 16:41:15",
    "objective": "本課程主要從實務方面介紹開發跨領域大型機電系統 (如捷運系統) 之相關技術及第三方驗證與認證之方法，內容包括需求管理、安全需求、工作分解架構、系統保證、功能方塊圖、失效模式與效應分析、災害分析與風險評估、界面管理、設計評估、型態管理、系統整合測試、安全證明、獨立安全評估及驗證與認證。\n目前國內極度缺乏跨領域專長的系統工程師及獨立驗證與認證之能量，修習本課程的同學，可以預先培養跨領域專長的系統工程知識及執行獨立驗證與認證之能力，俾利將來投入相關的機電產業。\nRequirements Management, Safety Requirement , Work Breakdown Structure, System Assurance, Functional Block Diagram, Failure Mode and Effects Analysis, Hazard Analysis and Risk Assessment, Interface Management, Design Review, Configuration Management, System Integration Test, Product Safety Case, Independent Safety Assessment, Verification and Validation.",
    "schedule": "每週上課章節：\n1.　　大型機電系統簡介\n2.　　系統工程與 V - 型系統發展流程\n3.　　需求發展 (將客戶需求轉化成產品規格) 與可追溯性需求管理\n4.　　機電系統設計與系統分析 (選擇技術解決方案)\n5.　　機電系統危害分析與風險管理、大型機電系統事故案例分析\n6.　　機電系統工作分解架構 (WBS) \n7.　　設計界面整合、型態管理與設計變更管制\n8.　　系統保證 (RAMS) 與可靠度關鍵項目\n9.　　期中報告\n10.　　捷運自動列車控制 (ATC) 及汽車自動駕駛原理、安全分析\n11.　　安全完整性等級 (SIL) 與安全關鍵項目\n12.　　組件功能測試、出廠測試與界面整合測試\n13.　　系統整合測試\n14.　　功能方塊圖、失效模式與效應分析、故障報告，分析及糾正行動\n15.　　設計符合需求驗證、第三方驗證與認證\n16.　　安全證明、獨立安全評估 ( ISA )\n17.　　人生地圖：設計快樂與成功的人生\n18.　　期末考",
    "scorePolicy": "上課討論 (10%)、\n期中報告 (40%)、\n期末考 (50%)",
    "materials": "1. Introduction to Systems Engineering,  A.P. Sage  J.E. Armstrong, Wiley-Interscience,  2000\n2. CENELEC  EN50126: Railway Applications - The Specification and   Demonstration of Reliability, Availability, Maintainability and Safety, 1999. \n3. CENELEC  EN50128: Railway Applications - Communications, Signaling and Processing Systems - Software for Railway Control &amp; Protection Systems, 2001.\n4. CENELEC  EN50129: Railway Applications - Communications, Signaling and Processing Systems- Electronic Systems for Signaling, 2003.\n5. International Standard IEC 61508: Functional Safety of Electrical/Electronic/Programmable Electronic Safety-Related Systems, 2010.\n6. ISO 26262 Road Vehicles-Functional Safety, International Organization for Standardization, 2011.\n7. 自動駕駛系統設計及應用，  余貴珍、周彬等著，北京清華大學出版社，2019\n8. Error-Free 零錯誤 - 全球頂尖企業都採用的科技策略，邱強著，天下文化，2019\n9. 能力成熟度整合模式 (上、下冊) 資訊工業策進會出版，2002\n10. 飛航解密，王立偵著， 遠流出版，2017.\n11. 任課老師分階段提供相關之參考資料",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 若學校因應疫情，暫停實體上課時，將使用下面三種網路平台上課。\n1. 利用老師所建立的 LINE 群組 (群組名稱：大型機電系統) \n https://line.me/R/ti/g/XcqQOTa_AI  進行討論，或\n2. 使用 Google meet 遠距教學，或\n3. 上課講義事先透過電子郵件寄發給同學，於上課時間在 LINE 群組討論，\n我的 email：chenliangtw @gmail.com。</div>"
  }
]
