[
  {
    "name": "黃光廷",
    "email": "alexkthuang@gmail.com",
    "latestUpdate": "2022-01-03 16:42:35",
    "objective": "本課程之目的是在於讓學生透過參與大學社會責任實踐計畫，從訪談、觀察記錄到提出規劃設計方案，一方面體認到建築專業的多元價值與社會責任感，另一方面則學習到如何應用課堂所學於真實的社會環境之中。具體是以原民部落為合作對象，藉由一系列參與式行動與部落族人對話、溝通並盤點社區議題，進而參與到對策研擬、空間改造設計、營造行動等階段之工作內容。\nThis course is aimed to involve the students into the project of University Social Responsibility. From interview, observation, documentation to design, the students are expected to explore the diverse value of architectural profession and to practice the social responsibility by applying their expertise to solve real-world problems. In specific, the process will engage the members from the aboriginal tribes into a series of participatory activities, including site analysis, programming, design development, and collaborative construction.",
    "schedule": "1.　　部落文化概述\n2.　　基地觀察與部落訪查（部落社會服務實習）\n3.　　部落發展議題盤點\n4.　　參與式規劃設計與案例研析\n5.　　社會計畫與社區設計\n6.　　部落族人訪談與策略研擬（部落社會服務實習）\n7.　　社區協作式營造案例研析\n8.　　公共空間改造案例研析\n9.　　空間規劃設計提案（部落社會服務實習）\n10.　　期中報告：提案發表與意見反饋\n11.　　提案修正與設計發展\n12.　　部落參與設計提案修正（部落社會服務實習）\n13.　　細部設計與案例研析\n14.　　財務分析與可行性評估\n15.　　空間實作計畫擬訂\n16.　　部落參實作計畫修正（部落社會服務實習）\n17.　　成果發表個別指導\n18.　　期末報告：成果發表與評圖（PPT、短片、行銷企劃等）",
    "scorePolicy": "1.　　期中報告 20﹪\n2.　　期末報告 20﹪\n3.　　課堂參與 10﹪\n4.　　社區實作 40﹪ \n5.　　其他  10﹪",
    "materials": "1.　　山崎亮（2015）。社區設計：重新思考「社區」定義，不只設計空間，更要設計「人與人之間的連結」。台北：臉譜出版社。\n2.　　王本壯、李永展、邱勇嘉、周芳怡（2016）。社區 X 營造：政策規劃與理論實踐。台北：唐山出版社。\n3.　　奈傑爾・懷特里（2014）。為社會而設計。台北：聯經出版社。",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "黃志弘",
    "email": "huangch@ntut.edu.tw",
    "latestUpdate": "2022-01-23 18:51:59",
    "objective": "本課程目的在建立大學生以自身專業，在社區社會責任實踐中的身體力行；藉由對原住民部落社區議題盤點，研擬對策，並在與部落族人溝通後，擬定包括：社會計畫、設施設計、營造計畫、執行措施等階段工作內容，之後親自著手進行計畫實踐。以利於培養學生博雅的品格、並體會專業社會服務的情操與體驗，開拓生命視野。\nThe purpose of this course is, to provide students to practice the social responsibility based on their expertise and to develop sentiments through these social services for aboriginal tribes. \nBy means of inventory on issues in tribes, the social plan, facility plan, construction plan and executive plan would be drafted, and communicated with people, then be fulfilled by students themselves.",
    "schedule": "1、部落文化、歷史回顧\n2、社區社會組成\n3、部落產業經濟─農業景觀、產銷合作社與社會企業（參與實作）\n4、部落健康營造與長期照護（文健站）\n5、青年聚會所與部落決策模式\n6、部落宗教生活\n\n7、住宅供給與住宅市場（設計實作）\n8、社會住宅原理─國際案例社會計畫分析\n9、高齡、托幼、托老、安親、健康營造\n10、建築計畫中的社會計畫擬定、社會企業（案例實作）\n11、社會計畫財務分析\n12、部落建設實作（案例實作）",
    "scorePolicy": "設定標的社區，社區社會計畫分析探，研擬社會服務設施需求；（20％）\n設定社會服務需求課題系統，對應需求族群、需求內涵、機構形式、人力資源需求等總整分析；（20％）\n機構設施設計建築計畫設定；經營管理體制設定；（10％）\n完成社區社會計畫設計書圖，參與實作。（50％）",
    "materials": "參考書：社區計畫書、社區與社區發展、社區工作、社區 X 營造：政策規劃與理論實踐、護計畫、社區高齡健康促進、社會政策與計劃分析、都市社會學\n建築設計各國案例作品集；",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n※「一級」警戒：實體授課。\n※「三級」(含) 以上警戒：課程全採遠距授課。\n※「二級」警戒，授課方式說明如下：\n● 上課方式： 遠距上課 分流上課 </div>"
  }
]
