[
  {
    "name": "郭政淳",
    "email": "kuojona@gmail.com",
    "latestUpdate": "2022-02-14 17:56:08",
    "objective": "英語語用學的研究關乎了解英語在各種情境下的使用。本課程首先回顧一些最常用於理解「言外之音」的重要觀念，例如「暗示」、「預設」、及「言談行為」。下個階段則是介紹一些重要語用學的議題，例如「禮貌理論」、「修辭語」、「言語幽默」、和「機構性談話」，並概述用於研究這些語用學議題的一些方法，包含「會話分析」、「言談分析」、甚或「批判性言談分析」。本課程旨在透過充足的英文例子來提升學生的語用學意識，從而鼓勵他們發揮語用學的知識來應對各種 (英文) 語言的實務操作。\nThe study of English pragmatics is about understanding the use of English in different types of context. The course begins by revisiting the ideas most commonly embraced to understand meaning beyond the linguistic code (e.g. implicature, presupposition, speech act). The next step is an overview of the key issues in pragmatics (e.g. politeness theory, figure of speech, verbal humor, institutional talk) as well as the various approaches to these issues (e.g. conversation analysis, discourse analysis, and critical discourse analysis). This course aims to raise students’ pragmatic awareness with ample English examples, and encourage them to apply pragmatic knowledge in various aspects of (English) language practices.",
    "schedule": "Wk 1 Introduction\nWk 2 Meaning in Context\nWk 3 Lexical Semantics (I)\nWk 4 Lexical Semantics (II)\nWk 5 Implicature and Presupposition\nWk 6 Speech Acts (I)\nWk 7 Speech Acts (II)\nWk 8 Language and Politeness (I)\nWk 9 Language and Politeness (II)\nWk 10 Discourse Analysis (I)\nWk 11 Discourse Analysis (II)\nWk 12 Term Project Guide &amp; Discussion\nWk 13 Conversation Analysis \nWk 14 Second Language Pragmatics (I)\nWk 15 Second Language Pragmatics (II)\nWk 16 Humor and Irony\nWk 17 Term Project: Proposal and Peer Review \nWk 18 Recapitulation",
    "scorePolicy": "Assigned Reading 20%\nHomework: 15%\nClass Activity: 30%\nTerm Project: 35%",
    "materials": "Handouts will be distributed.\nSelected articles and papers will be assigned.",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 因應疫情遠距教學的規劃:\n\n1. 公開的資訊請參考北科 i 學園，個人問題請透過電子郵件的方式詢問。\n\n2. 倘若疫情升溫而需要進行遠距教學，請到 i 學園的課程網站中取得 Google Meet 之連結。[假如在第一周即需遠距教學的狀況下，Google Meet 連結會公佈在此課程大綱中提供尚未選修成功的學生]\n\n3. 每堂課的內容都會進行錄製，於課程結束一周內將連結上傳到課程網站中。</div>"
  }
]
