[
  {
    "name": "宋立垚",
    "email": "lysong@ntut.edu.tw",
    "latestUpdate": "2022-02-16 11:49:02",
    "objective": "資訊蒐集技術是研究生在從事研究工作與論文寫作時必須具備的工具。本課程主要目的在協助研究生在眾多的資訊來源中，如何搜尋正確及高品質的資訊。課程內容涵蓋資訊蒐集技術的原則及應用，並探討多種的實用工具及電子資訊來源，以滿足研究生在作研究及論文寫作上對資訊的需求。\nInformation gathering skills are essential to the studying of graduate students and the development of their subject knowledge on dissertation/thesis writing. The course is designed to help graduate students to find the right kind and the right quality of information from the vast amount available.  The content of the course will deal with the broad principles and practices underlying information gathering techniques which explore the many practical tools and electronics sources of information that will help graduate students find the information they need when doing research or writing the dissertation/thesis.",
    "schedule": "第一週 課程介紹、資訊的類型與來源\n第二週 國定假日\n第三週 常用的論文寫作輔助工具、學術資料庫的查詢\n第四週 論文研究計畫書的撰寫\n第五週 書目管理軟體 (Endnote)\n第六週 論文原創性檢查系統的操作 (Turnitin)\n第七週 國定假日\n第八週 學術倫理、研究論文的架構\n第九週 期中報告 (一)\n第十週 引文內容與格式 (一)\n第十一週 引文內容與格式 (二)\n第十二週 期中報告 (二)\n第十三週 論文摘要的寫法\n第十四一週 文獻回顧的寫法 (一)\n第十五週 文獻回顧的寫法 (二)\n第十六週 期刊論文的投稿注意事項\n第十七週 論文圖表的處理\n第十八週 期末報告",
    "scorePolicy": "出席率 (10%)、平時作業 (60%)、期末報告 (30%)。",
    "materials": "1. 童國倫、潘奕萍，研究資料如何找？Google It!，臺北市：五南，2009。\n2. 張淑彩 譯，Niall O. Dochartaigh 著，網路學術資源技巧：教您從網路尋找文獻與發現資料，臺北市：韋伯，2010。\n3. 胡子陵、胡志平，不再是夢想！搞定論文題目、研究架構與寫作技巧，臺北市：五南，2010。\n4. 張可婷 譯，Diana Ridley 著，一步步教您做文獻回顧，臺北市：韋伯文化，2011。\n5. 童國倫、張楷、林義，淡定學 Endnote，臺北市：五南，2013。\n6. 吳珮瑛，論文寫作之規範及格式，臺北市：翰蘆，2014。\n7. 吳珮瑛，老師在講你有在聽嗎？論文寫作之規範及格式，臺北市：翰蘆，2016 。\n8. 周春塘，撰寫論文的第一本書：一步步的教你如何寫，讓論文輕鬆過關，臺北市：五南，2016。\n9. 蔡清田，論文寫作的通關密碼，臺北市：高等教育，2017。\n10. 彭明輝，研究生完全求生手冊：方法、秘訣、潛規則，臺北市：聯經 2017。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若學校因應疫情規定遠距教學，則同時使用下面網路平台上課\n1. 學校的 Microsoft Teams 資訊蒐集與論文寫作（學生學號 @cc.ntut.edu.tw）\n2. 我的 email：lysong@mail.ntut.edu.tw</div>"
  }
]
