[
  {
    "name": "黃儀婷",
    "email": "evie.ting.huang@gmail.com",
    "latestUpdate": "2022-01-05 16:50:44",
    "objective": "本課程為一延續性的專題研究，其目標在於研討互動設計、互動媒體、互動藝術之相關研究專題，以文獻研讀、論文研讀討論以及個案研究為重點，藉由密集討論、書面報告以及設計專題之研究與實作，學生可以有效率地交換意見，獲得更深入而廣泛的體驗，並具備研究、分析、實作之能力。本所以結合電子資訊、機電、人文、設計與藝術等各領域的學生，以整合培育互動媒體設計專業人才，因此，本課程之另一主要學習目標為建構一多元領域交互學習的環境，以專題導向式為學習模式，可分別組合具設計、藝術、資訊、機電等專長的研究生，協同完成互動媒體設計專題的研究，或是透過互動媒體設計個案研討、互動媒體設計專題創作的方式進行。教學將以課堂講授、論文研討與發表以及專題實作為主，並以報告、分組討論與發表以及實作作品為評量方式。\nThis special topic is a continuous course within two semesters. This course is to explore the fields of inter92tion design, inter92tive media and inter92tive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design pr92tice, graduate students can be able to learn the ability of research, analysis and pr92tice by effectively exchange opinions and personal experience. The aim of graduate of inter92tive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of inter92tive media design. Therefore, one of the aims of this course is to construct a multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate a inter92tive media design project.",
    "schedule": "由各指導教授個別訂定論文研究進度",
    "scorePolicy": "平常表現 100%",
    "materials": "由各指導教授與同學討論後訂定",
    "foreignLanguageTextbooks": true
  },
  {
    "name": "葛如鈞",
    "email": "dablog@gmail.com",
    "latestUpdate": "2022-01-04 17:21:21",
    "objective": "本課程為一延續性的專題研究，其目標在於研討互動設計、互動媒體、互動藝術之相關研究專題，以文獻研讀、論文研讀討論以及個案研究為重點，藉由密集討論、書面報告以及設計專題之研究與實作，學生可以有效率地交換意見，獲得更深入而廣泛的體驗，並具備研究、分析、實作之能力。本所以結合電子資訊、機電、人文、設計與藝術等各領域的學生，以整合培育互動媒體設計專業人才，因此，本課程之另一主要學習目標為建構一多元領域交互學習的環境，以專題導向式為學習模式，可分別組合具設計、藝術、資訊、機電等專長的研究生，協同完成互動媒體設計專題的研究，或是透過互動媒體設計個案研討、互動媒體設計專題創作的方式進行。教學將以課堂講授、論文研討與發表以及專題實作為主，並以報告、分組討論與發表以及實作作品為評量方式。\nThis special topic is a continuous course within two semesters. This course is to explore the fields of inter92tion design, inter92tive media and inter92tive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design pr92tice, graduate students can be able to learn the ability of research, analysis and pr92tice by effectively exchange opinions and personal experience. The aim of graduate of inter92tive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of inter92tive media design. Therefore, one of the aims of this course is to construct a multi-disciplines learning environment which performs a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate a inter92tive media design project.",
    "schedule": "課堂中說明",
    "scorePolicy": "課堂中說明",
    "materials": "課堂中說明",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "龍祈澔",
    "email": "drag0725@yahoo.com.tw",
    "latestUpdate": "2022-01-06 11:30:52",
    "objective": "本課程之目標在於研討互動設計、互動媒體、互動藝術之相關研究專題，以文獻研讀、論文研讀討論以及個案研究為重點，藉由密集討論、書面報告以及設計專題之之研究與實作，學生可以有效率地交換意見，獲得更深入而廣泛的體驗，並具備研究、分析、實作之能力。本所以結合電子資訊、機電、人文、設計與藝術等各領域的學生，以整合培育互動媒體設計專業人才，因此，本課程之另一主要學習目標為建構一多元領域交互學習的環境，以專題導向式為學習模式，可分別組合具設計、藝術、資訊、機電等專長的研究生，協同完成互動媒體設計專題的研究，或是透過互動媒體設計個案研討、互動媒體設計專題創作的方式進行。教學將以課堂講授、論文研討與發表以及專題實作為主，並以報告、分組討論與發表以及實作作品為評量方式。\nThis course is to explore the fields of interaction design, interactive media and interactive art and focus on the literature study, paper discussion and case studies. With panel discussion, research report and design practice, graduate students can be able to learn the ability of research, analysis and practice by effectively exchange opinions and personal experience. The aim of graduate of interactive media design is to integrate different disciplines from computer science, mechatronics, human-culture and design and art so as to foster the professional of interactive media design. Therefore, one of the aims of this course is to construct  multi-disciplines learning environment which perform a topic-oriented study model. This study model formulates the graduate students of design, art, information and mechatronic disciplines to collaborate an interactive media design project. It may execute interactive media design by working with the form of case study or design creation. The teachin",
    "schedule": "週 01.　　課程與授課老師介紹\n週 02.　　設計實務\n週 03.　　設計實務\n週 04.　　設計實務\n週 05.　　設計實務\n週 06.　　第一次評圖 (初步提案) \n週 07.　　設計實務\n週 08.　　設計實務\n週 09.　　設計實務\n週 10.　　設計實務\n週 11.　　設計實務\n週 12.　　第二次評圖 (進度討論與講評)\n週 13.　　設計實務\n週 14.　　設計實務\n週 15.　　設計實務\n週 16.　　設計實務\n週 17.　　設計實務\n週 18.　　期末總檢",
    "scorePolicy": "個人學習成果展現 25％\n個人 / 分組競賽投稿 20％\n分組學習成果展現 35％\n出席率及平時表現 20％",
    "materials": "依小組導師專業領域與題目決定",
    "foreignLanguageTextbooks": false
  }
]
