[
  {
    "name": "吳建文",
    "email": "xcwwu@ntut.edu.tw",
    "latestUpdate": "2022-02-15 13:58:00",
    "objective": "本課程是教授學生人工智慧的基本概念與應用，激發學生在人工智慧領域的創新應用。課程內容包括：人工智慧基礎、機器學習、大數據技術、深度學習、生成對抗網路、創業家思維、人工智慧與現代科技、人工智慧的製造業應用、人工智慧的服務業應用。\nThis course is to teach students the basic concepts and applications of artificial intelligence and to inspire students for innovative artificial intelligence applications. The course includes: artificial intelligence basics, machine learning, big data, deep learning, generative adversarial network, entrepreneurial thoughts, artificial intelligence and modern technologies, industrial applications of artificial intelligence, and services applications of artificial intelligence.",
    "schedule": "1. 人工智慧基礎介紹\n2. 機器學習、深度學習\n3. 人工智慧與現代科技\n4. 人工智慧與商業模式\n5. 人工智慧的製造業應用\n6. 人工智慧的服務業應用",
    "scorePolicy": "出席、課堂討論參與、作業",
    "materials": "教師提供投影片、作業、作業解答、相關論文",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 本學期課程因應疫情警戒等級規劃上課方式如下：\n※「一級」：實體授課。\n※「三級」(含)：遠距授課。\n※「二級」說明如下：\n● 上課方式：實體授課\n● 評量方式：\n分組報告 60%、課程參與與出席 40%\n● 遠距上課網址：\n請加入 line ID = 0937143666\n● 學生加退選簽核及諮詢課程問題管道：\n請加入 line ID = 0937143666</div></b></b>"
  },
  {
    "name": "翁頌舜",
    "email": "wengss@ntut.edu.tw",
    "latestUpdate": "2022-01-03 10:32:58",
    "objective": "本課程介紹人工智慧的基本概念與發展，並激發學生在人工智慧領域的創新應用。課程內容包括：人工智慧基礎、機器學習、大數據技術、深度學習、生成對抗網路、創業家思維、設計思考、商業模式、人工智慧與現代科技、人工智慧的製造業應用、人工智慧的服務業應用。\nThis course is to teach students the basic concepts and applications of artifi-cial intelligence and to inspire students for innovative artificial intelligence applications. The course includes: artificial intelligence basics, machine learn-ing, big data, deep learning, generative adversarial network, entrepreneurial thoughts, design thinking, business models, artificial intelligence and modern technologies, industrial applications of artificial intelligence, and services ap-plications of artificial intelligence.",
    "schedule": "1. 人工智慧簡史\n2. 人工智慧趨勢\n3. 人工智慧與機器學習\n4. 人工智慧與現代科技\n5. 人工智慧的商業模式\n6. 人工智慧個案研讀與討論",
    "scorePolicy": "上課出席，上課參與，分組作業與報告",
    "materials": "上課講義",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div></b></b>"
  },
  {
    "name": "許嘉裕",
    "email": "chiayuhsu@ntut.edu.tw",
    "latestUpdate": "2022-01-17 14:11:25",
    "objective": "本課程教授人工智慧技術的基礎理論與實務技巧，並對於人工智慧在製造業、服務業、金融業的應用，提供啟發性的基本認知與創意，以激發學生在人工智慧領域的創新應用。課程內容包括：人工智慧基礎、機器學習、大數據技術、深度學習、生成對抗網路、創業家思維、設計思考、商業模式、人工智慧與現代科技、工業 4.0、人工智慧的製造業應用個案、人工智慧的服務業應用個案、人工智慧的金融應用個案。\nThis course aims to teach students the basic concepts and practical techniques of artificial intelligence and to introduce its applications on manufacturing, service, and finance industries. The course focuses on inspring students for innovative artificial intelligence applications. The course includes: artificial intelligence basics, machine learn-ing, big data, deep learning, generative adversarial network, entrepreneurial thoughts, design thinking, business models, artificial intelligence and modern technologies, industry 4.0, real case applications on manufacturing, service, finance industries.",
    "schedule": "1. 機器學習 (Machine Learning)\n2. 深度學習與類神經網路 (Deep Learning and Artificial Neural Network)\n3. 卷積神經網路 (Convolution Neural Network)\n4. 遞迴神經網路 (Recurrent Neural Network)\n5. 自編碼器 (Auto-Encoder)\n6. 人工智慧於製造業應用案例",
    "scorePolicy": "Exam and Assignment (100%)",
    "materials": "簡富、許嘉裕，(2019)，大數據分析與資料挖礦，2 版，前程文化，台北",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div></b></b>"
  }
]
