[
  {
    "name": "陳柏均",
    "email": "cpc@mail.ntut.edu.tw",
    "latestUpdate": "2022-01-03 12:22:15",
    "objective": "薄膜科技是當今各式高科技製造業最不可或缺的技術之一，相關技術影響範疇包含電子、光電、半導體製造業、表面工程、高硬度高強度、耐磨抗腐蝕、裝飾與保護等等。薄膜技術種類與相關配合技術繁多，隨產業發展各項技術亦不斷進化，本課程涵蓋相關薄膜成長概論與原理、物理與化學各式沉積方法、蝕刻技術及薄膜結構分析等內容。並搭配實作課程，期望讓學生認識薄膜在科技產業上的應用，並了解其重要性及未來的發展。\n\nThin film science and technology have gone through a thorough development which results in numerous new materials and advanced applications. Thin film research shares the knowledge from multi-disciplines, such as materials science, chemistry, solid state physics, mechanics and etc.. This course is an introductory class for students who are interested in thin film technology.  Topics include, but are not limited to, fundamentals on crystal structures and defects in thin films, the basic nucleation and growth mechanisms of thin films, thin film processes (PVD, CVD, and solution deposition), characterization techniques of thin films, and several advanced topics related to applications in semiconductors, optoelectronics, energy, and bioelectronics. Lab or tour session (s) will be provided to promote teaching and learning.",
    "schedule": "1)Overview of thin film technology\n2)Crystal structures of thin films\n3)Defects in thin films (vacancies and interstitials, dislocations, grain boundaries etc.) Nanocrystalline, polycrystalline and epitaxial thin films\n4)Diffusion\n5)Surface, thin film nucleation and growth models (2D, 3D, and 2D-3D combination)\n6)Epitaxy Homoepitaxy and heteroepitaxy; Lattice matching epitaxy and domain matching epitaxy; Superlattice structures and quantum wells\n7)Vacuum Science and Technology\n8)Thin film growth techniques (Physical Vapor Deposition- Sputtering, MBE, Laser MBE, PLD and E-bean evaporation)\n9)Thin film growth techniques (Chemical Vapor Deposition- CVD, PECVD, MOCVD)\n10)Thin film growth techniques (Solution Processes- Electrodeposition, Electroless Deposition) \n11)Term paper presentations\n12)Special topics in thin films applications\n13)Final review and Q&amp;A\n\nThin Film Lab Sessions (thin film deposition and property measurements)",
    "scorePolicy": "Final Exam 30%\nSemester Project 30%\nLab Assignments 20%\nParticipation 20%",
    "materials": "Handbook of Thin Film Deposition Processes and Techniques Principles, Methods, Equipment and Applications, Krisna Seshan, 2001\nISBN No. 978-0-8155-1442-8\n(e-book @ NTUT)",
    "foreignLanguageTextbooks": true
  }
]
