[
  {
    "name": "孫熙文",
    "email": "suncwen@ntut.edu.tw",
    "latestUpdate": "2022-02-10 17:07:17",
    "objective": "精準醫療 (Precision Medicine) 又稱為個人化醫療，該詞最早於 2011 年由美國國家研究委員會所提出，意指除了藉由傳統診斷方法如病患症狀描述及常規生化、影像檢查之外，加上新式生物醫學檢測如基因檢測等，並整合個人資料，如性別、身高、體重、種族、基因特異性、過去病史、家族病史等完整綜合信息，透過人體基因資料庫進行比對及分析，進而藉以選出最適合病患的治療方法及藥物治 療，如細胞治療、基因治療和標靶治療等。精準醫療最終的目的是希望透過個體差異性的深入診斷，來找出治療效果最大化及副作用最小化的最佳個人化醫療方案。2015 年美國前總統歐巴馬在國情咨文演講中提出「精準醫學計畫 (Precision Medicine Initiative)」， 率先投入二億美元以建立百萬人次的醫療記錄、基因、生活習慣等數據資料庫，並找尋誘發癌症的基因及相應新藥開發，訂定相關法規並 研究如何保護隱私與個資安全。此後各國無不競相投入精準醫療之發展，精準醫療也是當前台灣生技重點產業之一。\n開課綱要：本課程希望增進同學對精準醫療領域發展的認識與理解，上課內容涵蓋：精準醫療紹介、基因檢測發展及其應用、基因晶片發展及其應用、次世代定序發展及其應用、基因治療發展及其應用、伴隨診斷及標靶治療、細胞治療發展及其應用等，最前緣的精準醫學知識與應用範例。\n\nPrecision Medicine is also known as Personalized Medicine. This term was first proposed by the National Research Council in November 2011. In addition to traditional diagnostic methods such as patient symptoms and imaging examinations, it also integrates with new biomedical tests such as genetic testing and comprehensive personal information like gender, height, weight, race, gene specificity, past medical history, family medical history, etc. The genetic and personal information is analyzed through searching known human gene database and used to select the most suitable treatments and medicines for patients, for example, cell therapy, gene therapy, and targeted therapy. The ultimate goal of precision medicine is to find out a personalized medical plan with maximum therapeutic benefits and minimum side effects through in-depth diagnosis of individual differences. President Obama has launched \"Precision Medicine Initiative\" in January 2015. It is estimated that $215 million US dollars will be invested to build a database of medical records, genes, and lifestyle habits of million people. This project also includes the search for new oncogenic genes, the development of new targeted cancer drugs, and the establishment of relevant regulations to protect privacy and personal security. Since then, all countries have competed to invest in the development of precision medicine. Precision Medicine is also one of the key biotechnology industries in Taiwan. The goal of this course is to highlight the leading-edge knowledge and applications in precision medicine.",
    "schedule": "01. Gene Sequencing and Analysis \n02. Gene Microarray\n03. Next-generation Sequencing\n04. Cell and Gene therapy\n05. Tissue Engineering\n06. Regenerative Medicine\n07. Applied Microbiology\n08. Fine Chemicals\n09. Nutraceutical Science\n10. Pharmaceuticals\n11. Case study 1：Bioindustry\n12. Case study 2：Transgenic Farming\n13. Case study 3：Biochip Development\n14. Case study 4：Gene Editing\n15. Case study 5：Synthetic Biology \n16. Case study 6：Stem Cell Research",
    "scorePolicy": "期中報告\n期末報告",
    "materials": "產官學界最新資料彙整",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 本學期課程因應疫情警戒等級規劃上課方式原則如下，實際實施日期與上課方式，請依照學校網頁所公布之訊息為準：\n(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)</div>"
  }
]
