[
  {
    "name": "胡憲倫",
    "email": "allenhu@ntut.edu.tw",
    "latestUpdate": "2022-01-04 23:25:27",
    "objective": "This course is regarding win-win strategies for which corporate can achieve both profitability and sustainability. Students will not just learn traditional business management but also new strategies and practices for doing business in the emerging green and low carbon economy. Students will be taught the characteristics and landscape of the new economy, and how to help enterprises enhance their competitiveness in response to the megatrends of sustainability. In addition, the latest practices and theories of corporate sustainability, such as UN Sustainable Development Goals (SDGs), Bottom of the Pyramid (BOP), and Creating Shared Values (CSV), will be taught in the class. Case studies and group discussions will be adopted in the class.",
    "schedule": "Week 1(2/22) Introduction to Business Management and Corporate Sustainability\nWeek 2(3/1) National Holiday*\nWeek 3(3/8) Corporate Strategy for Environmental Management and Sustainability\nWeek 4(3/15) What sustainability and ESG mean to you - A Future Leaders Talk (Dr. Niven Huang, KPMG)\nWeek 5(3/22) How to tell a company in terms of ESG - From talking about it, doing it, to show it (Dr. Niven Huang, KPMG)\nWeek 6 (3/29) What the world will look like in 2030 if BAU (business as usual) – From vision 2050 to outlook 2030 (Dr. Niven Huang, KPMG)\nWeek 7 (4/5) National Holiday*\nWeek 8(4/12) Global Trends and Business Thinking for Sustainability* (Dr. Grace Liu, ACER)\nWeek 9 (4/19) Corporate Sustainability - Core Issues of Environmental Aspect* (Dr. Grace Liu, ACER)\nWeek 10(4/26) Dell’s Perspectives &amp; Practices on Sustainability &amp; Circular Economy* (Ms. Vivian Tai, Dell Technologies)\nWeek 11(5/3) Special Topic on the Base of the Pyramid/Inclusive Business and Shared Value- A New Business Ocean Strategy\nWeek 12 (5/10) Special Topic on Impact Investing and Corporate Sustainability* (Dr. D.K. Wu, B Lab Taiwan)\nWeek 13 (5/17) Special Topic on New Evaluation Methodology- Natural Capital Accounting (NCA) and Environmental and Social Profit and Loss (Dr. Lance Huang)\nWeek 14 (5/24) Group Presentation (I)\nWeek 15 (5/31) Group Presentation (II)\nWeek 16(6/7) Company Tour (Acer Inc.)\nWeek 17(6/14) National Holiday*\nWeek 18(6/21) Special Topic on Sustainable Business- ESG from the DJSI and CDP Rating (Dr. Jerry Hsu, Dr. Daniel Chen, and Dr. Yao-te Chen, Sustain Vision)",
    "scorePolicy": "Homework/Reports: 20%  Participation: 10% Midterm: 15%\nFinal Exam: 25%   Project: 30% (TBA in the class)",
    "materials": "1.　　Blowfield, Michael (2013), Business and Sustainability, Oxford : Oxford University Press, 2013.\n2.　　Weybrecht, Giselle (2010), The Sustainable MBA: The Manager's Guide to Green Business, John Wiley &amp; Sons, Chichester, UK\n3.　　Werther, W.B. and D. Chandler (2011). Strategic Corporate Social Responsibility- Stakeholders in a Global Environment (2nd edition), Sage Publications\n4.　　Esty and Winston (2009), Green to Gold: How Smart Companies Use Environmental Strategy to Innovate, Create Value, and Build Competitive Advantage, Wiley \n5.　　Andrew S. Winston (2014), The Big Pivot: Radically Practical Strategies for a Hotter, Scarcer, and More Open World, Harvard Business Review Press",
    "foreignLanguageTextbooks": true
  }
]
