[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2022-02-17 13:16:48",
    "objective": "Advanced Robotics and Automation Applications (ARAA) is offered only for up to 28 graduate students with basic programming experience.  In addition to lectures on robotic manipulation, ARAA requires oral presentations and reports on robotics papers also focuses on projects with mobile robots and manipulators in the topics of interest related to:\n\n高等機器人與自動化應用 (ARAA) 適合研究生修習，因設備因素限 28 人，須具備程式語言能力。除教授機器人學外，另鼓勵研究生閱讀相關論文並演示簡報與撰寫報告，亦聚焦於移動式機器人與機械手臂專題，相關主題如下：\n\n1. Spatial descriptions and transformations 空間描述與數學轉換 2. Manipulator kinematics 機械手臂運動學 3. Manipulator inverse kinematics 機械手臂反向運動學 4. Linear control of manipulator 機械手臂之線性控制 5. Paper presentation and report 論文簡報與撰寫報告 6. Project topics: manipulator and mobile robot control, and robot control system based on visual sensing 專題項目：機械手臂及移動式機器人操控、結合視覺感測之機器人控制系統。\n\nCourse handouts will be available via iStudy web. In addition to homework assignments, a number of quizzes will be taken weekly during lectures.  The quiz questions are based on problem sets in the textbook.  Each student is required to make an oral presentation and submit a report based on a technical paper preferably related to proposed final project in related topics.  All projects must be completed and evaluated in class under supervision of Professor and TA with particular attention to equipment operation safety. \n\n本課程於每週課前公布講義於北科 i 學園 +，除了繳交作業外，授課期間每週會有小考，藉以評估作業及學習狀況。期末專題提案應研讀相關論文、撰寫書面報告並於課堂上口頭報告，使用專題設備時必須正確操作並注意安全，且所有專題執行成果必須經教授與助教考核。",
    "schedule": "Tentative schedule 暫定課程進度\n1　　02/24　　簡介 Introduction\n2　　03/03　　空間描述與轉換 Spatial Descriptions &amp; Transformations\n3　　03/10　　方向表示 Representations for Orientation\n4　　03/17　　順向運動學 Forward Kinematics\n5　　03/24　　逆向運動學 Inverse Kinematic\n6　　03/31　　機械手臂控制 Control of manipulator\n7　　04/07　　移動式機器人視覺控制專題 #1 Project: Vision-Based Control of Mobile Robots #1\n8　　04/14　　移動式機器人視覺控制專題 #2 Project: Vision-Based Control of Mobile Robots #2\n9　　04/21　　機械手臂操控專題 #1 Project: Manipulator Control #1\n10　　04/28　　機械手臂操控專題 #2 Project: Manipulator Control #2\n11　　05/05　　論文簡報 #1 Paper presentation #1\n12　　05/12　　論文簡報 #2 Paper presentation #2\n13　　05/19　　論文簡報 #3 Paper presentation #3\n14　　05/26　　期末專題 (1/3) Final Project (1/3)\n15　　06/02　　期末專題 (2/3) Final Project (2/3)\n16　　06/09　　期末專題 (3/3) Final Project (3/3)\n17　　06/16　　期末專題簡報及展示 Final Presentation and Demo\n18　　06/23　　期末專題報告繳交 Final Project Report Due",
    "scorePolicy": "The final grade will be a weighted average of attendance and homework quizzes 20%, paper presentation and report 20%, projects 40%, and final project 20%. 學期成績權重比例為出席與作業小考 20%，論文簡報與報告 20%，專題成績 40%，以及期末專題 20%。",
    "materials": "Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company.\n\nRobotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke\nPublication Year: 2013 | ISBN 3642201431 | 1st Edition",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If remote classes\nhttps://meet.google.com/ein-zomr-jwj\nhttps://istudy.ntut.edu.tw/\n\nProfessor Wen-Chung Chang 張文中教授，wchang@ntut.edu.tw\nTAs: Yun-Kai Liu 劉芸愷 t110318120@ntut.edu.tw、Kai Hsueh 薛凱 t110318158@ntut.edu.tw</div>"
  }
]
