[
  {
    "name": "張文中",
    "email": "wchang@ntut.edu.tw",
    "latestUpdate": "2021-12-27 12:50:31",
    "objective": "Advanced Robotics and Automation Applications (ARAA) is offered only for up to 28 graduate students with programming experience. In addition to lectures on robotic manipulation, ARAA also focuses on projects with mobile robots and manipulators in the topics of interest related to:\n高等機器人與自動化應用 (ARAA) 適合研究生修習，因設備因素限 28 人，須具備程式語言能力。除教授機器人學外，另鼓勵研究生閱讀相關論文並演示簡報與撰寫報告，亦聚焦於移動式機器人與機械手臂專題，相關主題如下：　　\n1. Spatial descriptions and transformations 空間描述與數學轉換 2. Manipulator kinematics 機械手臂運動學 3. Manipulator inverse kinematics 機械手臂反向運動學 4. Linear control of manipulator 機械手臂之線性控制 5. Paper presentation and report 論文簡報與撰寫報告 6. Project topics: manipulator and mobile robot control, and robot control system based on visual sensing 專題項目：機械手臂及移動式機器人操控、結合視覺感測之機器人控制系統。",
    "schedule": "The order of lectures and projects may be adjusted according to course needs.  \n下列授課內容及專題得視實際狀況調整順序\n\n1　　02/24　　Introduction 簡介\n2　　03/03　　Spatial Descriptions &amp; Transformations 空間描述與轉換\n3　　03/10　　Representations for Orientation 方位表示\n4　　03/17　　Forward Kinematics 順向運動學\n5　　03/24　　Inverse Kinematics 逆向運動學\n6　　03/31　　Control of manipulator 機械手臂控制\n7　　04/07　　Project: Vision-Based Control of Mobile Robots (1/2)\n移動式機器人視覺控制專題 (1/2)\n8　　04/14　　Project: Vision-Based Control of Mobile Robots (2/2)\n移動式機器人視覺控制專題 (2/2)\n9　　04/21　　Project: Manipulator Control (1/2)\n機械手臂操控專題 (1/2)\n10　　04/28　　Project: Manipulator Control (2/2)\n機械手臂操控專題 (2/2)\n11　　05/05　　Paper presentations I 論文簡報 I\n12　　05/12　　Paper presentations II 論文簡報 II\n13　　05/19　　Paper presentations III 論文簡報 III\n14　　05/26　　Final Project (1/3) 期末專題 (1/3)\n15　　06/02　　Final Project (2/3) 期末專題 (2/3)\n16　　06/09　　Final Project (3/3) 期末專題 (3/3)\n17　　06/16　　Final Project Presentation and Demonstration\n期末專題簡報及展示\n18　　06/23　　Dead week 期末考試週",
    "scorePolicy": "The final grade will be a weighted average of attendance and homework quizzes 20%, paper presentation and report 20%, projects 40%, and final project 20%. \n學期成績權重比例為出席與作業小考 20%，論文簡報與報告 20%，專題成績 40%，以及期末專題 20%。",
    "materials": "Introduction to Robotics: Mechanics and Control, John J. Craig, Addison-Wesley Publishing Company.\n\nRobotics, Vision and Control: Fundamental Algorithms in MATLAB, Springer by Peter Corke\nPublication Year: 2013 | ISBN 3642201431 | 1st Edition",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">Course handouts will be available via iStudy web. In addition to homework assignments, a number of quizzes will be taken weekly during lectures.  The quiz questions are based on problem sets in the textbook.  All projects must be completed and evaluated in class under supervision of Professor and TA. 本課程於每週課前公布講義於北科 i 學園，除了繳交作業外，授課期間每週會有小考，藉以評估作業及學習狀況。使用專題設備時必須正確操作並注意安全，遇到問題務必通知助教尋求協助。所有專題執行成果必須經教授與助教考核。</div>"
  }
]
