[
  {
    "name": "陳錦文",
    "email": "cwchen@mail.ntut.edu.tw",
    "latestUpdate": "2022-02-15 11:37:28",
    "objective": "係利用物理機械整理及化學處理方式，改善紡織品之吸引性、服務性和最終用途之機能性。整理加工技術包括結構穩定性 (諸如壓縮、煮呢、蒸呢、熱定型)；表面特性改質 (諸如平滑性、粗糙性、光澤性及其他美觀性質) 與功能性改質 (諸如防縐、防縮、防火、防污、防水、防微生物與昆蟲、耐光、耐冷熱、耐污染質及化學藥劑、耐氣候、耐摩擦、抗起球、抗靜電)。\nIn textile manufacturing, finishing refers to the processes that convert the woven or knitted cloth into a usable material and more specifically to any process performed after dyeing the yarn or fabric to improve the look, performance, or hand feeling of the finish textile or clothing.\nThe attractiveness, serriceability and end-use performance of textiles are imporved by the application of physical mechanical and chemical processes.  Finishing techniques include dismensional stabilization (such as, sanforization, crabbing, decatizing, heat-setting),modification of surface characteristics (such as, smoothness, roughness, luster, other esthetic fabric qualities) and functional property modification (such as, resistance to wrinkle shrinkage, fire, soils and stains, water, microorganisms and insect, light, heat and cold, air pollutants and chemical agents, weathering, abrasion, pilling and static change).",
    "schedule": "Week 1 - Introduction to Finishing\nWeek 2 - Wrinkle Resistant Finishing - 1 (Performance characteristics, Catalysis and Catalysts, Other Crosslinking agents, Non-nitrogenous Agents, Control of Formaldehyde Release)\nWeek 3 - Wrinkle Resistant Finishing - 2\nWeek 4 - Wrinkle Resistant Finishing - 3\nWeek 5 - Stiff and Soft Finishing - 1\nWeek 6 - Stiff and Soft Finishing - 1\nWeek 7 - Water Proofing and Water Repellency - 1 (Waterproof Breathable Textiles)\nWeek 8 - Midterm exam\nWeek 9 - Water Proofing and Water Repellency - 2\nWeek 10 - Soil Repellency and Soil Release Finishing\nWeek 11 - Fire Retardant Finishing (Chemistry of Flame Retardants and\nMore Flame retardants and evaluation of fire retardancy)\nWeek 12 - Antimicrobial Finishing\nWeek 13 - Finishing of Wool (Shrink Resistant Wool, Wool Setting, Mothproofing of Wool) \nWeek 14 - Biopolishing \nWeek 15 - Finishing of synthetics &amp; Antistatic Finish\nWeek 16 - Energy Saving (Low Liquor Application &amp; Waste heat recovery)\nWeek 17 - Principles of Some Finishing Machines\nWeek 18 - Final exam",
    "scorePolicy": "Midterm 40%, Final 40%, Attend 20%",
    "materials": "Provided PowerPoint files\nChemistry Technology of Fabric Preparation and Finishing (https://p2infohouse.org/ref/06/05815.pdf) \nChemical Finishing of Textiles (https://www.sciencedirect.com/book/9781855739055/chemical-finishing-of-textiles)",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div></b></b>"
  }
]
