[
  {
    "name": "王聖銘",
    "email": "ryan5885@gmail.com",
    "latestUpdate": "2022-01-03 15:07:16",
    "objective": "Design thinking is a powerful approach to new product development that begins with understanding unmet customer needs. It’s a human-centered design process that approaches problem-solving with understanding the user needs. Design thinking encompasses concept development, applied creativity, prototyping, and experimentation. When design thinking approaches are applied to business, the success rate for innovation has been seen to improve substantially.\n\nDesign-driven companies such as Apple, Coca-Cola, IBM, Nike, Procter &amp; Gamble, and Whirlpool have outperformed the S&amp;P 500 over the past 10 years by an accumulated 211% in what's called the Design Value Index—a portfolio of 16 publicly traded companies that integrate design thinking into corporate strategy. According to a 2016 report from the Design Management Institute, this marks the third consecutive year the index has shown an excess of 200% over the S&amp;P 500.\n\nThe Design Thinking course will lead participants through a step by step, design thinking process. To be considered successful, innovations have to solve the three key dimensions of Desirability, Feasibility, and Viability.\n\nDesirability: Is this product or service addressing a real customer need?\nFeasibility: Can we develop a solution that is technically feasible and better than competitors?\nViability: Is there a viable business model around this product or service?\n\nThis course will use Problem-based Learning (PBL) method to teach the five kernel steps of design thinking including the following: Empathize, Define, Ideate, Prototype, and Test. It will also help students in knowing the interdisciplinary innovation methods of interaction design by case studies and real case operation. The main course goals include the following: gain an understanding of the methods and steps of interaction design; explore the methods and operation models for the interdisciplinary innovation of interaction design; and gain the experiences of interaction design by real cases analysis and operation.\n\n本課程將以問題導向學習 (Problem-based Learning) 的模式，學習設計思考的五個核心步驟：同理心分析、問題定義、創意發想、雛型發展、驗證評估。並透過實際案例的分析與操作，學習互動設計跨領域創新的方法。本課程的主要目標在於提供學生：1. 了解互動設計的方法與步驟；2. 探討互動設計跨領域創新的方法與操作模式；3. 透過實務案例的操作累積互動設計的執行經驗。",
    "schedule": "Module 1: Design Thinking Skills\nSkills expected of design thinking practitioners\nInnovation challenges, Real-Win-Worth framework\nAltitude case study – innovation processes, leadership, and overall culture\n\nModule 2: Identifying Customer Needs\nProduct development process and concept development phase in design\nplanning and analysis\nCustomer needs and markets\nTypes of product users\nCustomer needs analysis\n\nModule 3: Product Specifications\nTranslating customer needs into measurable specifications\nBenchmarking needs vs. specifications\nDynamics of product specifications\nQuality function deployment (house of quality)\n\nModule 4: Applied Creativity\nProblem decomposition techniques and solution concepts\nBrainstorming principles and their efficacy in creative thinking\nSystem exploration and concept/down-selection\n\nModule 5: Prototyping\nPrototyping and its relevance in the concept development phase\nTypes of prototyping Prototyping strategy\nRapid prototyping and virtual prototyping Prototyping examples\n\nModule 6: Design for Services\nService development process\nService cycle experience map\nProduct vs. service systems\nService innovation examples\n\nModule 7: Product Architecture\nTypes of product architecture: integral and modular\nExamples of integral and modular architectures\nImplications of product architecture on the design process\n\nModule 8: Financial Analysis\nProduct development economics\nProject financial modeling\nCalculating Net Present Value (NPV) and its influence over product\ndecision making\nCash flow analysis\n\nModule 9: Design for Environment\nDFE principles and decision making\nHow DFE integrates with the product development process\nProduct life cycle and environmental impacts\nHerman Miller story\n\nModule 10: Product Development Processes\nSystematic innovation process: Altitude case study\nTypes of development processes – staged, spiral, and agile\nmethodologies",
    "scorePolicy": "1. This course runs over 16-18 weeks with an estimated 4-6 hours per week of study time\n2. This course is delivered in mixing online and physical classroom format and encourages students to participate at their own pace according to the provided modules. \n3. Students will learn through various formats, including interactive videos, practice quizzes, presentations, assignments, and discussion forums.\n4. The results will be evaluated according to the following criteria:\nAttendance: 20%\nMidterm report 20%\nTerm project proposal 20%\nTerm project presentation 20%\nTerm project report/paper 20%",
    "materials": "1. “design thinking at work: how innovative organizations are embracing design”\nExcerpt From: David Dunne. “Design Thinking at Work.” Apple Books. \n2. “INNOVATION BY DESIGN: How Any Organization Can Leverage Design Thinking to Produce Change, Drive New Ideas, and Deliver Meaningful Solutions”\nExcerpt From: Thomas Lockwood. “Innovation by Design.” Apple Books.",
    "foreignLanguageTextbooks": true
  }
]
