[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2022-01-06 22:53:55",
    "objective": "This course aims to enhance English-major students’ communicative competence with special emphasis on business presentations and meetings. By developing effective skills, strategies and tactful language use, students with high-intermediate proficiency level of English will be able to prepare as well as present verbal reports to achieve career goal.",
    "schedule": "Note: The weekly schedule is occasionally subject to change due to time constraints, unexpected disruptions, or needs of the class.  Readings and online conferences should be done before that week’s class.\n\nA detailed syllabus will be distributed on the first day of class.\nWeek 1. Course overview and ice breakers \nWeek 2. Welcoming your audience\nWeek 3. Introducing yourself and the topic\nWeek 4. Dealing with nervousness\nWeek 5. Body language\nWeek 6. Tips on presenting to an English-speaking audience\nWeek 7. Holiday\nWeek 8. Presentation tools\nWeek 9. Mid-term\nWeek 10. Using approximate numbers \nWeek 11. Creating effective visuals\nWeek 12. Presenting visuals effectively\nWeek 13. Describing graphs and charts\nWeek 14. Describing trends\nWeek 15. Concluding a presentation\nWeek 16. Handling the question and answer session\nWeek 17. Final presentations  \nWeek 18. Final presentations",
    "scorePolicy": "Attendance &amp; Presentation 20%\nPresentations 60%\nPortfolio 20%\n\nNote: \n\nAttendance is mandatory for all sessions. The course is a workshop class that includes in-class and out-of-class writing/discussion and peer group work. Therefore, students should not be late and should not miss classes. \n\nAny class work missed as a result of tardiness or absence is the student’s responsibility to make up. Each absence above the allowed number (two) will result in a 3-point deduction from a student’s final grade if that student remains in the course. If you have a legitimate conflict or an extreme emergency, discuss it with your instructor.\n\nStudents are expected to complete all of the assigned readings and homework assignments prior to class and fully participate in class discussions and activities. Equally important, they need to actively interact with their peers and proactively offer feedback on their peers’ presentations and performance in simulated business events to help one another identify and in turn address the areas for further improvement.",
    "materials": "Grussendorf, Marion. (2012). English for Presentations. Oxford: OUP.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div>"
  }
]
