[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2021-12-24 23:38:47",
    "objective": "文化研究以文學，社會批評，通俗文化，人類學、科學、女性主義和種族批評等觀點，對文化現象做深入的觀察、思考、及批判。本課程透過研讀相關文學與影視作品以及批判理論，探討過去與當代跨文化情境中的同化與異化現象、性別與種族身分認同的建立與崩解，培養其觀察，思考，及批判能力。\nCultural studies is emerging as one of the most inspiring and exciting fields in and out of the academy.  Drawing its energies from literary and social criticism, popular culture, anthropology and the sciences, feminism and critiques of race, cultural studies involves an infinite number of ingenious, politically contingent, and often popularly amusing subjects.  Hopefully, students taking this course are trained to become independent, critical thinkers who are able to observe, analyze, criticize, and ameliorate culture.  By addressing diverse cultural issues, students can not only deepen their understanding of different cultural values but also apply this knowledge to improve cross-cultural communication.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction\n\nWeek 2: National Holiday\n\nTheme 1: Gender and discourse\n\nWeek 3: Michel Foucault, Introduction to The History of Sexuality\n\nWeek 4: Laura Mulvey, \"Visual Pleasure and Narrative Cinema\"\n\nWeek 5: Harry M. Benshoff, \"Introduction: The monster and the homosexual\"\n\nWeek 6: Harry M. Benshoff, \"Defining the monster queer in the classical Hollywood horror film\n\nWeek 7: Film viewing and discussion: Interview with the Vampire (1994)\n\nWeek 8: National Holiday\n\nTheme 2: Race\n\nWeek 9: Edward Said, \"Introduction\" to Orientalism\n\nWeek 10: Discussion of John Gabriel Stedman's Narrative of a Five Year Expedition \n\nWeek 11: Anne McClintock, \"Soap-Soaping Empire\"\n\nWeek 12: Film viewing and discussion: The Human Stain (2003)\n\nTheme 3: Fear and pleasure: aesthetics of violence\n\nWeek 13: Robert Buch, \"In Praise of Cruelty\"\n\nWeek 14: Julia Kristeva, \"Approaching Abjection\"\n\nWeek 15: Michael Fuchs, \"Cooking with Hannibal: Food, liminality and monstrosity in Hannibal\"\n\nWeek 16: Asuka Yamazaki, “Only the Winner is Allowed to Live”: The Concept of Cannibalism in Attack on Titan\n\nWeek 17: Film Viewing and discussion: The Silence of the Lambs (1991)\n\nWeek 18: Group presentations and final reflection",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 40%\nFinal paper: 40%",
    "materials": "All reading texts will be provided by the instructor.",
    "foreignLanguageTextbooks": true,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\">*Please be advised:\nIn this course, we will approach cultural issues and cross-cultural encounters by studying related literary and theoretical works. If you are not interested in literature and do not intend to spend much time reading long and complicated texts every week, this might not be the course for you.</div>"
  }
]
