[
  {
    "name": "陳岡伯",
    "email": "kpchen@ntut.edu.tw",
    "latestUpdate": "2022-02-15 13:55:48",
    "objective": "文化研究以文學，社會批評，通俗文化，人類學、科學、女性主義和種族批評等觀點，對文化現象做深入的觀察、思考、及批判。本課程透過研讀相關文學與影視作品以及批判理論，探討過去與當代跨文化情境中的同化與異化現象、性別與種族身分認同的建立與崩解，培養其觀察，思考，及批判能力。\nCultural studies is emerging as one of the most inspiring and exciting fields in and out of the academy.  Drawing its energies from literary and social criticism, popular culture, anthropology and the sciences, feminism and critiques of race, cultural studies involves an infinite number of ingenious, politically contingent, and often popularly amusing subjects.  Hopefully, students taking this course are trained to become independent, critical thinkers who are able to observe, analyze, criticize, and ameliorate culture.  By addressing diverse cultural issues, students can not only deepen their understanding of different cultural values but also apply this knowledge to improve cross-cultural communication.",
    "schedule": "*Tentative, subject to changes\n\nWeek 1: Introduction\n\nWeek 2-8: Gender and discourse\nIntroductory text: “Gender and Sexuality” by Michael Ryan\nSupplementing theoretical text: “The Incitement to Discourse” by Michel Foucault\nCritical essay 1: “Visual Pleasure and Narrative Cinema” by Laura Mulvey\nCritical essay 2: “The Trouble with Prince Charming, or He Who Trespassed Against Us” by Roxanne Gay \nCritical essay 3: “Defining the Monster Queer in the Classical Hollywood Horror Film” by Harry Benshoff\nFilm viewing: Interview with the Vampire (1994)\n\nWeek 9-12: Race and identification\nIntroductory text: “Ethnicity” by Michael Ryan\nSupplementing theoretical text: “Introduction” to Orientalism by Edward Said\nCritical essays: to be decided\nFilm viewing: The Human Stain (2003)\n\nWeek 13-17: Violence and horror in popular culture\nIntroductory text: excerpts from Regarding the Pain of Others by Susan Sontag\nSupplementing theoretical text: “Approaching Abjection” by Julia Kristeva\nCritical essays: to be decided\nFilm viewing: to be decided\n\nWeek 18: Group presentations",
    "scorePolicy": "Attendance and participation: 20%\nGroup presentation: 40%\nFinal paper: 40%",
    "materials": "All reading texts will be provided by the instructor.\nGoogle Drive link:\nhttps://drive.google.com/drive/folders/172Y6XT-krUeNkYUlrm_Ig9DaQZgVCZVJI5kQJORkcioO-_1AHuot_IVkjINeg_G5Q0dW_vAH",
    "foreignLanguageTextbooks": true
  }
]
