[
  {
    "name": "陳心怡",
    "email": "hichen@ntut.edu.tw",
    "latestUpdate": "2022-03-29 15:39:02",
    "objective": "This current course emphasizes a holistic view of business communication in a global context.  Given that business communication across from fields of business activities is now made possible by the English language, the course thus aims to develop the ability to use critical skills essential to successful oral communication in English, with particular emphases on oral forms of communications that are highly visible within and outside business organizations, including socializing, teleconferencing, giving presentations, taking part in meetings, negotiating, handling interview questions, etc. Informal communication skills are also incorporated to address workplace situations to identify the relevant communication needs. \n\nThis course aims to foster an environment favorable for the development of team building skills including communication, active listening, problem solving, feedback offering, and so forth. Students will learn strategies and techniques for effective oral communication, discuss issues in business communication, analyze communication processes and problems, and practice techniques in simulated business situations. They will also learn useful language expressions and organizational patterns that are commonly used in English business communication to strengthen their ability to use English more appropriately and effectively.",
    "schedule": "A detailed syllabus will be distributed on the first day of class.\nWeek 1. Course overview and ice breakers \nWeek 2. U1 Connections: Cross-cultural communication \nWeek 3. U2 Careers: Managing discussion \nWeek 4. U3 Change: Showing understanding \nWeek 5. U4 Risk: taking part in a teleconference \nWeek 6. U5 Teamwork: Dealing with conflict  \nWeek 7. Holiday\nWeek 8. U6 Progress: Brainstorming ideas\nWeek 9. Mid-term\nWeek 10. SWOT analysis presentation\nWeek 11. U8 Performance: Giving an impromptu presentation\nWeek 12. U10 Leadership: giving a briefing \nWeek 13. Video resume evaluation \nWeek 14. U11 Values: Reaching agreement\nWeek 15. U12 Persuasion: Selling an idea \nWeek 16. Team building meetings \nWeek 17. Business pitch presentations  \nWeek 18. Business pitch presentations",
    "scorePolicy": "Assignment Points Attendance and participation 15% \nAssignments &amp; projects 85% \nTotal 100/100%",
    "materials": "Baade, K., Hollowway, C., Scrivener, J., &amp; Turner, R. (2018). Business result (Advanced). Oxford: OUP.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 本學期原則採實體授課方式；因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n(https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw)\n\nGoogle Meet will be used for online classes.</div>"
  }
]
