[
  {
    "name": "施欣文",
    "email": "sharinschroeder@ntut.edu.tw",
    "latestUpdate": "2022-01-04 16:26:43",
    "objective": "The official course description from the website is below, but individual professors may choose to teach the texts mentioned at their discretion. (I will certainly teach Harry Potter, but I'm still deciding as to Percy Jackson. We will do some activities with picture books as well as with longer works written for children.) I wish to note that this course should be great for elementary, junior high, and high school teachers [I LOVED reading children's literature when learning a foreign language], but it's also quite suitable for non-teachers who want to read some new texts or learn more about texts they have read in the past--and who want to improve their presentation skills. I have enjoyed having teachers and non-teachers in previous classes. \n\n本課程針對幼稚園、國小、與國中階段的英語師資而設計，在教材與教法的搭配上提供學理的引介與實務上的訓練。本課程設計考量這些階段學生之身心發展程度與興趣，將屬於兒童與青少年文學範疇的文本（例如：希臘神話、哈利波特系列、波西傑克森系列等等）作創意運用，幫助老師們擷取並改編合宜的教材，經由活潑的教學活動（包括：改編戲劇演出、繪本製作、歌唱舞蹈等等），提高學生的英語能力，也在培養他們體察文化差異的深層素養。\nDesigned for kindergarten, elementary school, and junior high school English teacher, this course aims to provide practical training and theories in teaching materials and pedagogy. Students of this course will also learn to adapt children and teenager literary works such as Greek mythology, the Harry Potter series, and the Percy Jackson series into materials suitable for students at the above-specified age groups. Possible learning activities such as role-play, picture books, dancing/singing will also be explored as methods to both develop students' English proficiency and cultural awareness.",
    "schedule": "I am still thinking about the exact schedule and course topics and texts we will discuss. Feel free to send me an e-mail if you have any concerns (sharinschroeder@mail.ntut.edu.tw). \n\nIn past years, we have read the following: Harry Potter, The Silver Chair, A Wrinkle in Time, Holes, The BFG, Alice's Adventures in Wonderland, The Hobbit, and A Christmas Carol (among others). We may not read all of these--I may switch some texts out, and this year I will certainly include more illustrated children's books.",
    "scorePolicy": "Grade Percentages:\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nReading Quizzes and Informal Writing: 25%\nInformal Lesson Plans/Teaching Presentations and Class Participation: 20%\nMidterm Illustrated Children's Book Activity: 10%\nFormal Teaching Presentations: 25%\nFinal Teaching Reflection Paper: 20%\n\nI include more detail below: \n\nTeaching Demonstrations. Each student will prepare formal and informal teaching demonstrations (including the midterm children's book activity). You will select the date and topic for the formal teaching. At times I may also ask you to brainstorm ways you might teach certain material, which you would present informally to other group members. \n\nTeaching Reflections and Informal Lesson plans. Students will write informal in-class reflections on how they would teach a particular work that we study and informal lesson plans as homework and a short midterm reflection. They will also write one longer final reflection in which they will either consider how they might integrate children's literature into their current teaching (or an after-school English club) OR how they imagine they *could* do so if they were a teacher or had an English club. \n\nReading Quizzes. (There is no need to worry about the quizzes, but our discussion goes much better when everyone has read, so we do have them. Quizzes will be open-note but not open book. If you have a busy schedule, as so many of you do, consider other ways to make sure you can read the children's literature for the week--perhaps audio versions, etc.) \n\nClass participation will be fun. I like teaching the teaching literature classes!",
    "materials": "Please see the above information in the schedule section. We will purchase some books (having the same edition if possible), and we will also have a course packet.",
    "foreignLanguageTextbooks": true
  }
]
