[
  {
    "name": "辜炳達",
    "email": "pingtaku@me.com",
    "latestUpdate": "2022-01-03 12:02:53",
    "objective": "許多文學鉅作都已經被改編成電影，讓以英語作為第二語言的學生能夠更容易地體驗這些具有文化意義的故事，一些全新且獨特的流行文化娛樂，像是電影、電視、音樂、舞蹈、和電玩遊戲也從其他文學作品和作家得到啟發。這門課程將透析文學和流行文化如何以有趣且富含文化意義的方式做結合，課程中會展現流行文化如何讓學生對這些好的文學作品更加熟悉，以及文學知識如何使學生更懂得欣賞且了解這些他們樂在其中的流行文化。\nMany of the greatest works of literature have been adapted into films, making it easier for ESL students to experience those culturally significant stories.  Other literary works and writers have inspired entirely new and different pop cultural creations (film, tv, music, dance, video games).  This course examines how literature and pop culture have combined in interesting and culturally significant ways. The course demonstrates how pop culture can help students become more familiar with great works of literature, and how knowledge of literature can help students better appreciate and better understand the popular culture which they enjoy.",
    "schedule": "Week 1. Course Intro: The implications and cultural logic of short fiction’s “shortness”\nWeek 2. “Genesis” from The Bible (ca 950 BCE)\nWeek 3. “The Purloined Letter” by Edgar Allan Poe (1844)\nWeek 4/5. “Bartleby, the Scrivener: A Story of Wall Street” by Herman Melville (1853) \nWeek 6. “After the Race” by James Joyce (1914)\nWeek 7/8. “Metamorphosis” by Franz Kafka (1915)\nWeek 9. Midterm exam\nWeek 10/11. “The Curious Case of Benjamin Button” by F. Scott Fitzgerald (1922)\nWeek 12. “The Wall” by Jean-Paul Sartre (1939)\nWeek 13. “The Garden of Forking Paths” by Jorge Luis Borges (1941)\nWeek 14/15. “Minority Report” by Philip K. Dick (1956)\nWeek 16. “The Love of Lady Purple” by Angela Carter (1974) \nWeek 17. “Solid Geometry” by Ian McEwan (1975)\nWeek 18. Final exam",
    "scorePolicy": "In-class performance 25%\nIndividual presentation 25%\nMidterm exam 25%\nFinal Exam 25%",
    "materials": "All course materials are available on https://archive.org/ and https://www.pingtaku.com/",
    "foreignLanguageTextbooks": true
  }
]
