[
  {
    "name": "蔡逸萍",
    "email": "ctsai@ntut.edu.tw",
    "latestUpdate": "2022-01-05 13:47:28",
    "objective": "PLEASE NOTE THAT THE WORKING LANGUAGES OF THIS INTERPRETING TRAINING COURSE ARE ENGLISH AND CHINESE.\n\n本課程延續「中英口譯入門」之內容，引導學生學習中英雙向之商務口譯技巧並認識商務口譯之場域特性與本質。學生持續演練逐步口譯筆記，強化習得之技巧。課程重點在熟練如何在高度時間壓力下，即刻聚焦演說片段的主旨，並透過筆記重啟被動記憶。學生也將進一步認識商務同步口譯技巧，透過本課程，認識商務口譯的認知面向與非語言變數。\nThis course builds on Introduction to Chinese-English Interpreting and equips students with skills in business interpreting in both directions. Students continue with practical exercises aimed at reinforcing note-taking skills. The nature and characteristics of business interpreting are introduced. More emphasis is placed upon learning to zero in on the main idea under heavy time pressure and re-activate passive memories with the aid of note-taking. Students also learn essential SI strategies. The course seeks to acquaint students with the cognitive dimensions and extra-linguistic variables with regard to business interpreting.",
    "schedule": "1.　　This course is designed for students who have already taken Intro to Interpreting in the Fall semester.\n2.　　The syllabus is subject to change due to evolving Covid-19 concerns.\n\nWEEK　　SESSION THEME\n1　　Introduction \n2　　The business context: Liaison interpreting/Dialogue interpreting and Conference interpreting\n3　　ST business text I \n4　　ST business text II  \n5　　CI business text I  \n6　　CI business text II \n7　　Spring break\n8　　CI business text III \n9　　Midterm\n10　　Review of midterm\n11　　SI:  pre-exercises\n12　　SI Techniques and strategies/ booth etiquette \n13　　SI of general text \n14　　SI of business text \n15　　SI of general text \n16　　SI of business text \n17　　Wrap-up: CI and SI\n18　　Final",
    "scorePolicy": "Assessment\n　　30% on mid-term examination\n　　30% on final examination\n　　10% on practice log\n　　30% on continual assessments: in-class performance; attendance to lectures; homework",
    "materials": "See class handouts.",
    "foreignLanguageTextbooks": false
  }
]
