[
  {
    "name": "洪媽益",
    "email": "miguelt@ms19.hinet.net",
    "latestUpdate": "2022-05-23 17:37:43",
    "objective": "應用語言學屬於邊緣交叉學科，與其他學科如語言學、心理學、教育學、人類學與社會學之間存在密切的關係。本課程著重在介紹第二語言與外語習得、第二語言與外語教學法、言談分析與社會語用學及社會文化學理論的研究，並探討這些領域與語言教學與學習之間的關連。本課程涵蓋各種不同觀點的理論與應用，回顧方法論的演進歷史，尤其強調現今廣受認同的方法論。\nApplied linguistics is a large interdisciplinary field of study related to a range of academic fields, including linguistics, psychology, education, anthropology, and sociology. This course focuses primarily on research in the areas of second/foreign language acquisition, second/foreign language pedagogy, discourse analysis, and sociopragmatic and sociocultural theory, as well as their relevance to language teaching and learning. We will cover theories and applications from a variety of perspectives, tracing the history of methodologies with special emphasis on those currently in widespread use.",
    "schedule": "February 23 Class orientation\nMarch 2/9/16 Pragmatics/Sociolinguistics\nMarch 30 first oral presentation\nApril 13/20/27 Lexicogrammar/Corpus Linguistics\nMay 11 second oral presentation\nMay 18/25/June 1 Psycholinguistics/Language Acquisition/Teaching\nJune 8 third oral presentation\nJune 15 Research proposal presentation\nJune 22 Final paper due\nEND",
    "scorePolicy": "Oral presentations: 30%\nFinal presentation (research proposal): 30%\nFinal paper: 30%\nParticipation: 10%\nEND",
    "materials": "Lecture contents will be taken from various textbook chapters.\nJournal articles and graduate theses.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >May 25, talk on EMI from 1pm to 3pm\nLecture on Language Acquisition\nJune 1, Lecture on Learning Strategies and presentations on Reading and Listening skills\nJune 8, talk on Film Subtitle Translation (and English Teaching) from 1pm to 3pm \n(Those who like watching films/movies and who have watched the film Everything Everywhere All at Once are invited to come to Room 301; the speaker would like to engage in some interaction with a live audience)\nSecond oral presentations from 3pm \nJune 15, Project presentations from 3pm\nJune 22, final paper and one-page reflection (on the talks) due END</div>"
  }
]
