[
  {
    "name": "蔡逸萍",
    "email": "ctsai@ntut.edu.tw",
    "latestUpdate": "2022-02-21 10:45:36",
    "objective": "PLEASE NOTE THAT THE WORKING LANGUAGES OF THIS INTERPRETING TRAINING COURSE ARE ENGLISH AND CHINESE.\n\n本課程延續「中英口譯入門」之內容，學生演練雙向語言之積極聆聽、重述、記憶保留、摘要及逐步口譯筆記，強化之前習得之技巧。擴大譯出語演說之議題深度與廣度，口譯片段加長，學生能持續加強分析與歸納綜合訊息的能力。學生進一步認識基礎專業同步口譯，回溯之前習得的口譯技巧，熟悉同步口譯的基本要素，包括重述、專注力分割、一心多用、聽譯時間差、預測及重組等。\nBased on Introduction to Chinese-English Interpreting, students continue with practical exercises aimed at reinforcing skills in active listening, recall and memory retention, gist extraction and note-taking in both directions. Increasing lengths and difficulties of speeches of diverse topics also enables students to strengthen and apply more advanced analytical and synthetic skills. Students continue to brush up on skills obtained previously and learn essential SI strategies, including paraphrasing or re-oralizing, split attention, multitasking, the time lag between interpreter and speaker, anticipation and reformulation.",
    "schedule": "1.　　This course is designed for students who have already taken Intro to Interpreting in the Fall semester.\n2.　　The syllabus is subject to change due to evolving Covid-19 concerns.\n\nWEEK　　SESSION THEME\n1　　Introduction \n2　　ST \n3　　ST \n4　　ST  \n5　　Long CI \n6　　Long CI \n7　　Long CI \n8　　Long CI \n9　　Midterm \n10　　Review of midterm\n11　　SI: pre-exercises  \n12　　SI techniques and strategies/booth etiquette\n13　　SI of general text \n14　　SI of general text \n15　　SI of general text \n16　　SI of general text \n17　　Wrap-up: CI and SI\n18　　Final",
    "scorePolicy": "Assessment\n　　30% on mid-term examination\n　　30% on final examination\n　　10% on practice log\n　　30% on continual assessments: in-class performance; attendance to lectures; homework",
    "materials": "See class handouts.",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1. 若學校因應疫情規定遠距教學，則使用下面平台上課: https://meet.google.com/icu-zjyi-mbv\n2. 教師聯絡方式（E-mail）：ctsai@ntut.edu.tw</div></b></b>"
  }
]
