[
  {
    "name": "丁原智",
    "email": "ycding@ntut.edu.tw",
    "latestUpdate": "2022-02-14 17:24:20",
    "objective": "本課程有系統的教授英文寫作技巧，藉由課堂活動及回家作業等給予學生們實際去練習備忘錄、信件以及論文寫法並試著報告。",
    "schedule": "Instructions and procedures are documents that help either developers or end users operate or configure a device or program.\n \nProposals. Most projects begin with a proposal—a document that describes the purpose of a project, the tasks that will be performed in the project, the methods used to complete the project, and finally the cost of the project.\n\nEmails, letters, and memoranda are some of the most frequently written documents in a business.\n \nPress releases. When a company wants to publicly reveal a new product or service, they will have a technical writer author a press release, a document that describes the product's functions and value to the public.\n \nSpecifications are design outlines that describe the structure, parts, packaging, and delivery of an object or process in enough detail that another party can reconstruct it\n. \nDescriptions are shorter explanations of procedures and processes that help readers understand how something works.\n \nRsums and job applications are another example of technical documents. \nTechnical reports are written to provide readers with information, instructions, and analysis on tasks. \n\nCase study is a published report about a person, group, or situation that has been studied over time; also : a situation in real life that can be looked at or studied to learn about something.\n \nWhite papers are documents that are written for experts in a field and typically describe a solution to a technological or business challenge or problem.",
    "scorePolicy": "reading tests 100%",
    "materials": "handout",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因應疫情調整之上課方式\n因應疫情調整之上課方式\nemail:ycding@ntut.edu.tw\n遠距教學: MS team</div>"
  }
]
