[
  {
    "name": "陳盈棻",
    "email": "yingfenchen@ntut.edu.tw",
    "latestUpdate": "2022-02-16 16:22:03",
    "objective": "While cinema has been invented over a hundred years and getting influential in shaping people’s perspectives to our environments, the studies of cinematic urbanism have only initiated since 1990s. During the past decades, this interdisciplinary field has developed upon the scholarships of various disciplines, including film and media studies, cultural studies, history, geography, urban studies, etc. This course intends to introduce this still young field through chronologically examining the relationships between cinema and cities, from both being used to celebrate and mediate the modern feelings to film noir playing a crucial role to criticize and depict urban problems, and to cinematic urban imaginaries boosting tourism and intervening in urban process. Students will learn the theories and methodologies of cinematic urbanism studies, comprehending cinema and different urban spaces as powerful medium that could be manipulated to create, transmit, and perceive certain ideologies.",
    "schedule": "Week 01　　Introduction\nWeek 02　　Holiday: Peace Memorial Day\nWeek 03 Man with a Movie Camera in the Modern City\nWeek 04　　Modernism in Architecture and Cinema: Sergei Eisenstein and Le Corbusier\nWeek 05　　Mediating the American Modernism through Cinematic Spaces\nWeek 06　　Shanghai Modern: Urban Culture and Film Industry\nWeek 07　　Holiday: Spring Break/Children’s Day\nWeek 08　　Film Noir and the Spaces of Modernity\nWeek 09　　Future Urban Imaginations and Si-fi Cinema\nWeek 10　　Midterm Presentation \nWeek 11　　Postmodern Aesthetics and Taiwan’s New Wave Cinema\nWeek 12　　Hong Kong Cinema and the City on Fire\nWeek 13　　The Film Studio: Film Production in the Global Era\nWeek 14　　From Fans’ Cinematic Pilgrim to Film-induced Tourism\nWeek 15　　Cinematic Promotion and Cultural Governance in Contemporary Cities\nWeek 16　　Cinematic Historiography and Community Design\nWeek 17　　Final Presentation (I)\nWeek 18　　Final Presentation (II)",
    "scorePolicy": "15% Attendance\n30% Participations\n15% Midterm Presentation\n40% Final Presentation and Essay",
    "materials": "Simmel, Georg (1903, 1971) \"The Metropolis and Mental Life\", trans. Edward A. Shils in Our Individuality and Social Forms, ed. Donald N. Levine. Chicago: U of Chicago Press, 324-339. \nBruno, Giuliana (1997) “Site-seeing: Architecture and the Moving Image” in Wide Angle 19.4, 8-24.\nVidler, Anthony (2019) “The Eisenstein Effect: Architecture and Narrative Montage in Sergei Eisenstein and Le Corbusier” in The Moving Eye: Film, Television, Architecture, Visual Art, and the Modern, ed. Edward Dimendberg. Oxford University Press.\nEisenstein, S., Bois, Y., &amp; Glenny, M. (1989). Montage and Architecture. Assemblage, (10), 111-131. \nHansen, Miriam (1994) “Introduction: Cinema Spectatorship and Public Life” and “Chameleon and Catalyst: The Cinema as an Alternative Public Sphere” in Babel and Babylon: Spectatorship in American Silent Film. Harvard U. Press. \nNasaw, David (1999) “Dollar Theaters, Concert Saloons, and Dime Museums” and “Something for Everybody” at the Vaudeville Theater” in Going Out: The Rise and Fall of Public Amusements. Harvard U. Press.\nHansen, Miriam (2000)“Fallen Women, Rising Stars, New Horizons: Shanghai Silent Film as Vernacular Modernism,” Film Quarterly 54.1: 10-22.\nPang Laikwan (2007) “Introduction,” “Chapter 1,” “Chapter 5” in The Distorting Mirror. University of Hawai'i Press, 1-68, 164-183.\nDimendberg, Edward. (2004) “Introductin” and “Simultaneity, the Media Environment, and the End of Film Noir” in Film Noir and the Spaces of Modernity. Harvard University Press.\nTsutsui, W. (2010). “Oh No, There Goes Tokyo: Recreational Apocalypse and the City in Postwar Japanese Popular Culture.” In Prakash G. (Ed.), Noir Urbanisms: Dystopic Images of the Modern City. Princeton; Oxford: Princeton University Press, 104-126.\nPrakash, G. (2010). “Introduction: Imaging the Modern City, Darkly.” In Prakash G. (Ed.), Noir Urbanisms: Dystopic Images of the Modern City. Princeton; Oxford: Princeton University Press, 1-14. \nAlSayyad, Nerza. (2006) “An alternative modernity: race, ethnicity and the urban experience” and “Exurban postmodernity: utopia, simulacra and hyper-reality” in Cinematic Urbanism: A History of the Modern from Reel to Real. Routledge Press.\nJameson, Frederick (1992) “Remapping Taipei” in The Geopolitical Aesthetic: Cinema and Space in the World System. Bloomington: Indiana University Press, 114-157. \nChang. Yvonne (2005) “The Terrorizer and the Great Divide in Contemporary Taiwan’s Cultural Development.” In Island on the Edge: Taiwan New Cinema and After. Ed.  Chris Berry and Feii Lu. Hong Kong University Press, 13-26.\nAbbas, M A. (1997) “Introduction: Culture in a Spcae of Disappearance.” In Hong Kong: culture and the politics of disappearance. University of Minnesota Press, 1-15. \nCheung, Ester M. K. (2004) “The City that Haunts: The Uncanny in Fruit Chan’s Made in Hong Kong.” In Cheung, Ester M. K., Chu, Yiu-wai Ed. Between Hong and World: A Reader in Hong Kong Cinema. Oxford U. Press, 352-368.\nKrause, Linda and Petro, Patrice ed. (2003) Global Cities: Cinema, Architecture, and Urbanism in Digital Age. Routledge Press. (selected chapter, TBD). \nGoldsmith, Ben and O'Regan, Tom (2005) “International Production and Globalization” and “The Same but Different Canadian Studios and International Production” in The Film Studio: Film Production in the Global Economy. Rowman &amp; Littlefield Publishers. \nBeeton, Sue. (2005) “Popular Media and Tourism” and “film Studio Theme Park success and Fallings” in Film-Induced Tourism. Channel View Publications. \nRoberts, Les (2012) “Cinematic Geography: Mobilizing the Archive City” and “Cinematic Cartography: Mapping the Archive City” in Film, Mobility, and Urban Space: A Cinematic Geography of Liverpool. Liverpool University Press.\nKronenburg, Robert (2010) “Informing Contemporary Architectural and Urban Design with Historic Filmic Evidence” in Koeck, R., Roberts, L. Ed. The City and the Moving Image Urban Projections. Palgrave Macmillan. \nThanouli, Elefth",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >The class will be held through Google Meet with a link provided later here if the COVID-19 affects the prevention policy. Please contact the instructor via yingfenchen@ntut.edu.tw if needed.</div></b></b>"
  }
]
