[
  {
    "name": "陳儀",
    "email": "",
    "latestUpdate": "2022-02-18 15:57:19",
    "objective": "This course, \"Practical Application of Chinese Language\", is designed for the students of the University of Science and Technology. It is based on the practical application in the future work and life.\n Based on the Chinese language ability of the previous 12 years before the university, the curriculum design is oriented towards the application of multiple practices, with the construction of students diverse communication and expression in needs of the  future work as the main, including information gathering ability, information application ability, presentation production ability, writing ability , self-promotion, oral communication, interview writing, idea exposition, innovative thinking, and many other areas, and attaches great importance to inspiring students to cultivate their taste in life, deepening students' understanding of practical use of Chinese in the future.",
    "schedule": "Week 1  Course Introduction\nWeek 2  Introduction to Daoism\nWeek 3  Chinese Classics Reading: Zhuangzi\nWeek 4  Introduction to Resume and Autobiography Writing\nWeek 5  Writing Practice\nWeek 6  Chinese Classics Reading: Daughter of a Fox Spirit\nWeek 7  Chinese Classics Reading: Daughter of a Fox Spirit\nWeek 8  Introduction to Story Writing and Writing Practice\nWeek 9  Writing Practice\nWeek 10  Introduction to Confucianism\nWeek 11  Chinese Classics Reading: Confucius and Mencius\nWeek 12  Introduction to Project Proposal Writing\nWeek 13  Creative Thinking and Evaluation\nWeek 14  Structures and Paragraphs\nWeek 15  Polishing and Retouching\nWeek 16  Group Project Presentation\nWeek 17  Group Project Presentation\nWeek 18  Final Examination",
    "scorePolicy": "Class Participation: 30%\nGroup Assignments (oral presentation and PowerPoint slides): 50%\nFinal Exam: 20%",
    "materials": "Lily Zhang (2011). Thirty Chapters on the History of Chinese Philosophy, Le Jin Books.\nI will be selecting some of the primary literatures in Chinese Philosophy as a self-made teaching material.",
    "foreignLanguageTextbooks": false,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If it is necessary to adopt online teaching, we will use Google meet.\nThe detail information can be found on i-school plus.\nContact information: yioocat@yahoo.com.tw</div></b></b>"
  }
]
