[
  {
    "name": "黃慧禎",
    "email": "Huichen429@gmail.com",
    "latestUpdate": "2022-01-04 16:44:26",
    "objective": "本校科技大學的國文課程，以能力及素養之培植為導向，\n並以精深致用為授課標的，方能不負大學國文課程之名，\n並符合本校重視實務應用的優良傳統。\n依授課教師之取擇，課程可概分為兩大類。\n一、文學類：著重在文學品味力、語文敏感力、文學創意力與實作創造力等能力的深化。\n二、思想類：著重在批判思辨力、邏輯推演力、決斷力、組織整合力、論述力與品格實踐力等能力的提升。\n期盼藉由這兩大方面的磨礪，為學「生」未來的「生」存、「生」活與「生」命，開展出璀璨的「三生」有幸。\n\nThe Chinese language curriculum of the University of Science and Technology of this university is oriented to the cultivation of ability and literacy, and is taught with intensive application. Only then can it live up to the name of the university's Chinese language curriculum and conform to the school's fine tradition of emphasizing practical application.\n\nDepending on the choice of the instructor, the courses can be divided into two categories.\n1. Literature: Focus on the deepening of literary taste, language sensitivity, literary creativity and practical creativity.\n2. Thinking category: Focus on the improvement of critical thinking ability, logical deduction ability, decision ability, organizational integration ability, discussion ability and character practice ability.\n\nIt is hoped that through the cultivation and training of these two aspects, we will develop a brilliant three lives for the future survival, life and life of students.",
    "schedule": "1. 課程介紹\nCourse Introduction\n2. 《紅樓夢》閱讀與討論（一）\nReading and Discussion of \"A Dream of Red Mansions\"  1\n3. 《紅樓夢》閱讀與討論（二）\nReading and Discussion of \"A Dream of Red Mansions\"  2\n4. 中華文化的文學母題\nLiterary Motif of Chinese Culture\n5. 故事寫作技巧講述（情節篇）：〈大智若魚〉 觀賞與討論\nStory Writing Skills (Plot): \"Big Wisdom Ruoyu\" Watch and Discuss\n6. 同上\nSame as above\n7. 故事創作之大綱擬定\nOutline of story creation\n8. 《紅樓夢》閱讀與討論（三）\nReading and Discussion of \"A Dream of Red Mansions\" 3\n9. 《紅樓夢》閱讀與討論（四）\nReading and Discussion of \"A Dream of Red Mansions\" 4\n10. 期中評量\nInterim  test\n11. 同上\nSame as above\n12. 電影欣賞\nappreciate the movie\n13. 中外經典賞析與翻譯（一）\nAppreciation and Translation of Chinese and Foreign Classics 1\n14. 中外經典賞析與翻譯（二）\nAppreciation and Translation of Chinese and Foreign Classics 2\n15. 中外經典賞析與翻譯（三）\nAppreciation and Translation of Chinese and Foreign Classics 3\n16. 中外經典賞析與翻譯（四）\nAppreciation and Translation of Chinese and Foreign Classics 4\n17. 期末評量\nFinal test \n18. 期末評量\nFinal test",
    "scorePolicy": "一、　　出席與課堂參與：各占百分之二十。\n二、　　期中評量：百分之四十。\n三、　　期末評量：百分之二十。\n備註：1. 出席以當場點名為計，逾時不候。另，同學若當週無法到課，需在下週上課日時，本人跟老師當面核對准假假單，以銷抵曠課紀錄。 課堂參與包括課堂活動發言、積極度、禮貌與秩序等。2. 報告不接受遲交\n\n1. Attendance and class participation: 20% each.\n2. Interim assessment: 40%.\n3. Final assessment: 20%.\nRemarks: 1. Attendance will be counted on the spot, and will not wait for overtime. In addition, if students cannot attend class that week, they need to check the fake slip with the teacher face-to-face on the school day next week to offset the record of absenteeism. Class participation includes class activity speech, enthusiasm,polite and order, etc. 2. Late submission of the report is not accepted",
    "materials": "《紅樓夢》\n《千面英雄》\n自編講義：請至北科 i 學園「課程公告」下載。\n\n\"Hero with a Thousand Faces\"\nSelf-edited lecture notes : Please download from the \"Course Bulletin\" of NTUT i Academy.",
    "foreignLanguageTextbooks": false
  }
]
