[
  {
    "name": "林碧雲",
    "email": "py23373@ntut.edu.tw",
    "latestUpdate": "2022-04-17 17:08:04",
    "objective": "人類社會中的經濟活動愈來愈錯綜，人與人之間的經濟關係也愈來愈複雜，但無非都是為求經濟問題的解決。如何將有限的資源在諸多可行的途徑中，選擇最有利、最能發揮滿足人們慾望的效果，乃是身為「經濟人」的萬物之靈所努力的目標。本課程提供學習者分析經濟現象的工具，掌握經濟發展的脈動，以便在現代經濟社會中立於不敗之地。\nIn human society economic activity is getting more and more complicated and economic relationship between people is also getting more and more complicated but all are to seek for the solution of economic problems. Among a number feasible ways how to choose the best way that can make best use of limited resources to satisfy people's desire shall be the goal for human being as \"economic persons\" making effort to fulfill. The course enables students to learn the tools for the analysis of economic situation, the way of grasping the wave of economic development in Taiwan so as to win in the modern economic society.",
    "schedule": "第 1-2 週  課程及參考資料概述\n第 3-5 週  發展經濟學的基本概念 (經濟發展的意義、目的與理論)\n第 6-8 週  經濟成長理論\n第 9 週  期中考\n第 10 週  學校停課\n第 11 週  國民所得的決定 --- 消費與投資\n第 12 週  國民所得的決定 --- 政府支出與淨出口\n第 13 週  財政政策與經濟發展\n第 14 週  貨幣政策與經濟發展\n第 15 週  國際貿易與經濟發展\n第 16-17 週  台灣的經濟變遷與發展\n第 18 週  期末考\n＊教師將視同學學習情況調整進度與內容",
    "scorePolicy": "平時成績 (出勤及參與討論)：40% \n期中考：30% \n期末考：30%",
    "materials": "1. Economic Development,  by Michael P. Todaro &amp; Stephen C. Smith, Harlow. England: Pearson Education Limited, ©2020, 13th edition.\n2. The Theory of Economic Development: An Inquiry into Profits, Capital, Credit, Interest, and the Business Cycle, by Joseph A. Schumpeter.  Translated by Redvers Opie. Harvard University Press, 1934, Harvard Economic Studies 46. 中文譯本，經濟發展理論，蕭美惠譯。商周出版社，2015，新商業周刊叢書。\n3. Institutions, Institutional Change and Economic Performance, by Douglass C. North. Cambridge University Press, 1990. 中文譯本：制度、制度變遷與經濟成就，劉瑞華譯。台北市：聯經出版事業股份有限公司，2017。\n4. 圖解第一次看懂經濟指標就上手，李明黎著。台北市：易博士文化、城邦文化事業股份有限公司，2020，修訂 3 版。\n5. 台灣經濟再奮發之路：擷取過去 70 年發展經驗，葉萬安著。台北市：遠見天下文化出版股份有限公司，2020。\n6. 台灣戰後經濟發展的源起：後進發展的為何與如何，瞿宛文著，台北市：聯經出版事業股份有限公司，2017。中央研究院叢書。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若因疫情無法進行實體授課，將改採遠距上課：\n★課程講義及預錄的教學影片皆先置於「北科 i 學園 PLUS」 https://istudy.ntut.edu.tw/learn/index.php 課程「經濟變遷與發展」內。上課時開啟老師的錄影檔，聽取老師的講授，並於「線上討論室」內同步討論。\n★考試及課程相關資訊將即時公布於上址之「課程公告」。如有問題請聯繫老師信箱 py23373@mail.ntut.edu.tw</div>"
  }
]
