[
  {
    "name": "羅彥棻",
    "email": "fenlo@mail.usc.edu.tw",
    "latestUpdate": "2022-05-10 11:29:06",
    "objective": "這 e 世紀時代的資訊交流是一個廣泛、多樣化與複雜的；究竟人們如何透過溝通表達意識與行為，卻變成非常重要。有效的溝通程度常視為學習溝通的指標，須視事實、竟見、感覺、嗜好和經驗進行徹底地交融與分享的結果。因此，本課程重視現代社會學習「溝通管理」的二項關鍵技術包括：有效溝通結合自我學習技巧和方法：商業知識與科技結合促成人的系統互動能力，配合多媒體傳輸工具完成學習個人與團體溝通效益。課程涵概主題：1. 溝通管理定義與本質元素。2. 溝通管理內涵分析。3. 學習個人溝通能力。4. 學習溝通程序。5.e 化自我學習技巧、方法與表達能力。6. 學習全球化溝通科技工具。7. 團隊溝通的策略與協同戰術。8. 塑造整體溝通文化。\nThe information exchange is wide, variety, and complicated in the e-era; how do people express their consciousness and behavior turn to become very important. Effective communication degrees usually are seen as the index of learning communication. It depends on thoroughly melting and sharing with fact, opinion, feeling, interesting and experience. Therefore, \"Communication Management,\" in this course we emphasize on two key techniques of modern society learning including: effective communication with self-learning skill and method; Business knowledge and technology with interactive ability of human system. By using multimedia transmitting tools to complete self and group learning communication and get benefit.Course Subjects:1. Definition and essential element of Communication Management.2. Content analysis of Communication Management.3. Learn personal communication ability.4. Learn communication process.5. E-learning skill, method, and expression ability.6. Learn the technical tools",
    "schedule": "課程規劃與規定介紹。報告個案研擬說明\n溝通管理定義與本質元素\n溝通管理內涵分析\n認識個人溝通能力\n溝通能力電影賞析\n溝通管理策略思維\n溝通技巧對組織績效的影響\n溝通的道德觀點\n期中考\n團隊溝通 (個案討論)\n職場溝通 (個案討論)\n親密溝通 (個案討論)\n網路溝通 (個案討論)\n衝突溝通 (個案討論)\n會議溝通 (個案討論)\n商業談判 (個案討論)\n溝通的倫理議題\n期末考試",
    "scorePolicy": "1. 平時成績佔 55%：包括課堂 Oral 報告 15% 與課堂討論 30% 及出席狀況 10%。\n2. 期中考 25% \n3. 期末考 20%\n\n註：如因肺炎疫情有以下狀況者，評量方式說明:\n1. 暫緩來台學生，(1) 因屬學期選修課程，建議退選其他學期再加選. (2) 如未退選，則需線上學習，除詳讀老師置放於北科 i 學園 Plus 教材外，需同步上課。繳交上課的小測驗。及期中考，期末考。如無法同步上課者，請加觀看全都錄檔案.\n2. 因防疫而隔離學生：需線上學習，除詳讀老師置放於北科 i 學園 Plus 教材外，需同步線上課程。繳交每堂上課的小測驗。及期中考，期末考。如無法同步上課者，請加觀看全都錄檔案.\n3. 未來可能確診就醫之學生：需線上學習，依據進度詳讀老師置放於北科 i 學園 Plus 教材外，需觀看全都錄上課錄影。繳交每堂上課的小測驗。及期中考，期末考.\n4. 因此成績配分不變。\n5. 因疫情升級必須線上上課，則依據學校規定上課方式。計分方式不變.",
    "materials": "教師自製教材",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >20220510 (2) 遠距演練課程連結 &nbsp;https://meet.google.com/itv-rgxk-wbt</div>"
  }
]
