[
  {
    "name": "廖硃岑",
    "email": "liaoct@ntut.edu.tw",
    "latestUpdate": "2022-01-26 12:05:16",
    "objective": "本課程從建築物構築方法和材料特性出發，介紹構法的歷史以及創新應用。內容包括現行工法的運用，以及先進工法的突破。藉由課程引導和案例介紹，培養學生構法知識與應用能力，提升學理與實務上的知能。\nThis course starts from building construction methods, introduces the technical history, innovative applications of construction methods. The content includes the application of current construction methods, as well as the breakthrough of advanced construction. Through course guidance and case study, students will cultivate their knowledge of construction method, and enhance their ability in academic theory and practice.",
    "schedule": "1.　　Course introduction.\n2-3.　　Common construction methods in Taiwan: building composition and material properties\n1.　　Taiwan case study: introduce the construction methods commonly used for new projects with different purposes\n2.　　Reading report-1\n6-7.   Advanced building construction and materials: the evolution and trend of building construction methods.\n8.  Foreign case discussion: Introduce the advanced construction methods and building materials with different purposes.\n9-10.   Mid-term week：Mid-term report\n11-12.  The application of smart buildings in construction methods\n13.  Reading report-2\n14.  Foreign case discussion: The trend of smart architecture\n15-16.  Special speech for future architecture\n17-18.  Final week：Final report",
    "scorePolicy": "1.　　Attendance：Absent for three or more lessons will fail the course.\n2.　　Attendance 20%\nReading report 20%\nMid-term report 30%\nFinal report 30%",
    "materials": "1.　　D. Michelle Addington, Daniel L. Schodek, Smart Materials and New Technologies for Architecture and design professions, Harvard University, 2005.\n2.　　Axel Ritter, Smart building in architecture, interior architecture and design, Birkhauser Architecture, 2006.\n3.　　John Fernandez, Material Architecture, Architectural press, 2006",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因應疫情防疫規定，可能調整教學方式如下\n1. 上課方式：線上上課\n2. 上課網址：\nMicrosoft teams 平台\n3. 學生加退選簽核及諮詢課程問題管道：\n授課老師分機 2935\n辦公室設計館 1F 165\nEmail: liaoct@ntut.edu.tw\n4. 補充\n以 line 群組輔佐聯絡事項 </div>"
  }
]
