[
  {
    "name": "吳南葳",
    "email": "nwwu@mail.ntut.edu.tw",
    "latestUpdate": "2022-04-13 08:29:02",
    "objective": "本課程主要在教導學生對西方 (歐洲及西亞) 認識歷史建築之演進過程與思考涵構，並使學生具備西方文化歷史與思想的相關知識，其主要授課內容如下：1. 在範圍上 -- 自古埃及、西亞、而收至古典建築、基督教建築、中世紀的大教堂時代以至文藝復興及 17、18 世紀的建築歷史。2. 在思想上 -- 自希臘的文化與哲學思想談起，以至各時代之政治、宗教與社會文明之演進，瞭解歷史涵構及其對建築的表現。3. 在建築上─針對每一時期的建築表現，瞭解其構造方法、材料應用及相關細部特徵。",
    "schedule": "第一週（2 月 25 日）、課程介紹：歷史的觀念＆史前文明、古埃及建築（金字塔）\n第二週（3 月 4 日）、古埃及建築（陵墓與神廟）＆西亞建築\n第三週（3 月 11 日）、希臘建築：克里特島與邁錫尼文明\n第四週（3 月 18 日）、希臘建築：希臘神廟與古典柱式\n第五週（3 月 25 日）、奧林匹亞與特耳菲 [本週登記期中報告題目]\n第六週（4 月 1 日）、希臘建築：雅典衛城與希臘化時期\n第七週（4 月 8 日）、羅馬建築之共和與帝國時期，劇場、圓形競技場及馬車競賽場\n第八週（4 月 15 日）、羅馬建築之哈德連皇帝與萬神殿\n第九週（4 月 22 日）、（期中考週照常上課）羅馬建築之羅馬浴場與帝國晚期\n第十週（4 月 29 日）、 中世紀之早期基督教、拜占庭、仿羅馬\n第十一週（5 月 6 日）、中世紀之哥德\n第十二週（5 月 13 日）、文藝復興之布內勒奇、亞伯提與達文西\n第十三週（5 月 20 日）、文藝復興之布拉曼德、米開朗基羅與帕拉底歐\n第十四週（5 月 27 日）、文藝復興在歐洲其他地方與矯飾主義\n第十五週（6 月 3 日）、端午節放假\n第十六週（6 月 10 日）、巴洛克與柏尼尼 [最後繳交課堂筆記日期]  [本週繳交期中報告]\n第十七週（6 月 17 日）、巴洛克之布羅米尼＆期末考前複習\n第十八週（6 月 24 日）、（期末考週）期末考",
    "scorePolicy": "出席成績　　　　20%（使用 zuvio 點名，或隨堂即時問答）\nAttendence 20% (Zuvio will be the system to calculate the attendance. Please download the app and learn how to use it.)\n課堂參與　　　　20%（期中考前後（2 月 25 日第 1 週到 4 月 15 日第 8 週間，4 月 29 日第 10 週到 6 月 10 日第 16 週間），各擇一次課堂繳交當天在北科 i 學園 plus 上傳翻拍筆記。\nClass participation 20% (Since the training of participation is not only about how you understand of the lecture but also but the skill of jotting down the crucial points. Therefore, this will be calculated according to the lecture note that you upload. The note should be uploaded on the day of the lecture before midnight so that please do not keep all of your note all together before the deadline. You should upload at least once before the mid-term (2/25-4/15), and the other before the final (4/29-6/10).)\n期中報告　　30%（2~3 人一組，3 月 25 日第 5 週上課前跟大一班代登記報告標的建築，報告標的不可重複，逾期沒有登記者，視同放棄期中報告繳交！6 月 10 日第 16 週上課前繳交 word, page 或 Indesign 排版之紙本報告。）\nMid-term report 30% (the topic should be one of the projects on the list, and each team should have 2-3 people and the topic should be registered before 3/25. Each topic can only be reported by one team, so if you already have your teammates, you should book the topic as soon as possible.) The paper report should be submitted before the class of 6/10.\n期末考試　　　　30%（缺席者本項成績以零分計）\n\n・　　期中報告標的建築列表\n蒐集資料並參觀體驗一棟指定列表中之日治時期西洋歷史風情建築。報告內容應包括：1. 該建築本身基本資料（平立面與照片）(30%)；2. 陳述該建築之西洋歷史風情之符碼 (30%)；3. 參觀後心得（該建築風格等有何啟發）(20%)；4. 報告同學本人與參觀建築物之合照 (10%)；5. 參考文獻 (10%)。（圖面數量不限，文字至少 1000 字）引用圖面、照片，請註明出處；引用專家說法請以引號標註，否則視為抄襲，若發現抄襲網路文章，期中成績以零分計。（抄襲標準：九個字中有七個字重複即視為抄襲）\n期中報告可選擇之案例包括：國立臺灣博物館、淡水紅毛城、國立臺灣師範大學禮堂、臺北自來水博物館、淡水基督長老教會、臺北市紅樓劇場、臺北二二八紀念館、台大醫院舊館、國立臺灣大學校史館、國立臺灣博物館土銀展示館、臺北濟南基督長老教會、北投溫泉博物館、國立臺灣大學傅園、新竹火車站、臺北北投基督長老教會、臺灣總督府交通局鐵道部（國立臺灣博物館鐵道部園區）、臺北中山基督長老教會、臺灣銀行總行大廈、台南地方法院、台中火車站、前清淡水關稅務司官邸 (小白宮)、臺灣總督府專賣局（含廳舍、臺博南門園區）、高雄玫瑰聖母聖殿主教座堂、國立臺灣文學館",
    "materials": "傅朝卿，2009，《圖說西洋建築發展史話》\n霍普金斯、畢爾德，謝孟蓉譯，2011，《羅馬大競技場的故事》\n金恩，吳光亞譯，2002，《圓頂的故事：文藝復興建築史的一頁傳奇》\n徐明松，2003，《古典、違逆與嘲諷： 從布魯涅列斯基 到帕拉底歐的文藝復興建築》\n米勒，鄭明萱譯，2010，《聖彼得大教堂建築的故事》\n傅朝卿，2009，《圖說台灣建築文化資產日治時期篇》\n黃士娟，2012，《建築技術官僚與殖民地經營 1895-1922》\nMusgrove, John (ed.) (1987). Sir Banister Fletcher’s A History of Architecture. London: Butterworths.\nPevsner, Nikolaus (1960). An Outline of European Architecture. Baltimore, Mayland: Penguin Books.\nWatkin, David (ed.) (1986). A History of Western Architecture. London: Laurence King.Allsopp, Allsopp, Bruce (1970). The Study of Architectural History. London: November Books.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若因疫情而暫停實體上課時，將使用 Google Meet 視訊上課，會議網址將公告於北科 i 學園 plus，或請洽 nwwu@ntut.edu.tw 詢問。</div>"
  }
]
