[
  {
    "name": "劉如熹",
    "email": "rsliu@ntu.edu.tw",
    "latestUpdate": "2022-01-22 08:29:19",
    "objective": "先修課程：負責教授同意。\n技術的關鍵特性和技術之生命週期，企業核心技術、來源和取得，技術的管理與風險，國家科技政策之影響，企業與技術生存之道，全球創新產品之開發，全球創新產品的技術策略與戰略，未來趨勢和走向。\nTechnological Innovation: Process, Content, and Types, Organization &amp; Organizing for Innovation, Planning and Discontinuous Innovation, Concurrent Engineering and Interface Management, Human Resource Management, Technology Strategy, Dominant Design, Standard, and Compatibility External R&amp;D and Alliances, Competencies and Knowledge Management in R&amp;D Setting, Design and Product Innovation, Global R&amp;D and Product Development, Industrial Research &amp; Development, Assessment and Performance Appraisal, Perspective.",
    "schedule": "1. 技術創新與管理：有關科技開發案之技術開發管理、人力責任管理及時間任務管理等 PDCA (Plan, Do, Check, Action) 之實務探討。\n2. 本課程將涵蓋以材料化學核心技術 (配方與合成、分析與應用) 為基礎，發展各種具可應用於光轉換為光、電與熱之新材料，其將分別應用於發光二極體、水分解與生醫熱療之介紹，如下圖所示。 本課程將兼具學術研究與產學研發 (實務)。其中並將教授如何製作專利及論文地圖。\n1. Technological innovation and management: The management of human resources management and time management of PDCA (Plan, Do, Check, Action) of the practical discussion.\n2. This course will cover the development of a variety of new materials that can be applied to light conversion to light, electricity, and heat, based on the core chemistry of materials chemistry (formulation and synthesis, analysis and application), which will be applied to light-emitting diodes, water splitting and biomedical, as shown below. This course will combine academic research and practical application which will teach how to make patent and paper maps.",
    "scorePolicy": "1. 聽講情形，出席狀況，發問狀況 (80%)。\n2. 專利地圖製作及報告 (20%)。\n1. Listen to the course, attend the course, ask the questions. (80%)\n2. Patent map preparation and reporting. (20%)",
    "materials": "Google patent, US patent, European Patent, Taiwan patent and China patent.",
    "foreignLanguageTextbooks": false,
    "remarks": "<div style=\"background:transparent;color: blue;font-size:12pt\"> 因應疫情防疫規定，可能調整教學方式為遠距教學，使用 Webex 教學軟體，有任何問題與我聯絡方式為 e-mail: rsliu@ntu.edu.tw。\nIn response to the epidemic prevention regulations, the teaching method may be adjusted to distance teaching, using Webex teaching software.</div>"
  }
]
