[
  {
    "name": "詹淑月",
    "email": "sarasara0218@yahoo.com.tw",
    "latestUpdate": "2022-03-18 14:07:30",
    "objective": "本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。本校體育課程目標為鍛鍊健全身心、促進身心健全發展、培養運動道德、發揚團隊精神及養成終身運動習慣。四技一年級實施普通班體育正課教學。四技二、三年級實施專項分組教學，由具有專長之教師授課。開課項目：籃球、排球、桌球、羽球、保齡球、射箭、高爾夫球、網球、體操遊戲、慢速壘球、太極拳、國際標準舞、體適能、國術。學生得按自己興趣選擇修習。\nAll students are required to attend two hours per week of Physical Education class. This requirement applies to Freshman Sophomore and Junior students while it is an elective for senior students.  For Freshman level, Classes focus on basic physical strength training.  For Sophomore and Junior students, classes are interest-oriented, thus giving students the opportunity to select specific activities they are interested in.  Choices include Basketball, Volleyball, Table Tennis, Badminton, Bowling, Archery, Golf, Tennis, Gymnastics, Slow pitch, Tai Chi Chuan, Ballroom Dancing, Physical Fitness and martial arts, to mention a few.",
    "schedule": "1. 課程介紹、請假規定、場地規格介紹、球拍選購、網球發展史介紹\n2. 球感練習與正手拍基本動作練習\n3. 正手拍腳步講解及練習\n4. 正手拍隔網丟球擊球練習\n5. 小考正手拍\n6. 反手拍基本動作講解及練習\n7. 反手拍腳步移動分解動作講解及練習\n8. 反手拍隔網拋球練習\n9. 反手拍小考\n10. 聯招考場準備放假一天\n11. 截擊基本動作講解\n12. 綜合循環練習\n13. 發球基本動作講解\n14. 綜合循環練習比賽規則講解、站位說明、分組比賽拍 \n15. 端午節放假一天\n16. 考發球\n17. 補考比賽\n18. 補考",
    "scorePolicy": "1. 正手拍隔網擊球測驗 20%\n2. 反手拍隔網擊球測驗 20%\n3. 發球測驗 20%\n3. 平時成績 40%",
    "materials": "中華民國網球協會教練手冊",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若因疫情而暫停實體上課時將使用 LINE 群組視訊上課，會議網址將公佈於北科 i 學園，\nMAIL:sara@ulive.pccu.edu.tw\nLINE ID:chansara02\n有關學生加退選可先加老師 sara@ulive.pccu.edu.tw 跟老師聯繫\n電話：0928252312\nLINE 群組 1102 專項十一  https://line.me/R/ti/g/CphZBwkECA</div>"
  }
]
