[
  {
    "name": "吉塔",
    "email": "sangeetha@mail.ntut.edu.tw",
    "latestUpdate": "2022-01-24 10:48:15",
    "objective": "COURSE OUTLINE AND SYLLABUS\nThis course 'CLEAN ENERGY TECHNOLOGY' is a basic course taught entirely in English. The aim of this course is to provide introductory knowledge to students who have not studied Environmental Science as a subject. The clean strategies that can be used to prevent negative environmental impacts on the Earth will be discussed in this class. Students can gain introductory knowledge related to sustainable energy sources and innovative techniques to reduce harmful negative environmental impacts like Global Warming and Climate Change by sustainable use of resources. This course will also motivate students to improve their English language skills like conversing and discussing in English and will help them to deliver better English presentations. \nWeek 1: Clean Energy Technology- Introduction and Basics\nWeek 2: Clean Energy sources\nWeek 3: Carbon Cycle and Footprint\nWeek 4: Carbon Trading\nWeek 5: Bio-geoengineering\nWeek 6: Carbon Sequestration\nWeek 7: Bioenergy production\nWeek 8: Carbon Farming\nWeek 9: Midterm Exam \nWeek 10: Sustainable Development Goals (SDGs)\nWeek 11: Sustainable Biofuels\nWeek 12: Fuel cells\nWeek 13: Nuclear Energy\nWeek 14: Sustainable Agriculture\nWeek 15: Sustainable Conversion Technologies\nWeek 16: Green Architecture\nWeek 17: Ecotourism\nWeek 18: Final Exam",
    "schedule": "1. The students of this class will be separated into groups for weekly presentation purposes and every week the Teacher will assign a topic for the presentation.\n2. In every class, the Teacher will initially finish the power point presentation\n3. Then one person from every group has to give his/her presentation.",
    "scorePolicy": "1. The Teacher will conduct one Midterm exam and one Final exam throughout the semester\n2. The questions for the exams will be from the power-point presentation of the Teacher. \n3. The total score of exam will be for 100 marks, in which the Teacher will consider the assignment marks, class attendance and the weekly presentation of every student.\n4. In case of online classes, the teacher will ask all students to prepare assignments as midterm and final exams.\n5. The assignment marks will be considered for exam grades along with class attendance and the weekly presentation of every student",
    "materials": "1.　　The Teacher will not use any textbooks/bibliography materials for the class.\n2.　　The students will have to study the Powerpoint presentations prepared and taught by the Teacher in every class.",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >ONLINE CLASS\n1. My online class will be on Google meet every Tuesday from 9.45AM to 12PM.\n2. Any doubts regarding the class can be discussed during online class.\n3. Students can also mail me at ID sangeetha@mail.ntut.edu.tw</div>"
  }
]
