[
  {
    "name": "李明哲",
    "email": "aslan_lee@hotmail.com",
    "latestUpdate": "2022-01-05 19:57:03",
    "objective": "This course will talk about basic mathematical analysis of complex numbers, together with possible applications. Students interested in mathematics of complex analysis are welcome to take this course. Particularly, having acquired the knowledge of calculus, engineering mathematics, or differential equations will make the learning process much easier. Although the lectures will be given in English, Chinese speaking students are also encouraged to take this course. The lecturer believes that English should not be an issue stopping students from taking this course and will endeavor to reduce the language barrier. If necessary, explanations in Mandarin may be provided to assist teaching complicated concepts and to facilitate learning. To elucidate abstract or abstruse ideas more vividly, the lecturer may also use MATLAB for demonstration. Hopefully, through a semester of learning, students can become more confident of and more familiar with addressing complex analysis. Finally, due to the depth and essence of this course, there will be no exam. Instead, evaluation will be performed based on attendance and reports only.",
    "schedule": "The schedule and contents are for reference only and liable to be adjusted according to students' learning progress in reality.\nWeek                             Course Contents\n1                          Complex numbers and complex planes\n2~3                        Complex functions and mappings\n4~5                        Analytic functions\n6~7　　　　　　   Elementary functions\n8~9                        Mid-term Report\n10~11　　　　           Integration in the complex plane\n12~13　　　　           Series and residues\n14~16　　　　           Conformal mappings\n17~18                      Final Report",
    "scorePolicy": "Attendance ─ 20%\nMid-term Report ─ 40%\nFinal Report ─ 40%",
    "materials": "Reference Book:\nComplex Analysis (A First Course with Applications), 3rd Ed., D. G. Zill &amp; P. D. Shanahan",
    "foreignLanguageTextbooks": false
  }
]
