[
  {
    "name": "林家弘",
    "email": "jhlin@ntut.edu.tw",
    "latestUpdate": "2021-12-29 15:02:27",
    "objective": "由於光纖具有小的纖核，當高強度的光脈衝在光纖中質傳播時，許多三階非線性光學效應，包括自相位調變、四波混頻、受激拉曼散射都現象會被激發，並可以透過各種新穎的光纖包括光子晶體光纖或拉錐光纖，使得光纖所產生非線性效應更為顯著。本課程除了介紹基礎的光纖理論與短脈衝在光纖中的傳播理論 (非線性薛丁格方程式)，藉此模擬光脈衝在光纖中傳播時所產生的各種非線性光學現象，此外也介紹光纖短脈衝雷射產原理與各種光孤子動態。\n\n\nOwing to the relatively small fiber core, many third order nonlinearity effect including self-phase modulation, four wave mixing, stimulated Raman scattering will be excited as high intensity pulsed light propagation in fiber.  In addition, the nonlinearity will be enhanced by means of novel fiber such as photonics crystal fiber or tapered fiber.  In this course, it will introduce the principle of optical fiber and propagation theory (Nonlinear Schrödinger equation) to simulate different kind of nonlinear optical phenomenon.  In addition, it will introduce the principle of the mode-locked fiber laser and variety soliton dynamics.",
    "schedule": "第一週 光纖簡介 I (歷史回顧與光纖製作)\n       Introduction (Historical Perspective and fiber fabrication)\n第二週 光纖簡介 II (光纖特徵)\n       Introduction (Fiber characteristics)\n第三週 光纖極化與應用 \n      Polarization of fiber and its application\n第四週 光纖非線性光學簡介 \n      Introduction of nonlinear optics in fiber\n第五週 光纖光學原理 I \n       Principle of fiber optics I\n第六週 光纖光學原理 II \n       Principle of fiber optics II\n第七週 脈衝傳播方程式 I (脈衝傳播方程式)\n       Pulse propagation in fibers I (Pulse propagation equation)\n第八週 脈衝傳播方程式 II (分階傅立葉法)\n        Pulse propagation in fibers I (Split step Fourier method)\n第九週  期中考\n       Midterm examination\n第十週 群速度色散 I (色散造成脈衝的變寬)\n       Group velocity dispersion (Dispersion induced pulse broadening)\n第十一週 自相位調變 I (自相位調變造成光頻譜變化)\n        SPM induced spectral changes\n第十二週 理論模擬非線性光學效應\n        Simulation of nonlinear optical effect\n第十三週 光纖雷射簡介 I (連續波光纖雷射)\n        Introduction of Fiber laser I (CW fiber laser)\n第十四週 光纖雷射 II (傳統光孤子光纖雷射)\n        Introduction of Fiber laser II (conventional soliton fiber laser)\n第十五週 光孤子動態 I (耗散光孤子雷射)\n        Introduction of Fiber laser II (dissipative soliton fiber laser)\n第十六週 光孤子動態 I \n        Soliton dynamics I\n第十七週 光孤子動態 II\n       Soliton dynamics II\n第十八週 期末考 (Final examination)",
    "scorePolicy": "期中考 (Midterm examination) 40%    \n期末考 (Final examination)  60%",
    "materials": "書名: Applications of Nonlinear Fiber Optics, Second Edition \n作者: Govind P. Agrawal",
    "foreignLanguageTextbooks": true
  }
]
