[
  {
    "name": "郭霽慶",
    "email": "kuocc@ntut.edu.tw",
    "latestUpdate": "2022-02-22 21:38:11",
    "objective": "This course mainly focuses on explaining the basic concepts and common sense related to polymer materials (for example: the structure of polymers, the formation of structures, molecular motion, etc.), and the molecular structure of polymers will determine its chemical/physical properties. It will determine its use and processing methods. On the application side, the current novel optoelectronic polymers and biomedical polymers will be introduced. It is expected to have a general understanding of polymer materials and their current applications, and to generate interest in polymer materials.",
    "schedule": "Introduction to polymer science\nConcept of organic chemistry for polymer science\nPhysico-Chemical properties of polymer – 1\nPhysico-Chemical properties of polymer– 2 \nSynthesis of polymer – Step-growth polymerization - Generalities\nSynthesis of polymer – Step-growth polymerization - Polycondensation\nSynthesis of polymer – Step-growth polymerization – Polyaddition\nSynthesis of polymer – Chain Polymerization – Generalities\nMidterm exam\nSynthesis of polymer – Chain Polymerization – Radical polymerization\nSynthesis of polymer – Chain Polymerization – Cationic polymerization\nSynthesis of polymer – Chain Polymerization - Anionic polymerization\nCharacterization of polymer\nApplication of polymer \nGoing further: block copolymer (BCP), self-healing polymer, composite introduction\nCharacterization of BCP and their applications\nFinal examination\nOral exams",
    "scorePolicy": "Attendance rate/class spirit: 25%\nMidterm exam: 25%\nFinal exam: 25%\nReport: 25%",
    "materials": "Please use slides and handouts in this lecture. Take notes on the handouts. \n\nThe other suggested book:\nGeorge Odian, “PRINCIPLES OF POLYMERIZATION”, Wiley-Interscience, New York, 2004.",
    "foreignLanguageTextbooks": true,
    "remarks": "\n      <b> 本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div></b></b>"
  }
]
