[
  {
    "name": "劉祐綸",
    "email": "y.l.liu@ntut.edu.tw",
    "latestUpdate": "2021-12-30 11:23:33",
    "objective": "本課程旨在幫助學生在論文寫作以及企業研究方法上建立足夠的知識與技能。課程內容主要分為兩部分，第一部分將介紹論文架構，緊接著介紹如何撰寫緒論、文獻探討、研究方法、結果分析、討論、結論及參考文獻，配合課程中的實際案例討論，指導學生應注意的論文格式與規範。本課程的第二部分則在介紹目前企業研究上常用的各種數量方法，各種數量方法的原理及其應用的領域將以實際案例解釋說明，透過上課解說演練、討論、作業、報告等方式使學生熟悉各種研究方法。主要教授的研究方法包括層級分析法、網路程序分析、TOPSIS、VIKOR、灰關聯法、決策實驗分析法、模糊理論、約略集合及基本多變量分析。所教授的各種的研究方法將以 Excel 進行分析與計算演練，本課程學習結束後，學生應當能具備足夠的能力撰寫論文並了解使用各種研究方法於企業問題解決。\nThe objective of this course is to help students build up the knowledge/skills in thesis writing and business research methods. The content of the course can be divided into two major parts. The first part will begin from the introduction of thesis structure, followed by how to write the introduction, literature review, methodology, result analysis, discussion, remarking and reference. The format of thesis will also be illustrated by some class examples. The second part of the class will begin with the introduction of different quantitative methods commonly used in business research methods today. The categories of research methods and their applicable problems are then presented using real-world case studies. Students can learn different decision-making tools through lectures, discussions, assignments, term-projects, and in-class practices. The main methods include AHP, ANP, TOPSIS, VIKOR, DEMATEL, Gray Relation Methods, Fuzzy Set Theory, Rough Set Theory, and some basic multivariate",
    "schedule": "本課程的目的為協助碩士論文的撰寫，從主體發想、文獻回顧方式到社會科學常用之量化與質性研究方法的資料收集、分析與結果報導與討論，採取漸進式的方法完成論文架構的設計與預期內容規劃。課程設計與規劃較適合企業與商業管理相關論文主題的同學，建議領域包括行銷、廣告、組織行為與心理等。\n\nTopic 1　　研究方法課程簡介：如何完成一本碩士論文、碩士學位論文應該要包含哪些內容、（不）適合的論文題目範例等。　　\n\nTopic 2　　知識論 (Epistemology) 與方法論 (Methodology)、研究假設制定、群體與樣本、概念的操作化定義、變數與資料、資料蒐集方法、資料的解釋與運用。　　\n\nTopic 3　　量化研究方法 1：統計軟體 SPSS 的功能介紹、量化資料類型與資料整理技巧。　　\n\nTopic 4　　量化研究方法 2：實驗法操作與資料分析方式；共變異數分析、假設檢定。　　\n\nTopic 5　　量化研究方法 3：問卷調查法操作與資料分析方式；相關分析、線性與非線性回歸分析。　　\n\nTopic 6　　量化研究方法 4：中介效果與干擾效果檢定。\n　　\nTopic 7　　質性研究方法 1：歷史研究法、田野調查研究法。\n\nTopic 8　　質性研究方法 2：民族誌、內容分析法。　　\n\nTopic 9　　質性研究方法 3：比較研究法、個案研究法。　　\n\nTopic 10　　質性研究方法 4：訪談研究法、焦點團體訪談法。\n　　\nTopic 11　　質性研究方法 5：動態研究法、烏托邦研究法。\n　　\nTopic 12　　期末報告",
    "scorePolicy": "1. 上台報告自己的論文主題與計畫使用之研究方法 50%\n2. 個人論文前三章（Introduction, Literature review, Method）架構報告一份 50%",
    "materials": "研究方法：入門與實務\n\n作者： Ranjit Kumar  \n譯者： 黃國光",
    "foreignLanguageTextbooks": false
  },
  {
    "name": "蔡榮發",
    "email": "jftsai@ntut.edu.tw",
    "latestUpdate": "2021-12-28 17:32:56",
    "objective": "主要內容包含：企業研究的本質、研究流程、研究問題與假設、文獻評論、資料收集、操作性定義、測量、理論架構模型化、研究設計、量化與質化研究、個案研究法、資料分析與解釋、研究報告撰寫。\nThe course mainly discusses concepts of business research methods. The contents will include following topics：（1）the nature of business research, （2）elements of research and research process, （3）research problem and hypothesis,（4）literature review, （5）research design, （6）research proposal, （7）case study, （8）analysis and the interpretation of data, （9）quantitative and qualitative research,(10) research report.",
    "schedule": "週次　　授課老師　　內容\n1.　　(蔡榮發 3/5) 課程大綱與課程介紹\n2.　　(蔡榮發 3/12) 管理研究主題探討 (1)\n3.　　(蔡榮發 3/19) 管理研究主題探討 (2)\n4.　　(蔡榮發 3/26) 量化與質化研究方法介紹 (1)\n5.　　(蔡榮發 4/9) 量化與質化研究方法介紹 (2)\n6.　　(蔡榮發 4/16) 研究計劃書撰寫與報告",
    "scorePolicy": "出席狀況 50% \n課堂討論 25%\n課堂報告 25%",
    "materials": "Business Research Methods (12th Ed.), McGraw Hill, 2013\n企業研究方法 (12 版), 華泰書局，2014\n授課教授提供相關的講義、案例等資料",
    "foreignLanguageTextbooks": false
  }
]
