[
  {
    "name": "詹傑勝",
    "email": "jasonjan@gmail.com",
    "latestUpdate": "2022-03-16 20:31:40",
    "objective": "工業化導致人口從鄉村往都市遷徙，其後果不只是在人類生活環境的改變或者是流行病學問題。都市化過程也造成自然環境改變，生物棲地減少的問題。該課程希望透過了解都市中生態棲地的改變，如何影響鳥類以及其他生物的生存，使學生意識到人類的都市化，對其他物種的衝擊。並從中思考，在便利的都會社會生活以及休閒活動之外，該如何在都市生活中建設生態友善的校園。\nIndustrialization brings about domestic migration from rural areas to cities. The consequences include not only environmental changes for human life or related epidemiological issues. The process of urbanization also causes changes of natural environment, reducing habitat for wildlife. This course aims to provide students a scope to aware how habitat changes in urban areas impact birds and other wildlife and to design environment-friendly campus in additional to convenient urban social life and leisure activities.",
    "schedule": "第 1 週　　課程介紹\n第 2 週　　社會科學與自然科學的關聯\n第 3 週　　第 14 章 人口、都市化與環境 (都市化的人口遷徙、人口老化與休閒)\n第 4 週　　校外生態觀察 - 大安森林公園\n第 5 週　　校外生態觀察 - 華江雁鴨公園\n第 6 週　　第 14 章 人口、都市化與環境 都市生態跳島化與公園生態廊道\n第 7 週　　社會研究方法，休閒活動問卷設計。郊區生態。\n第 8 週　　台北科技大學中的鳥類與生態觀察\n第 9 週　　期中考\n第 10 週　　公園生態化倡議與校園生態化倡議，規劃生態友善校園\n第 11 週　　石碇水域生態觀察  \n第 12 週　　校外生態觀察 - 台北植物園\n第 13 週　　社會學概論 第 12 章 經濟、消費與休閒\n第 14 週　　校外生態觀察 - 新海濕地浮洲濕地\n第 15 週　　外來物種認識，鳥類、爬蟲類、魚類、植物對生態的衝擊\n第 16 週　　台北科技大學中的鳥類與生態觀察\n第 17 週　　規劃生態友善校園期末報告 (含問卷調查文字與影像紀錄)\n第 18 週　　期末考",
    "scorePolicy": "期中考 Midterm　　50%\n課堂參與 class participation 10%\n出席 attending class　　20%\n校園設計期末報告 Campus design final report　　10%\n影像紀錄成果展覽 image recording exibition  10% (影像紀錄部分，請自行準備設備，單眼相機或是類單眼相機，攝錄影的鏡頭焦段至少 200mm 以上，照片畫素約一千五百萬以上 Cameras or camcorders are needed in this class, with lens at least 200mm to photograph wild birds)\n以上成績計算之後。再依照出席狀況以及課堂學習狀況加分或減分。\n課堂出席：每週點名，全勤者學期總分最多加 4 分，遲到及缺課者按情況扣分。遲到超過兩次者，開始扣分，每次 0.5 分。缺課一小時每次扣 1 分，缺課 8 小時以不及格計算。\n課堂要求：禁用手機或從事非課業相關事務，違反者每次學期總分扣 5 分。課堂學習包括抄筆記與分組討論。\nRollcall each week. Each absence and late to class will result in deduction of final grade by 2 points  and one point relatively. No cellphone and other tasks unrelated with the class are allowed. Violating this rule will result in 5 points deduction of final grade.",
    "materials": "社會學概論 第 12 章 經濟、消費與休閒 第 14 章 人口、都市化與環境 George Ritzer 著，吳鴻昌等譯 2017 雙葉書廊。\n社會科學研究方法 Earl Babbie 1998。時英出版社，台北。\n鳥與史料 周鎮著 1992 臺灣省立鳳凰谷鳥園。\n臺灣野鳥手繪圖鑑 蕭木吉著 2015 行政院農委會林務局。\n寂靜的春天，卡森 (Rachel Carson) 著，李文昭譯。\n公園生態化倡議 - 荒野保護協會 https://www.sow.org.tw/blog/129/20170523/5461。",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若因應疫情改線上課程，將以 email 通知學生上北科 i 學園觀看預錄課程，並加入 Line 群組即時討論內容。</div>"
  }
]
