[
  {
    "name": "耿慶瑞",
    "email": "cjkeng@ntut.edu.tw",
    "latestUpdate": "2022-02-14 16:20:39",
    "objective": "讓學生瞭解製造業與服務業行銷的觀念和趨勢。主要包括以下課題：（1）消費者行為（2）市場區隔（3）產品策略（4）行銷通路（5）網路行銷（6）促銷（7）關係行銷。",
    "schedule": "次 (日期)　　主題　　內容與個案\n 13\n　　消費者行為 (講義，與客戶互動 VCD)　　消費者行為概論投影片\n消費者決策過程\n \n \n14　　行銷個案：行銷產品策略定位\n 　　哈佛商學院 HBS Case1: IKEA (宜家侵入美國 514-C07 中文版)\n1. 請分析採購家俱的消費者行為，通常消費者會有哪些困難？\n2. 家俱業者提供哪些服務來解決困難？\n3. 分析美國的家俱市場\n4.IKEA 提供給消費者什麼價值？商業模式為何？\n5.IKEA 如何在美國拓展市場？\n \n15\n　　行銷個案：廣告策略\n 　　哈佛商學院 HBS Case2 : 2010 Cola Wars Continue: Coke and Pepsi in the Twenty- First Century ( 2010 年可樂大戰之續 714- C04 中文版)\n 1: 請以五力分析罐裝廠以及濃縮液廠\n2: 請分析 Coke 與 Pepsi 在行銷策略上的差異\n3: 請說明非碳酸飲料崛起之後，Coke 與 Pepsi 的因應策略\n \n \n16　　行銷個案：品牌行銷與口碑行銷  　　哈佛商學院 HBS:Case3  Dove（多芬：一個品牌的發展歷程 514-C03 中文版）\n1. What is a brand? Why does Unilever to want fewer of them?\n2. What was Dove’s market positioning in the 1950s? What is its positioning in 2007?\n3. How did Unilever organize to do product category management and brand management in Unilever before 2000? What was the corresponding structure after 2000? How was brand meaning controlled before 2000 and how is it controlled at the time of the case?\n4. Spend a little time searching blogs, using Google Blog Search, Technorati, BlogRunner, or any other blog search engines, to get a sense of what people are saying about Dove today. What does this discussion contribute to the meaning of the brand?\n \n17　　行銷個案： 消費者行為與大數據　　補充網路行銷\n哈佛商學院 HBS: Case4: Predict Customer Tastes with Big Data at GAP（9-517-115）\n1. Why is Gap doing poorly in 2017? \n2. Was Peck correct in firing his creative directors and replacing them with a big data-driven creative process? Why or why not? \n3. What do you predict will happen to Gap Inc.’s sales going forward as a result of this decision? How will it affect each of its brands’ equity?  \n 4. Does the big data approach work for all three of Gap Inc.’s primary brands: Old Navy, Gap, and Banana Republic? Why or why not? Which brands are better/worse served by this strategy? Why？\n18　　行銷個案：\n　　哈佛商學院 HBS Case5: ASICS\n1. The company is considering changes to the marketing mix of the core ASICS brand. What would you recommend going forward on issues such as:\n i. Product line (e.g., introducing mid-tier ASICS running shoes at a much lower price point) \nii. Channels to market (e.g., increasing company owned retail stores) iii. Communications (e.g., changing the current ad campaign of “Want it More” and discontinuing sponsorship of the NYC marathon)\n2. Was it wise for ASICS to acquire the fitness app RunKeeper? How can the company best leverage this new digital asset? \n3. Do you feel the company is on the right track to achieving its 2020 goals?",
    "scorePolicy": "個案每人要寫一頁 A4 心得 (針對問題回答): 請在學期結束前時交給助教，任選 3 個個案",
    "materials": "參考書:\n行銷學 (第二版)\n \n・　　作者：  耿慶瑞，陳銘慧，蔡瑤昇，江啟先，廖森貴，胡同來，田寒光，謝效昭  \n・　　出版社：全華圖書  訂閱出版社新書快訊 新功能介紹\n・　　出版日期：2018/06/15\n・　　語言：繁體中文 \n・　　定價：580 元\n・　　優惠價：95 折 551 元",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1. 請與授課老師耿慶瑞聯絡 cjkeng@ntut.edu.tw\n2. 若因疫情需要遠距上課：遠距網址為:https://moe-tw.webex.com/meet/cjkeng\n3. 課程 line 群組會公告在本課程之 i 學園。</div>"
  },
  {
    "name": "劉祐綸",
    "email": "y.l.liu@ntut.edu.tw",
    "latestUpdate": "2022-01-24 08:04:24",
    "objective": "本課程適合一般大專基本行銷管理原則之授課。其目的在尋求優良的產品行銷管理方法，以求企業之良好利潤。本課程授課內容在使學生瞭解行銷管理之觀念，產品設計、產品運銷、促銷及訂價。相關之授課內容包括：市場區隔、市場組織、購買行為、產品開發、零售、批發、促銷、廣告及訂價程序等。\n\nThis marketing course is suitable to college student. The purpose is to find good method of product marketing, in order to pursuit good profit of enterprise. The course contents' goal makes student understand the idea of marketing, product design, product transportation, promotion and price setting. The related course includes: market segmentation, market organisation, the behaviour of buying, product development, retailing, whole-selling promotion, advertising and price setting process.",
    "schedule": "Week 01: 導論 – 認識行銷\nWeek 02: 關係行銷\nWeek 03: 市場調查\nWeek 04: 消費行為\nWeek 05: 制定以顧客為導向的行銷策略\nWeek 06: 市場區隔與定位\nWeek 07: 行銷組合方案建構\nWeek 08: 服務行銷策略\nWeek 09: 期中考週\nWeek 10: 價格策略\nWeek 11: 通路策略\nWeek 12: 推廣策略與整合行銷溝通\nWeek 13: 行銷溝通組合方案\nWeek 14: 公關、人員銷售與直效行銷策略\nWeek 15: 數位行銷策略\nWeek 16: 創新管理\nWeek 17: 考前複習\nWeek 18: 期末考週",
    "scorePolicy": "書面報告 (50%)\n課堂個案解析 (50%)",
    "materials": "行銷管理概論（二版）蕭富峰著　智勝出版",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 若因疫情影響而需線上上課，課程 Google Meet 連結如下：\nhttps://meet.google.com/vac-svat-kkj\n\n聯絡電子郵件信箱：y.l.liu@ntut.edu.tw</div>"
  }
]
