[
  {
    "name": "李傑清",
    "email": "lee123@ntut.edu.tw",
    "latestUpdate": "2022-01-07 00:21:48",
    "objective": "本課程從中美貿易戰美方指控中國竊取營業秘密及強制技術移轉談起，再以我國營業秘密法與公平交易法之立法目的、沿革及發展趨勢為出發點，探討此二法律在規範對象、方法及競合等之差異；除重視營業秘密法與公平交易法之基礎內涵外，將以國際比較法的視野，論述二法律與智權行使密切相關的課題，並輔以專題探討或案例分析的方式進行之。",
    "schedule": "第 1 週：介紹授課理念、課程綱要、上課方式與評分標準，並依多數同學需求進行調整 --- 從中美貿易戰美方指控中國竊取營業秘密及強制技術移轉談起\n第 2 週：營業秘密法與公平交易法的立法目的、沿革及發展趨勢。\n第 3 週：營業秘密法的法理基礎。\n第 4 週：營業秘密的標的、歸屬與應用。\n第 5 週：營業秘密的侵害、保全程序、救濟與保護（秘密保持命令）。\n第 6 週：營業秘密與競業禁止（台積電跳巢案、美光科技挖角案）。\n第 7 週：侵害營業秘密之刑事處罰（穩懋半導體公司營秘遭竊案、英業達公司營秘案、美光控訴聯電及中國晉華竊取半導體 DRAM 營秘案）。\n第 8 週：侵害營業秘密之損害賠償（先進光賠償大立光 15.22 億元案）。\n第 8 週：侵害營業秘密案件的審理與秘密保持命令。\n第 9 週：公平交易法與智慧財產權法規範的對象、方法及競合。\n第 10 週：公平交易法對獨占、結合及聯合行為之規範。\n第 11 週：公平交易法對不公平競爭行為之規範。\n第 12 週：違反公平交易法之民事、刑事及行政責任。\n第 13 週：公平交易法與專利 (授) 權之行使（警告函、高通案）。\n第 14 週：公平交易法與專利 (授) 權之行使（標準必要專利 (SEP)、公平及合理非歧視條款 (FRAND)）。\n第 15 週：公平交易法與商標權之行使（攀附著名商標、仿冒商標〈表徵〉）。 \n第 16 週：公平交易法與著作權之行使（電視節目版式、AI 創作及 AI + 大數據）。 \n第 17 週：兩岸公平交易法與營業秘密之保護 (1)。\n第 18 週：美、日、德公平交易法與營業秘密之保護 (2)。\n\n※ 實際授課內容將依同學之興趣、程度，擇要或增修主題後進行之。\n\n※ 本課程重視問題意識之引導及積極參與式的學習，2/3 以上的主題將以案例探討或業師協同教學方式授課。",
    "scorePolicy": "平時成績 (含出席率、提問及參與報告、討論之綜合表現) 50％、期末報告 50％\n\n※ 實際評分標準將於首次授課時與選課同學共同協商、確認之。\n\n※ 期待智財所的修課者上課前至少已研讀過任何營秘法或公平法的專書各 1 本 (可參考下列書目) 或有興趣的專論數篇。",
    "materials": "1. 林洲富，營業秘密與競業禁止案例式，3 版，五南，2018 年 8 月。\n2. 王偉霖，營業秘密法：理論與實務，3 版，元照 ，2020 年 5 月。\n3. 曾勝珍，智慧財產權法專論：透視營業秘密與競業禁止，五南，2017 年 3 月。\n4. 池泰毅、崔積耀、洪佩君、張惇嘉（璞實法律事務所），營業秘密：實務運用與訴訟攻防，元照，2017 年 3 月。\n5. 張志朋、林佳瑩，營業秘密訴訟贏的策略，元照，2017 年 1 月。\n6. 曾勝珍，案例式營業秘密法，新學林，2016 年 7 月。\n7. 劉江彬、陳桂，中國大陸營業秘密保護機制及執法研究：實務觀點，華泰文化，2014 年 12 月。\n8. 張靜，營業秘密法及相關智慧財產問題，經濟部智慧局，2014 年 2 月。\n9. 林洲富，公平交易法：案例式，五南，2020 年 7 月。\n10. 林佳瑩，不公平競爭訴訟贏的策略 —— 智慧財產法院判決分析，元照出版，2017 年 2 月。\n11. 廖義男、黃銘傑，競爭法發展之新趨勢：聯合、結合、專利權之行使，元照，2017 年 12 月。\n12. 公平交易委員會，認識公平交易法，公平會，2019 年 8 月。\n13. 廖義男 ，公平交易法之釋論與實務 (第 3 冊)，元照，2017 年 6 月。\n14. 何之邁、張懿云、林廷機、陳志民，公平交易法：司法案例評析，2 版，元照，2016 年 5 月。\n15. 汪渡村，公平交易法，6 版，五南，2015 年 10 月。\n16. 劉孔中，解構智財法及其與競爭法的衝突與調和，新學林，2015 年 6 月。\n17. 適時補充國內、外案例教材及時事課題。",
    "foreignLanguageTextbooks": false
  }
]
