[
  {
    "name": "李禮仲",
    "email": "Lawrencelee61@hotmail.com",
    "latestUpdate": "2022-04-04 18:16:24",
    "objective": "新經濟與舊經濟的分野不是在有『e』還是沒有『e』，而是在有『i』還是沒有『i』，而『i』就是『Innovation，創新』。二十一世紀的『腦力經濟』最重要的戲規則就是『智慧財產權』，同時也是 WTO 會員國必須遵守的重要規範之一。課程內容主要包括三個最基本的智慧財產權課題：專利權，商標權，以及著作權；而為配合本校學生學科背景，本課程將較著重於『專利』方面的實務知識，並且講授『如何激發創意，以培養學生日後能好好應用『智慧財產權』的保護。\nThe difference between New-economy and Old-economy is not caused by having \"e\" or not having \"e\", but caused by owining \"i\" or not owning \"i\". where \"I\" means \"Innovation:.  Intellectual Property is not only the most importance business rule of the :Brain economy era:, but also one of the most important agreements among WTO members.  This course includes the basic three subjects of Intellectual Property:Patent, Trademark, and Copyright.  In order to accommodate the learning background for most of NTUT students, the contents of this course will focus more on the practical practice of the Patennt.  In addition, it also includes the subject of\"how to activate your creativeness:so as to make students can use what they learn, \"Intellectual Property:, to protect their intellectual work.",
    "schedule": "the schedule may be changed after discussion with students at first class.\n\nweek 1　　Introduction to IP　　\nweek 2　　Patents　　\nweek 3　　Patents　　\nweek 4　　Copyright　　\nweek 5　　Copyright　　 \nweek 6　　Moral Rights/performers rights　　 \nweek  7    Designs　　                                                                                                                       \nweek 8.    Designs and designs copyright overlap　　                                  \nweek 9     Midterm exam　　\nweek 10　　Actions for passing off, misleading and deceptive conduct　　\nweek 11  Trade marks (registered rights)　　\nweek 12　　Confidential information　　\nweek 13. Revision　　\nweek 15  Case presentation \nweek 16  Case presentation \nweek 17  Case presentation \nweek 18  Case presentation",
    "scorePolicy": "1. Class participation and performance 30%\n2. Panel discussion 30% and      \n3. case presentation 40%",
    "materials": "Electronic Resource Guide:\nJonathan Franklin, International Intellectual Property Law",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If students are unable to attend classes and exams at the school due to the pandemic alert, students will use individual or group online reports instead\n\n\nGoogle \nmeet.google.com/vho-uszo-gjq</div>"
  }
]
