[
  {
    "name": "張勻翔",
    "email": "iiergon@hotmail.com",
    "latestUpdate": "2022-01-26 11:53:47",
    "objective": "　　人生是一連串的選擇﹐並且為這些選擇承擔伴隨而來的結果。這些選擇容或有大小之分﹐或輕重程度之不同﹐但是我們都希望在經過理性的思考之後﹐我們能夠做出正確的選擇﹐迴避掉不好的或錯誤的決定。要達到這個目的﹐很重要的一點便是﹐我們有能力正確地檢視和判斷支援這些選擇的理由﹐看看這些理由是否足以有效地支援這些選擇。學習〝批判性思考〞主要的目的便是幫助我們培養上述這種能力﹐使我們能較好地規劃我們的人生。本課程包括：基本的邏輯推論規則、謬誤理論、真值表、與介於自然與形式語言之間的翻譯等等。\n　　\nLife is constituted of a series of choices and the consequences that follow wherefrom. Although these choices may be different in their magnitude, we all hope to make right choices and avoid bad ones based on our rational thinking. To achieve this goal, we need to be capable of evaluating and judging the reasons behind our choices correctly so as to see whether those reasons can support those choices effectively. The main purpose of studying\"Critical Thinking\" is to help us obtain this kind of ability, so that we will be able to arrange our life. This course covers at least the following topics: basic logical rules, the fallacy theory, the truth table, and the translation between natural and formal language, etc",
    "schedule": "第一周　　課程準備及「批判性思考」簡述\n第二周　　蘇格拉底之死\n第三周　　蘇格拉底反拮法文化批判\n第四周　　文化批判\n第五周       文化批判\n第六周       簡單語句與複合語句\n第五周　　真值表\n第六周　　基本的邏輯推論規則\n第七周　　基本的邏輯推論規則\n第八周　　基本的邏輯推論規則\n第九周　　期中考試\n第十周　　定義\n第十一周　定義\n第十二周　謬誤理論\n第十三周　謬誤理論\n第十四周　謬誤理論\n第十五周　謬誤理論\n第十六周　其他的思維方法\n第十七周　期末報告\n第十八周　期末報告",
    "scorePolicy": "出缺席以及上課表現 20%\n小組討論 40%\n期中考試 20%\n期末報告 20%",
    "materials": "《批判性思考：跳脫慣性的思考模式》，譯者：鄭淑芬，臺北：深思，2007\n曾漢塘，《趣味邏輯》，空中大學，2009。",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >1、若因疫情無法進行實體授課，課程將改成遠距形式。\n2、期中考若為線上授課，期中考試將取消，改以回答問題的形式。同學應在期限內回答完問題，上傳「i 學園」。\n3、期末報告若為線上授課，則改成「線上模式」進行，辦法會提前公告。\n4、遠距上課時段：不變。\n5、方式：同步（googlemeet）+ 非同步（教室網址會公告於群組）。\n6、課程訊息：由 Line 群組進行通知。\n7、「i 學園」公告有群組連結，請自行加入。</div>"
  }
]
