[
  {
    "name": "鄭以旋",
    "email": "gracecheng@mail.ntut.edu.tw",
    "latestUpdate": "2022-02-19 10:28:27",
    "objective": "This course is designed for undergraduate students to develop their academic English language skills in preparation for an all-English learning environment. Students will engage actively in a variety of academic writing and speaking activities. Students will also learn general English syntax and structure of an academic essay as well as strategies for delivering a successful presentation for academic purposes.\n\nAny inquiry please contact Ms. Chen (chihhsuanchen@mail.ntut.edu.tw) or Ms. Huang (yushanhuang@mail.ntut.edu.tw) at the Media Center.",
    "schedule": "Week 1　　No class\nWeek 2　　Admission interviews\nWeek 3　　Class\nWeek 4　　Class\nWeek 5　　Class\nWeek 6　　Class\nWeek 7　　Holiday \nWeek 8　　Class　　\nWeek 9　　Class\nWeek 10　　Writing test (tentative)\nWeek 11　　Speaking test (tentative)\nWeek 12 　　May 15 GEPT speaking and writing test (tentative)\n　　　　Class\nWeek 13　　Class\nWeek 14　　No Class. Writing assignment due (tentative)\n\n*There may be one or more supplementary class in week 9, 10, 11 and/or 12.",
    "scorePolicy": "I. 　　30% 　　Writing\nII.　　30% 　　Speaking\nIII.　　40% 　　GEPT Speaking and Writing Upper-Intermediate Test (tentatively scheduled on May 15)\n\n•　　Any act of plagiarism will result in a grade of zero for this course. At the lecturer’s sole discretion, an act of plagiarism may be reported to the university as misconduct.",
    "materials": "Great Writing, National Geographic Learning, Book 4",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >Prerequisite to take the course: CEFR B1 or equivalent.\n\nIf the classes are conducted online, please use the following link to access the virtual classroom: https://meet.google.com/okv-wpxs-iiu.</div>"
  }
]
