[
  {
    "name": "鄭又平",
    "email": "youpingcheng@gmail.com",
    "latestUpdate": "2022-01-25 15:21:16",
    "objective": "本課程由全球化框架來檢視兩岸關係的演進、現況、及發展趨勢。\n由政治、經濟、乃至社會心理層面分析海峽兩岸錯綜複雜的互動關係。\n並檢視國際政治經濟體系中，美國與日本兩大國對兩岸關係的影響。\nThis introductory course on the complex cross-strait interactions will examine\nTaiwan’s role in the intricate web of international power politics; as well as the structure of hegemonic power rivalry, particularly Sino-US-Japan triangle, and its impact on cross strait relations. The material will cover the evolution, status quo, and developmental path of the cross strait relations in a global framework.",
    "schedule": "課程進度：\n一　　課程總論：兩岸關係的現實和國際政治的關鍵要素\n二　　大國政治的悲劇：美國的戰略布局與修昔底德陷阱\n三　　中美博弈：科技與貿易角力\n四　　中美博弈：軍備競賽、島鏈之爭\n五　　國際政治的現實：中美霸權如何相互抗衡？\n六　　國際政治的現實：世界亞洲化趨勢\n七　　國際政治的現實：國際供應鏈的移轉可能嗎？\n八　　區域經濟整合趨勢下的台灣\n九　　期中考週\n十　　以全球視野揭露中國戰略佈局\n十一　　高度發展的中國經濟與軍事：從粵港澳大灣區到北斗系統\n十二　　兩岸關係的本質：一張圖道盡兩岸現實\n十三　　兩岸經貿、產業關係與全球化：依賴？競爭？脫鉤？剝削？雙贏？\n十四　　兩岸關係與台灣政黨政治、民意趨勢、認同政治\n十五　　端午放假\n十六　　中美台三角戰略互動：棋手與棋子的視角\n十七　　結論：國際政經舞台上，台灣命運劇本結局何去何從？ \n十八　　期末考週",
    "scorePolicy": "評量標準：\n課堂討論參與\n出席\n報告",
    "materials": "1. Elizabeth C. Economy，習近平與新中國：中國第三次革命的機會與挑戰 The Third Revolution Xi Jinping and the New Chinese State（台北：天下文化，2019）\n2. Andrew J. Nathan（黎安友）、Andrew Scobell，沒有安全感的強國 China’s Search for Security（新北：左岸，2018）\n3. Graham Allison，注定一戰？中美能否避修昔底德陷阱 DESTINED FOR WAR： Can America and China Escape Thucydides’ Trap?（台北：八旗文化，2018）\n4. Peter Navaro，美、中開戰的起點 Crouching Tiger: What China’s Militarism Means for the World (台北：光現，2017)\n5. Tom Miller (唐米樂)，中國的亞洲夢：一帶一路全面解讀，對台灣、全球將帶來什麼威脅和挑戰 China’s Asian Dream (台北：時報出版，2017)\n6. 易思安，中共攻台大解密 The Chinese Invasion Threat: Taiwan’s Defense and American Strategy in Asia（台北：遠流，2017）\n7. John Mearsheimer，大國政治的悲劇 The Tragedy of Great Power Politics（台北：麥田，2014）",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div > 因應疫情調整上課方式，將使用 Google Meet 遠距同步上課，課程網址：https://meet.google.com/gru-cwnf-hzb</div>"
  }
]
