[
  {
    "name": "蒲鶴章",
    "email": "johnnypu1@gmail.com",
    "latestUpdate": "2022-02-19 14:07:05",
    "objective": "本課程為本校「智慧鐵道學程」的選修課程。本課程開授之目標，是希望修課學生能夠瞭解現今整個鐵道通訊及資訊系統與行控中心的架構、配置、功能及目標。前瞻資通訊技術（Information and Communication Technology, ICT）的發展與創新應用，將定義了整個鐵道產業的未來。由於鐵道通訊及資訊系統本身屬於跨管理、通訊與資訊等專業領域的技術，因此，本課程是針對選讀學程之學生，邀請鐵道通訊及資訊技術應用專家，以業師的身份共同參與授課。 本課程會要求修課同學於期末報告時，針對管理、通訊及資訊三部分提出通訊系統與行控中心之創新想法規劃與評估報告，並邀請學者與產業專家共同擔任評審及評比分數。\nThis course is the elective subject of Intelligent Railway Curriculum. The main purpose of this course is to provide the students an overall understanding of the structure, configuration, function, and the objective of the domestic railway industry and operation control center (OCC). The course will be composed with advanced development and innovative application of Information and Communication Technology (ICT), and will dictate the future of railway industry. ICT of railway industry is interdisciplinary which involves management, communication, and information, etc. This intercollegiate course will invite industrial instructors, i.e. ICT experts from some relevant fields in intelligent railway industry to our course. In the final project and report, students are required to plan and assess the communication system and OCC focused on advanced management, communication, and information, and evaluated by qualified experts.",
    "schedule": "W1 課程介紹與學習方向說明\nW2 數位無線通訊發展與原理概論\nW3 資通訊 (ITC) 改論與應用\nW4 雲端通訊平台架構\nW5 電話、無線電、廣播系統、標準時鐘、不斷電系統\nW6 自動收費系統 (一) \nW7 列車控制與監視系統 (TCMS)\nW8 鐵道或捷運公司參訪\nW9 期中考週\nW10 智慧型系統概論\nW11 智慧型系統於鐵道業的應用與實務\nW12 閉路電視 (CCTV)，網路影像系統。\nW13 車載通訊系統\nW14 旅客資訊系統 (PIDS)\nW15 自動收費系統 (二) 多元支付技術\nW16 現代鐵道資通訊與智慧化發展趨勢\nW17 台北捷運維修機場參訪\nW18 期末考週",
    "scorePolicy": "本課程住要針對即將畢業的學生，其在學理上有一定基礎，並重點培養學生系統性的思維，跳脫單一專業領域並具備異質系統整合的能力，且能應用現代資通訊技術來發展鐵道領域的維修與運務的創新服務。",
    "materials": "依據業師教材",
    "foreignLanguageTextbooks": false,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div ></div>"
  }
]
