[
  {
    "name": "陳儀",
    "email": "",
    "latestUpdate": "2022-02-21 09:52:27",
    "objective": "Course description: This course is intended as an introduction to some of the key concepts and ideas in Chinese Philosophy. Through reading of some of the most influential texts of main thinkers, students will develop a general understanding of Chinese philosophy and how these may relate to contemporary life. This course will not assume any previous knowledge in the area. All reading and discussions are in English.\nRequirements: The course is conducted in English and demands active participation. Students are expected to contribute actively to class meetings by posing questions and by responding to the questions and comments of other students based on the material in lectures and readings. Students are asked to establish small groups and to conduct analysis on related project and give an oral presentations before the final exam.\n（全英語授課）",
    "schedule": "Week 1  Course Introduction: The Spirit of Chinese Philosophy\nWeek 2  Confucius\nWeek 3  Confucius\nWeek 4  Mencius\nWeek 5  Mencius\nWeek 6  Xunzi\nWeek 7  Tomb Sweeping Day\nWeek 8  Mozi\nWeek 9  Group Meeting (Students need to set work schedule and management plan for an oral presentations of group projects.)\nWeek 10  The logicians\nWeek 11  Laozi and Zhuangzi\nWeek 12  Neo-Taoism\nWeek 13  The revival of Confucianism\nWeek 14  The Neo-Confucianism\nWeek 15  The Neo-Confucianism\nWeek 16  Presentations of Group Projects\nWeek 17  Presentations of Group Projects\nWeek 18  Final examination",
    "scorePolicy": "Class Participation: 40%\nGroup Assignments (oral presentation and PowerPoint slides): 40%\nFinal Exam: 20%",
    "materials": "JeeLoo Liu (2006). An Introduction to Chinese Philosophy: From Ancient Philosophy to Chinese Buddhism, Blackwell Publishing\nLily Zhang (2011). Thirty Chapters on the History of Chinese Philosophy, Le Jin Books.\nWing-Tsit Chan (1973). A Source Book in Chinese Philosophy, 4th Printing, Princeton University.\nI will be selecting some of the primary literatures in Chinese Philosophy as a self-made teaching material. Translations of some of the texts can also be found online on the Chinese Text Project: https://ctext.org/",
    "foreignLanguageTextbooks": true,
    "remarks": "\n       本學期原則採實體授課方式；<b > 因應疫情警戒標準，本學期教學及授課方式請依照學校網頁所公布之訊息為準：\n\n      (<a href=\"https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw\" target=\"_blank\">https://oaa.ntut.edu.tw/p/404-1008-98622.php?Lang=zh-tw</a>)\n\n\n      <div >If it is necessary to adopt online teaching, we will use Google meet.\nThe detail information can be found on i-school plus.\nContact information: yioocat@yahoo.com.tw</div>"
  }
]
