[{"name":"宋立垚","email":"lysong@ntut.edu.tw","latestUpdate":"2019-12-20 12:45:39","objective":"本課程主要在探討敷地計畫的規劃及設計技術如何應用於實際的操作層面。以敷地計畫的基本內容為單元，介紹各種實際案例並分析其特點。學生透過課堂的討論及實地的調查、分析，來瞭解敷地計畫的實際工作內容並研習各種課題的對策、解決方法，使其具備更豐富的專業知識應用於建築設計的相關領域。","schedule":"第一週　　課程簡介\n第二週　　綠建築\n第三週　　山坡地規劃與設計\n第四週　　案例一：校園規劃\n第五週　　戶外無障礙空間設計(一)\n第六週　　戶外無障礙空間設計(二)\n第七週　　建築入口環境設計\n第八週　　生態工法\n第九週　　期中作業報告\n第十週　　案例二：集合住宅\n第十一週　校外參觀(一)\n第十二週　社區規劃與設計\n第十三週　舖面設計\n第十四週　環境影響評估\n第十五週　案例三：公園規劃與設計\n第十六週　校外參觀(二)\n第十七週　期末作業報告(一)\n第十八週　期末作業報告(二)","scorePolicy":"平時成績(作業、出席率)　50%\n期中報告　25%\n期末報告　25%","materials":"(1)黃世孟 主編，基地規劃導論，台北：中華民國建築學會，民國84年。\n(2)台灣建築報導雜誌社 編，永續綠建築，台北：台灣建築報導雜誌社，2002。\n(3)陳政雄，山坡地計畫，台北：博遠，民國83年。\n(4)彭一剛，建築空間組合論，台北：地景，1990。\n(5)陳淑珍 譯，環境規劃與基地開發—地方性永續規劃設計手冊，台北：六合，2002。\n(6)行政院公共工程委員會 編，生態工法博覽會成果報告，台北：行政院公共工程委員會，2004。\n(7)行政院公共工程委員會 編，2004生態工法案例編選集，台北：行政院公共工程委員會，2004。\n(8)薛健，國外建築入口環境，天津：天津大學出版社，2002。\n(9)梁振學 編著，建築入口型態與設計，天津：天津大學出版社，2002。\n(10)丁成章 編著，無障礙住區與住所設計：設計師和建築師輔助手冊，北京：機械工業出版社，2004。\n(11)劉可泰 編譯，坡地規劃與設計概論，台北：茂榮，民國82年。\n(12)崔征國 譯，圖解都市景觀，台北：詹氏，民國80年。\n(13)胡太山、李少甫 譯，基地規劃與社區設計，新竹：建都文化，民國89年。\n(14)胡佳 主編，居住小區景觀設計，北京：機械工業出版社，2007。\n(15)丁榮生 等編，台灣的學校建築＜中小學幼稚園篇＞，台北：中華民國建築師公會全國聯合會出版社，民國86年。\n(16)林惠文 等編，台灣的學校建築(1981—1991)，台北：中華民國建築師公會全國聯合會出版社，民國82年。\n(17)韓國產業文化出版社 編，教育設施建築，長春：吉林科學技術出版社，2002。\n(18)[日]住宅.都市整治公團關西分社集合住宅區研究會 編著，張桂林、張軍英 譯，最新住區設計，北京：中國建築工業出版社，2005。\n(19)劉宗群、黎明 編著，綠色住宅綠化環境技術，北京：化學工業出版社，2007。\n(20)方咸孚、李海濤 編著，居住區的綠化模式，天津：天津大學出版社，2001。\n(21)李宇宏 譯，簡明場地設計，北京：中國電力出版社，2006。","foreignLanguageTextbooks":false},{"name":"蘇瑛敏","email":"ymsu@ntut.edu.tw","latestUpdate":"2020-06-12 18:19:40","objective":"本課程是敷地計畫學的延續，授課目標在培養學生對於建築基地的實務規劃與設計能力。授課內容著重敷地計畫學所探討的理論及技術如何應用於實際的操作層面。以校外專家配合教學，介紹各種實際案例並分析其優缺點。學生透過課堂的討論及實地的調查、分析及校外的參訪，來瞭解敷地計畫的所涵蓋的重點實務工作，進而研習各項課題的解決對策與方法，使其具備建築相關業界所需的專業知識及技能。\nThe course is to explore the practical skills on site planning and design techniques. Teaching materials cover the basic components and their various applications of the site planning. Professional experts are invited to join the training program. Both advantages and disadvantages of each case are introduced and analyzed. Through class discussions and field studies, students can recognize the actual contents and issues during the site planning and design process. Strategies and solutions to the planning and design problems will be facilitated to help students to get the better professional abilities to qualify related architectural design works’ needs.","schedule":"1-9周書籍閱讀\n10-18周案例研討","scorePolicy":"作業70%+上課出席*30%","materials":"國內外期刊","foreignLanguageTextbooks":true}]
