[{"name":"李達生","email":"f11167@ntut.edu.tw","latestUpdate":"2019-12-17 07:03:03","objective":"控制理論講授古典控制理論，並以線性代數為基礎教導現代控制設計，以實例教學說明模糊控制設計、數控系統設計，並介紹近年來重要人工智慧技術發展應用與冷凍空調控制。","schedule":"1　　課程綱要簡介\n2　　古典控制理論\n3      PID controller\n4      線性代數基礎\n5　　自動控制系統狀態空間\n6　　狀態空間設計\n7　　近代控制理論\n8      觀測器設計\n9　　電腦模擬應用於近代控制系統設計\n10　　期中考\n11    強健控制理論\n12　　強健控制系統設計實例\n13　　模糊控制理論\n14    模糊控制系統設計實例\n15　　數位控制理論\n16    數位控制系統設計實例\n17　　人工智慧介紹\n18    人工智慧控制系統設計實例\n19　　期末考","scorePolicy":"期中考     30%\n期末考     30%\n作業         30%\n課堂表現 10%","materials":"自編講義\nAbbas, S.R., Arif, M., 2006. Electric load forecasting using support vector machines optimized by genetic algorithm, in: 10th IEEE International Multitopic Conference 2006, INMIC. pp. 395–399. https://doi.org/10.1109/INMIC.2006.358199\nAhmed, A., Korres, N.E., Ploennigs, J., Elhadi, H., Menzel, K., 2011. Mining building performance data for energy-efficient operation. Adv. Eng. Informatics 25, 341–354. https://doi.org/10.1016/j.aei.2010.10.002\nAki, H., Wakui, T., Yokoyama, R., 2016. Development of a domestic hot water demand prediction model based on a bottom-up approach for residential energy management systems. Appl. Therm. Eng. 108, 697–708. https://doi.org/10.1016/j.applthermaleng.2016.07.094\nAmjady, N., Hemmati, M., 2006. Energy price forecasting: Problems and proposals for such predictions. IEEE Power Energy Mag. 4, 20–29. https://doi.org/10.1109/MPAE.2006.1597990\nAndre, P., Nicolas, J., 2001. OPTIMAL HEATING CONTROL IN A PASSIVE SOLAR COMMERCIAL BUILDING 69, 103–116.\nArabali, A., Ghofrani, M., Etezadi-Amoli, M., Fadali, M.S., Baghzouz, Y., 2013. Genetic-algorithm-based optimization approach for energy management. IEEE Trans. Power Deliv. 28, 162–170. https://doi.org/10.1109/TPWRD.2012.2219598\nAzadeh, A., Saberi, M., Seraj, O., 2010. An integrated fuzzy regression algorithm for energy consumption estimation with non-stationary data: A case study of Iran. Energy 35, 2351–2366. https://doi.org/10.1016/j.energy.2009.12.023\nBann, J.J., Irisarri, G.D., Mokhtari, S., Transmission, S.P., Kirschen, D.S., Applications, A.I., The, I., n.d. Integrating AI Applications in an Energy Management System 53–59.\nBrøgger, M., Wittchen, K.B., 2018. Estimating the energy-saving potential in national building stocks – A methodology review. Renew. Sustain. Energy Rev. 82, 1489–1496. https://doi.org/10.1016/j.rser.2017.05.239\nByun, J., Hong, I., Park, S., 2012a. Intelligent cloud home energy management system using household appliance priority based scheduling based on prediction of renewable energy capability. IEEE Trans. Consum. Electron. 58, 1194–1201. https://doi.org/10.1109/TCE.2012.6414985\nByun, J., Kim, Y., Hwang, Z., Park, S., 2012b. An intelligent cloud-based energy management system using machine to machine communications in future energy environments. Dig. Tech. Pap. - IEEE Int. Conf. Consum. Electron. 664–665. https://doi.org/10.1109/ICCE.2012.6162018\nCai, H., Huang, J.H., Xie, Z.J., Littler, T., 2015. Modelling the benefits of smart energy scheduling in micro-grids, in: IEEE Power and Energy Society General Meeting. pp. 1–5. https://doi.org/10.1109/PESGM.2015.7285596\nCatalina, T., Virgone, J., Blanco, E., 2008. Development and validation of regression models to predict monthly heating demand for residential buildings. Energy Build. 40, 1825–1832. https://doi.org/10.1016/j.enbuild.2008.04.001\nChauhan, A., Saini, R.P., 2014. A review on Integrated Renewable Energy System based power generation for stand-alone applications: Con fi gurations , storage options , sizing methodologies and control. Renew. Sustain. Energy Rev. 38, 99–120. https://doi.org/10.1016/j.rser.2014.05.079\nCheng, C.C., Lee, D., 2019. Artificial intelligence-assisted heating ventilation and air conditioning control and the unmet demand for sensors: Part 1. problem formulation and the hypothesis. Sensors (Switzerland) 19. https://doi.org/10.3390/s19051131\nChou, J.S., Bui, D.K., 2014. Modeling heating and cooling loads by artificial intelligence for energy-efficient building design. Energy Build. 82, 437–446. https://doi.org/10.1016/j.enbuild.2014.07.036\nCiabattoni, L., Ippoliti, G., Benini, A., Longhi, S., Pirro, M., 2013. Design of a home energy management system by online neural networks, in: IFAC Proceedings Volumes (IFAC-PapersOnline). IFAC, pp. 677–682. https://doi.org/10.3182/20130703-3-FR-4038.00111\nClark, G., Mehta, P., 1997. Artificial intelligence and networking in integrated building management systems. Autom. Constr. 6, 481–498. https://doi.org/10.1016/S0926-5805(97)0002","foreignLanguageTextbooks":false}]
