[{"name":"朴維鎮","email":"eugenepark993@gmail.com","latestUpdate":"2019-12-24 12:39:41","objective":"‘Statistics’ is the art of using data to make appropriate (sometimes, best!) conjectures about problems encountered. This course is a calculus-based introduction to statistics, and so designed to help students learn the introductory descriptive and inferential statistical procedures that are used in diverse areas. Mainly, this course deals with the basic concepts of statistical inference and linear models. After a review of descriptive statistics and some necessary probability distributions, interval and point estimation, hypothesis tests, linear regression analysis, and ANOVA are illustrated and accompanied by practical/theoretical exercises. The objective of this course is to introduce students to core ideas of probability and statistics, and also to provide an understanding on statistical concepts to include measurements of location and dispersion, probability, probability distributions, sampling, estimation, hypothesis testing, correlation analysis, simple and multiple linear regression, factorial designs, and RSM. Consequently, these skills will provide the student with a basis to conduct their own such analyzes and to evaluate critically others’ uses of statistics.","schedule":"Week 1　　Introduction to probability distribution, sampling distribution, and estimation\nWeek 2　　Decision making for a single sample – Estimation, hypothesis testing, inference on the mean of a population\nWeek 3　　Decision making for a single sample – Inference on the variance of a normal population, inference on a population proportion, goodness of fit test\nWeek 4　　Decision making for two samples – Inference on the means of two populations, paired t-test\nWeek 5　　Decision making for two samples – Inference on the ratio of variances of two normal populations, inference on two population proportions\nWeek 6　　Simple linear regression – Part I\nWeek 7　　Simple linear regression – Part II\nWeek 8　　Other aspects of simple linear regression\nWeek 9　　Midterm exam (In-Class, 1 Cheat Sheet, Calculator)\nWeek 10　　Multiple linear regression – Part I\nWeek 11　　Multiple linear regression – Part II\nWeek 12　　Other aspects of multiple linear regression\nWeek 13　　Factorial design, replication, center points – Part I\nWeek 14　　Factorial design, replication, center points – Part II \nWeek 15　　Blocking, confounding, fractional factorial designs X-bar and R control chart\nWeek 16　　Factorial experiments with more than two levels\nWeek 17　　Introduction to control charts\nWeek 18　　Final exam (In-Class, 1 Cheat sheet, Calculator)","scorePolicy":"1. Midterm Exam: 30 % – Test of covered topics\n2. Final Exam: 30 % – Test of covered topics\n3. Quiz: 35 %\n4. Attendance: 5 %","materials":"Engineering Statistics (5th Ed., Wiley) by Montgomery, Runger, and Hubele (ISBN: 978-0-324-59433-1)","foreignLanguageTextbooks":true}]
