[{"name":"吳南葳","email":"nwwu@mail.ntut.edu.tw","latestUpdate":"2020-02-11 21:20:09","objective":"本課程內容分二部分進行授課，第一個部份以小組進行校園建築進行實測後，繪製平、立、剖面圖，以加強學生團隊合作，並透過實際量測與繪製建築平、立、剖面圖，使學生感受實體與練習之關係；由於目前臺灣多以集合住宅建照申請居多，且住宅為空間尺度之根本；因此，第二個部份之課堂操作，依序為浴廁、臥室、廚房、餐廳、客廳單元等不同空間尺度練習後，聚焦於住宅平面圖之練習；接著，透過住宅平面圖之練習，衍伸至立面圖與剖面圖與透視圖練習。課程亦將藉由同學上述二個部分之練習，延續第一學期建築製圖基本常識、觀念與技法之傳授，以確實增進學生建築製圖能力。 本課程符合系教育目標如下： 1. 訓練學生建築設計與工程基礎專業能力； 2. 透過實作方式彙整建築設計與建築構造之技能； 3. 引導建立建築專業道德倫理態度； 4. 整合建築理論與實務提升就業競爭力。\nThis course will need the knowledge from the previous course Architectural Graphics (1) and apply them into graphics; The course have two parts, first part of the course will split the class into small groups ,students will first measuring the school buildings and than draw them into three-dimensional diagrams. Second, lecture the detail graphics of residential building such as the floor plan, bathroom, bedroom, kitchen etc. and more drawing practice on cross section graphics and elevation graphics. During the semester Introduction to graphics will enable the students ready for second semester. After this course the students will acquire the following aspects: 1). Advance knowledge in architectural design and engineering. 2). Practical skill in architectural design and structure. 3). Correct attitude in architectural professions moral. 4). Integrate theory an","schedule":"1.課程介紹/點陣影像編修I\n2.國定假日\n3.點陣影像編修II\n4.向量影像繪製與編修I\n5.向量影像繪製與編修II\n6.排版與輸出I\n7.國定假日\n8.排版與輸出II\n9.期中測驗\n10.Autocad繪圖與輸出I\n11.Autocad繪圖與輸出II\n12.Autocad繪圖與輸出III\n13.Autocad繪圖與輸出IV\n14.電腦模型編修與輸出I\n15.電腦模型編修與輸出II\n16.電腦模型編修與輸出III\n17.電腦模型編修與輸出IV\n18.期末測驗","scorePolicy":"出席 10%\n隨堂作業 40%\n期中測驗 25%\n期末測驗 25%","materials":"Kelby, Scott (2017) The Adobe Photoshop CC Book for Digital Photographers\nWood, Brain (2017) Adobe Illustrator CC Classroom in a Book\nDonley, Matt (2016) Sketchup &amp; Layout for Architecture: The Step by Step Workflow of Nick Sonder \nAouad, Ghassan (2012) Computer Aided Design Guide for Architecture, Engineering and Construction","foreignLanguageTextbooks":true}]
