[{"name":"葉惠蘭","email":"hlyeh@ntut.edu.tw","latestUpdate":"2020-02-28 17:10:18","objective":"國文，是運用本國語言文字，蘊釀於欣賞文藝作品，充實文化內涵，增進思維能力與人文素養的一門課程。\n本課程分為大一上學期2學分，大一下學期2學分。大一上學期的授課內容，以文學名篇為範圍；希望藉此擴建學生深入品味文學趣味的能力，鍛鍊靈活的語文敏感度，默契文學創意，甚而嘗試創作。大一下學期的授課內容，以思想名篇為範圍；希望藉此啟發學生透轍分析各家學說思想，漫步哲人的宇宙天地，跟隨哲人的心路歷程，進而念茲在茲，從容內化，共饗取之不盡用之不竭的先驗與風範。\n\"Chinese\" is the course where we make full use of our native languages to enjoy literary works, to enrich our cultural taste, to develop our thinking and even to elevate human cultivation.\n\nThis four-credit course is set for the freshman students: with 2 credits in each of the two semesters of the school year. In the first semester, the course covers important articles in literature, in the hope for the student learners to cultivate better ability to taste literary works when they have more vivid sense on the language. With fuller knowledge on what literature is about, they are expected to try creative writings. For the second semester, the course is mainly focused on the writings on thoughts. It is our expectation that throughout the reading and analysis of various great schools of philosophy, the student learners are given the opportunity to explore the huge minds of philosophers, who will thus be imitated and followed. Through the internalization, the students might benefit themse","schedule":"課程名稱：大一國文講座\n任課教師：葉惠蘭\n每週時數：二小時\n教 科 書：大學國文選/自行編印講義\n授課方式：1.教師引領文本閱讀及討論\n          2.表達能力訓練，個別講演3分鐘，抽籤分別次第\n題目「我與父母間的相互影響」         \n授課內容：\n (依週次序列 )\n          1. 課程概述/分組次第/講演次第抽籤/書香會考佔比/講義印製\n          2. 中國經典系列─ 三《禮》：規範、秩序與理性生活/發講義\n          3. 中國經典系列─ 三《禮》：規範、秩序與理性生活\n          4. 中國經典系列─ 三《禮》：規範、秩序與理性生活﹝1–4﹞ \n          5. 冠義／昏義／祭義  ●週二國文會考﹝5–8﹞\n          6. 冠義／昏義／祭義﹝9–12﹞\n          7. 冠義／昏義／祭義﹝13–16﹞\n          8. 中國經典系列─《論語》：禮與仁﹝17–20﹞             \n          9. 中國經典系列─《論語》：禮與仁﹝21–24﹞（加課）\n             / 另擇期期中筆試\n         10 . 儒家綜述﹝25–28﹞         \n         11 . 停課一次（因9週加課）\n         12 . 莊子〈養生主〉﹝39–32﹞\n         13 . 莊子〈養生主〉﹝33–36﹞\n         14 . 《老子》選讀﹝37–40﹞\n         15 . 《老子》選讀﹝41–44﹞\n         16. 《老子》選讀﹝45﹞\n         17  道家綜述/《壇經》─中國禪的宣言/課堂小考\n             ●交「儒道濡染自我盤點與權衡」期末書面報告\n              （2人一組/至少盤點家族倫理、個人生涯與價值判斷、政治觀\n                點等三個面向2000–3000字）\n         18 . 成績結算及評量   \n考　　核： \n書香計畫〈10%〉\n個人演講〈20%〉\n期中考（筆試）〈30%〉\n期末小考〈10%〉（暫定）\n期末考核〈30%〉\n參考書籍：葛照光《中國經典十種》\n\n※居家隔離者\n1. 期中報告\n●古典中國何以有「禮儀之邦」的美稱？試就社會禮制結構、政治理想及其與\n  儒家的關係說明之。（1000字以內）30%\n●抒陳「我與父母間的相互影響」（1000字以內）20%\n2. 期末報告\n●「儒道濡染自我盤點與權衡」書面報告\n  （至少盤點家族倫理、個人生涯與價值判斷、政治觀點等三個面向\n     2000–3000字）30%\n●試分別指出莊子〈養生主〉中的四個寓言故事透露何樣的養生旨意？20%\n  \n※期中報告於第10週以前繳交，期末報告於17週以前繳交\n  必署班級、學號、姓名\n  交寄hlyeh@mail.ntut.edu.tw\n※任課教師保有電詢（或視訊）後調整配分的權利","scorePolicy":"考　　核： \n書香計畫〈10%〉\n個人演講〈20%〉\n期中考（筆試）〈30%〉\n期末小考〈10%〉（暫定）\n期末考核〈30%〉\n參考書籍：葛照光《中國經典十種》","materials":"參考書籍：葛照光《中國經典十種》","foreignLanguageTextbooks":false}]
