[{"name":"葉惠蘭","email":"hlyeh@ntut.edu.tw","latestUpdate":"2020-02-28 17:09:44","objective":"國文，是運用本國語言文字，蘊釀於欣賞文藝作品，充實文化內涵，增進思維能力與人文素養的一門課程。\n本課程分為大一上學期2學分，大一下學期2學分。大一上學期的授課內容，以文學名篇為範圍；希望藉此擴建學生深入品味文學趣味的能力，鍛鍊靈活的語文敏感度，默契文學創意，甚而嘗試創作。大一下學期的授課內容，以思想名篇為範圍；希望藉此啟發學生透轍分析各家學說思想，漫步哲人的宇宙天地，跟隨哲人的心路歷程，進而念茲在茲，從容內化，共饗取之不盡用之不竭的先驗與風範。\n\"Chinese\" is the course where we make full use of our native languages to enjoy literary works, to enrich our cultural taste, to develop our thinking and even to elevate human cultivation.\n\nThis four-credit course is set for the freshman students: with 2 credits in each of the two semesters of the school year. In the first semester, the course covers important articles in literature, in the hope for the student learners to cultivate better ability to taste literary works when they have more vivid sense on the language. With fuller knowledge on what literature is about, they are expected to try creative writings. For the second semester, the course is mainly focused on the writings on thoughts. It is our expectation that throughout the reading and analysis of various great schools of philosophy, the student learners are given the opportunity to explore the huge minds of philosophers, who will thus be imitated and followed. Through the internalization, the students might benefit themse","schedule":"大一國文\n      —極短篇小說習作/現代詩朗誦\n1.　　課程概述/考核說明/確認3人一組報告序列\n   「文學」定義/「文學」何用\n2.　　文學創作：關於「語言」/想像與情感（印製講義）\n3.　　文學批評/（發講義）\n4.　　民國代表文類探索：詩的民族/小說發展史略 \n「小說」釋義與要件（報告順序表單完成）\n5. 極短篇類型：定型與不定型/（週二國文會考）\n6. 極短篇類型：定型與不定型\n7. 結構、觀點與轉接 \n8. 關於小說寫作                \n9. 故事意念、故事修改/範例分析      \n10. 談女性書寫\n11. 談女性書寫/中國評點試批評/（123組發書面資料並交個人作業）\n\n●個人作業：羅列已閱讀的極短篇（作者、篇名、出處）15篇/抄寫自己賞\n  愛的現代詩作3首（作者、篇名、出處），並說明賞愛理由  \n\n12. 極短篇寫作暨賞愛誦詩發表開始：1.2.3.組\n  \n   A發下週創作文本暨朗誦的詩作/交下週報告組的個人作業\n   B報告小說創作緣起過程、作品類型、人物、結構（分部/情節階）、使用觀\n     點、旨意及其可能的性別觀點\n   C精選朗誦近現當代中文詩作一首，說明推介賞愛的理由、朗誦聲情表現配\n     置（如高低輕重快慢等）、作者、作品出處\n   D每組20–25分鐘/小說創作、創作介述、誦詩及說明，3人分工並合作\n   E老師講評/每組評選全班1、2名及最後1名，署組別姓名並附上評語  \n\n13. 4.5.6.組\n14. 7.8.9.組\n15. 10.11.12.組\n16. 13.14.15. 組\n17. 16.17.18. 組/交每組對他組的評選\n18. 總評/成績評量\n（書香會考10%/小說寫作及介述40%/誦詩20%/評語10%/個人作業20%）\n\n參考書目\n極短篇美學   弦等  爾雅叢書\n小說的五十堂課  大衛·洛吉 木馬文化\n現代中國詩選I II  楊牧、鄭樹森編  洪範\n一首詩的誕生/一首詩的玩法/一首詩的誘惑  白靈  九歌\n爾雅極短篇 隱地編  爾雅叢書\n日本極短篇小說  柏谷譯  爾雅叢書\n世界名家極短篇三卷  曹又方  圓神\n\n※居家隔離者\n●期中報告：\n1.　　談「文學」的定義/「文學」之於人生，好比甚麼？（共500字以內）10%\n2.　　「文學創作」與「文學批評」最大的不同是甚麼？（300字以內）10%\n3.　　交個人作業\n（A.讀15篇極短篇小說的紀錄/B.抄寫3首個人最賞愛的現代詩作，並說明\n  賞愛緣由）20%\n●期末報告：60%\n  極短篇創作一篇\n  並附說明創作緣起過程、作品類型、人物、結構（分部/情節階）、使用觀\n  點、旨意及其可能的性別觀點\n\n※期中報告於第10週以前繳交，期末報告於17週以前繳交\n  必署班級、學號、姓名\n  交寄hlyeh@mail.ntut.edu.tw\n※任課教師保有電詢（或視訊）後調整配分的權利","scorePolicy":"（書香會考10%/小說寫作及介述40%/誦詩20%/評語10%/個人作業20%）","materials":"參考書目\n極短篇美學   弦等  爾雅叢書\n小說的五十堂課  大衛·洛吉 木馬文化\n現代中國詩選I II  楊牧、鄭樹森編  洪範\n一首詩的誕生/一首詩的玩法/一首詩的誘惑  白靈  九歌\n爾雅極短篇 隱地編  爾雅叢書\n日本極短篇小說  柏谷譯  爾雅叢書\n世界名家極短篇三卷  曹又方  圓神","foreignLanguageTextbooks":false}]
