[{"name":"陳維昌","email":"wcchen@ntut.edu.tw","latestUpdate":"2020-04-01 00:39:34","objective":"正交分頻多工（OFDM）和多輸入多輸出（MIMO）技術是無線和行動通信中相當熱門的傳輸技術。OFDM和MIMO技術具有多種優勢，例如：提高傳輸資料速率和改善接收效能。在課堂上，我們將學習OFDM和MIMO的基本原理和一些進階主題。在學期末時，選修這門課程的學生必須針對OFDM或MIMO相關之主題進行期末專題報告。\n\n本課程為中英雙語課程。\n\nOrthogonal frequency division multiplexing (OFDM) and multiple-input multiple-output (MIMO) techniques are popular transmission techniques for wireless and mobile communications, because they offer several advantages such as increasing transmission data rate and enhancing error performance. In the class, we will learn about the basic principles and some advanced topics of OFDM and MIMO. All students taking this class have to study a special topic on OFDM or MIMO as a final project. Some parts of this course will be offered in English.","schedule":"Week 01. Reviews of probability and random process theories (複習機率與隨機過程)\nWeek 02. Review of detection theory (複習偵測理論)\nWeek 03. Review of estimation theory (複習估計理論)\nWeek 04. Review of channel capacity (複習通道容量)\nWeek 05. OFDM: Signal model, orthogonality and efficient implementation (介紹OFDM訊號模型、正交性與快速實現法)\nWeek 06. OFDM: Equalization for CP-OFDM (介紹CP-OFDM的等化)\nWeek 07. OFDM: Equalization for ZP-OFDM (介紹ZP-OFDM的等化)\nWeek 08. OFDM: Synchronization and channel estimation (介紹OFDM的同步與通道估測)\nWeek 09. Midterm Exam (期中考)\nWeek 10. OFDM: SC-FDE, DFT-S-OFDM, and OFDMA\nWeek 11. OFDM: Power allocation (介紹用於OFDM的功率負載技術)\nWeek 12. OFDM: PAPR problem and PAPR reduction techniques (介紹OFDM的PAPR的問題及解決方案)\nWeek 13. OFDM: Large OOB emission problem and OOB emission reduction techniques (介紹OFDM的帶外能量逸散的問題及解決方案)\nWeek 14. MIMO: Error performance in fading channels, maximal ratio combining, and selection combining.  (衰減通道之BER分析、MRC與SC)\nWeek 15. MIMO: Space-time block code and spatial precoding (空時碼與空間編碼)\nWeek 16. MIMO: Spatial multiplexing and spatial modulation (空間複用與空間調變)\nWeek 17. Final Exam (期末考)\nWeek 18. Student Oral Presentation (學生期末報告)\n\nThe schedule may be adjusted if necessary.","scorePolicy":"Midterm Exam         30%\nFinal Exam           30%\nSpecial Topic Report 40% (20% for Oral Presentation and 20% for Paper Report)\n\n期中考     30%\n期末考     30%\n期末專題   40% (口頭報告 20% + 書面報告 20%)","materials":"References:\n1. Y.-P. Lin, S.-M. Phoong, P. P. Vaidyanathan, Filter Bank Transceivers for OFDM and DMT Systems, Cambridge University Press, 2010. \n2. T. D. Chiueh, P. Y. Tsai, and I. W. Lai, Baseband Receiver Design for Wireless MIMO-OFDM Communications, 2nd ed., Wiley Inc., 2012.\n3. D. Tse and P. Viswanath, Fundamentals of Wireless Communication, Cambridge university press, 2005.","foreignLanguageTextbooks":false}]
