[{"name":"蘇評揮","email":"jphhu@yahoo.com","latestUpdate":"2020-02-22 09:33:21","objective":"Green Vehicle Technology Development and its Industry Engineering Practice Class\n(1)　　Teaching Objective is to educate student to have a general comprehensive knowledge on green vehicle industry status, regulation, policy, powertrain technology and its Industry Engineering Practice including the development and maintenance processes of the powertrain, transmission, energy, control systems, and the industry practice at the product development center or the service station of the car company. \n　　The powertrain system will include the mild-hybrid, full hybrid, pure motor drive, and fuel cell systems. The energy system will include the introduction of the lead acid, nickel-metal hydride, and lithium-ion batteries, and their charging-discharging mechanism and its management devices.\n　　This class will lead the students to be able to learn the process of the green vehicle development and also to have an\nopportunity to receive the lectures from the car maker experts on the car maker product development center or the service station.\nThe class will start from the introduction of the green vehicle industry status, regulation, policy, powertrain technology and then followed by its Industry Engineering Practice on the car maker company. In order to train the student presentation capability, the class will be divided into several teams to present the progress bi-weekly.","schedule":"Overview of world automotive industry; Internet of Vehicle, Green Vehicle Industry, and Business Model Innovation driven of Automotive Mega-Trend, status, and technology development - 3 Weeks\nii.　　From the Intelligent Transportation System (ITS) to Connected Vehicle or Internet of Vehicles including infrastructure, enabling technology, and standards for the better system operation – 3 Weeks \niii.　　Fundamental Technologies on Green Vehicle Powertrain; Mild-Hybrid, Full-Hybrid, Pure Electric, and Fuel-Cell, - 4 Weeks\niv.　　Fundamental Technologies on Green Vehicle Energy System; the introduction of the lead acid, nickel-metal hydride, and lithium-ion batteries, and their charging- discharging mechanism and its management devices -4 Weeks \nv.　　Green Vehicle Key Component Supplier Chain Development, Manufacturing, Quality Assurance-2 Weeks\nvi.　　Green Vehicle Industry Practice on Product Development, and Maintenance Service Practice and Level Certification- 2 Weeks","scorePolicy":"Teaching Methodology and Teaching Activities; Lecture, team presentation, mid-term, and final tests will be covered as:\n1) Bi-weekly presentation 25%,\n2) Mid-Term test and presentation 35%,\n3) Final test and presentation 40%.","materials":"Class notes will be prepared by the professor.","foreignLanguageTextbooks":false}]
