[{"name":"郭五鳳","email":"ckuo66ntut@ntut.edu.tw","latestUpdate":"2019-12-26 16:19:26","objective":"自21世紀的資通訊（ICT)產業的興起，跟隨著物聯網（IoT)和大數據(Big Data)分析與運用時代來臨。我們將共同探討：由產業發展趨勢，產品創新設計與研發，到產業行銷，應用，與管理的關鍵要素，以符合工業4.0趨勢。\nIn the twenty first century, innovation is the key factor which brings profits to our technological stagnation.  However, without the up-to-date knowledge and right strategy with some killer-tactics implemented, the innovation may turn good things up side down. This course, Product Innovation Strategy, is given from a practitioner’s viewpoints on how to deploy the concepts, information, knowledge experiences related to Information Technology (IT), Information and Communication Technology (ICT), Big Data (BDA), Internet of Things (IoT), Virtual Reality (VR), Augmented Reality (AR), and Artificial Intelligence (A.I.). We will study, review, and design new product project to help the students develop capabilities on IT/ICT new product development and project management in order to reach the market trends and demands for the 4th wave of industry (Industry 4.0) era.","schedule":"1 Feb.　　19　　IT, ICT, IoT, AI, Big Data, IoT, AR, VR, Industry 4.0\n2　　　　　26　　Industry 4.0-Innovation Strategy\n3 March　　04　　Business Network Development Ecosystem\n　　　　　　\n4　　　　　11　　Value Chain Cooperation for PIS\n5　　　　　18　　New Product Project Development\n6　　　　　25　　PIS on People/Process/Profits\n7 April　　01　　Firm’s (Team’s) Core Competences\n8　　　　　08　　Industry Case Study\n9　　　　　15　　Group Project Presentation\n10　　　　　22　　Firm’s (Team’s) Core Competences\n11　　　　　29　　Industry Case Study\n12 May　06　　Ubiquitous Computing Technology to the 3rd Platform era\n13　　　　　13　　Product Project Management &amp; Business Development\n14　　　　　20　　Industry Case Study\n15　　　　　27　　Risk Assessment on Product Development &amp; Project Management\n16 June　03　　Industry 2020-2030\n17　　　　10　　Individual Project Presentation\n18　　　　　17　　Individual Project Presentation","scorePolicy":"These assignments will involve a team project presentation and an individual presentation, which will be graded 30 % for the mid-term and 40% for the final exam. The remaining 30% of the total grade is for students’ attendance.","materials":"* Harvard Business Review\n* MIT Technology Review","foreignLanguageTextbooks":true}]
