[{"name":"吳可久","email":"kochiuwu@ntut.edu.tw","latestUpdate":"2019-12-23 13:03:53","objective":"本課程之目標在於從科學哲學層次、研究方法層次、與實際操作層次探討設計研究的本質，內容包括界定設計研究問題、選用適當的量化或質性研究方法與特定工具、研究結果詮釋、案例解析、以及論文寫作等，俾使同學具備研究之基礎觀念以及進行創作或理論論文寫作之能力。研究方法一強調量化研究，課程內容包含研究的基本概念、文獻探討、研究問題、研究變項、研究假設、研究設計、資料蒐集與分析、研究工具、研究樣本、研究倫理與研究論文撰寫等。教學以課堂講授與論文研討與發表為主要方式，並以隨堂測驗、報告與分組討論與發表為評量依據。","schedule":"1描述統計\n2推論統計\n3多變項設計與分析\n4因素分析\n5報告研究結果\n6參考文獻","scorePolicy":"每次上課點名 未到三次 將予以慎重考慮\n期中、期末二次報告","materials":"教師自備","foreignLanguageTextbooks":false},{"name":"陳圳卿","email":"cceugene@ntut.edu.tw","latestUpdate":"2019-12-18 19:46:27","objective":"本課程之目標在於從科學哲學層次、研究方法層次、與實際操作層次探討設計研究的本質，內容包括界定設計研究問題、選用適當的量化或質性研究方法與特定工具、研究結果詮釋、案例解析、以及論文寫作等，俾使同學具備研究之基礎觀念以及進行創作或論文寫作之能力。研究方法二強調質性研究，例如：以深度訪談以及參與式觀察法探究互動行為脈絡，課程內容包含質性研究導論、質性研究過程與步驟、質性研究設計、質性研究方法、譯碼的程序、質性資料蒐集與分析、質性研究報告撰寫、質性研究在創新設計研究上的應用。教學以課堂講授與論文研討與發表為主要方式，並以隨堂測驗、報告與分組討論與發表為評量依據。\nThe aims of this course are to explore the nature of design research at the three various levels of scientific philosophy, research methods, and practical execution. The contents involve the introduction of defining the design problems, selecting the quantitative or qualitative research methods and specific instruments, interpretation of research results, case studies, as well as writing a thesis.\nThis course provides graduate students with the ability of fundamental concept and design creation or research thesis. These research methods two focus on qualitative research with the exploration of in-depth interview and participant observation. The details of content includes introduction, research process and approaches, research design, research methods, coding scheme, data collection and analysis, writing up and implication of innovation and design. The teaching methods include lectures, paper discussion and presentation based on the course assessment of assigned project, panel discuss","schedule":"1描述統計\n2推論統計\n3多變項設計與分析\n4因素分析\n5報告研究結果\n6參考文獻","scorePolicy":"每次上課點名 未到三次 將予以慎重考慮\n期中、期末二次報告","materials":"SPSS","foreignLanguageTextbooks":false}]
