[{"name":"陳怡靜","email":"sweetprettylover@gmail.com","latestUpdate":"2019-12-23 04:28:02","objective":"本課程為僑生國語文，提供僑生認識並進一步欣賞中華文化藝術之美。\n本課程分為大一上學期2學分，下學期2學分。上學期的授課內容，以唐朝詩詞名篇為範圍，介紹李白、杜甫名著之形成背景，及其寫作手法與技巧，甚而嘗試運用。大一下學期的授課內容，將選讀其他詩詞名篇以為範圍，期學生能欣賞理解不同詩人的創作風格，並涵化於個人性格中，進一步能進行獨立創作。\nThis course is for the students who are Chinese from oversea. It serves them to understand and appreciate the beauty of  Chinese art within culture. The course has two sections, each of them serves 2 grade. In last semester we taught the famous poems in Tang dynasty. We've learned about the articles were written by Li bai and Dufu of the context and the writing skills, and tried to use them. Next semester we'll teach other famous poems were written by other poets who were with different personality. Hope students can appreciate to the different style of poets and bring out the unique personality of you. The further, you can create individually.","schedule":"第1週 本學期介紹及其他唐朝詩人介紹  week 1 introduce\n第2週 白居易  week 2 Bai Juyi\n第3週 白居易及其詩作week 3 Bai Juyi and his poems\n第4週 白居易的性格week 4 the personality of Bai Juyi \n第5週 白居易的愛情week 5 the romance of Bai Juyi \n第6週 孟焦week 6 Meng Ciao\n第7週 賈島 week 7 Jia Dao\n第8週 焦寒島瘦week 8 The cool people in Tang Dynasty\n第9週 期中考week 9 midterm exam\n第10週 孟浩然 week 10 Meng Haoran\n第11週 孟浩然的性格week 11the personality of Meng Haoran\n第12週 孟浩然的生涯week 12 the career of Meng Haoran\n第13週 王維week 13 Wang Wei\n第14週 王維的性格week 14 the personality of Wang Wei\n第15週 唐代紅人的定位week 15 the popular people in Tang Dynasty\n第16週 期末發表(1)week 16 final presentation(1)\n第17週 期末發表(2)week 17 final presentation(2)\n第18週 期末考week 18 final exam","scorePolicy":"出席率20% attendance 20%\n小考10%    quiz10%\n作業10%   assignment10%\n發表20%  presentation20%\n期中考20%  midterm exam 20%\n期末考20%  final exam20%\n在本堂課每個人都不是局外人，敬請參與思考與討論\nStudents are not the audience in class, you need to be involved.","materials":"《華語詩詞賞析》楊琇惠編著/五南出版社 textbook\n自編講義 handout will be assigned in class\n自備一個自製小白板及白板筆 a mini white broad and white broad pen for discussing","foreignLanguageTextbooks":false}]
