[{"name":"陳心怡","email":"hichen@ntut.edu.tw","latestUpdate":"2020-02-28 17:47:15","objective":"本課程旨在幫助學生熟稔運用基本重要文法以寫出正確自然, 表達清晰之句子.  內容包括語法結構和錯誤分析, 例如不完整句、誤置修飾語、不連結修飾語、散漫句、錯誤平行結構、易混淆字、贅詞等常見問題。\nThis course is intended to provide a review of essential grammar skills as a background for students to construct sentences that convey ideas effectively and clearly.  The main content includes the correction of sentence fragments, run-on sentences, misplaced modifiers, dangling modifiers, and faulty parallelism.  Further focus is placed on varying syntactical structure, and on avoiding errors related to commonly confused words, slang, pretentious wording, cliches, and wordiness.","schedule":"Week　　Date　　Topic\n1　　3/2　　Introduction to the course \nIn-class writing \n2　　3/9　　Unit 1 Paragraphs \n3　　3/16　　Unit 2 Developing ideas for writing a paragraph\n4　　3/23　　Unit 3 Topic sentences\n5　　3/30　　Unit 4 Supporting and concluding sentences\n6　　4/6　　Unit 5 Paragraph review \n7　　4/13　　Unit 6 Definition paragraphs \n8　　4/20　　Workshopping \n9　　4/27　　Midterm\nDefinition paragraph due \nUnit 8 Descriptive paragraphs\n10　　5/4　　Workshopping\n11　　5/11　　Descriptive paragraph due\nUnit 9 Opinion paragraphs\n12　　5/18　　Workshopping \n13　　5/25　　Opinion paragraph due\nUnit 10 Narrative paragraphs\n14　　6/1　　Workshopping\n15　　6/8　　Narrative paragraph due\n16　　6/15　　Unit 11 Paragraphs in an essay: Putting it all together \n17　　6/22　　Workshopping \n18　　6/29　　Final exam\nEssay due \n\nNote: a syllabus is occasionally subject to change due to time constraints, unexpected disruptions, or needs of the class.  Readings and online conferences should be done before that week’s class.","scorePolicy":"The course adopts a 100 point scale for grading. Your grade will be based on the quality of your work in the following areas.\n\n1.　　Attendance &amp; participation: 20%\n2.　　Writing assignments &amp; in-class activities: 80%\n\nOther Policy:\n\n1.　　Previewing the materials is essential for classroom discussion. \n2.　　Attendance is required. Each unapproved absence and lateness will result in a 3-point deduction from the final grade. \n3.　　Course assignments should be submitted by the due dates. Late assignments are not accepted and will result in 3-point deduction by each calendar day. \n4.　　Plagiarism is not allowed in this course. Students who plagiarize will receive a zero for the course.","materials":"Folse, K., Muchmore-Vokoun, A., &amp; Solomon, E. (2014). Great Writing 2: Great Paragraphs. National Geographic Learning. \n\n*Additional readings will be supplemented.","foreignLanguageTextbooks":true}]
