[{"name":"王怡鈞","email":"bnwntut8@ntut.edu.tw","latestUpdate":"2020-03-01 16:16:48","objective":"This is a science applied course that examines how the application of big data is made for our human to enhance technical and functional capabilities and how the big data processing efficiency can be facilitated and monitored to achieve well-defined objectives.\n\nAs it is well known that an optimized result made by Artificial Intelligence (AI) could not be significantly achieved without big data feedings. Nowadays, there are diversity of data type (mostly of non-structured ones) spreading on the air and pipelines, furthermore we are generating much more data and faster than ever before, and the application of big data does impact our daily life. Although we can store and process the data, there are problems using existing techniques to accommodate our most interests. For example, both accessing the data from disk in distributed systems and getting data to the processors are of the typical bottlenecks. \n\nThis course is designed to not only introduce students to Hadoop Big Data application and trend, but also its processing technology and ecosystems which are capable of eliminating the bottlenecks by its unique methods for storing and processing data per common application scenario. In addition, the course provides the platforms for students’ paper reading, group discussion, co-work assignment, case studies and presentation.\n\nThe course will introduce Hadoop core technologies and administration with its major listed below:\n\n　　Big Data in Demand and Its Application Trend\n　　Core Technologies of Hadoop for Big Data Management \n　　Management tool to simplify Hadoop Administration  \n　　Hadoop Cluster Deployment\n　　YARN Applications including MapReduce  \n　　Hadoop Cluster Hardware and Software \n　　Deployment of Hadoop Ecosystem Projects: Sqoop, Flume, Hive and Impala \n　　HDFS Configuration for High Availability\n　　Hadoop Security \n　　Cluster Resource Scheduling and Configuration \n　　Cluster Monitoring and Management\n　　Industrial Big Data and Ecosystems Development and Case Studies","schedule":"(Syllabus, preliminary)\nThursday. 18:30-21:10\n\nWeek#  Rescheduled by COVID-19     Subject to change per needs and circumstances\n \n1      2/20-&gt;3/05　　        Syllabus &amp; organization of all mission cases from the class\n2      2/27-&gt;3/12　　        Big Data Demand and Trend\n3      3/05-&gt;3/19               Core Technologies for Big Data Management\n4      3/12-&gt;3/26　　        Hadoop Cluster Deployment\n5      3/19-&gt;4/02　　        Tomb Sweeping Day 清明節\n6      3/26-&gt;4/09　　        MapReduce \n7      4/02-&gt;4/16               YARN Applications \n8      4/09-&gt;4/23　　        Hadoop Distributed File System \n9      4/16-&gt;4/30　　　　Mid-Exam or Report\n10     4/23-&gt;5/07　　　　Planning Hadoop Cluster\n11     4/30-&gt;5/14　　　　Hands On Lab or  Industrial Speech \n12     5/07-&gt;5/21　　　　Hadoop ecosystem projects - Sqoop and Flume \n13     5/14-&gt;5/28　　　　Hadoop I/O \n14     5/21-&gt;6/04　　　　Case Study and Demonstrations-I\n15     5/28-&gt;6/11　　　　Case Study and Demonstrations-II\n16     6/04-&gt;6/18　　　　Hadoop security &amp; Managing resources \n17     6/11-&gt;6/25　　　　Dragon Boat Festival端午節\n18     6/18-&gt;7/02　　　　Final-Exam or Report","scorePolicy":"1. Assignment including Report, Hands on Lab  and Presentation：40%\n2. Mid-Term Exam or Study Report：20%\n3. Final-Term Exam or Study Report：20%\n4. Attendance: (15%+5%): 20%","materials":"Reference:\n\n1.　　Hadoop: The Definitive Guide, Fourth Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Tom White\n2.　　Hadoop Essentials, First Edition, April 2015, Published by O’Reilly Media, Inc., Editor: Shiva Achari.\n3.　　Hadoop Operation, First Edition, September 2012, Published by O’Reilly Media, Inc., Editor: Eric Sammer\n4.　　The Google File System;  https://static.googleusercontent.com/media/research.google.com/zh-TW//archive/gfs-sosp2003.pdf\n5.　　MapReduce: Simplified Data Processing on Large Clusters; https://static.googleusercontent.com/media/research.google.com/zh-TW//archive/mapreduce-osdi04.pdf\n6.　　Big Data associated, To-Be-Advised in class","foreignLanguageTextbooks":true}]
