[{"name":"林宜玄","email":"yishyuan@ntut.edu.tw","latestUpdate":"2020-02-25 11:10:48","objective":"一、課程名稱：專題討論（二）\n二、教學目標：\n（一）增進批判、分析、統整與應用之相關能力\n（二）確定學術論文之研究問題與題目並進行相關文獻分析\n（三）完成研究設計及論文計畫構想書\n三、授課方式：\n（一）教師講授：研究問題與論文題目之探索、文獻探討方法、待答問題或研究假設之確定、研究變項之界定、研究設計之類型、研究問題轉變為研究計畫、論文寫作方法與APA格式講解。\n（二）教育議題辯論：請依據指定之教育相關議題，組隊進行辯論比賽並繳交專題報告。\n（三）論文計畫構想書撰寫與討論：請自行探索研究問題與論文題目、分析相關文獻、確定待答問題或研究假設、界定研究變項、進行研究設計、撰寫論文計畫構想書，進行報告與討論並繳交報告。","schedule":"四、授課內容及進度：\n ※第一週（3/04）\n說明授課內容及進行方式，討論本學期教育議題辯論題目，分組及抽籤決定辯論組別與順序，論文題目與研究問題、相關文獻分析報告之配對與順序。\n ※第二週（3/11）\n講授研究問題與論文題目之探索、文獻探討方法\n※第三週（3/18）\n 講授待答問題或研究假設之確定、研究變項之界定、研究設計之類型、研究問題轉變為研究計畫、論文寫作方法與APA格式\n※第四週、第五週（3/25、4/01）\n  1.每週2隊（5人組成一隊）進行教育議題辯論\n  2.辯論隊員全隊共同繳交一份報告\n  3.非辯論隊員每人繳交1-2頁報告\n※第六週（4/08）專題演講\n※第七週、第八週、第十一週、第十二週（4/15、4/22、5/13、5/20）\n 1.每週5人分別進行10分鐘的論文題目與研究問題、研究目的、相關文獻分析報告及討論（請用power point報告），2人一組配對相互評論計畫內容，評論時間3分鐘。\n 2.報告人繳交書面報告（書面及電子檔）\n 3.非報告人需參與討論\n※第九週（4/29）期中考試\n※第十週（5/06）專題演講\n※第十三週、第十五週、第十六週、第十七週（5/27、6/10、6/17、6/24）\n 1.每週5人分別進行10分鐘的待答問題或研究假設、研究變項、研究\n設計、論文計畫構想書報告及綜合討論（請用power point報告），2人一組配對相互評論計畫內容，評論時間3分鐘。\n 2.繳交論文計畫構想書（書面及電子檔）\n 3.非報告人需參與討論\n※第十四週（6/03）技職研討會\n※第十八週（7/01）期末考試","scorePolicy":"五、成績評量：\n（一）平時成績（包括：上課出席率、專題演講心得報告及討論發言狀況）：25%\n（二）教育議題辯論（包括：辯論分數及書面報告、心得報告）：25%\n（三） 論文題目與研究問題、研究目的、相關文獻分析報告（包括：課堂報告及書面報告；口頭評論與回饋、報告評分表）：25%\n（四）期末論文計畫構想書報告（包括：課堂報告及書面報告；口頭評論與回饋、報告評分表）：25%","materials":"六、備註：\n1.教育議題經全班討論後票選2則，5人組成一隊依據指定之教育時事議題，進行辯論比賽並繳交專題報告。非辯論隊員需負責場地佈置（計時器、警鈴、題目海報…），其中1人擔任會場主席、1人擔任記時員、其餘同學擔任記分員，非辯論隊員於比賽後均需參與討論並繳交1-2頁報告（書面及電子檔）。\n2.每人進行10分鐘的論文題目與研究問題、研究目的、相關文獻分析報告並繳交報告，其餘同學需參與討論。\n3.每人進行10分鐘的期末論文計畫構想書報告並繳交報告，論文計畫構想書報告內容包括：論文名稱、研究動機（問題）、研究目的、待答問題或研究假設、名詞釋義、研究範圍與限制、研究對象、相關文獻分析、研究設計與方法，其餘同學需參與討論。\n 4. 外聘演講之次週應繳交1~2頁報告，報告內容包括學理上的評論、補充資料，心得感想等，有引用他人觀點時，仍應依APA格式，註明文獻。如因時間安排致不能參與演講，應經教師同意，於二週內以參加其他相當份量之學術研討會或演講之心得報告替代。\n5. 所有應繳交之報告，請提供書面及電子檔，由班長彙整轉交；所有報告將掛網，所以務請留意學術倫理及智慧財產權問題。\n\n\n七、參考書目：\n    1.畢恆達（2005）。教授為什麼沒告訴我。臺北:學富。\n    2.潘慧玲主編（2004）。教育研究方法論。臺北:心理。\n    3.潘慧玲主編（2006）教育研究的取徑-概念與應用。臺北:高等教育。\n    4.蔡今中(2008)。社會科學研究與論文寫作：成功發表秘笈。臺北:高等教育。\n    5.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(一)  總論與量化研究。臺北:東華。\n    6.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(二)  質性研究法。臺北:東華。\n    7.瞿海源、畢恆達、劉長萱、楊國樞主編(2012)。社會與行為科學研究法(三)  資料分析。臺北:東華。\n\n新制奧瑞岡式五五四制辯論規則\n壹、人員\n一、每場比賽須由主辦單位指派會場主席一位，以主持比賽之開始及進行。\n二、每場比賽須由主辦單位指派計時員、計分員各若干位。\n三、每場比賽須由主辦單位安排三位以上(含三位)單數之裁判人員擔任裁判工作。 \n貳、比賽程序\n一、比賽程序如後： \n(1) 正方第一位隊員申論， 反方第二位隊員質詢正方第一位隊員。\n(2) 反方第一位隊員申論， 正方第三位隊員質詢反方第一位隊員。\n(3) 正方第二位隊員申論， 反方第三位隊員質詢正方第二位隊員。 \n(4) 反方第二位隊員申論， 正方第一位隊員質詢反方第二位隊員。\n(5) 正方第三位隊員申論， 反方第一位隊員質詢正方第三位隊員。 \n(6) 反方第三位隊員申論， 正方第二位隊員質詢反方第三位隊員。\n(7) 雙方結辯。\n二、比賽時間依申論、質詢、結辯標準時間之順序，採「五、五、四」制（5分鐘、  5分鐘、4分鐘）。\n三、申論、質詢均告完畢後，3分鐘開始結辯，結辯次序由正、反雙方於一辯申論前抽籤決定。\n四、申論、質詢及結辯之發言， 於標準時間外，均有30秒之緩衝時間，屆滿時必須結束發言。 \n參、比賽規則\n一、通則 \n(1) 道具一經使用，他方亦得相同之權利。 \n(2) 非經他方要求，將已使用或待使用之道具於他方發言時展示者，視為違規。 \n(3) 任何隊員發言時，不得涉及人身攻擊，否則視為違規。\n(4) 出賽隊員於比賽開始後，不得獲他人之任何幫助，否則視為違規。 \n(5) 出賽隊員於發言計時開始後，不得獲他人及其他出賽隊員之任何幫助，否則視為違規。\n(6) 引述對方言詞應正確，否則視為違規。 \n(7) 引述之證據資料應切合事實，否則視為違規，某方偽造證據資料時，得由他方檢具證據資料反證，於賽後提出抗議。 \n(8) 抗議應由結辯或領隊於比賽前或比賽後10分鐘內以書面向主席提出，否則不予受理，抗議提出後，主席應知會他方，他方得以書面答辯。 \n二、立場\n(1) 正方界定之立場應完全符合題目之要求。 \n(2) 反方界定之立場應反對題目。 \n(3) 有合題爭議時，最遲必須在下一位隊員申論時提出，否則爾後不得再予爭論。\n三、質詢 \n(1) 質詢者應提出任何與題目有關之合理而清晰之問題。 \n(2) 質詢者控制質詢時間，得隨時停止被質詢者之回答。 \n(3) 質詢者自行申論或評論時，裁判應視之為違規，答辯者並得要求其停止。\n四、答詢\n(1) 被質詢者應回答質詢者所提之任何問題，但問題顯然不合理者，被質詢者得說明理由，拒絕回答。 \n(2) 被質詢者不得提出反質詢。 \n(3) 被質詢者得要求質詢者重述其質詢，但不得惡意為之，否則視為違規。 \n(4) 被質詢者提出反質詢時，質詢者得要求其停止，並拒絕回答。\n五、結辯 \n(1) 結辯由雙方出賽隊員中自行推選一人擔任之，於賽前10分鐘連同比賽名單提出。 \n(2) 結辯者應就己方論點及雙方交情形加以整理陳述，不得提出任何申論及質詢階段未提出之論證，否則視為違規。\n肆、 裁判守則\n一、裁判之判決，應以該場雙方所提出之論點、證據及場上之表現為基礎，依一般人之經驗法則判斷之","foreignLanguageTextbooks":false}]
