[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2020-03-02 17:08:52","objective":"在《電影》(一九二六) 一文裡，維吉尼亞o吳爾芙曾說：文學作品與其改編電影的關係，就如不幸的受害者與貪婪的掠奪者或寄生蟲之間的關係一般。電影業已經建立了一項傳統，將文學作品作為滋養其文化與美學內涵的材料來源。然而，對吳爾芙而言，這種傳統卻為電影業與文學作品帶來了災難性的結果。如她所言：「正當眼睛與大腦欲攜手合作卻徒勞無功之際，他們同時亦遭受到無情地剝離。」儘管吳爾芙也許對於文學作品與其改編電影的關係過於悲觀，然而，她的話有時聽來卻也千真萬確。在本課程裡，我們將探討改編自文學作品的電影之局限和缺點，以及其潛力和長處等問題。我們將研究，在文學作品之中得依賴讀者想像力才能生動傳達的微妙心理，電影裡的聲音與視覺效果須如何將之傳遞?文學與電影在處理象徵及思想的方法上，有何不同?還有，改編自文學作品的電影如何偏離文學原作之主題或結構，以便迎合當代觀眾之美學、心理、社會、政治、以及文化等層面的期待？本課程將研究之文學作品與改編電影將於下列作品中選出，但是不局限於下列作品：\nJoseph Conrad, Heart of Darkness (1899)\nFrancis Ford Coppola, Apocalypse Now (1979)\n\nRudyard Kipling, Kim (1901)\nJohn Howard Davie\nIn \"The Cinema\" (1926), Virginia Woolf observes that the relationship between works of literature and their film adaptations is like that between unfortunate victims and their rapacious predators or parasites. The cinema has established a tradition of feeding on works of literature as a source of cultural and aesthetic nourishment. But the results for her are \"disastrous to both.\" As she puts it, \"Eye and brain are torn asunder ruthlessly as they try vainly to work in couples.\" Although Woolf might have been over pessimistic about the alliance between works of literature and film adaptations, yet her words ring true at times. In this course, we will explore the limitations and shortcomings as well as the potentialities and strengths of the film adaptations of literary works. We will examine how cinematic sound and visual effects convey psychological subtleties, whose rendition in literature relies heavily on words that come alive only in our imagination; how symbols and thoughts are tr","schedule":"03/02　　Introduction\n03/09　　Forster’s Howards End\n03/16　　Forster’s Howards End\n03/23　　Forster’s Howards End\n03/30　　Forster’s Howards End\n04/06　　Forster’s Howards End\n04/13　　Forster’s Howards End\n04/20　　James Ivory’s Howards End\n04/27　　Ondaatje’s The English Patient\n05/04　　Ondaatje’s The English Patient\n05/11　　Ondaatje’s The English Patient\n05/18　　Ondaatje’s The English Patient\n05/25　　Ondaatje’s The English Patient\n06/01　　Ondaatje’s The English Patient \n06/08　　Ondaatje’s The English Patient\n06/15　　Anthony Minghella’s The English Patient\n06/22　　Position paper due and Oral Presentation\n06/29　　Review and Discussion","scorePolicy":"attendance, participation in class discussion, and oral presentation: 50%; position paper: 50%","materials":"Howards End\nThe English Patient","foreignLanguageTextbooks":true}]
