[{"name":"林祐正","email":"yclin@ntut.edu.tw","latestUpdate":"2019-12-16 12:46:05","objective":"This course will provide students with practical project management skills to learn a step-by-step process of planning and managing construction projects. Students will focus on defining, organizing, planning, tracking and managing a project. Planning and managing projects is designed to give students practical project management skills - the skills necessary in today's dynamic environment for bringing products to market on time and with features that meet business objectives. This course has a strong focuses on project management processes; risk management; schedule management and controlling; scope management; management techniques. The course is a combination of lectures, readings, hands-on exercises, homework assignments and a project.","schedule":"Major topics of this course\n1. Introduction to Construction Project Planning and Control\n2. Concept of Construction Project Planning and control\n3. PDM Approach for Construction Project Planning \n4. ADM Approach for Construction Project Planning\n5. PERT Approach for Construction Project Planning \n6. S-Curve Approach for Construction Project Planning and Control\n7. Risk Management for Construction Project Planning and Control \n8. Stakeholder Management for Construction Project Planning and Control\n9. Earned Valued Management for Construction Project Planning and Control\n10. Related Software for Construction Project Planning and Control\n11. BIM for Construction Project Planning and Control\n12. The Special Topic for Construction Project Planning and Control\n13. Case Study","scorePolicy":"1. Quizzes (20%)\n2. Assignments (30%)\n3. Midterm Report (20%)?\n4. Final project presentation (5%) and final project report (25%)","materials":"1. Construction Project Management (2002) by Frederick E and Gould, Nancy E. Joyce. (Prentice Hall; 2 edition)\n2. Project Management in Construction (2006) by Sidney M. Levy (McGraw-Hill Professional Engineering)","foreignLanguageTextbooks":false}]
