[{"name":"薛人瑋","email":"angusshiue@gmail.com","latestUpdate":"2019-12-17 10:25:00","objective":"循環經濟是一種與傳統線性經濟（開採-製造-丟棄）不同的產業經濟模式，循環經濟就像自然生態循環一樣，是封閉且循環的經濟系統，透過重新設計產品和商業模式，促進更好的能源與資源使用效率、消除廢棄物及避污染自然環境。內容將包括發展及應用物質流分析及循環經濟的相關技術，先進材料的循環經濟議題及案例分析，不同高分子材料領域的循環經濟生態，及跨學科創造永續的解決辦法。\nA circular economy is a regenerative system in which resource input and waste, emission, and energy leakage are minimised by slowing, closing, and narrowing material and energy loops. This can be achieved through long-lasting design, maintenance, repair, reuse, remanufacturing, refurbishing, and recycling. This is contrast to a linear economy which is a 'take, make, dispose' model of production. This course, further, contributes to the optimising systems rather than components, or the notion of ‘design for fit’. As a generic notion it draws from a number of more specific approaches including novel material, plastic, polymer, textile, and the cicular economy. Additional benefit to students is learning of Sustainable Development.","schedule":"Weekly Date hours 　　Key Item of the Instruction Content\n1　　20/2　　        3　　Climate Change and the Circular Economy - How Green Chemistry \n                                Connects\n2　　27/2　　        3　　Definitions, processes and impacts\n3　　06/03　　3　　Critical appraisal of the circular economy standard BS 8001\n4　　13/03　　3　　Cyclic Flow of Material: Concepts and Classifications\n5　　20/03　　3　　Facility Management In A Circular Economy\n6　　27/03　　3　　Recycling of Polymer Materials\n7　　03/04　　3　　Circular Economy Synergies in Cement Production for a Sustainable \n                                Future\n8　　10/04　　3　　Sustainable Plastics from a Chemicals Perspective \n9　　17/04　　3　　(Middle Exam)\n10　　24/04　　3　　Circular Economy in the Textile Industry\n11　　01/05　　3　　Waste Tyre Utilization\n12　　08/05　　3　　Circular economy of pulp and paper industry\n13　　15/05　　3　　Circular economy of pulp and paper industry\n14　　22/05　　3　　Municipal Solid Wastes as a gasifier fuel\n15　　29/05　　3　　Gasification of Municipal Solid Waste\n16　　05/06　　3　　Gasification of waste for energy carriers\n17　　12/06　　3　　Gasification of waste for energy carriers\n18　　19/06　　3　　(Final exam)","scorePolicy":"1.　　Homework 30%：Homework must be handed in during class when the date is due.\n※ Late homework – HALF GRADE if handed within a week; ZERO GRADE thereafter.\n2.　　Mid-term exam 35%.\n3.　　Final exam 35%.","materials":"1. Circular Economy and sustainable environment\n2. Sustainable Development toward to 2030 year","foreignLanguageTextbooks":true}]
