[{"name":"李志鴻","email":"cl4e@ntut.edu.tw","latestUpdate":"2020-03-05 12:53:14","objective":"Introduce the basic principles of computer-aided engineering and finite element analysis.\nTeaching the operation methods and techniques for the analysis software ANSYS.\nGuide students to practice finite element analysis of plane stress or heat transfer problems.\nDevelop students with the ability to perform independent finite element analysis.\nCultivate students with the correct attitude of using finite element analysis.\nIntroduction to engineering analysis, finite element model building, advanced module techniques, solid model building, one-dimensional element analysis, two-dimensional element analysis, three-dimensional element analysis, and advanced examples.","schedule":"Week 1 Introduction to the Computer-Aided Engineering and the Finite Element Method: numerical analysis, finite difference, Newton-Raphson, etc.\nWeek 2 Introduction to the Computer-Aided Engineering and the Finite Element Method: mathematical modeling of mechanics problems, the energy method, etc.\nWeek 3 Introduction to the Computer-Aided Engineering and the Finite Element Method: finite element method, multi-section polynomials.\nWeek 4 Introduction to the Computer-Aided Engineering and the Finite Element Method: various boundary conditions, displacement and force conditions.\nWeek 5：\n1. ANSYS Structure; 2. ANSYS Interface; 3. On-line Help System; 4. The ANSYS System; 5. ANSYS Command Language.\nWeek 6:\n1. Introduction to the Plane Stress Analysis; 2.Problem analysis; 3.Element Selection &amp; Attributes; 4.Solid Modeling; 5.Finite Element Modeling; 6. Computer Lab Practices\nWeek 7:\n1. Analysis Type and Options; 2.Boundary Conditions; 3.Solution Options and Solving; 4. Post-Processor &amp; Result Displays; 5. Result Query; 6. Result Verification; 7.Computer Practices 8.Assignment\nWeek 8:\n1. Coordinate System; 2. Move and Rotate of Working Plane; 3. The Select Function; 4. Component and Assembly; 5. Computer Lab Practices\nWeek 9 mid-term examination\nWeek 10 Techniques of Advanced Solid Modeling:1.Bottom-Up Modeling; 2.Extrude or Extend a Line; 3.Boolean Operations; 4.Copy, Move, Modify, and Mirror of a Solid Model; 5.Import Other CAD files and zoom of Solid Model; 6.List Properties of Solid Model; 7. Computer Lab Practices\nWeek 11 Techniques of Finite Element Modeling:1. Multiple Element Attributes; 2.Control of Element Size; 3. Mapped Mesh; 4.Extrude and Sweep; 5. Copy, Move, Modify, Mirror, Zoom, and Merge of a Finite Element Model; 6. Create Nodes and Elements Directly; 7.Hardpoint; 8. Computer Lab Practices\nWeek 12 Advanced Boundary Conditions and Solvers: 1.Concentrated Force Load; 2.Inertia Load; 3.Nodal Coordinate System; 4.Symbols of Boundary Conditions; 5.Solvers; 6.Method for Solving Multiple Boundary Conditions; 7.ANSYS File Locations; 8. Computer Lab Practices, 9.Assignment\nWeek 13 Post-processing, 1.Results of multiple loads, 2. path map, 3. error evaluation, 4. vector diagram, 5. result coordinate system, 6. result monitor, 7. practice.\nWeek 14 Plane Stress Analysis: An Example of Bracket Analysis\nWeek 15 Heat transfer examples: 1.ANSYS heat transfer analysis ; 2. problem analysis； 3.activate ANSYS element type definition； 4. model building and meshing； 5. boundary conditions and solution； 6. post processing； 7. thermal stress；8. online practice; 9. hoework\nWeek 16 Heat transfer example: one-dimensional/two-dimensional heat transfer analysis; heat transfer of compositite materials\nWeek 17 Axi-symmetric problems: \nWeek 18 Final examination","scorePolicy":"/homework or quiz: 30%\n/mid-term examination:30%\n/final examination:30%\n/attendance:10%","materials":"Textbook: Teacher’s notes\nReference book:\nMoaveni, Finite Element Analysis, Theory and Application with ANSYS, Prentice Hall, 1999.\n康淵、陳信吉，ANSYS入門，全華圖書 2009 ISBN 978-957-21-5845-6","foreignLanguageTextbooks":false}]
