[{"name":"陳涵秀","email":"gtaiwan@gmail.com","latestUpdate":"2019-12-23 13:45:12","objective":"本課程探究文化保存的各項議題，包含有形無形文化保存的真實性、文化價值的差異與認定、詮釋與再現；同時透過國內外文化保存的實踐案例的分析與討論，思考未來文化保存的多元發展可能性。\nThis course aims to understand the concept of cultural preservation, and the methods of doing cultural preservation by examining different case studies in the world. Different issues related to cultural preservation are also discussed in this course, include the value and authenticity of cultural heritage, the representation and interpretation of culture, and reuse and management of cultural spaces. A creative practice of cultural preservation will be conducted in this course.","schedule":"一，什麼是文化 what is culture?\n二，文化保存相關概念 About cultural preservation，conservation, restoration.\n三，當代文化保存的發展 The development of cultural preservation policy \n四， 文化保存的真實性與價值 The authenticity and value of cultural preservation.\n五，文化保存的基礎工作與技能 The foundation work and methods of doing cultural preservation\n六，校外參訪 field trip \n七， 文化保存創意實踐案例分析 The case studies of cultural preservation and creative practice \n八，國外文化保存創意實踐案例分析 The international case studies of cultural preservation and creative practice \n九， 期中口頭報告 oral presentation\n十，田野調查實習 fieldwork \n十一，個人田野調查 personal fieldwork\n十二，校外參訪 fieldtrip\n十二，田野調查觀察與記錄報告 oral presentation for personal fieldwork\n十三，田野技巧進階及資料整理 the method of fieldwork\n十四，企劃執行確認與討論 project revision \n十五，文化保存創意實踐計畫執行take action I\n十六，文化保存創意實踐計畫執行take action II\n十七，文化保存創意實踐計畫檢討 examining the action \n十八，文化保存創意實踐計畫成果分享 oral presentation of your action work","scorePolicy":"課堂作業 15%\n期中口頭報告 20%\n田野調查記錄報告20%\n計畫執行25%\n期末成果 20%","materials":"Ashworth, G., 2000 A Geography of Heritage: Power, Culture and Economy, Arnold\nKapila D. Silva and Neel Kamal Chapagain，2017，Asian Heritage Management: Contexts, Concerns, and Prospects，Routledge\nde Groot, Jerome，2016，Consuming History: Historians and Heritage in Contemporary Popular Culture，Routledge\nFalser, Michael，2015，Cultural Heritage as Civilizing Mission: From Decay to Recovery，Springer\n劉銓芝，2015，聚落與文化景觀保存操作執行手冊，文化部文化資產局  \n劉益昌, 趙金勇, 王嵩山, 林會承, 林修澈, 李台元，2014，文化保存，五南  \n劉俊裕, 張宇欣, 廖凰，2015 ，臺灣文化權利地圖，巨流圖書公司  \n漢寶德，2014，文化與文創，聯經出版公司  \n李天鐸，2011，文化創意產業讀本：創意管理與文化經濟，遠流 \n文化部文化資產局 ，2013，進化：產業文化資產階段再生，文化部文化資產局","foreignLanguageTextbooks":true}]
