[{"name":"吳岳錚","email":"wuyuehcheng@hotmail.com","latestUpdate":"2019-12-18 15:21:07","objective":"吉祥圖在台灣民居空間之呈現，分佈於各構件上，亦為中國人吉祥圖案的濃縮。古代建築裝飾圖案屬民俗吉祥文化範疇花樣繁多，內容豐富，分布在古建築的多個重要部位。古建築裝飾的原則是：建築必有圖，有圖必有意，有意必吉祥。可滿足人們心理祈求安全與審美的層次需求與讓實質的物質生活與心靈的精神結合為一。透過教學，使學生了解傳統建築吉祥圖騰意涵，並實地進行田野調查工作。\n\n本課程預計使修課人員具備以下能力：\n1.　　具有對歷史人文思考、觀察、體知之能力\n2.　　具有對「文獻經典」理性體悟之能力\n3.　　具有對歷史圖像、藝術圖像反思與品評之能力\n4.　　具有史料蒐集、解讀、組織與寫作之能力\nThe auspicious picture is displayed in Taiwan's residential space, distributed on various components, and is also a condensed of the auspicious pattern of the Chinese. The decorative patterns of ancient buildings belong to the folk and auspicious cultural category, with a variety of patterns and rich contents, which are distributed in many important parts of ancient buildings. The principle of ancient building decoration is: the building must have a picture, the picture must be intentional, and the intention must be auspicious. It can meet people's psychological needs for safety and aesthetics, and integrate the material life and the spirit of the soul into one. Through teaching, students are made aware of the meaning of traditional architectural auspicious totems and conduct field investigations on the spot.\n\nThis course is expected to equip students with the following abilities:\n1. Ability to think, observe, and understand historical humanities\n2. Ability to rationalize the \"lite","schedule":"授課週次\n課程主題\n第一週\n概論\n第二週\n吉祥圖騰於傳統建築之意涵\n第三週\n吉祥圖騰的種類分析\n第四週\n龍鳳篇\n第五週\n瑞獸祥魚類\n第六週\n靈禽類\n第七週\n花木類\n第八週\n博古器物類\n第九週\n人物篇\n第十週\n期中報告\n第十一週\n戶外參訪：廟宇實地探訪\n第十二週\n參訪心得分享與討論\n第十三週\n戶外參訪：傳統建築實地探訪\n第十四週\n參訪心得分享與討論\n第十五週\n文獻原著簡介\n第十六週\n文獻閱讀與討論\n第十七週\n文獻閱讀與討論\n第十八週\n期末調查報告","scorePolicy":"上課出席20% \n期中作業及期末調查報告佔80%","materials":"一、專書 \n1.《台閩地區的古蹟與歷史建築》 。\n2.漢寶德，《古蹟的維護》 台北，文建會，民74年。 \n3.黃得時，《台灣的孔廟》 ，省新處，1987年。 \n4.李乾朗，《傳統營造匠師派別之調查研究》 ，李乾朗建築研究室，民77年。 \n5.林會承，《台灣傳統建築手冊》，台北藝術家出版社，民79年。  \n6.光復書局編，《台灣傳統建築之美》，民81年。  \n7.王振復，《建築美學》，台北地景企業有限公司，民82年。 \n8.夏鑄九、江伯决，《文化資產、古蹟保存與社區參與研討會論文集》 ， 台北，文建會，民85年。 \n9.編 者，《中國古建築術語辭典》，山西人民，1996年。 。  \n10.梁思成，《中國建築史》，天津百花文藝出版社，1998年。 \n11.梁思成，《中國建築藝術圖集》上下，天津百花文藝出版社，1998年。 \n12.李乾朗，《古蹟入門》，台北，遠流出版社，1999年。 \n13.李乾朗，《台灣古建築圖解事典》，台北，遠流出版社，2003年。 \n\n二、論文 \n1.周貞芳，〈從台灣古建築來看保護古蹟的意義〉，《史聯雜誌》21，民81年，頁110—111。 \n2.夏鑄九，〈現階段古蹟保存之重要課題〉，《造園季刊》11，民81年，頁19—23。 \n3.石守謙，〈古蹟、史料、記憶、危機〉，《當代》92，民82年，頁10—19 \n4.林明德，〈台灣地區宅第之匾聯探索〉，《宜蘭文獻雜誌》11，民83年頁2—27。 \n5.夏鑄九，〈為何保存為誰保存—古蹟保存意義的建構與重構〉，《漢聲》74，民84年，頁57—62","foreignLanguageTextbooks":false}]
