[{"name":"吳岳錚","email":"wuyuehcheng@hotmail.com","latestUpdate":"2019-12-18 15:22:34","objective":"與西方學院派的美術相比，傳統建築工藝之美學在台灣較被忽略，西方雕塑與繪畫有它構成的原則，台灣傳統建築工藝亦是構築一套屬於自身的審美觀點。以台灣繪畫教育為例，大部分的課程偏向西式教學如素描、水彩、油畫，它們追求是立體感，達到寫實效果。而東方水墨繪畫或書法教育則偏少，它們講求線條系統，而屬於工藝美術的「傳統建築工藝」區塊更是沒有太多著墨，以致傳統工藝「美學」有流失的現象。\n　　本課程將設計三種彩繪形式有「木構插角圖稿彩繪」、「木構螭龍窗圖稿彩繪」、「古蹟樑枋彩繪仿作」，前兩者為彩繪於雕刻材上的呈現，後者為包含圖案設計與水墨繪畫的樑枋彩繪，三種不同樣式彩繪使學員能體驗彩繪施作上的各式要點。本課程將以「木構插角圖稿彩繪」、「木構螭龍窗圖稿彩繪」兩種彩繪形式為，進行彩繪課程教授。\n本堂課將以「台灣傳統建築彩繪」為主題，介紹台灣傳統彩繪源流、匠派、技法，以達到欣賞台灣傳統彩繪之目的，並以實際操作模式，模擬彩繪工作現場之現況，了解彩繪施工技巧與步驟。\nCompared with western academic art, the aesthetics of traditional architectural craftsmanship is neglected in Taiwan. Western sculpture and painting have their constituent principles. Traditional Taiwanese architectural craftsmanship also builds a set of own aesthetic viewpoints. Taking Taiwan's painting education as an example, most of the courses are oriented towards Western-style teaching such as drawing, watercolor, and oil painting. Their pursuit is three-dimensional and realistic. Oriental ink painting or calligraphy education is less. They focus on the line system, and the \"traditional building crafts\" section of the arts and crafts does not have too much ink, so that the \"aesthetics\" of traditional crafts are lost.\n\nThis course will design three kinds of painting styles: \"artwork drawing of wooden frame corners\", \"artwork drawing of wooden structure windows\", \"painting imitation of ancient beams\", the former two are renderings on carved materials. The latter is Liang Kui's pa","schedule":"授課週次\n課程主題\n課程內容\n第一週\n台灣傳統彩繪概述\n認識台灣彩繪歷史\n認識台灣傳統彩繪匠派\n經典彩繪作品賞析\n第二週\n彩繪底板與工具製作\n製作木筆 \n打磨木板\n壓上補土層\n第三週\n彩繪底板製作\n塗刷底漆\n塗刷面漆\n第四週\n圖稿分析\n圖稿施作技巧(鰲魚插角)\n圖稿施作技巧(螭龍窗)\n第五週\n圖稿製作\n牛皮紙以鑽打洞製作粉本\n製作粉包\n打印圖稿\n第六週\n線稿繪製\n以白粉鋪擦彩繪板\n以圭筆繪製線稿\n第七週\n線稿繪製\n以小楷毛筆繪製細節\n第八週\n安金\n以白粉鋪擦彩繪板\n平塗安金漆\n以米酒略浸金箔\n金箔貼至安金處\n第九週\n退暈\n製作桐油漆\n退暈技法教學\n塗繪主色調部分\n第十週\n退暈\n塗繪主色調部分\n第十一週\n退暈\n塗繪次色調部分\n第十二週\n退暈\n塗繪次色調部分\n第十三週\n攆色\n攆色技法教學\n圖繪攆色所需部分\n第十四週\n攆色\n圖繪攆色所需部分\n第十五週\n平塗\n單一顏色處塗刷\n第十六週\n平塗\n單一顏色處塗刷\n第十七週\n作品修整\n溢漆部分修整\n墨線總整理\n第十八週\n期末討論\n分享作品配色理念\n彩繪技法使用心得交流","scorePolicy":"【成績計算權重】\n1.　　出席率　30%\n2.　　實作技藝　40%\n3.　　上課態度　30%\n\n【實作技藝評量重點】\n1.　　墨線工整度　10%\n2.　　油彩塗刷技術　50%\n3.　　顏色搭配　10%\n作品整潔度　30%","materials":"陳淑華（2006）。建築彩繪保存修護入門手冊。臺南市：文化保存籌備處。","foreignLanguageTextbooks":false}]
