[{"name":"耿慶瑞","email":"cjkeng@ntut.edu.tw","latestUpdate":"2019-12-24 15:34:41","objective":"以消費者為重心已蔚為目前市場行銷的重要潮流。了解消費者決策過程也成為行銷領域研究的主流。一般而言，消費者的購買決策制定過程決定產品與服務的購買結果，主要包括五個階段：(1)問題察覺、(2)資訊搜尋、(3)方案評估、(4)購買選擇、(5)購後過程。消費者的購買決策制定過程深受各種不同因素之影響。本課程強調如何藉由理論概念、實例討論與實作方式進一步了解消費者，並將此知識應用於行銷策略上。此外網際網路為一整合媒體,有別於傳統之行銷環境,在網際網路上消費者與媒體可以產生高度的互動,並且也可能產生虛擬經驗.本課程也從消費者行為理論出發,探討在網際網路環境下之消費者行為。課程以哈佛式個案討論為主。","schedule":"耿慶瑞 三次上課\n\n行銷策略個案\n　　哈佛商學院HBS Case1: 2010 Cola Wars Continue: Coke and Pepsi in the Twenty- First Century\n\n1. Why is the soft drink industry so profitable?\nCompare the economics of the concentrate business to the bottle business: why is the profitability so different?\nHow has the competition between Coke and Pepsi affected the industry’s profit?\nCan Coke and Pepsi sustain their profits in the wake of flattening demand and the glowing popularity in non-carbonated drink?\n\n\n哈佛商學院HBS: Case2:IKEA\n\n1.請分析採購家俱的消費者行為,通常消費者會有哪些困難?\n2.家俱業者提供哪些服務來解決困難?\n3.分析美國的家俱市場\n4.IKEA提供給消費者什麼價值?商業模式為何?\n5.IKEA如何在美國拓展市場?\n\n品牌溝通個案　　哈佛商學院HBS:Case 3 Dove\n1. What is a brand? Why does Unilever to want fewer of them? \n2. What was Dove’s market positioning in the 1950s? What is its positioning in 2007? \n3. How did Unilever organize to do product category management and brand management in Unilever before 2000? What was the corresponding structure after 2000? How was brand meaning controlled before 2000 and how is it controlled at th","scorePolicy":"二、評分方式:\n\n個案討論: 共3個，所有同學需繳交3個心得(哈佛商學院HBS個案)報告，於期末前繳交\n本課以個案討論為主，講課或文選討論為輔。上課前必須準備好當天要討論之個案與文選。學生須準備篇個案，須於上課前繳交一頁個案問題與答案之書面資料。","materials":"消費者行為  Consumer Behavior 洞察生活、掌握行銷  Life and Marketing\n \n作者 : 曾光華\n出版日期 : 105年","foreignLanguageTextbooks":false},{"name":"陳昱欣","email":"","latestUpdate":"2020-03-01 22:19:12","objective":"本課程整合心理學、社會學、 決策行為學等理論，介紹消費者的產品購買思維，以及產品消費行為，並討論企業如何應用消費 者行為分析的各項研究發現與理論，以提高行銷規劃與市場活動 效能。課程內容包括：1.消費購買的行為模式。2.消費行為的心理學與社會學基礎。3.消費者認知過程與心理發展。4.社會互動關係與購買行為。5.產品涉入對消費行為的影響。6.情境因素對消費行為的影響。7.態度的形成與改變。8.消費者行為分析在行銷管理的應用。學生修習本課程之後，將對行銷規劃之主要變數，如產品設計、零售企劃、廣告促銷、定價策略等，有一扎實的行為科學方面的理論基礎。\nThe purpose of the course is to help the student develop a good grasp of the variables that affect consumption and the implications of this knowledge for actual business decisions. Among the more specific goals, the course should improve the student's ability to: 1. Understand the sociological and psychological variables that shape the consumer decision process, 2. Identify various ways to segment a consumer market, 3. Examine the target market before making marketing-related decisions, 4. Identify new business opportunities, 5. Appreciate a variety of techniques for changing attitudes, 6. Learn how to maximize satisfaction and customer loyalty, and 7. Apply a knowledge of consumer behavior to a variety of entities ranging from non-profit organizations to e-commerce.","schedule":"課程進度：\n第一週 消費者行為學導論及課程說明（大綱、評分標準、報告規定）\n第二週 消費者的需求與動機(購前)\n第三週 研究消費者怎樣購買(購中)\n第四週 消費者購買後行為(購後)\n第五週 清明節(補假)\n第六週 消費者心理學\n第七週 行銷個案：行銷產品策略定位(哈佛個案)\n第八週 消費者的價值觀與自我(Self)\n第九週 期中報告  \n第十週 行銷個案：廣告策略(哈佛個案)\n第十一週  消費者旅程落實到消費體驗\n第十二週  新經濟型態下的消費者行為\n第十三週  參考群體與從眾效應\n第十四週  行銷個案：品牌行銷與口碑行銷 (哈佛個案)\n第十五週  數位世代的消費者行為\n第十六週  跨世代的消費習性進化\n第十七週  端午節(補假)\n第十八週  期末報告","scorePolicy":"哈佛個案每人要寫一頁A4心得(針對問題回答): 寫3個個案\nCase1: IKEA(宜家侵入美國514-C07中文版)\nCase2 : 2010 Cola Wars Continue: Coke and Pepsi in the Twenty- First Century( 2010年可樂大戰之續714- C04中文版)\nCase3  Dove（多芬：一個品牌的發展歷程514-C03中文版）\n\n成績考核方式\n期中報告：40％\n期末報告：40％\n課堂報告與討論：20%（包含出席與學習態度）","materials":"消費者行為 汪志堅編著 全華出版社","foreignLanguageTextbooks":false}]
