[{"name":"吳南葳","email":"nwwu@mail.ntut.edu.tw","latestUpdate":"2020-03-02 15:27:06","objective":"This course is based on historical development of architectures. According to the development of the history in Taiwan, several cultural times can be defined. This course will introduce every topical of architectures, as followers：historical studies of Taiwan Architectures, early historical architecture, architectures of high mountain peoples, architectures of lower mountain peoples, architectures from Nederland and Spain, architectures from China, architectures from Europe, Japanese architectures, and modern architectures.","schedule":"1.　　Introduction to the course, clarification of historiography, periodization and systems of knowledges\n2.　　-1 Pre-historic architecture\n-2 Austronesian people and architecture: indigenous people before the 17th Century\n3.　　Dutch and Spanish occupation and architecture in the 17th Century\n4.　　Religious space of Han people\n5.　　Inhabitant settlements of Han people\n6.　　Grand residences of Han people\n7.　　Western style architecture during the Qing Dynasty\n8.　　introduction to Japanese modern architecture\n9.　　Mid-term week: students’ discussions of topics and outlines of final reports\n10.　　Improvement of construction materials and techniques during the Japanese colonial period\n11.　　Architectural development under vernacular consideration during the Japanese colonial period\n12.　　Western style architecture in colonial Taiwan\n13.　　Traditional Japanese architecture in colonial Taiwan\n14.　　Modernism after the Second World War\n15.　　New Chinese Classical Style architecture after the Second World War\n16.　　Regionalism after the Second World War\n17.　　Diverse development after the Second World War\n18.　　Final week: final report","scorePolicy":"Attendance 20%\nParticipation 30%\niIn-class Presentation 20%\nresearch thesis 30%\n\nParticipation: every student needs to prepare a brief introduction to the social background of one cultural period of time (1 for 17th. C. European influences, 1 for 17th. C. to 19th. C. China, 1 for Japan before 1895, 1 for Japanese colonialism, 1 for modernism from western, 1 for Chinese origin before and after 1945, 1 for regionalism)\n\nMid-term presentation\nIn the first half of the courses, students have to outline their interests of Taiwanese architecture in certain approaches. They might be forms, structural systems, materials, particular types of architecture, etc. Students should present their plans of their final reports in the mid-term class about 10 minutes, in order to collect some feedback from colleagues and class instructor for further develop to achieve the final report.","materials":"Fu, Chao-Ching, 2014. A History of Modern Architecture in Taiwan. Taipei: Architectural Institute of Taiwan\nCaptivating History, 2019. History of Taiwan: A Captivating Guide to Taiwanese History and the Relationship with the People's Republic of China. CH Publications.\nDavison, Gary Marvin, 2003. A Short History of Taiwan: The Case for Independence. Praeger.\nSadler, A. L. 2011. Japanese Architecture: A Short History. Tuttle Classics.","foreignLanguageTextbooks":true}]
