[{"name":"彭光輝","email":"khpeng@ntut.edu.tw","latestUpdate":"2020-02-23 15:16:38","objective":"目前全世界超過一半以上的人口生活在城市，人數仍快速增加中，相伴而來的環境、經濟、社會與治理問題將如何處理？因此城市轉型是城市要繼續成長的必要過程，許多案例顯示創意城市是城市轉型的典範，可以作為城市轉型與再生的契機。創意城市是近年來先進國家鼓勵領導者、產業、市民從己身城市內思考、規劃、發揮創意與實現城市創新的觀念，以啟發城市找到自身的發展潛能，結合當地文化資產及地方特色，經由城市發展規劃提升創意經濟及城市的競爭力。本課程以文化創意、產業創新及城市規劃為主軸，包括研究創意城市定義、特徵、條件、構成、指標、類型、評估的基礎，進而探討與文化創意、產業創新、城市發展規劃的關連，並參考國內外城市的創新與再生案例，他們是如何在城市議題上思考、規劃與執行富有創意的行動，又如何將行動運用於城市規劃。課程經由互動分析創意城市與城市規劃的關連及作法，討論可供借鏡的發展策略與方案。\nThe creative city is crucial to urban transformation in the future of our city. It means to encourage leaders,industries, and citizens to think, plan, create and realize urban innovation, inspired by the city to find their own development potential, combined with local cultural assets and characteristics, to enhance the creative economy through urban development planning and the city's competitiveness. The course aims at framing cultural creativity, industrial innovation and urban planning as main thoughts on the basis of research. Literature review including definition, characteristics, conditions, indicators, types of assessment, and then to explore with the cases of innovation and regeneration around the world. How they think urban issues, planning and implementation on creative actions, and how the actions used in urban planning.Courses via interactive analysis among the creative city,urban planning and practices,to figure out development strategies and programs available to learn.","schedule":"1.課程與概念介紹Course Description and Concept of Creative Cities\n2.創意城市的緣起與未來The Origin and Future of Creative Cities\n3.城市變遷與創意動能Urban Change and Creative Momentum\n4.創意城市相關理論Theories of Creative Cities\n5.創意城市的研究方法Research Methods in Creative Cities\n6.城市自明性：文化資源、治理和社區參與Identity in Cities: Cultural Resource, Governance and Community Engagement\n7.創意城市評估與新指標Creative City Assessment and New Indicators\n8.創意城市的主要議題Critical Issues of Creative Cities\n9.創意產業和創意城市Creative Industries and Creative Cities\n10.創意城市政策與文化導向城市復甦Creative City Policy and Cultural Renaissance\n11.文化和創意城市規劃專題Special Topics in Culture and Creative City Planning\n12.創意城市基礎設施與公共藝術Creative City Infrastructure and Public Art\n13.創意城市生命力與創意街區Creative Vitality and Creative Neighborhoods\n14.創意城市網絡與案例介紹Creative Cities Network and Case Study\n15.學生期末報告Final Presentation","scorePolicy":"1.上課互動情形（30%）：閱讀主要的參考文獻、上課聽講、參與課堂討論\n2.課堂報告（30%）：所選的主題進行文獻閱讀或專題研究，並作一次課堂報告\n3.學期報告（40%）：依課堂報告內容以及師生所提意見，修撰學期報告完稿（依論文格式撰寫，文長12號字約10-12頁）","materials":"1.楊幼蘭譯，創意城市: 打造城市創意生活圈的思考技術(Landry, Charles, The Creative City: A Toolkit for Urban Innovation)，城邦，2011\n2.劉維公，創意台灣的前瞻規劃與對策研究，行政院經濟建設委員會，2004\n3.葉晉嘉，各國創意城市指標的比較性研究，城市發展，第九期\n4.周志龍，文化、地方發展與城市規劃，國土及公共治理季刊，第六卷第二期，2018\n5.丘昌泰．呂育誠，創意城市治理新思維，臺北市政府公務人員訓練處，2012\n6.邱淑宜、林文一，建構創意城市－臺北市在政策論述上的迷思與限制，地理學報，第72期，57-84(2014)\n7.Landry, Charles, 創意臺北，勢在必行，臺北市都市更新處，2012\n8.黃舒楣，創意城市的代價，City GREE N綠雜誌2012年8月 Vol.18\n9.國家文化藝術基金會，文化創意產業實務全書，商周，2004\n10.傅振焜譯，創意新貴: 城市與創意階級 (Florida, Richard, Cities and the creative class)，台北: 寶鼎\n11.創意城市- LaVie 設計改變世界 https://www.wowlavie.com/SubChannelP2/M01G/2\n12.Landry, Charles, The Creative City: A Toolkit for Urban Innovation, London: Earthscan, 2008.\n13.Landry, Charles, The Art of City-Making, London: Earthscan, 2006.\n14.Florida, Richard, Cities and the creative class, New York : Routledge, 2005.\n15.Antonina M. Simeti, The 'Creative City': Moving from Ideas to Planning Practice, Massachusetts Institute of Technology, 2006.\n16.Sydney of City, Creative City: Cultural Policy and Action Plan 2014 - 2024, Sydney of City, 2014.\n17.Larqvist, Hannah, FREE BERLIN! Enable urban space for creativity, inspired by free space in Berlin, Chalmers University of Technology, 2015.\n18.European Colloquium on Culture, Creativity and Economy, European Colloquium on Culture, Creativity and Economy (CCE) Working Paper Compendium, 2017.\n19.Edited by Girard, L. F., Sustainable City and Creativity: Promoting Creative Urban Initiatives, Ashgate, 2011.\n20.The UNESCO Creative Cities Network (UCCN), https://en.unesco.org/creative-cities/home\n21.上課隨機提供教材","foreignLanguageTextbooks":true}]
