[{"name":"李禮仲","email":"Lawrencelee61@hotmail.com","latestUpdate":"2020-03-20 10:51:06","objective":"法學概論，顧名思義是在介紹法律原理，以啟發學生法學研究的興趣。然而，法學涵蓋的層面甚廣，法學緒論的課程，只能大略介紹各種法律的共通原理，就繁駁的法律現象，作綜合的引說，俾使初學法律的人，不僅能粗知「實定法」的共通原則，還可藉此原則來培養法律見解和修養，執簡馭繁，因而體會法律的性質、內涵和理念。\n有關本課程的教授方式，擬先介紹法律的基概念及原理，並以答問之方式訓練學生邏輯反思的能力，同時輔以日常屢見之法律實例問題。如此，學生不僅可以可以學習正確的法律觀念和知識，並可培養縝密思辨的能力，將課堂上所習得的知識應用落實在日常生活中，以達保障並維護自己及他人權益之目的。\nIntroduction of Law is to introduce the theory of law and to promote students' interest to study law. Since the field of law is very broad but the time is limited, this course can briefly explain common principles of law, complex phenomena of law, etc. The main purpose of this course is to let students catch the concept of common principles of \"lex scripta.\"  Also, this course aims to promote students' knowledge about law, thus cultivating their spirit of abiding by law.  This course will introduce the basic concept and theory of law first. Then students will be given logical training through discussion.  Besides, the general cases and problems of law will be covered as well. Through this course, students can not only get correct concepts of law, but learn to protect their/others' right.","schedule":"1　　導論\n說明本課程的進行方式，分組討論腦筋急轉彎的內容（上此一課程的學生要有發表意見並討論的勇氣，至少要透過這堂課培養這樣的習慣）另外，同學要學習使用遠距教學網，培養學習利用科技並結合不同資源幫助自己學習法學的能力。\n2　　法律的定義、法律與其他社會規範的關係（小組分組與討論時間）\n3　　法律的定義、法律與其他社會規範的關係（小組分組與討論時間）\n4　　法律的定義、法律與其他社會規範的關係（小組分組與討論時間）\n5　　我國法律如何來的將來何去何從，他跟其他世界各國的法制的相互關係為何？\n（交第一次指定作業：上法律課程的第一星期的經驗、觀察與感想）\n6　　我們如何認識法律：法律的分類-為何要區分公法或私法，這在現代法律體系中的必要性如何？區分標準何在？區分的實益如何？訴訟時，如何決定去打民事官司或刑事官司或行政官司？\n7　　我們如何認識法律：法律的分類-為何要區分公法或私法，這在現代法律體系中的必要性如何？區分標準何在？區分的實益如何？訴訟時，如何決定去打民事官司或刑事官司或行政官司？\n8　　法律（廣義）之訂定、公佈、修正及廢止\n國家的法律如何被訂定出來或被修正（討論憲法的改革：制憲或修憲的爭論意義何在？親屬法的修正與性別平等教育法的訂定經驗說明。\n9　　期中考: 這個測驗主要要瞭解同學對於法學緒論課程中所談的內容作一個測驗\n測驗分數佔學期成績30%\n10　　法律的適\n一個人碰到一件事情時？如何在各種法律規定中找到可以適用的法律？這些法律又可以如何被解釋與使用法律解釋的方法、法律論證的問題（三段論夠用嗎？）\n11　　法律的解釋、法律漏洞問題、什麼是武器？刀、槍是武器？原子筆、絲襪或者硫酸是否為武器？什麼叫做性交？口交、肛交是否為性交？什麼是不能人道？（親屬法？）什麼是被詐欺、脅迫？誰是輕率、無經驗的人可以主張法律上的權利（民法74條）法律漏洞是什麼？法律有漏洞嗎？用手機攝影他人的生活隱密是否犯罪？妨害秘密罪為什麼要被定下來？\n（交第二份報告：請寫下你學習法律的生涯規劃並說明為何如此選擇）\n12　　法律的解釋、法律漏洞問題、什麼是武器？刀、槍是武器？原子筆、絲襪或者硫酸是否為武器？什麼叫做性交？口交、肛交是否為性交？什麼是不能人道？（親屬法？）什麼是被詐欺、脅迫？誰是輕率、無經驗的人可以主張法律上的權利（民法74條）法律漏洞是什麼？法律有漏洞嗎？用手機攝影他人的生活隱密是否犯罪？妨害秘密罪為什麼要被定下來？\n（交第三份報告：請寫下你學習法律的生涯規劃並說明為何如此選擇）\n13　　法律與審判\n你曾經看過法院的審判嗎？你想過如果自己是審判者，要如何進行審判才能查明真相，適用法律？如果你是被審判者？你希望這個審判制度應該是一個什麼樣的制度。陪審制度跟台灣的審判制度的關係如何？在電視上看到的美國的審判跟台灣的審判有何不同？\n14　　法律與審判\n你曾經看過法院的審判嗎？你想過如果自己是審判者，要如何進行審判才能查明真相，適用法律？如果你是被審判者？你希望這個審判制度應該是一個什麼樣的制度。陪審制度跟台灣的審判制度的關係如何？在電視上看到的美國的審判跟台灣的審判有何不同？\n15　　法與制裁\n國家的法律規定如何制裁違背法律者？制裁的方法有哪些？民事損害賠償？（財產上的賠償、精神上的賠償有何不同？）無效或可撤銷是否是一種制裁？\n刑法上的制裁有死刑、無期徒刑、有期徒刑、拘役或罰金（有期徒刑跟拘役的分別在哪裡？）\n行政上的制裁：你接過違反交通規則的罰單嗎？你接過其他的處罰規定嗎？學校對於你的操行成績以及記過嘉獎制度是否屬於一種行政制裁。\n人民對於國家制裁的決定一定要接受嗎？在確定之前可以改變的可能在哪裡？\n16　　法律教育（法律人的各種可能發展)\n一個受法律教育的人想要在法律學系學習到什麼？個人的努力方向是什麼？法律教育只是教出一批法官、律師與檢察官嗎？你還知道哪些可能？法官、律師、檢察官的生活如何你知道嗎？\n17. 法律教育（法律人的各種可能發展)\n一個受法律教育的人想要在法律學系學習到什麼？個人的努力方向是什麼？法律教育只是教出一批法官、律師與檢察官嗎？你還知道哪些可能？法官、律師、檢察官的生活如何你知道嗎？\n18. 期末考: 這個測驗主要要瞭解同學對於法學緒論課程中所談的內容作一個測驗\n測驗分數佔學期成績40%","scorePolicy":"由同學就上課過程討論的內容做簡單的書面報告兩份 交報告的時間請看上課進度（報告成績佔百分之三十）\n期中測驗 佔百分之三十\n期中測驗 佔百分之四十","materials":"陳惠馨 法學概論 108年新版 三民書局（第十六版）\n上課補充講義","foreignLanguageTextbooks":false}]
