[{"name":"廖啟宏","email":"jimigit@ms55.hinet.net","latestUpdate":"2019-12-19 13:41:05","objective":"本課程的設計，旨在和修課同學一齊品味中西愛情文學精典；內容擬以文學為主推及其它藝術媒介，並以主題單元來進行。\n愛情不妨有四季：或者像春天，來無影、去無蹤；或者像夏天，三心兩意、不知何去何從；或者像秋天，需要費心照料，才能瓜熟蒂落；或者像冬天，非得寒天飲冰、苦苦守候。我們在文學的夢土裡走過四季，隨著虛構的情事歡笑、悲哭；而在釋卷之餘，返回現世的我們獲得新的體悟──關於愛情、文學，還有自我。\n鑑於修課同學青春正好，不日且將投入社會；故本課程除了涵泳愛情文學經典，更欲取之與現實人生作結合，反思從愛情、兩性、婚姻、社會到家國等多元議題。最終，或許我們都能以愛之名、行愛之實，一往無前。\nThe course to be taught to lead students know the love of ancient and modern literature; content encompasses poems, prose, fiction, drama, music, video works, etc., and will be conducted in a manner theme unit. From this, clear astringent taste ambiguous, fresh and moving, epic, unforgettable, deeply grieved and other types of love literature. \nIn the process, the works convey mood, thoughts, aspirations, etc. to produce spiritual resonance. Thus to discover: In dust, there is no time and space to pass emotional estrangement, is matched heart.\nAs the students is young, will start his life being so understanding of the course in addition to the love of ancient and modern literature, and our desire to make a real life connection. Thus thinking love, marriage, gender, home country, society, politics and other topics. Thus, the nature and essence of seeking love.","schedule":"1．課程介紹「愛情．文學．人生（自我）」\n2．（彷彿）春天的戀情之一\n3．（彷彿）春天的戀情之二\n4．（彷彿）春天的戀情之三\n5．（彷彿）春夏之交的戀情\n6．（彷彿）夏天的戀情之一\n7．（彷彿）夏天的戀情之二\n8．（彷彿）夏天的戀情之三\n9．期中考週（繳交報告）\n10．（彷彿）秋天的戀情之一\n11．（彷彿）秋天的戀情之二\n12．（彷彿）秋天的戀情之三\n13．（彷彿）秋天的戀情之四\n14．（彷彿）冬天的戀情之一\n15．（彷彿）冬天的戀情之二\n16．（彷彿）冬天的戀情之三\n17．（彷彿）冬天的戀情之四\n18．期末考週（考試）","scorePolicy":"學期報告：40％\n學期考試：40％\n出席記錄：20％","materials":"《契訶夫短篇小說選》，契訶夫著，汝龍譯，桂冠，1995\n《侯麥．四季的故事》，黃慧鳳編著，麥田，2002\n《夏日之戀》，亨利－皮耶．侯歇著，夏宇譯，麥田，2002\n《國境之南，太陽之西》，村上春樹著，賴明珠譯，時報，1993\n《開往中國的慢船》，村上春樹著，賴明珠譯，時報，1998\n《萊辛頓的幽靈》，村上春樹著，賴明珠譯，時報，1998\n《電視人》，村上春樹著，賴明珠譯，時報，2000\n《偷窺》，格雷安，葛林著，鍾鈴譯，時報，1985\n《愛情的盡頭》，格雷安．葛林著，盧玉譯，時報，2001\n《可笑的愛》，米蘭．昆德拉著，邱瑞鑾譯，皇冠，1999\n《困難的愛》，伊塔羅．卡爾維諾著，倪安宇譯，時報，2015\n《浮世男女》，瑞蒙．卡佛著，張定綺譯，1998\n《紐約客故事集Ⅰ＆Ⅱ＆Ⅲ》，安．比蒂著，周瑋譯，時報，2016-2019\n《清潔女工手記》，露西亞．柏林著，謝靜雯、林士棻譯，聯經，2018\n《一百首愛的十四行詩》，聶魯達著，陳黎、張芬齡譯，1999\n《黃金時代》，王小波著，聯經，1992","foreignLanguageTextbooks":false}]
