[{"name":"曾俊儒","email":"ktseng@pddlab.org","latestUpdate":"2020-02-11 16:45:15","objective":"本課程主要是要讓學生對醫學設計之基本理論及實務內容有所認識。了解一個健康醫療產品/系統/服務從醫學及使用者需求的思維、如何發展到設計理念之形成、設計內容之導入實現、工程技術之開發、原型機製作、臨床前測試、臨床試驗、醫療認證、及工業管理等層次。讓學生能掌握跨領域之醫學設計原理，並教導如何藉由創新產品設計與開發方法引導醫學背景與設計背景之專業人士合作以瞭解開發市場上成功之健康醫療產品之關鍵課題、針對臨床服務需求，提出健康醫療創新解決方案。進而產生創新健康醫療產品。\nThis course aims to teach postgraduate students to understand the basic theory and practice of medical design. Learn about the health and medical products/ systems/ services from the discovery of medical and user needs to the design of innovative healthcare products, which include the topics of how to generate the design concepts, understand the user and market needs, develop the engineering technologies and prototype, design pre-clinical testing and clinical trials, obtain medical certification and plan industrial management. To enable students to master the principles of interdisciplinary medical design, and teach them how to use innovative product design and development approach to guide professionals in medical backgrounds and design backgrounds to understand the key issues in developing successful health medical products in the market and address the needs of clinical services, propose innovative solutions for health care, and develop innovative health and medical products.","schedule":"The primary learning goals of the course are summarised as follows:\n-Expecting students to complete a 5-10 page paper to propose a novel medical product/service. \n-Explaining the unmet clinical need that should be fulfilled. Why is there a need for this product/service?\n-Positioning the competitive landscape for your product/service. What existing commercial products/services will compete with your proposed product/service in the marketplace? How is your new product/service better?\n-Describing the technical breakthrough that must be overcome. Are there new technologies that must be developed to make the product a success?\n-Describing the regulatory pathway for the product/service. Will you need to conduct pre-clinical studies or a clinical trial?\n-Explaining the pricing for the new product/service. How do you justify the price, and how will it compare in pricing to competitive products/services?","scorePolicy":"Assignments:　　50%\nClass participation:   25%\nFinal presentation:　　25%","materials":"•　　Reading pack.\n•　　Paul G. Yock, Stefanos Zenios, Josh Makower, Todd J. Brinton, Uday N. Kumar, F. T. Jay Watkins, Lyn Denend, Thomas M. Krummel, Christine Q. Kurihara (2015) “Biodesign: The Process of Innovating Medical Technologies,” 2ND Edition, Cambridge University Press.","foreignLanguageTextbooks":true}]
