[{"name":"范書愷","email":"morrisfan@ntut.edu.tw","latestUpdate":"2016-02-03 18:23:03","objective":"An introduction to probability theory and mathematical statistics that emphasizes the probabilistic foundations required to understand probability models and statistical methods. Topics covered will include the probability axioms, basic combinatorics, discrete and continuous random variables, probability distributions, mathematical expectation, common families of probability distributions, the central limit theorem, inferential statistics, and some useful statistical methods. The course objectives are to enable students having the ability to\n1. Summarize and present data; \n2. Describe probability distributions and compute probabilities; \n3. Conduct point and interval estimation; \n4. Make inference about populations; \n5. Apply these concepts in practice with emphasis on engineering applications, engineering design, decision making and management sciences.","schedule":"1　　Estimation \n2　　Estimation \n3　　Estimation \n4　　Test of Statistical Hypotheses \n5　　Test of Statistical Hypotheses \n6　　Test of Statistical Hypotheses \n7　　Nonparametric Methods \n8　　Homework Assignments Review and Recapitulation \n9　　Midterm Exam\n10　　Review of Midterm Exam\n11　　Nonparametric Methods \n12　　Nonparametric Methods \n13　　Bayesian Methods \n14　　Bayesian Methods \n15　　Statistical Theory\n16　　Statistical Theory &amp; Homework Assignments Review \n17　　Final Exam","scorePolicy":"Grading Policy: 30% Homework Assignments &amp; Quizzes, 30% Midterm, 30% Final, 10% Participation","materials":"[Textbook]\n\nRobert V. Hogg and Elliot A. Tanis (2010), Probability and Statistical Inference, Eighth Edition, Pearson Prentice Hall, Upper Saddle River, New Jersey 07458. ISBN-13: 978-0-321-63635-5 \n\n[References]\n\nMorris H. Degroot and Mark J. Schervish (2011), Probability and Statistics, Fourth Edition, Pearson Addison Wesley. ISBN-13:  9780321500465\n\nDouglas C. Montgomery and George C. Runger (2010), Applied Statistics and Probability for Engineers, Fifth Edition, John Wiley. ISBN 978-0-470-05304-1","foreignLanguageTextbooks":false}]
