[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2015-12-27 23:34:38","objective":"教導學生閱讀囊括全球議題的文章，並藉由文章的內容作技巧的訓練，字彙的建構，語言的解析，及思維的啟發。課中延展活動將閱讀內容與聽力、會話、寫作做進一步的連結，並引導學生將所學做有效的應用。","schedule":"Course Aims:\n\nThe course provides students with skill-based instructions in learning how to read literary and cultural texts. Desired learning outcomes include reading skill development, vocabulary building, language analysis, and critical thinking. Reading materials encompass a variety of viewpoints on global topics centered on social issues, the environment, psychology, business, and technology. Extended activities are designed to encourage students to go beyond the assigned materials, and to put what they have acquired from the readings into listening, speaking and writing practices.\n\nFocus for Spring 2016:  Narrative and Ideology   \n\nWeek 1: Introduction: Aspects of Narrative\nBoccaccio, The Decameron (First Story, Sixth Day)\n\nWeek 2: The Story of the Stone (Chapter 1) \n\nWeek 3: No Class (International Conference)\n\nWeek 4: Henry James’s short story\nQuiz 1\n\nWeek 5: 21 Grams  (2003, dir. Alejandro González Iñárritu)\n[Presentation Groups 1 and 2]\n\nWeek 6: 21 Grams (continued)  \n[Presentation Group 3]\n\nWeek 7: No Class on Wed (university holiday)\nThurs: Roland Barthes’s S/Z \nQuiz 2\n\nWeek 8: Barthes (continued)\n[Presentation Group 4]\n\nWeek 9: Mid-term exam \n\nWeek 10: The Day He Arrives (dir. Hong Sang-soo) \n[Presentation Group 5]\n\nWeek 11: The Day He Arrives (Continued) \n[Presentation Group 6]\n\nWeek 12: Freud’s Beyond the Pleasure Principle + Peter Brooks’s Reading for the Plot\n[Presentation Group 7]\nQuiz 3\n\nWeek 13: Mulholland Drive  (dir. David Lynch) \n[Presentation Group 8]\n\nWeek 14: Mulholland Drive  (Continued)\n[Presentation Group 9]\n\nWeek 15: Borges’s ‘Garden of Forking Paths’\n[Presentation Group 10]\nQuiz 4\n\nWeek 16: No class on Thursday (public holiday) \n\nWeek 17: Final Examination \n\nWeek 18: Off-campus activity","scorePolicy":"Teaching Approach:\n\nStudents are required to read all the assigned texts, including literary, filmic and theoretical works. They should attend lectures, participate in discussions in tutorials, take a mid-term examination, give a group presentation, and write an essay. \n\nAssessment:\n\nParticipation and Quizzes　　　　20%\nGroup Presentation　　　　　　　　20%\nMid-term exam　　　　　　　　　　30%\nFinal exam　　　　　　　　　　30%    \n　　　　　　　　　　　　　　100%","materials":"Bibliography 　　\nAll materials will be provided on the e-Learning platform except the one marked with a {*}. Screenings will be scheduled for films.\n\n21 Grams. Dir. Alejandro González Iñárritu. 2003.\nBarthes, Roland. S/Z. Trans. Trans. Richard Miller. Farrar, Straus and Giroux, 1975. \nBoccaccio, Giovanni. The Decameron. Trans. G.H. McWilliam. Harmondsworth: Penguin, 2003.\nBorges, Jorge Luis.  ‘Garden of Forking Paths.’ Labyrinths. Trans. James E. Irby. New Directions Publishing Corp. 1962. \nBrooks, Peter. Reading for the Plot. Harvard: Harvard University Press, 1992.\nCao, Xueqin. The Story of the Stone (or Hong Lou Meng or Dream of the Red Chamber) 5 vols. Trans. David Hawkes and John Minford. Harmondsworth: Penguin, 1973-87.\nFreud, Sigmund. Beyond the Pleasure Principle. Trans. and Ed. James Strachey. CreateSpace Independent Publishing Platform, 2010. \n* James, Henry. ‘The Turn of the Screw,’ The Turn of the Screw and The Aspern Papers. Harmondsworth: Penguin, 2003. \nMulholland Drive. Dir., Prod.’ and Writ. David Lynch. Cine. Peter Deming. 2001. \nThe Day He Arrives. Dir. and Writ. Hong Sang-soo. 2011.\n\n* Students should buy a copy of this book. \n\nReferences:\n\nBenjamin, Walter. ‘The Storyteller. Illuminations. Trans. Harry Zohn. Cape, 1970.\nFoucault, Michel. ‘What is an Author?’ Language: Counter-Memory, Practice. New York: Cornell University Press, 1977.\nGenette, Gerard. Narrative and Discourse. Trans. Jane E. Lewin. New York: Cornell University Press, 1988. \nMiller, D.A. Narrative and its Discontent. Princeton: Princeton University Press, 1981.\nTambling, Jeremy. Narrative and Ideology. Buckingham: Open University Press, 1991.","foreignLanguageTextbooks":false}]
