[{"name":"邱于芸","email":"vickiyuyunchiu@gmail.com","latestUpdate":"2016-02-16 13:41:38","objective":"當代的許多社會問題，源自於無法預測或控制的科技發展；科技解決了舊問題，卻不自覺地帶來了新麻煩。本課程以科學技術和社會變遷作為出發點，導入思想研究、科學哲學與社會學中的科技社會研究（science, technology and society, STS）之思考模式，旨在讓本課程之學生重新思索，甚至批判科技對於當代社會的各方面影響。本課程先以科學哲學與STS之基礎論述作為導論，輔以思想史之簡易說明，帶領學生依照人、事、時、地、物等六方面切入不同個案，最後鼓勵其提出自我之看法與想像。國立臺北科技大學創校之初，目的便在於培訓、教育與推廣科學技術之人才，進而回饋社會。而隨著科學與知識不斷累積與發展，從早期工程人員進而延伸至管理與商業人才，各學門之分工與專業程度日漸精細、進步，師生在未來勢必會遇到前所未有之跨領域問題。故本課程以科學技術對於社會變遷為起點，實為本校之特色量身訂做之整合性課程，提供一個動態的世界藍圖，而非一成不變的道路。此課程之開設，有助於學生評估自身之所學，進而強化生涯規劃與面對社會變動之能力。","schedule":"週次　　日期　　課程主題　　　　　　　　　　　　內容\n1　　2/23　　課程簡介　　　　　　　　　　　　鐵達尼號\n2　　3/1　　問題比答案重要的世界　　　　　　　　學習的歷程\n3*　　3/8　　社會需要科技，還是科技需要社會?　　　　　　愛迪生\n4　　3/15　　哲學、科學與科學哲學　　　　　　　　客觀知識如何可能?\n5　　3/22　　星座與巫術　　　　　　　　　　新科學的興起\n6　　3/29　　現代與傳統　　　　　　　　　　科技與文化的兩難\n7　　4/5　　清明節放假　　\n8　　4/12　　現代性效率時代　　　　　　　　　　工業機械化\n9　　4/19　　女性主義　　　　　　　　　　　　洗衣機與兩性平權\n10　　4/26　　期中考周　　\n11　　5/3　　點子時代　　　　　　　　　　　　現代藝術與設計 \n12　　5/10　　地域與空間　　　　　　　　　　老齡化與少子化\n13*　　5/17　　崩解與解構　　　　　　　　　　天災還是人禍 看見台灣\n14*　　5/24　　期末報告調研　　\n16　　5/31　　階級革命　　　　　　　　　　　　21世紀資本論；快速時尚、平價奢華\n17　　6/7　　內觀時代　　　　　　　　　　　　快樂是甚麼?\n18　　6/14　　期末報告","scorePolicy":"1.　　課堂出席 5%\n2.　　課堂參與 15% \n3.　　期中作業 40%\n4.　　期末考 40%","materials":"範例考題:\n\n答題說明: 請由下列的主題中, 針對a 或 b 問題，選擇一題進行申論, 答案的完整度應與答題時間兩小時為基準, 答題字數不限, 恕不接受簡答題式的回答。請載明題號與子標題：如　一ｂ；四a或六a…  並且在每一張試題紙上寫上姓名與學號, 並與題目一併裝訂繳回。\n計分方式: 切題性(40%) 分析能力(30%) 對問題的脈絡與理解(15%) 完整度(10%) 創新洞見(5%) \n提醒與建議：請看清楚所有題目，並且回想本學期所著重的議題相關性，選擇適合自己的題目，在答題之前，為力求完整性與時間管理，建議可以先列出大綱（列為評分項目）再行作答。\n\n問題：\n\n一、　　導論：你為何想要一台蘋果?\na. 請解釋[需要為發明之母]的含意, 並用一個例子來說明這句話在現代科技發展所影響的文化變遷, 並且, 請用另一個例子解釋這句話為甚麼可能是個誤解? \nb. 貨櫃的誕生如何改變世界? 試舉例人類社會如何抗拒這個改變?\n\n二、　　社會需要科技，還是科技需要社會：醫學、疾病與藥物\na. 請問[疾病]的定義是甚麼?它是被科技發明的，還是人類尋求永生的產物？這個結論如何影響當今安樂死的議題？\nb. 請用一個完整論述說明[為何病人不見了?]的可能性。並且以一個案例說明這個論述可能是個謬誤?\n\n三、　　哲學、科學與科學哲學：眼見不一定為憑的世界、談科學之典範\na. 人類已經可以登陸月球，但為何還要慶祝中秋節？請用一個案例討論宗教儀式與科技的關係。\nb. 因為科技發展改變了世界觀，所以世界上沒有永遠的真理，試著舉一個相反的案例說明科技始終來自於人性。\n\n四、　　科學與社會(專家政治、科學社群、論文審查與發表制度)\na. 約定俗成的制度都是由一小部分的人決定的規格與標準，菁英制度決定了人類的生活樣態，請用一個案例說明社會中常見的文化認知是由一群專業人士所主宰。\nb. 二手菸傷害身體，所以全世界應該全面禁止菸草公司生產香菸，請說明這個論述為何尚未被所有國家執行？\n\n五、　　科技與知識傳播(新媒體、名嘴、中醫與偽科學)\na. [科學中藥]是甚麼？健保納入科學中藥的給付如何顯示科技已帶動文化變遷?這個現象如何解釋媽祖遶境的聖事？\nb. 甚麼是知識經濟？愛迪生對人類的貢獻如何改變世界？這項重大的創舉對於知識經濟的興起有甚麼關係？\n\n六、　　科技發展的性別議題(玉米田裡的先知與日本女性幹細胞科學家的故事 、工程師與科技業為何女性較少、臉書的女性主管與女權抬頭) \na.　　科技發展有性別嗎? 科技發展有其自我意識嗎？機器人將如何取代人類為萬物主宰的地位？試舉兩個當今案例做為立論基礎。\nb.　　洗衣機的發明帶給我們社會文化需求甚麼樣的認識?這樣的改變還可以被利用在我們對[工業革命]的理解上嗎?如果可以,為什麼? 如果不能?那原因又是為何?\n\n七、　　從宗教、信仰到文明(儀式的興起、墮胎議題、同性戀與多元成家)\na. 性別差異是社會議題還是科學議題？請就婚姻家庭制度的演化與變遷討論兩性平權的問題。\nb. 為何球場與賽事是神聖的?世界盃足球賽與奧運盛事轉播至今仍成為世界舉目焦點有何關聯？\n\n八、　　科技與專業倫理(醫療社會學、學術政治倫理如韓國的幹細胞造假事件 、專利與著作權) \na. 複製人，冷凍卵子與桃莉羊如何改變人類對於個體獨特性的想像？人類是否應該繼續發展生物科技？\nb. 因為一個社會的富裕仰賴科技創新發展的能量與成果，國家發展政策應該減低所有沒有科學根據的研究。請問這樣的理解將會對文化與社會有甚麼重大影響？","foreignLanguageTextbooks":false}]
