[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2016-02-19 14:33:49","objective":"Department of English, National Taipei University of Technology\nCourse Syllabus 2014\n\nCourse Title:　　　　Teaching English for Specific Purposes (Evening MA) \nCredit Hours:　　　　3\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw\nOffice: 　　        General Education Building Rm.805 / Extension: 3941, 3901\nTerm Offered:　　　　Spring, 2016\nRequired Text:    Ideas and Options in English for Specific Purposes by Helen Basturkmen / Mahwah, N.J. : Lawrence Erlbaum Associates, Publishers , 2006 (electronic resource at NTUT Library)\nRecommended Text: Developing Courses in English for Specific Purposes by Helen Basturkmen / Basingstoke : Palgrave Macmillan , 2010 (electronic resource at NTUT Library)\n\nCourse Description: When it comes to ESL/EFL teaching and learning, traditional teaching methodology has its major emphasis on theories of teaching and learning general English. Methods and approaches in the ESL/EFL classrooms, material implementation, course design and assessment do not meet the demands in the fast-growing market for function-specific professional English teaching personnel. While the pedagogical courses acknowledges the importance and necessity of preparing students with the ESL / EFL teaching basics, it is particularly our mission to expand the ESL /EFL horizon into a new realm of ESP/EPP-specific teaching contexts with the necessary tools, resources, and techniques in implementing ESP/ EPP courses. Quarrying out knowledge from both English pedagogy and ESP / EPP theories and applications, students are prepared to establish the tailor-developed ESP / EPP programs for specific industries and corporations for pre-career training and on-the-job trainings as well.　　This course centers on a wide range of methods and materials used in courses of English for specific purposes. Students are expected to be prepared with a strong theoretical background in second language acquisition and English-language pedagogy.","schedule":"Wk 1-3 Orientation/ Issues in ESP Course Design\nWk 4-6 Language Systems, Uses, and Descriptions\nWk 7-9 ESP Teaching Methodologies and Objectives\nWk 10-12 ESP Course Development \nWk 13-15 Case Studies in ESP Courses \nWk 16-18 Review","scorePolicy":"Course Requirements: Students are expected to fulfill the following course requirements:\n(1)　　Read and present book chapters \n(2)　　Design and present ESP lesson plans (for at least 3 content areas w/ 6 lessons)\n\nGrading Policy: \n(1)　　Presentations of books chapters 30%\n(2)　　ESP course design / evaluation of course materials 20%\n(3)    Term paper 30%\n(3)　　Attendance 20%","materials":"Ideas and Options in English for Specific Purposes by Helen Basturkmen / Mahwah, N.J. : Lawrence Erlbaum Associates, Publishers , 2006 (electronic resource at NTUT Library)\n               Developing Courses in English for Specific Purposes by Helen Basturkmen / Basingstoke : Palgrave Macmillan , 2010 (electronic resource at NTUT Library)\nResource Books for Teachers: English for Specific Purposes by Keith Harding / Oxford University Press 2007","foreignLanguageTextbooks":false}]
