[{"name":"洪媽益","email":"miguelt@ms19.hinet.net","latestUpdate":"2016-02-22 08:55:54","objective":"本課程旨在探討英語與漢語在結構與功能上的主要異同，涵蓋語意、語音、音韻、詞法、句法、語用與社會文化等特徵，同時類比與對比這兩個語言使用何種語言策略達到溝通的目的。本課程之本質在訓練學生往後如何解決語言對比分析的問題，在學期結束時，學生需要針對英語與漢語某一特定語言現象獨立完成對比分析。This course aims at investigating the major structural and functional differences and similarities of Chinese and English. The differences and similarities identified include semantic, phonetic, phonological, morphological, syntactic, pragmatic, and sociocultural features. We will also compare and contrast linguistic strategies the two languages employ to achieve communicative purposes. This course is exploratory in itself, directed toward providing students with keys to tackling linguistic issues they may encounter in their future careers. Students will be required to present an ultimate Chinese-English contrastive analysis in a certain aspect at the end of this course.","schedule":"Weekly Schedule\nFebruary 22 Orientation\nFebruary 29 Holiday, no classes\nMarch 7 Presentations Group A\nMarch 14 Presentations Group B\nImportant: Discuss topic and materials for final paper with instructor by March 14.\nMarch 21 Time/Tense and Temporal Expressions in English and Chinese\nMarch 28 Aspect in English and Chinese\nApril 4 no classes\nApril 11 Modification in English and Chinese\nApril 14 (Thursday) CA presentations on Tense/Aspect\nApril 18 (Group A)\nApril 25 (Group B)\nApril 28 (Thursday) CA presentations on Modification\nMay 2/9 no classes\nMay 16 (Group A)\nMay 19 (Thursday) CA presentations on Referential Expressions\nMay 23 (Group B), Final Project due\n\nOptional Topics: Referential expressions, Clause types and word order, Written discourse, Speech Acts, Yes-No Questions and Interrogatives, Metaphors and Talking about Thinking\n\n　　Time/Tense and Temporal Expression\nLongman Ch 6.2\nLi et al. Ch 3.5.2 (Types of time relation)\nTime adverbials in Chinese and English. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 14-30\nThe unmarked or the simple present. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 31-95\nThe expression of past time. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 96-146\nChen, Jenn-Yeu Chen and Padraig G. O’Seaghdha. 2013. Do Mandarin and English speakers think about time differently? Review of existing evidence and some new data. Journal of Chinese Linguistics 41.2: 338-358.\nLi, Wendan. 2012. Temporal and aspectual references in Mandarin Chinese. Journal of Pragmatics 44.14: 2045-2066.\nLin, Jo-wang. 2003. Temporal reference in Mandarin Chinese. Journal of East Asian Linguistics 12: 259-311.\nRiddle, Elizabeth. 1986. The meaning and discourse function of the past tense in English. TESOL Quarterly 20: 267-286.\nSmith, Carlota S. and Mary S. Erbaugh. 2005. Temporal interpretation in Mandarin Chinese. Linguistics 43.4: 713-756.\nYu, Ning. 2012. The metaphorical orientation of time in Chinese. Journal of Pragmatics 44.10: 1335-1354.\n\n　　Aspect\nLongman 6.3\nLi and Thompson. Ch 6\nLi et al. Ch 3.5.3/4/5\nThe description of continuance. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 147-166.\nThe description of completion. In Lin, 2001. Time, tense, and aspect: Chinese and English in contrast. 167-184.\nBinnick, Robert I. 2005. The markers of habitual aspect in English. Journal of English Linguistics 33.4: 339-369.\nNesselhauf, Nadja and Ute Romer. 2007. Lexical-grammatical patterns in English: The case of the progressive with future time reference. International Journal of Corpus Linguistics 12.3: 297-333.\nSybesma, Rint. 1997. Why Chinese verb-LE is a resultative predicate. Journal of East Asian Linguistics 6: 215-261.\nSzmrecsanyi, Benedikt. 2003. BE GOING TO versus WILL/SHALL: Does syntax matter? Journal of English Linguistics 31: 295-323.\nTagliamonte, Sali and Helen Lawrence. 2000. “I used to dance, but I don’t dance now”: The habitual past in English. Journal of English Linguistics 28.4: 324-353.\nYeh, Meng. 1996. An analysis of the experiential GUO in Mandarin: A temporal quantifier. Journal of East Asian Linguistics 5: 151-182.\nBender, Emily. 2000. The syntax of Mandarin BA: Reconsidering the verbal analysis. Journal of East Asian Linguistics 9: 105-145.\nLiu, Feng-hsi. 1997. An aspectual analysis of BA. Journal of East Asian Linguistics 6: 51-99.\n\n　　Modification (Relative clauses) \nLongman Ch 8.7 (Postmodification)\nLongman 7.1\nLi et al. Ch 2.1.1 (Non-Action Verbs)\nLi et al. Ch 3.2.2 (Non-Action Verbs)\n曹逢甫。1993。漢語及英語的關係子句：形式及功用的對比研究。應用語言學的探討，108-131。\nRadden and Dirven. 2007. CEngGram. 7: Qualifying things: Modifiers. 141-170.\nFeist, Jim. 2009. Premodifier order in English nominal phrases: A semantic account. Cognitive Linguistics 20.2: 301-340.\nFox, Barbara A. and Sandra A. Thompson. 1990. A","scorePolicy":"Paper presentations 50% (RQs, Lit Rev, Methodology, Results, Implications, FS)\nCA presentations 30%\nFinal project 20%","materials":"journal articles assigned","foreignLanguageTextbooks":false}]
