[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2015-12-27 23:37:40","objective":"科學與技術是了解這個世界和我們自己一項強而有力的工具，而許多作家們對於這樣的情況也在他們的作品中給予各式各樣的回應。在這個課程中我們將學習到作家們如何在他們的作品中使用文學藝術技巧來詮釋與解讀科技與現代文學的相互作用；人類與大自然的關係；以及人類當前的處境。修習這門課程的學生並不需要具備對科學有嚴格的基礎訓練與知識，只要具備強烈的好奇心和求知慾。在課程的一開始我們將藉由閱讀相關作品讓大家熟悉一些重要的議題。課程的中心主題除了針對科學技術與文學的相互關係外，我們也將焦點放在分析文學作品上。我們將繼續探索文學形式與內容的關聯。同時，我們也將利用現代科技在課堂上練習文學作品的即興創作。學生們一開始分析一段正文的內容。然後他們利用這些片段重新組合成一篇新的文本。接著，在這些文本內建立新的超連結︰每當文本被閱讀時，讀者能有多種選擇來閱讀並且使正文成為一個完全新的實體。","schedule":"Course Description:\n\nBy close readings of cultural texts including literature, film, architecture and the city, this course examines the relationship between technology, culture and modernity, exploring the extent to which technology could be regarded as neutral and progressive. Informed by critical theory, this course examines how technology shapes our ways of seeing, conception of ourselves, and relationship with others. \n\nTeaching Plan (subject to change):\n\n1. Introduction: On Technology, the Mechanical and Modernity\nModern Times (dir. Charlie Chaplin) (Cf. Raymond Williams, Key Words)\n\n2. The Mechanical Age\nDickens, Hard Times (chs. 1-2)\nThomas Carlyle, ‘Signs of the Times’ (1829)\n\n3. No Class (International Conference)\n\n4. The Mechanical Age (continued)\n\n5. ‘Dirty’ and ‘Clean’ Technology\nD. H. Lawrence, ‘Odour of Chrysanthemums’\nE.T.A. Hoffmann, ‘The Mines of Falun’\n\n6. Technology and Modernity \nHeidegger, ‘Question Concerning Technology’\n\n7. No Class (University Holiday)\n\n8. The Machine and the Body I\nFreud, ‘The Uncanny’\nE.T.A. Hoffmann (1776-1822), ‘The Sandman’\nThomas Hobbes on ‘the Artificial Man’\nDescartes on mind and body\n\n9. Mid-term\n\n10. The Machine and the Body II\nKafka, ‘In the Penal Colony’\nI’m a Cyborg, But That’s OK (dir. Park Chan-wook)\nCf. Donna Haraway, ‘A Cyborg Manifesto’\n\n11. Dystopia and the Critiques to Technology\nAldous Huxley, Brave New World (chapter 1)\nMon Oncle (‘My Uncle’) (1958, dir. Jacques Tati)\n\n12. Art and Politics\nBenjamin, ‘The Work of Art in Age of Its Technological Reproducibility’\n\n13. The Machine and the Body III: \nShakespeare, Coriolanus *\nCf. Lacan, ‘The Mirror Stage’\n\n14. The Machine and the Body IV: \nMary Shelley, Frankenstein, or The Modern Prometheus (1818) *\nEasy Rider (1969, dir. Dennis Hopper) \nCf. - Barthes, Camera Lucida\n- Foucault, Discipline and Punish\n\n15-16. Technology and the Global War\nDr. Strangelove (1964, dir. Stanley Kubrick) or\nEmpire of the Sun (1987, dir. Steven Spielberg) \nGeorg Trakl, ‘Grodek’\nHenry Reed, ‘Naming of Parts’ \nCf. - Umberto Eco, Travels in Hyper Reality \n- Spivak, ‘Terror: A Speech After 9-11’\n- T. J. Clark et al (eds.), Afflicted Powers \n\n17. Group Presentation \n\n18. Final Paper Due","scorePolicy":"Assessment: \n\nParticipation　　　　　　　　　　 　　　　　　　　　　　　10%\nMid-term paper　　　　　　　　　　　　　　　　　　　　30%\nGroup presentation 　　　　　　　　　　　　　　　　　　　　20%\nFinal paper 　　　　　　　　　　　　　　　　　　　　　　40%\n　　　　　　　　　　　　　　　　　　　　　　　　　　   100%　　\n\nMid-term paper:\nWrite an essay on a topic discussed during weeks 1-8. Possible essay titles will be announced during the lectures. The essay should focus on one cultural text and at least one cultural critic studied. A draft should be turned in for comment by week 7.\n\nFinal paper:\nWrite an essay on a topic discussed after the mid-term, during weeks 10-16. The essay should focus on one cultural text. You may compare it with a text discussed during weeks 1-8, but do not repeat yourself. A draft should be turned for comment by week 16.\n\nGroup Presentation:\nThe group should consist of 2-3 students. \nOption 1: to present on a chosen topic which allows critical analysis of an everyday issue concerning technology. Possible topics will be announced during the lectures. \nOption 2: to make a short film (around 15 min.) on a topic agreed by the instructor.\n\nSite visit:\nA site visit may be arranged. Possible activities: Museum visit, city field study, including shopping mall, park, library, transportation network, etc. Details to be confirmed.\n\nA Note on Plagiarism: \nPlease make sure your works are original and contain no unacknowledged materials. Plagiarism is an offense in the academic field, and Taipei Tech. takes it very seriously. The minimum penalty for plagiarism is a straight Fail in the course and the case may be passed on to the university for record.","materials":"References \n\nRequired texts: \nThe majority of the required texts will be provided in extracts. Students should get hold of those which are marked (*).\n\n* Shakespeare. Coriolanus (Arden Shakespeare Third Series). Ed. Philip Brockbank. London: Bloomsbury Academic, 1976. Or The Tragedy of Coriolanus. Ed. R. B. Parker. Oxford: Oxford University Press, 1998. (Both the Arden and Oxford versions are fine.)\n* Shelley, Mary. Frankenstein, or The Modern Prometheus. Harmondsworth, Penguin, 1992.\nBarthes, Roland. Camera Lucida. Trans. Richard Howard. London: Vintage, 1993.\nBenjamin, Walter. ‘The Work of Art in Age of Its Technological Reproducibility.’ Walter Benjamin: Selected Writings (Vol. 3). Trans. Edmund Jephcott and Harry Zohn. Ed. Howard Eiland and Michael W. Jennings. London: Fontana Press, 1968. 101-33.\nBoal, Iain A. Clark and T. J. Clark et al (eds.). Afflicted Powers: Capital and Spectacle in a New Age of War. New York: Verso, 2005.\nCarlyle, Thomas. ‘Signs of the Times.’ Complete Works of Thomas Carlyle (20 Vols): Critical and Miscellaneous Essays, Vol. 1 (1901). Dana Estes/Charles Lauriat, 1884. 462-88.\nCrary, Jonathan. Techniques of the Observer: On Vision and Modernity in the 19th Century. October Books: MIT Press, 1992.\nDickens, Charles. Hard Times, ed. Kate Klint (Harmondsworth: Penguin, 2003).\nDr. Strangelove (1964). Dir. Stanley Kubrick.\nEasy Rider (1969). Dir. Dennis Hopper.\nEco, Umberto. Travels in Hyper Reality: Essays. Trans. William Weaver. San Diego: Harcourt Brace Jovanovich, 1986.\nEmpire of the Sun (1987). Dir. Steven Spielberg.\nFoucault, Michel. Discipline and Punish. Trans. Alan Sheridan. New York: Vintage, 1977.\nFreud, Sigmund. ‘The Uncanny.’ Penguin Freud 14: Art and Literature. Trans. Albert Dickson. Harmondsworth: Penguin, 1990. 335-76.\nHansen, Miriam Bratu. Cinema and Experience: Siegfried Kracauer, Walter Benjamin, and Theodor W. Adorno. Berkeley, Los Angeles and London: University of California Press, 2012.\nHaraway, Donna J. ‘A Cyborg Manifesto.’ Simians, Cyborgs, and Women: the Reinvention of Nature. London: Free Association, 1991.\nHeidegger, Martin. The Question Concerning Technology, and other Essays, trans. William Lovitt. New York: Harper &amp; Row, 1977.\nHobbes, Thomas. Leviathan. Ed. C. B. MacPherson. Harmondsworth: Penguin, 1968.\nHoffmann, E.T.A. ‘The Mines of Falun.’ The Best Tales of Hoffmann. Ed. E.F. Bleiler. Trans. Major Alexander Ewing. New York: Dover, 1967. 285-307.\nHoffmann, E.T.A. ‘The Sandman.’ Ed. E.F. Bleiler. Trans. J. T. Bealby. New York: Dover, 1967.\nHuxley, Aldous. Brave New World. London: Pearson Education, 2008. Chapter 1.\nI’m a Cyborg, but that’s OK (2006). Dir. Park Chan-wook\nKafka, Franz. ‘In the Penal Colony.’ The Transformation and Other Story. Trans. and Ed. Malcolm Pasley. Harmondsworth: Penguin, 1992. 127-53.\nLacan, Jacques. ‘The Mirror Stage.’ Écrits. Trans. Bruce Fink. London: W.W. Norton, 2006.\nLawrence, D. H. ‘Odour of Chrysanthemums.’ Odour of Chrysanthemums. Harmondsworth: Penguin, 2011.\nLevin, David Michael (ed.). Modernity and the Hegemony of Vision. Berkeley: University of California Press, 1993.\nModern Times (1936). Dir. Charles Chaplin\nMon Oncle (‘My Uncle’) (1958). Dir. Jacques Tati.\nPostman, Neil. Technopoly: The Surrender of Culture to Technology. New York: Knopf, 1992. \nReed, Henry. ‘Naming of Parts.’ Henry Reed: Collected Poems. Carcanet Press, 2007.\nSpivak, Gayatri Chakravorty. ‘Terror: A Speech After 9-11’ boundary 2 31.2 (2004): 81-111.\nTrakl, Georg. ‘Grodek.’ The Poems of Georg Trakl. Trans. Margitt Lehbert. Wiltshire: Cromwell Press, 2007. \n\nSecondary sources:\n\nAdorno, Theodor. ‘On the Fetish-character in Music and the Regression of Listening.’ \nBarthes, Roland. ‘The Grain of the Voice.’ Music, Image, Text, trans. Stephen Health. London: Fontana Press, 1977.\nBenjamin, Walter. ‘The Author as Producer,’ Reflections. Ed. Peter Demetz. New York: Schocken, 1978.\nBerger, John. Ways of Se","foreignLanguageTextbooks":false}]
