[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2016-02-22 13:36:12","objective":"應用語言學與文化應用研究相關專題，以邀請專家專題演講，及論文討論為重點，參與者透過密集討論等方式，可以有效率地交換意見，獲得更深入而廣泛的體驗。　　\nCourse Description:  The course aims to develop graduate students’ scholarly strength in in-depth analysis to prepare for research in their respective disciplines. By centering its focus on critical, analytical and research-oriented development through student/researcher-initiated reading and discussions of scholarly studies, this course requires all students to work on a potential research topic, presenting selected papers of review as well as the draft thesis proposal.","schedule":"Presentations as scheduled.","scorePolicy":"Course Requirements: \n(1) All students are required to give one presentation of selected papers. Papers presented MUST be part of the thesis literature review. Papers and research studies to be presented must hold high scholarly value. Approximately thirty to forty minutes will be allotted for each paper presentation, and ten to twenty minutes for Q &amp; A. In addition to the paper presentation, students also need to present his/her thesis plan with the time frame and draft proposal. The draft proposal MUST include the introductory chapter and a part of selected literature review in writing to be submitted two weeks after the presentation.\n(2) An outline of selected papers and the presentation materials need to be distributed to the class prior to the presentation (hardcopy or digital). The student presenter is also responsible for hosting the discussion. \n(4) Class will meet every other week for 8 times in the spring semester. All sessions will start from 1:10 to 3:00 P.M. on Monday afternoon. Each class meeting will allow two presentations.\n(5) Students who fail to present as scheduled will forfeit the right of presentation and result in the loss of the 30% semester grade.\n\nGrading Policy:　　Selected research topic discussion / presentation 40% \nThesis planning and draft proposal (in writing) 30% \n　　 Class Attendance 30% (10% reduction for each unexcused absence)","materials":"N/A","foreignLanguageTextbooks":false}]
