[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2016-02-19 14:53:08","objective":"Course Title:　　　　English for Economics and International Business (經貿英文)\nCredit Hours:　　　　3\nTerm Offered:　　　　Spring, 2016\nInstructor’s Name:　　Dr. Yun-Hua Yang\nContact E-Mail:　　yhyang@ntut.edu.tw \nOffice 　　　　　　General Education Building Rm#805\nOffice Hours:　　　　By Appointment \nRequired Text:    (1) Marketing Genius  by Peter Fisk \n                (2) Compiled Handouts \n(3) Selected business journal articles  \nCourse Description: The course is designed for English-major students who wish to increase their knowledge in business-related issues and expertise in future business practice.  All students enrolled in this course are expected to be equipped with an advanced level of English proficiency as well as basic knowledge of effective business communication. This course covers fundamental business concepts, important current business events, essential business terms, and comprehensive language used in business practice. Business content vocabulary incorporating several main business categories / disciplines will be introduced. Also, students are required to read the current issues of several prestigious business publications, including but not limited to, Fortune, The Economist, BusinessWeek, Wall Street Journal and the New York Times. The \nCourse Objectives:  This course centers its focus on understanding business context in English, and it aims to help the students:\n(1)　　learn about business through the medium of English \n(2)　　promote high level of awareness of the business climate \n(3)　　improve reading comprehension of articles relating to business\n(4)　　develop functional business language in English","schedule":"Weekly Syllabus (TBA)","scorePolicy":"Student Assignments and Class Activities:\n　　　　　　　　(A) Students are obligated to \n1)　　present course units as assigned with annotated handouts. (40 mins)\n2)　　serve as commentators on student colleagues’ presentation\n3)　　write at least TWO short essays to present in class for discussions and Q&amp;A \n (B) During the semester, 1-2 guest speaker(s) will be invited to lecture particular business topics and share their expertise in their respective business practice (Schedule /Topic TBA)  \n\nGrading Policy:　　1) Final Exam 30%\n　　　　　　　　2) Presentation 20%\n　　　　　　　　3) Shor essays 20%\n　　　　　　　　4) Attendance  30%　　\nLeaves and Absences: 　　1) Any AWOL will result in the penalty of 10% semester grade deduction.\n　　　　　　　　  　　2) Penalty-waiver can be granted for any absence w/ official document at the \n　　　　　　　　　　   　　 instructor’s discretion. It is only limited for one time in the entire semester. \nShould there be any major incidents and issues, special considerations will be given after thorough discussion with the student(s) and the class advisor(s). \n3) Each lateness, after the instructor finishes the second-round roll call, will result in the penalty of 5% semester grade deduction. \nPresentation Guideline(s):　　1) Each presentation will be delivered by students as assigned. The time duration for each is 40-50 mins, which will be followed by the presentation commentators for another 10 mins. Both presenters and commentators need to work collaboratively prior to class delivery. \n　　2) All presentations will be delivered by PPT, and need to include the unit components assigned. Main emphasis needs to be contributed to the analysis of the unit case study. (See textbook)\n　　3) Each presentation group is responsible to provide a list of unit content vocabulary edited bilingually, which later will be tested. \n　　4) Both the draft and revised PPT files, and the unit vocabulary list need to be submitted on the compact disc to the instructor a week after the presentation.","materials":"Required Text:    (1) Marketing Genius by Peter Fisk \n                (2) Compiled Handouts of Business Content Vocabulary \n(3) Selected business journal articles","foreignLanguageTextbooks":false}]
