[{"name":"丁原智","email":"ycding@ntut.edu.tw","latestUpdate":"2014-01-13 14:56:43","objective":"炸藥與爆破工程應用於岩石爆破，為採礦及大地工程的基本作業。本課程之目的在介紹炸藥性質、炸藥反應原理、爆材特性及應用、爆破設計及施工並兼及爆破作業之環境控制。","schedule":"第1週 Introduction \n第2週 Basic knowledge of explosive and blasting\n第3週- makeup of a commercial explosive and basic properties and hazards of commercial\n第4週- Understand and recognise the common explosives available in the surface mining industry.\n第5週 Assess the safety aspects, benefits and limitations of these explosives to make the correct selection of explosives for a particular application\n第6週Blast design - Understand basic blasting terms and Identify the rock characteristics that affect selection of explosives and blast design.\n第7週Blast design - Understand the principles of how explosives break rock, Calculate a powder factor for any given blast\n第8週 Blast design - Design a blast from basic principles\n第9週 期中考\n第10週 Prime and charge - Outline the key safe handling procedures for loading and priming explosives\n第11週 Prime and charge - Decide what size, type and number of primers to use under different conditions and Safely charge explosives into blastholes\n第12週 Initiation system hook up - \n第13週Shotfiring\n第14週 Storage and transport\n第15 週Environmental control of blasting - Recognise the effect of major rock jointing and structure on blast performance and specify ways of avoiding problems\n第16 週Environmental control of blasting - modify blasthole charging to suit the geology\n第17週 Misfire treatment\n第18週 期末考","scorePolicy":"期中考40%, 期末考40%, 平時成績20%","materials":"炸藥與爆破講義","foreignLanguageTextbooks":false},{"name":"湯銘文","email":"Tang0543@ms28.hinet.net","latestUpdate":"2014-05-09 19:45:21","objective":"炸藥與爆破工程應用於岩石爆破，為採礦及大地工程的基本作業。本課程之目的在介紹炸藥性質、炸藥反應原理、爆材特性及應用、爆破設計及施工並兼及爆破作業之環境控制。","schedule":"第1週 Introduction.\n第2週 Basic knowledge of explosive and blasting .\n第3週- makeup of a commercial explosive and basic properties and hazards of commercial.\n第4週- Understand and recognize the common explosives available in the surface mining industry. \n第5週 Assess the safety aspects, benefits and limitations of these explosives to make the correct selection of explosives for a particular application.\n第6週Blast design - Understand basic blasting terms and Identify the rock characteristics that affect selection of explosives and blast design. \n第7週Blast design - Understand the principles of how explosives break rock, Calculate a powder factor for any given blast. \n第8週 Blast design - Design a blast from basic principles. \n第9週 期中考\n第10週 Prime and charge - Outline the key safe handling procedures for loading and priming explosives. \n第11週 Prime and charge - Decide what size, type and number of primers to use under different conditions and Safely charge explosives into blastholes. \n第12週 Initiation system hook up. \n第13週Shot firing.\n第14週 Storage and transport.\n第15 週Environmental control of blasting - Recognize the effect of major rock jointing and structure on blast performance and specify ways of avoiding problems. \n第16 週Environmental control of blasting - modify blast hole charging to suit the geology. \n第17週 Misfire treatment.\n第18週 期末考","scorePolicy":"期中考30%\n期末考40%\n平時成績30%","materials":"1. National Park Service Handbook for the Storage, Transportation, Training for  xplosives Use, and Handling of Explosives.\n2.新編爆破工程實用技術大全，主編：郭進平、聶興信，光明日報出版社。","foreignLanguageTextbooks":false}]
