[{"name":"饒餘杏","email":"Yvonnejao1@gmail.com","latestUpdate":"2014-02-13 11:44:45","objective":"本課程以輔助建築設計操作中的環境分析方法與實務練習為目的，培養學生具備具體的分析工具、方法、程序洞察力。課程將以實際操作為主，透過田野調查實務的練習強化學生的環境知識與體驗能力。\n〔一〕　　目標：提供學生有關生態(永續)土地發展、建築、景觀環境調查、收集、分析之基本理論、規劃設計方法及實務經驗，使學生在執行建築規劃、設計過程時具有分析、整合、應用基地環境條件，規劃設計能融合環境之永續土地發展、建築體及改善周邊環境景觀之規劃設計能力，以完成具有創意及生態基礎之永續建築、景觀規劃、設計實務能力。\n〔二〕　　方法：本課程一學期時間分為兩個部分，其一為生態環境調查、收集、分析、應用方法與永續土地發展、建築、景觀原理及規劃設計方法論、工作流程及實務操作規劃、設計案例介紹。\n          另部分為環境調查、收集、分析應用於實務永續建築及景觀規劃設計，使學生畢業後對生態(永續) 土地發展、建築、景觀領域之理論及實務方面，皆有所了解，以因應時代發展。 \n〔三〕 教授重點內容：\n       一 ．生態(永續)土地發展、建築、景觀環境調查、收集、分析應用範圍\n       二 ．生態(永續)土地發展、建築、景觀原理及規劃設計方法論\n       三 ．生態(永續)土地發展、建築、景觀規劃、設計 工作流程    \n       四 ．生態(永續)土地發展、建築、景觀資料蒐集、調查及分析\n              1.自然環境因子\n              2.實質環境因子\n              3.社會環境因(ㄧㄣ)子(ㄗ)\n              4.歷史文化因子\n       五 ．環境資源在生態(永續)環境中的功能     \n       六 ．環境調查、收集、分析應用於生態(永續)土地發展、建築、景觀規劃設計實務操作案例\n              1. 生態(永續)土地發展、建築、景觀規劃實務操作案例\n              2. 生態(永續)建築、景觀設計實務操作案例       \n       七 ．以一實際建築基地要求學生練習作基地生態環境資料收集、分析及土地發展、永續建築、景觀規劃、設計\n( I ) Objectives : To provide architectural students with the basic knowledge and practical experience of \n             Date collection, site survey and analysis , related with Sustainable Land development, \n             Architecture, Landscape Planning &amp; Design . \nTo train the student with the abilities to integrate the environmental data &amp; analysis in Eco(Sustainable) Land Development, Architecture and Landscape Planning &amp; Design.\n( II ) Method : This course contains two parts in one semester,. Part one will be the Introduction of the Eco (Sustainable) Land development, Architecture and Landscape Planning &amp; Design Methodology, Working Procedure, Data Collection, Site survey and Analysis, Functionally uses of Natural resources, on sustainable planning &amp; design . Another part Will be the Land development, Architecture and landscape planning and design Practical cases study. \n( III ) This course will focus on the major Topics : \n     1 . The Work Scope of Eco (sustainable) Architecture and Landscape Planning and Design\n     2 . Eco (Sustainable) Land development, Architecture and Landscape Theory and Planning &amp; Design Methodology \n     3 . The Working Procedure of Sustainable Land Development, Architecture and Landscape Planning and Design  \n     4 . Data Collection, Site survey and Analysis of Eco (Sustainable) Land Development, Architecture and Landscape Planning and Design\n         (1) .Natural factors\n         (2) .Physical factors\n         (3) .Social factors\n         (4) .Historic &amp; Cultural factors\n     5 . Functional uses of natural resources in sustainable projects\n     6 . Environmental Date collection, site survey and analysis , used on Eco (Sustainable) Land Development, Architecture and Landscape planning and design practice cases study\n(1)　　.Eco (Sustainable) Land development, Architecture and Landscape planning practice cases study\n(2)　　.Eco (sustainable) Architecture and Landscape design practice cases study\n     7. Choosing an architectural site let students to practice the Eco (Sustainable) Land Development,Architecture and Landscape Data Collection, Site Analysis, planning and Design","schedule":"2/20 第一週\n      一 . 課程大綱及課程進度內容、評分方式\n2/27第二週\n      二 ．生態(永續)土地發展、建築、景觀規劃設計應用範圍\n3/6~3/20第三~五週\n      三 ．生態(永續)土地發展、建築、景觀原理及規劃設計方法論\n3/27第六週\n      四 ．生態(永續)土地發展、建築、景觀規劃、設計 工作流程\n4/10~5/22第八 ~十四週(第十週繳期中基地調查、收集、分析報告)\n      五 ．生態(永續)土地發展、建築、景觀資料蒐集、調查及分析\n          1.自然環境因子\n          2.實質環境因子\n          3.社會環境因子\n          4.歷史文化因子\n5/29第十五週\n       六 ．環境資源在生態(永續)環境中的功能\n6/5~6/12第十六~十七週\n       七 ．生態(永續)土地發展、建築、景觀規劃設計實務操作案例\n          1. 生態(永續)土地發展、建築、景觀規劃實務操作案例\n          2. 生態(永續)建築、景觀設計實務操作案例\n6/19第十八週繳期末土地發展、永續建築及景觀規劃設計報告","scorePolicy":"1.上課點名 佔40%\n2.期中基地環境調查、收集、分析報告 佔30%\n3.期末永續建築及景觀規畫、設計報告  佔30%","materials":"1.　　生態土地使用規劃/2000年1月/黃書禮著/詹氏書局\n2.　　基地分析/2001年民國95年/James A. LaGro, Jr.原著，顏麗蓉、王偉譯/六合出版社                                                \n3.  築綠/2010年12月/陳宗鵠著/詹氏書局\n4.  Design with Nature//1992 /Ian L. McHarg /John Wiley &amp; Sons, Inc.\n   道法自然/2002年3月/郭瓊瑩、饒餘杏等15人譯/田園城市文化事業有限公司\n5.  Plants/people/and environmental quality/1972年/Gary O. Robinette/ U. S. Department of the Interior, \n   National Park Service, Washington, D. C.\n 6.  Landscape Planning for Energy Conservation /1977/Charles McClenon, Gary O. Robinette/ Environmental Design Press","foreignLanguageTextbooks":false}]
