[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2014-02-17 16:46:18","objective":"COURSE OVERVIEW\n\nBritish and American Fiction is a fascinating and inexhaustible subject. In this course, I hope to guide you through a general history of fiction in British and American writing. The books we are reading (Jane Eyre [1847], Alice’s Adventures in Wonderland [1865], Huckleberry Finn [1884], and 1984 [1949]), are books that people in Britain or the U.S. would be nearly as likely to pick up for fun as they would be to read them in class. They’re also books that almost everyone knows something about—even if individuals haven’t read the book. Knowing these books and the context they came out of will give you the ability to understand many ideas that are central to British and American identity and culture. \n\nIn addition to the main texts we read, in class we will do a general study of prose fiction from one of the first printed works in English, Malory’s Morte d’Arthur (printed by William Caxton in 1485) onward. Through informal investigations and in-class activities, you will learn the literary and historical context of the novel in each era. How has fiction changed from 1485 to the present? How did the purpose of writing change? How have tastes changed? And why are these changes important?     \n\nTEXTS\nJane Eyre (Charlotte Bronte)\nAlice’s Adventures in Wonderland and Through the Looking Glass (Lewis Carroll)\nHuckleberry Finn (Mark Twain)\n1984 (George Orwell)\n\nAdditional Readings will be provided in the Course Packet and or e-mailed to you.","schedule":"Please see the professor for this information as she uses a chart that cannot easily be uploaded. We will be reading sections of Gulliver's Travels in the second week, spending weeks three through eight on Jane Eyre and Alice in Wonderland, spending weeks eight through ten on Huckleberry Finn, and spending weeks eleven through fifteen on 1984. There is one paper (due week thirteen) and a final exam.","scorePolicy":"Grade Percentages:\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nIn-class Writing and Reading Quizzes: 30%\nPaper: 30%\nFinal: 25%\nIn-class Activities and Participation: 15%\n\nGrading Criteria:\nA　　Superior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\n\nB　　Achievement that is significantly above the level necessary to meet course requirements.\n\nC 　　Achievement that meets the course requirements in every respect. \n\nD 　　Achievement that fails to meet fully the course requirements. \n\nF 　　Achievement that is not worthy of credit. The only way to outright fail this course is through lack of effort and/or plagiarism. The student may not participate in classroom work. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.","materials":"　","foreignLanguageTextbooks":false}]
