[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2014-02-17 16:39:41","objective":"In this class, we will explore the fascinating subject of Victorian literature, the fiction, poetry, and nonfiction prose from Victoria’s long reign (1837–1901). Victorian novels are justly famous—authors experimented with complex plot interlacements and new narrative styles, but Victorian autobiographies, poetry, and expository prose have also had a profound impact inside and outside literary studies, with long-term effects on British and international law and on the disciplines of English, history, and science. By reading fiction, poetry, essays, dramas, and sections from autobiographies, students will gain a thorough understanding of this tumultuous era and of how Victorian concerns have continued to affect the way critics interpret literature today. Topics we will address include the industrial revolution, class conflict, rapid increases in literacy (which required more types of literature to be published in order to meet reader demand), women’s rights and women’s authorship, children’s literature, religious faith and religious doubt, nineteenth-century medievalisms, and the increasing importance of the British Empire. \n\nIn this class we will also be dealing with book history—with the idea that how a piece of writing is published matters when analyzing its contents. Thus, we will be reading one Victorian novel in its original serialized format, and we will take the time to examine the other essays that were published alongside this novel in Charles Dickens’s magazine All the Year Round. We will also be examining the value and role of the author in a society that both privileged anonymous publications and, contrarily, developed celebrity cults around popular authors. Students will do an individual project on a Victorian periodical of their choice and write two papers. All assignments are designed to develop students’ research and writing skills so that they can successfully complete their MA thesis.","schedule":"Please contact the professor for this information as she uses a chart format that can't be uploaded here. We will be reading works and sections of works by such authors as Caroline Norton, Charles Dickens, Christina Rossetti, Anthony Trollope, Wilkie Collins, George Eliot, Margaret Oliphant, Lewis Carroll, Gerard Manley Hopkins, Tennyson, E. Nesbit, Oscar Wilde, and James Barrie.","scorePolicy":"Students will be assessed in four main areas: (1) the quality of their participation in class discussions, (2) their responses during in-class writing and on quizzes (3) their Victorian periodicals presentation (4) their two course papers.  \n\nEffective Discussion Participation and Reading Notebook Quality: 15%\nQuizzes and In-Class Writing: 20%\nPresentation: 10%\nPapers: 55%\n\nI may modify these percentages at my discretion. If I do so, I will let you know.","materials":"　","foreignLanguageTextbooks":false}]
