[{"name":"陳秉訓","email":"cstr@ntut.edu.tw","latestUpdate":"2013-12-25 15:33:11","objective":"Module One: International law 101\nModule Two: IP treaties; IP provisions in FTAs\nModule Three: Case law\nModule Four: Six lecture series","schedule":"Week 1-Introduction: Understanding International IP law; Project assignments\n\nWeek 2-Taiwan and Sovereign State: (1) Xin Qiang, Mainland China’s Taiwan Policy Adjustments, 5(1) CHINA SECURITY 55 (2009); (2) Eric Ting-Lun Huang, The Modern Concept of Sovereignty, Statehood and Recognition: A Case Study of Taiwan, 16 N.Y. INT’L L. REV. 99 (2003); (3) Winston P. Nagan &amp; Aitza M. Haddad, Sovereignty in Theory and Practice, 13 SAN DIEGO INT’L L.J. 429 (2012).\n\nWeek 3-Law of Treaties: Text (http://www.gc.noaa.gov/documents/012780-vienna_treaty.pdf) (1) Chang-fa Lo, The Difference Between Treaty Interpretation and Treaty Application and the Possibility to Account for Non-WTO Treaties During WTO Treaty Interpretation, 22 IND. INT’L &amp; COMP. L. REV. 1 (2012); (2) James Thuo Gathii, The Legal Status of the Doha Declaration on TRIPS and Public Health Under the Vienna Convention on the Law of Treaties, 15 HARV. J.L. &amp; TECH. 291 (2002); (3) Rahim Moloo, When Actions Speak Louder Than Words: The Relevance of Subsequent Party Conduct to Treaty Interpretation, 31 BERKELEY J. INT’L L. 39 (2013).\n\nWeek 4- WTO, TRIPS, and WIPO: Lecture-WTO基本法制，施文貞教授（政治大學國際經營與貿易學系）\n\nWeek 5-WTO, TRIPS, and WIPO: Hwan Kim, The World Trade Organization Dispute Settlement System: China—Measures Affecting the Protection and Enforcement of Intellectual Property Rights, 23 N.Y. INT’L L. REV. 83 (2010) (describing the history of the WTO); Emir Aly Crowne, Fishing TRIPS: A Look at the History of the Agreement on Trade-Related Aspects of Intellectual Property, CREIGHTON INT’L &amp; COMP. L.J. 77 (2011); Zion H. Park, Comment, What the PCT Can Learn from Two African Systems, J. MARSHALL REV. INTELL. PROP. L. 693 (2007).\n\nWeek 6-Paris Convention; Berne Convention; Rome Convention; Phonograms Convention: Taiwan patent law and the compliance with the TRIPS and Paris Convention; 專利師考試之專利法規考題檢討。\n\nWeek 7-Paris Convention; Berne Convention; Rome Convention; Phonograms Convention: Graeme W. Austin, Intellectual Property Politics and the Private International Law of Copyright Ownership, 30 BROOK. J. INT’L L. 899 (2005) (Berne Convention); Jacob Zweig, Note, Fair Use as Free Speech Fundamental: How Copyright Law Creates a Conflict Between International Intellectual Property and Human Rights Treaties, 64 HASTINGS L.J. 1549 (2013) (fair use and TRIPS).\n\nWeek 8- Paris Convention; Berne Convention; Rome Convention; Phonograms Convention: Well-known mark protection; IP protection on performing arts. \n\nWeek 9-FTAs: Mohamed R. Hassanien, Bilateral WTO-Plus Free Trade Agreements in the Middle East: A Case Study of OFTA in the Post-TRIPS Era, 8 WAKE FOREST INTELL. PROP. L.J. 161, 170-71 (2008); Taiwan’s FTAs; China’s FTAs; Japan’s FTAs; Korea’s FTAs.\n\nWeek 10-ECFA: ECFA; CSAIPRPC; Pasha L. Hsieh, The China—Taiwan ECFA, Geopolitical Dimensions and WTO Law, 14 J. INT’L ECON. L. 121 (2011); Chi-An Chou, Comment, A Two-Edged Sword: The Economic Cooperation Framework Agreement between the Republic of China and the People’s Republic of China, 6 B.Y.U. INT’L L. &amp; MGMT. REV. 1 (2012); 陳秉訓（2012年12月），”Why the Economic Cooperation Framework Agreement Cannot Have Provisions Related to Intellectual Property?”，2012企業及財經法律學術研討會，張麗堂文教助學基金會和南台科技大學財經法律研究所主辦，2012年12月14日，台南市。\n\nWeek 11-EU Aspect: Kevin P. Mahne, A Unitary Patent and Unified Patent Court for the European Union: An Analysis of Europe’s Long Standing Attempt to Create a Supranational Patent System, 94 J. PAT. &amp; TRADEMARK OFF. SOC’Y 162 (2012); Patrick Coyle, Note, Uniform Patent Litigation in the European Union: An Analysis of the Viability of Recent Proposals Aimed at Unifying the European Patent Litigation System, 11 WASH. U. GLOBAL STUD. L. REV. 171 (2012).\n\nWeek 12- EU Aspect: Silvia Beltrametti, Evaluation of the Design Piracy Prohibition Act: Is the Cure Worse Than the Disease? An Analogy with Counterfeiting and a Comparison with the Protection Available in the","scorePolicy":"5頁FTA的IP條款分析報告。","materials":"1. 有幾次演講會在當週的星期二晚間舉辦。\n2. 因為增加了演講時間，白天的課有幾次會僅上兩小時。\n3. 本堂課以討論為主。教材最好於上課前都能讀過。\n4. 必須報名參加3月8日（六）的「 第14屆國際經貿法學發展學術研討會」。該研討會為八小時。本課程的兩小時課程至少會有八堂。","foreignLanguageTextbooks":false}]
