[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2014-02-17 16:51:01","objective":"In class we will do many activities involving listening, speaking, reading, and writing. Be prepared to speak in front of the class. In some weeks I may assign skits and/or oral presentations in addition to the homework from American Headway. I may also have you write short paragraphs in class. Depending on the purpose of this writing activity, I may or may not have you turn in your writing activity. (I do not tell you in advance whether I will collect a writing activity.) Please show yourself trustworthy in all areas by always doing your own work.","schedule":"Weeks 1–2: Unit Seven\nWeeks 3–4: Unit Eight\nWeeks 5–6: Unit Nine\nWeek Eight: Catch-up/Review\nWeek Nine: Midterm\nWeek 10–11: Unit Ten\nWeek 12–13: Unit Eleven\nWeek 14–15: Unit Twelve\nWeek 16: Catch-up/Review\nWeek 17: Oral or TBA\nWeek 18: Final","scorePolicy":"Homework: 23%\nQuizzes/Tests: 23%\nVocab Root Quizzes: 4% (every Wednesday) \nParticipation: 10%\nSkits and Presentations: 10%\nMidterm: 15% \nFinal: 15% (Note that we will be using TOIEC tests for the midterm and final, and you can practice at &lt;http://140.124.25.33/s/ntuteng/v3.6/en/practice-english-exams&gt;.)\n\nI may modify these grade percentages and this syllabus at my discretion. The midterm and final will always be worth 30% of your grade.","materials":"Required Text: \nAmerican Headway Level 5 (2nd edition), John and Liz Soars, Oxford\n\nRequired Materials:\n‧　　notebook with removable paper (or additional loose-leaf paper)\n‧　　dry-erase marker and cloth to be used as an eraser\n‧　　scissors\n\n\nPARTICIPATION\nYour participation is what makes or breaks this course. When you participate, everyone learns more and has more fun. Someone with a high grade in participation is engaged with class activities; takes academic honesty seriously and does all homework individually; stays focused and on task; takes notes; speaks exclusively, frequently, and thoughtfully in English; knows when to listen and when to speak; reads with expression and enthusiasm; is creative, enthusiastic, and audible during skits and presentations; is trustworthy; and interacts positively, helpfully, and tactfully with other class members. Remember, it’s okay to make mistakes. The goal is communication, and your questions and comments help other students. \n\nCLASS POLICIES\n‧　　Speak English. If you speak only in English, your participation grade will be high. If you speak mostly English, your participation grade will be passing. If you speak more Chinese than English, you will not receive a passing grade in participation. \n‧　　Please do not use any electronic devices in class. Electronic translators are okay (but not cell phones) provided you are only using them for translation. If you have your cell phone out or are using a computer or electronic device inappropriately, you may be marked absent and you will lose significant participation points. \n‧　　If you have a cell phone in your bag, make sure it is turned off.  \n‧　　Please by prompt. Lateness equals ½ absence. \n‧　　Students who have six unexcused absences (the equivalent of three weeks), twelve tardies, or the equivalent combination of absences and tardies, cannot pass the course. \n‧　　Please be present in both body and mind. Non-participation may lead to being marked absent. (If you are asleep, you will be marked absent.) Failure to bring course materials may lead to being marked absent and losing participation points.\n‧　　You are always responsible for knowing what happens during all class meetings. If you miss a class session, telephone or email a member of the class, and ask him/her what you missed and what you need to be ready for at the meeting to come. If it’s an excused absence, make sure to give me the proper form.","foreignLanguageTextbooks":false}]
