[{"name":"施欣文","email":"sharinschroeder@ntut.edu.tw","latestUpdate":"2014-02-17 17:02:24","objective":"In this semester, students will work more closely on making an argument suitable for an academic audience. The course will prepare them for future classes and their senior project as well as giving students general writing skills that they can apply in any future English writing. This course will help students organize and present ideas in clear, fluent, logical paragraphs. Students will learn to analyze their own voice, style, and word choice with the goal of becoming more creative at the same time as they learn to write more clearly. We will workshop papers in small groups and as a class, helping students analyze their own and other students’ writing. As necessary, we will review important grammatical points.","schedule":"Please see the professor as she uses a chart format for due dates that is difficult to upload. Formal papers are due in week nine, week fifteen, and week eighteen. You will also have many other drafts to write and library-based researching projects.","scorePolicy":"Grade Percentages:\n\nFormal Papers: 50%\nInformal Writing: 10%\nParticipation: 10%\nPeer Reviews: 5%\nHomework and quizzes: 25%\n\nI may modify these grade weights at my discretion. If I do so, I will let you know. \n\nGrading Criteria:\n\nA　　Superior work. Achievement that is outstanding relative to the level necessary to meet course requirements.\n\nB　　Achievement that is significantly above the level necessary to meet course requirements.\n\nC 　　Achievement that meets the course requirements in every respect. \n\nD 　　Achievement that fails to meet fully the course requirements. \n\nF 　　Achievement that is not worthy of credit. The only way to outright fail this course is through lack of effort. The student may not participate in classroom work or may be absent more than three times. Assignments are either (a) completed but not completed at a level of achievement that is not worthy of credit; (b) frequently late, thereby lowering the grade too significantly to give the student a chance to pass; or (c) never completed at all.","materials":"SUPPLIES\n‧　　Course Packet and/or e-mailed readings and handouts. Please always print these and bring them to class. Do not use electronic devices in class.  \n‧　　A journal, pens, and loose-leaf paper for in-class writing and quizzes\n‧　　A dry-erase marker and a cleaning cloth\n‧　　A pocket folder in which to submit papers and drafts\n‧　　A binder in which to keep all your class readings (highly recommended)","foreignLanguageTextbooks":false}]
