[{"name":"雷貝利","email":"barry.lee.reynolds@gmail.com","latestUpdate":"2014-02-06 22:26:44","objective":"本課程探討語言評量原則與方法以及相關重要課題。涵蓋之主題包括：語言評量原則；語言測驗設計；說、聽、讀、寫語言能力評量；替代、真實評量〈如學習歷程檔案評量法〉；語言評量研究法。\n\n語言測驗與評量\nCourse Policies and Syllabus　　Spring 2014\n\nDepartment:　　應用英文所　　　　　　　　Meeting Place: 　　共同301-1教室\nInstructor:  　　Dr. Reynolds  雷老師　　　　　　Class Time:　　　　四18:30-21:10\nE-mail:　　barry@ntut.edu.tw　　　　　　Class:　　　　　　碩士在職專班\n\nMy Facebook Page:　　　　http://www.facebook.com/ProfessorLei\n　　　　　　　　\nCourse Title:　　Language Assessment &amp; Evaluation\n\nCourse Description:　　This course examines principles of and major approaches to language assessment and current issues in the field. The main topics include the following: principles of language assessment, designing language tests, approaches to assessing language skills (listening, speaking, reading, writing), alternative authentic assessment (portfolios, conferences, observations, peer assessments, self assessments), and conducting research in classroom-based assessment.\n\nContent Outline: Students will mainly use two texts—both covering language-testing topics—to gain an understanding of language assessment and evaluation.  To further build up this knowledge, students will read other self-selected materials.  All reading will be done outside of class but with the understanding that class time will be used for presenting and discussing the reading materials.  Throughout this process students will become active learners by commenting, questioning, and taking notes.  Such activities will assist students in firstly writing a testing project proposal and then a test critique or testing research paper.  \n\nCourse Objectives:  By the end of the course students will have:\n‧　　Become familiar with theoretical concepts and terminology in language assessment.\n‧　　Analyzed language tests in terms of validity, reliability/consistency, beneficial backwash, and testing techniques.\n‧　　Acquired skills that will allow them to write better tests.\n‧　　Improved discussion, presentation, and academic writing skills.","schedule":"Instructional Activities:  The primary format of instruction shall be student presentation over assigned class readings.  Students are expected to have finished all the readings prior to coming to class so that they may participate fully in discussion that will take place after the presentations; students should come to class ready to ask questions regarding the assigned readings.  The instructor will also provide an ample amount of ‘mini lecture’ during the presentations to aid in clarifying major points covered in the class readings.  Additionally, each student/pair/group will have an opportunity during class time to meet one-on-one with the instructor for additional tutoring or assistance with the final class project.   \n\nThe Project Proposal is a written description of a real assessment that has or intends to be given to subject(s) and evaluated and/or written about in the Test Critique / Testing Research Project.  If a Test Critique is selected, then both the 1) kind of test (see Chapter 3) and 2) the subjects that will take the test should be described.  If a Testing Research Project is selected, then a description of the research including the following separated into two-three paragraphs should be given:  1) Introduction including a) literature review; b) Purpose [including research questions or hypotheses]; 2) Methods including a) participants; b) materials; c) procedures.  The Project Proposal should be between 200-500 words and in APA format; this can be an individual/pair/group assignment.  Final approval of the project must be granted before the project can begin.  \n\nThe Test Critique / Testing Research Project is a paper synthesizing the knowledge you have gained from this course.  If you select to write up a Test Critique you must evaluate a real assessment that has been given to subject(s) and evaluated in terms of validity, reliability/consistency, beneficial backwash, and testing technique(s).  In addition, if the assessment is a norm-referenced test then appropriate reporting of statistical analysis is required (see Appendix 1); if criterion-referenced testing is selected, then consistency results should be reported (see Chapter 5).  At the end of the paper you should present your conclusions and suggestions for improvement of the test.  If a Testing Research Project is selected, then the project should include an assessment that plays a major role in the research.  The research proposed in the Testing Research Proposal should be carried out and the findings will be written up in an article submitted for publication in an academic journal or conference.  The Test Critique / Testing Research Project should be between 4,000-6,000 words and in APA format; this can be an individual/pair/group assignment but must completed by the same people as the Project Proposal. \n\nThe Presentation assignment consists of presenting the contents of one of the assigned class readings as well as one self-selected “Further Reading”.  The “Further Reading” is not a required reading for the entire class but is encouraged; however, the presenter for that week is, of course, required to do the reading.  The presenter is expected to ensure that each class member as well as the teacher receives an electronic and/or hard copy of the reading material one week prior to the presentation.  The presentation should last around 50 minutes and be given in English (see attached rubric).  The presenter is expected to prepare a well-executed PowerPoint presentation.  Then 10 minutes will be used for Q&amp;A.  The presenter for that week is then expected to assist the teacher in further leading the class in completing the end of chapter “Reader Activities.” \n\nStudents are expected to participate fully in all In-Class Discussion.  Discussion points will be awarded on a relative grading scale.  The top 25 per cent of participating students will receive 15 points (100%); the next 25 per cent will receive 11.25 points (75%); the next 25 per cent will receive 7.5 points (50%); the next 25 per cent will receive 3.75 point","scorePolicy":"Grading Procedures:  Course grades will be calculated in the following manner:\n\n出席率　　　　　　　　　　　　　　　　5%\n　　Project Proposal　　　　　　　　　　　　　　5%\n　　Test Critique / Testing Research Project　　　　　　　　30%\nPresentation　　　　　　　　　　　　　　　　30%\n　　In-Class Discussion　　　　　　　　　　　　　　15%\n　　Note Taker Assignment　　　　　　　　　　　　15%\n　　　　　　　　　　　　　　　　　　Total:　　100 pts.\n\nA　　90-100　　　　\nB　　80-89\nC　　70-79　　　　\nD　　60-69　　  　　　　\nF　　59 &amp; BELOW","materials":"Books:　　\nBrown, H.D. (2004). Language Assessment Principles and Classroom Practices. New York: Longman. \nHughes, A. (2013). Testing for Language Teachers. Cambridge: Cambridge University Press.\n\n上課規則:\n1.　　Graduate level performance is expected from all students. At the graduate level, it is assumed that students are, to a great extent, responsible for their own learning. Therefore, all readings and assignments are to be completed PRIOR to the class for which they are assigned in a thorough and timely manner. Class attendance and quality in-class participation is expected. If you are absent, you should call a classmate to get class notes and assignments.\n2.　　Students are expected to complete all assignments on time. All out-of-class assignments should be typewritten, unless otherwise stated, following standard academic conventions and the APA style manual.\n3.　　Late work will be accepted only with prior instructor consent and WILL BE PENALIZED a letter grade (10 points) for each 24 hours that the assignment is late. If you are absent the day when a homework assignment is due, you are still required to hand it in on time. Receiving permission to submit an assignment late will not remove the penalty. Special exceptions for emergencies.\n4.　　It is expected that all homework assignments, projects, papers, and any other work submitted for class credit is the student’s own.  Students should always take great care to distinguish their own ideas and knowledge from information derived from sources.  The term “sources” includes not only primary and secondary material published in print or online, but also information and opinions gained directly from other people.  Quotations must be placed properly within quotation marks and must be cited fully.  In addition, all paraphrased material must be acknowledged completely.  Whenever ideas or facts are derived from a student’s reading and research or from a student’s own writings, the sources must be indicated.  If you submit portions of a paper or entire papers for credit in more than one course, you must get permission from the teachers of both courses and if approved cite the previous paper.  If these guidelines are not followed and it comes to the attention of the instructor that plagiarism has been committed the student will receive 0% on that particular assignment and the instance will be reported to the Department of English, National Taipei University of Technology.  For further information please visit: http://www.plagiarism.org\n5.　　老師授課時，請同學保持安靜，不要與同學交頭接耳。\n6.　　上課中請勿製造噪音(例如隨意講話，大聲整理東西，摔門，等等) 。\n7.　　上課時不可以吃東西（兩堂課中間休息時可以）。飲料沒問題。\n8.　　不來上課的同學注意喔！要補考（小；期中；期末）的學生必須出示醫生開立之證明或訃聞才可以補考。","foreignLanguageTextbooks":false}]
