[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2014-03-03 03:03:20","objective":"本課程主旨在向各級學校的英語師資，或對西洋文學文化有興趣的社會人士，推薦英美文學經典作品作為創意教學的教材藍本，兼具創意教學此一領域的理論介紹與創作實務。學員們藉由對英美經典文學作品與其相關之多媒體文化產物的研讀和探索，激起反應、反省與靈感，進而以英文創作作為回饋，朝向創意產業邁進。本課程設計的目標在激發學員多方面的能力：（1）瞭解英美經典文學作品的文字之美與文化意涵、（2）用英語表達的習慣、（3）用英文創作的潛能、以及（4）進入英語文化創意產業的準備。","schedule":"Week 1\nProf. Huang's presentation: \"Why Read the Classics?~by Italo Calvino\"\nWeek 2 \nGroup discussions on Readers: Level 1\nProf. Huang's presentation: \"Ways of Responding to What We Read\" and \"How to Encourage Students to Respond\"\nWeek 3 \nGroup discussions on Compass Readers: Level 1\nProf. Huang's presentation: \"Considering Genre (types of literary works) and Listening to the Voices from Your Inner Self and Others\"\nWeek 4 \nGroup discussions on Readers: Level 2\nProf. Huang's presentation:\"Writing about What We Read\"\nWeek 5  \nGroup discussions on Readers:Level 2\nProf. Huang's presentation:\"Argument, Critical Thinking, and Research\"\nWeek 6  \nGroup discussions on Readers:Level 3\nProf. Huang's presentation:\"On the Theme of Childhood and Innocence\"\nWeek 7  \nGroup discussions on Readers:Level 3\nProf. Huang's presentation: \"On the Theme of Roots and Identity\"\nWeek 8  \nGroup discussions on Readers:Level 3\nProf. Huang's presentation: \"On the Theme of Love\"\nWeek 9  \nGroup discussions on Readers:Level 4\nProf. Huang's presentation: \"On the Theme of Families\"\nWeek 10  \nGroup discussions on Readers:Level 4\nProf. Huang's presentation: \"On the Theme of Nature\"\nWeek 11  \nGroup discussions on Readers:Level 4\nProf. Huang's presentation:\"On the Theme of Animals\"\nWeek 12 \n Group discussions on Readers:Level 5\nProf. Huang's presentation:\"On the Theme of War\"\nWeek 13  \nGroup discussions on Level 5\nProf. Huang's presentation: \"On the Theme of Science and Technology\"\nWeek 14  \nGroup discussions on Readers:Level 5\nProf. Huang's presentation: \"On the Theme of Death\"\nWeek 15  \nGroup discussions on Readers:Level 6\nProf. Huang's presentation: \"On the Theme of Adventures\"\nWeek 16  \nGroup discussions on Level 6\nProf. Huang's presentation: \"On the Theme of Science and Technology\"\nWeek 17  \nGroup discussions on Readers:Level 6\nProf. Huang's presentation: \"On the Theme of Guilt\"\nWeek 18  \nGroup discussions on Readers:Level 6\nProf. Huang's presentation: \"On the Theme of Poetry and the Arts\"\n附表:英美文學與文化發展大綱\nI.主旨:下列大綱用意在英國與美國的文化發展歷史中,依照主要斷代的先後順序來引介最能表現該斷代文化特色與思想潮流的文學作品.目的是幫助學生做文化脈絡與文學表現的統整聯結,期待學生能融會貫通,\nII.分段進度\nIntroduction \"Why Read the Classics?\" by Italo Calvino\nTHEME ONE: The earliest piece of English literature英國文學的濫觴\nTHEME TWO: The Middle Ages 中古世紀\nTHEME THREE: The Renaissance 英國文藝復興時期\nTHEME FOUR: The Enlightenment and Neo-classicism 啟蒙運動和新古典主義\nTHEME FIVE: The English Romanticism 英國浪漫主義時期\nTHEME SIX: American Renaissance美國文藝復興\nTHEME SEVEN: The 19th -and 20th –Century Modernisms 現代主義各家: Realism, Symbolism, Naturalism, Existentialism, Absurdism, Magic Realsim\nTHEME EIGHT: The The interaction between literature and the arts","scorePolicy":"1.Attendance and participation:40%\n2.Presentation in the class: 10% X 4 = 40%\n3.Final project: 20%","materials":"1.Respondin to Liturature by Judith A. Stanford, 5th edition\n2.A Handbook to Literature by Harmon and Holman, 9th edition\n3.Compass Classic Readers, 10 books x 6 levels = 60 books","foreignLanguageTextbooks":false}]
