[{"name":"劉天一","email":"liut@csus.edu","latestUpdate":"2014-02-27 14:24:00","objective":"本課程介紹預測型診斷、維護、與監督之原理與應用。課程內容包括預測型診斷、維護、與監督所需之儀器，儀器所需之性能，數據獲取與訊號分析，特徵選擇以進行決策，智慧型技術在預測型診斷、維護、與監督上之應用。\n\nThis course introduces principles and applications of predictive diagnosis, maintenance, and monitoring in industry. The course contents include instrumentation for predictive diagnosis, maintenance, and monitoring; characteristics of the instrumentation; data acquisition and signal analysis; feature selection for decision making; intelligent techniques for predictive diagnosis, maintenance, and monitoring.","schedule":"Week                     Lecture\n\n1.　　Introduction to predictive diagnosis, maintenance, and monitoring \n2.　　Instrumentation for predictive diagnosis, maintenance, and monitoring\n3.　　Characteristics of instrumentation for predictive diagnosis, maintenance, and monitoring     \n4.　　Contact measurement methods for predictive diagnosis, maintenance, and monitoring\n5.　　Noncontact measurement methods for predictive diagnosis, maintenance, and monitoring\n6.　　Errors and error analysis in predictive diagnosis, maintenance, and monitoring  \n7.　　Data acquisition system for predictive diagnosis, maintenance, and monitoring\n8.　　Signal analysis for predictive diagnosis, maintenance, and monitoring\n9.　　Wave distortion in predictive diagnosis, maintenance, and monitoring\n10.　　Anti-aliasing for predictive diagnosis, maintenance, and monitoring   \n11.　　Feature selection for predictive diagnosis, maintenance, and monitoring \n12.　　Euclidean distance measure for two states in feature selection \n13.　　Euclidean distance measure for multiple states in feature selection \n14.　　Sequential forward search for feature selection  \n15.　　Intelligent technique for two states in predictive diagnosis, maintenance, and monitoring\n16.　　Intelligent technique for multiple states in predictive diagnosis, maintenance, and monitoring  \n17.　　Case Studies\n18.   Case Studies","scorePolicy":"Course Requirements: \n\n       1. Successful completion of three quizzes\n       2. Successful completion of two exams\n       3. Successful completion of semester project\n\nGrading:     Quizzes                      15% (Three quizzes.  No make-up for any quiz)\n                   Exams                        60% (Two exams.  No make-up for any exam)\n                   Semester Project        25% (Late report is not acceptable)","materials":"References:\n     \nBooks:\n\n1.　　D. Wang, M. Yu, C.B. Low, and S. Arogeti, “Model-based Health Monitoring for Hybrid Systems,” Springer, 2013 \n2.　　Rolf Isermann, “Fault-Diagnosis Applications: Model-based Monitoring: Actuators, Drives, Machinery, Plants, Sensors, and Fault-tolerant Systems,” Springer, 2011\n3.　　Jean-Claude Trigeassou, “Electrical Machines Diagnosis,” John Wiley &amp; Sons, 2011                   \n4.　　Richard S. Figliola, Donald E. Beasey, “Theory and Design for Mechanical Measurements,” John Wiley &amp; Sons, 2011\n5.　　Lihui Wang, Robert X. Gao, “Condition Monitoring and Control for Intelligent Manufacturing,” Springer, 2006\n\nJournal Papers:\n\n1.　　Tien-I Liu, Junyi Lee, George Liu, and Zhang Wu, “Monitoring and Diagnosis of Tapping Process for Product Quality and Automated Manufacturing,” International Journal of Advanced Manufacturing Technology,  Vol. 64, Issue 5, pp. 1169-1175, 2013 \n2.　　T.I. Liu, A. Kumagai, Y.C. Wang, S.D. Song, and J. Lee, \"On-Line Monitoring of Boring Tools for Control of Boring Operations,\" International Journal of Robotics and Computer Integrated Manufacturing, Volume 26, Issue 3, pp. 230-339, 2010\n3.　　Akihiko Kumagai, Tien-I Liu, and Paul Hozian, “Control of Shape Memory Alloy Actuators with A Neuro-Fuzzy Feedforward Model Element,” Journal of Intelligent Manufacturing, Volume 17, pp. 45-56, 2006 \n4.　　Tien-I Liu, Farhad Ordukhani, Dipak Jani, “Monitoring and Diagnosis of Roller Bearing Conditions Using Neural Networks and Soft Computing,\" International Journal of Knowledge-Based and Intelligent Engineering Systems, Volume 9, No. 2, pp. 149-157,  2005          \n5.　　W. He, Y.F. Zhang, K.S. Lee, and T.I. Liu, “Development of a Fuzzy Neuro System for Parameter Resetting of Injection Molding,” ASME Journal of Manufacturing Science and Engineering, Vol. 123, No. 1, pp. 110-118, 2001","foreignLanguageTextbooks":false}]
