[{"name":"吳可久","email":"kochiuwu@ntut.edu.tw","latestUpdate":"2014-02-11 12:00:14","objective":"資通訊與數位化科技的普及讓居住空間設計朝向智慧化，而互動設計更能營造人與建築空間場域之間良善的親和關係，除提升更優質的生活品質，也創新建築居住空間產業價值。互動智慧化居住空間設計除了發想對空間使用創意外，更需具備跨領域的相關技術作為基礎來實現。本課程主要學習在居住空間場域中之資通訊、自動化、監控、感知、系統整合等基本技術，進而學習互動科技應用在居住空間之智慧化設計，促使學習者多重思考未來居住空間之創新規劃設計的可能性與可行性，創造建築新價值，並與產業需求接軌，以達學用合一之目標。本教學除專業課程外，並安排校外參觀展覽實務學習，並引導學生以創意設計專題參加比賽，提高學習動力與未來職場上的競爭力。\nPopularization of ICT and digital technology makes living space toward intelligent design, and create a more interactive design goodness relationships between people and building space field, in addition to enhancing a better quality of life, but also innovative building living space industry value. Interactive Intelligent Living Space design in addition to want to use the creative space, but also need to diffident technologies as the basis to achieve. The course study in the Field of Information and Communication of living space, automation, monitoring, sense, systems integration and other basic skills, and then learning to interact with technology in intelligent design living space, to promote innovative thinking about the future planning of multiple learners living space possibility and feasibility of the design, inspire and create new value, in line with architecture industry needs in order to achieve the goal of learning to use unity. In the course will arrange to visit the exhibition outside of practice learning and guide students to participate in the competition of creative design project to improve motivation and competitiveness of the workplace in the future.","schedule":"1.　　課程簡介與考評方式說明\n2.　　台灣智慧化居住空間政策與產業現況\n3.　　互動智慧化居住空間之環境營造\n4.　　參觀2014年智慧城市展(南港展覽館2/19~2/22)\n5.　　參訪內政部智慧居住空間展示中心(新店)\n6.　　智慧空間與互動技術之需求\n7.　　設計互動智慧化居住空間-機電技術\n8.　　設計互動智慧化居住空間-資通訊技術\n9.　　期中(4/14)：期中報告(提出期末報告之專題作品主題與構想、文獻)\n10.　　設計互動智慧化居住空間技術-自動化與監控技術\n11.　　設計互動智慧化居住空間技術-感知與驅動技術\n12.　　設計互動智慧化居住空間技術-整合與連動技術\n13.　　設計互動智慧化居住空間技術-人機介面與空間介面技術\n14.　　設計互動智慧化居住空間技術-情境營造與互動技術\n15.　　互動科技應用於居住空間之智慧化設計(1)辦公場域\n16.　　互動科技應用於居住空間之智慧化設計(2)家庭場域\n17.　　互動科技應用於居住空間之智慧化設計(3)公共與休閒場域\n18.　　期末(6/16)：期末報告(專題作品成果發表)","scorePolicy":"教學除專業課程，與產、官、學研究性、實務利用性的專業講題、個案研討，並輔以報告作品小組討論為評量方式。","materials":"　","foreignLanguageTextbooks":false},{"name":"黃國書","email":"banco1688@yahoo.com.tw","latestUpdate":"2014-03-06 16:52:48","objective":"資通訊與數位化科技的普及讓居住空間設計朝向智慧化，而互動設計更能營造人與建築空間場域之間良善的親和關係，除提升更優質的生活品質，也創新建築居住空間產業價值。\n互動智慧化居住空間設計除了發想對空間使用創意外，更需具備跨領域的相關技術作為基礎來實現。本課程主要學習在居住空間場域中之資通訊、自動化、監控、感知、系統整合等基本技術，進而學習互動科技應用在居住空間之智慧化設計，促使學習者多重思考未來居住空間之創新規劃設計的可能性與可行性，創造建築新價值，並與產業需求接軌，以達學用合一之目標。\n本教學除專業課程外，並安排校外參觀展覽實務學習，並引導學生以創意設計專題參加比賽，提高學習動力與未來職場上的競爭力。","schedule":"W1：課程簡介與考評方式說明\nW2：台灣智慧化居住空間政策與產業現況\nW3：互動智慧化居住空間之環境營造\nW4：參觀2014年智慧城市展\nW5：參訪內政部智慧居住空間展示中心(新店) \nW6：智慧空間與互動技術之需求\nW7：設計互動智慧化居住空間-機電技術\nW8：設計互動智慧化居住空間-資通訊技術\nW9：期中(4/14)：期中報告\nW10：設計互動智慧化居住空間技術-自動化與監控技術\nW11：設計互動智慧化居住空間技術-感知與驅動技術\nW12：設計互動智慧化居住空間技術-整合與連動技術\nW13：設計互動智慧化居住空間技術-人機介面與空間介面技術\nW14：設計互動智慧化居住空間技術-情境營造與互動技術\nW15：互動科技應用於居住空間之智慧化設計(1)辦公場域\nW16：互動科技應用於居住空間之智慧化設計(2)家庭場域\nW17：互動科技應用於居住空間之智慧化設計(3)公共與休閒場域\nW18：期末(6/16)：期末報告(專題作品成果發表)","scorePolicy":"1.出席率20%\n2.平時作業20%\n3.期中報告20%\n4.期末報告40%\n5.加分項目：期刊發表、特殊表現等10%","materials":"1.內政部建築研究所 智慧建築解說與評估手冊2011年版\n2. 田園城市文化 互動建築\n3. 智慧生活家科技 台灣大學智慧生活科技整合與創新研究中心\n4.Engineering manual of automatic control  Honeywell\n5.智慧型大樓 建築設備的自動控制 田有松 中華水電空調雜誌\n6.監控系統與系統整合手冊 騰康科技(股)公司","foreignLanguageTextbooks":false}]
