[{"name":"勞維俊","email":"lolouis@graduate.hku.hk","latestUpdate":"2014-02-12 18:21:16","objective":"本課程以1950年代以後的西方文學為本，以當代文化批評理論作為分析基礎，如互文性、族群研究、（後）殖民主義、魔幻寫實主義、女性主義、傷痕記憶等。課程討論重點概念將包括論述、再現、心理分析、後結構主義、後現代主義等。\n\nCourse Aims\nThis course introduces the vast field of contemporary literature after the 1950’s, from late modernist to postmodernist works. Both literary and films, with a few translated into English from other languages, are discussed in terms of literary critical concepts such as intertextuality, post-colonialism, magic realism, feminism, and trauma.","schedule":"Course Outline \n\nWeek 1: Introduction: Modernism, Postmodernism, and Narrative: Jorge Luis Borges, ‘The Garden of Forking Paths’, and ‘Pierre Menard, Author of the Quixote’\n\nWeek 2: Kafka, The Trial (extract)\n\nWeek 3: Borges, ‘Kafka and his Precursors’\n\nWeek 4: Hiroshima mon amour (1959, dir. Alain Resnais)\n\nWeek 5: Hiroshima mon amour continued + Freud, Beyond the Pleasure Principle\n\nWeek 6: Cathy Caruth, Unclaimed Experience \n\nWeek 7: Holiday (No class) (Mid-term paper draft due)\n\nWeek 8: Kleist, ‘On the Marionette Theater’ + The Puppetmaster (1993, dir. Hou Hsiao-Hsien)\n\nWeek 9: Mid-term paper due\n\nWeek 10: Maurice Blanchot, ‘The Instant of My Death’\n\nWeek 11: W.G. Sebald, Austerlitz * \n\nWeek 12: W.G. Sebald, Austerlitz continued\n\nWeek 13: Shakespearean Journeys Conference 15-18 May (No class)\n\nWeek 14: Calvino, If on a Winter’s Night a Traveler *\n\nWeek 15: Derrida Today Conference 28-31 May (No class)\n\nWeek 16: The Day He Arrives (dir. Hong Sang-soo)\n\nWeek 17: Presentation \n\nWeek 18: Final paper due","scorePolicy":"Teaching Approach\n\nStudents are required to read all the assigned texts. On top of literary texts, students will have to do some readings on theories and criticisms, since it would be necessary for them to be equipped with certain understanding of key words and critical terms. Students are required to give a 20 – 25 minutes presentation, write a mid-term and a final paper.\n\nAssessment\n\nContinuous Assessment: 　　100%\n\nParticipation　　　　　　　　10%\nPresentation 　　　　　　　　20%\nMid-term essay　　　　　　30% (10% draft + 20% revised version)\nFinal essay  　　　　　　　　40% (10% draft + 30% revised version)","materials":"Primary texts: (students should get the books marked [*])\n\nBlanchot, Maurice. The Instant of My Death / Jacques Derrida, Demeure: Fiction and Testimony, trans. Elizabeth Rottenberg. Stanford, Calif.: Stanford University Press, 2000. \n* Calvino, Italo. If on a Winter’s Night a Traveler. Trans. William Weaver. London: Vintage, 1998. \nCaruth, Cathy. Unclaimed Experience: Trauma, Narrative and History. Baltimore: Johns Hopkins University Press, 1996.\nBorges, Jorge Luis. ‘The Gard","foreignLanguageTextbooks":false}]
