[{"name":"江怡君","email":"meanttobe@ntut.edu.tw","latestUpdate":"2010-02-22 14:46:11","objective":"課程重點：(1)藉由適合其程度的教材加強學生必備的基礎文法觀念和句型結構；(2)使學生確切把握閱讀要領以及充分瞭解寫作的各種技巧，重心在生字、片語、句法的解釋和基本寫作技巧的分析；(3)熟悉英語人士日常生活情境及與學生將來就業環境相關之會話及適當之應對方式；(4)透過練習加強聽、說、讀、寫的知能及表達。","schedule":"Week　　Chapter\n1　　Review\n2　　6\n3　　6\n4　　7\n5　　7\n6　　7\n7　　Mid-term Exam (Listening + Reading)\n8　　8\n9　　Mid-term Campus-wide English Proficiency Test\n10　　8\n11　　8\n12　　9\n13　　9\n14　　9\n15　　10\n16　　10\n17　　Final Exam (Listening + Reading)\n18　　Final Campus-wide English Proficiency Test\n","scorePolicy":"Average of Weekly Quizzes * 19% (每週小考)\nTotal grade of Remedial English Teaching * 21% (輔導課程總成績)\nComposition * 10% (兩百五十字作文)\nMid-term Exam * 10% (期中考)\nFinal Exam * 10% (期末考)\nMid-term Campus-wide English Proficiency Test * 15% (期中會考)\nFinal Campus-wide English Proficiency Test * 15* (期末會考)\n\n(預習和作業) Students are required to preview assigned reading, do homework, and take notes in class. The instructor will check students’ notes and homework at irregular intervals. If a student is found to not have taken notes or done homework, 20 points will be deducted from his or her quiz that week.\n\n(小考和補考) Weekly quizzes are always administered at the beginning of the class. Late students can ask for a make-up quiz administered by the teaching assistant, but 20 points will be automatically deducted. An absent student, with or without a justifiable reason, cannot ask for a make-up quiz. Yet, for all students, one lowest quiz grade needs not to be factored into the average calculation.\n\n(作文) Students are required to write a composition of 250 words on any chosen topic. It can be submitted any time during the semester but no later than May 28th, 2010. Otherwise, it will be given a zero automatically.\n\n(小老師) Teaching assistant will be awarded 3 bonus points to his or her final grade.\n\n(作弊及抄襲) Any student caught cheating or plagiarizing in a quiz, exam, or composition will be given a zero for his or her final grade without any room of negotiation.\n","materials":"Interactions 1—Reading / Writing (by J. Tanka etc., McGraw Hill)","foreignLanguageTextbooks":false}]
