[{"name":"周素鳳","email":"sfchou@ntut.edu.tw","latestUpdate":"2010-02-19 16:55:29","objective":"This course is designed to enhance students’ English proficiency through reading texts drawn from newspapers and online news websites.  Students will not only develop deeper understanding of English language through exposure to the language of the news media but also get in touch with the latest news and viewpoints on global affairs. In addition to selected news articles, Mitch Albom’s The Five People You Meet in Heaven (2003) is especially included as the supplementary reading to cultivate reading competence and enrich vocabulary learning knowledge. The class format will combine lecture, small-group discussion, and whole-class presentation.","schedule":"2/24　　Warm-up: Vienna Teng and Green Island Serenade\n3/3　　Live Each Moment for What It’s Worth\nGroup 1: pp. 104-108(l.6)\nGroup 2: pp. 108(l.7)-113(l. 17)\n3/10　　Smarter Tools Monitor Daily Life\nGroup 3: pp.113 (l. 18)-116\nGroup 4: pp.117-122(l. 16)\n3/17　　Smarter Tools Monitor Daily Life\nGroup 5: pp.122(l. 17)-126(l.12)\nGroup 6: pp.126(l.13)-131\n3/24　　History 101: Pass the Popcorn Please\nGroup 7: pp. 132-136(l.22)\nGroup 8: pp.136(l.23)-142(l.9)\n3/31　　History 101: Pass the Popcorn Please\nGroup : pp. 142(l.10)-145\nGroup : pp. 146-150\n4/7　　History 101: Pass the Popcorn Please\n4/14　　Midterm Exam\n4/21　　GEPT Simulation Test\n4/28　　Tim Burton &amp; Alice in Wonderland\n5/5　　Tim Burton &amp; Alice in Wonderland\nGroup 1: pp.151-155(l.21)\nGroup 2: pp. 155(l.22)-159\n5/12　　The Beatles\nGroup 3: pp.160-163\nGroup 4: pp.164-167(l.2)\n5/19　　John Lennon: Give Peace a Chance\nGroup 5: pp.167(l.3)-171\nGroup 6: pp.172-175\n5/26　　John Lennon: Give Peace a Chance\nGroup 7: pp.176-182\nGroup 8: pp.183-187\n6/2　　Feet and Minds Need a Chance To Wander\nGroup 9: pp.188-192(l.23)\nGroup 10: pp.192(l.24)-196　　9\n6/9　　Feet and Minds Need a Chance To Wander\n6/16　　Final Exam\n6/23　　GEPT Simulation Test\n","scorePolicy":"Grading Scale:\n1. Reading Portfolio (The Five People): 20%\n2. Two Group Presentations (The Five People): 10%\n3. Vocabulary Quizzes and In-class Activities: 30%\n4. Midterm Exam: 20%+Final Exam: 20%\n","materials":"Requirement:\n1. Regular attendance is required to pass this course.  3 unexcused absences from class will result in failing this course.  One unexcused absence will result in an automatic final score reduction of 2 points.\n2. Students will be given vocabulary quizzes on the main reading texts regularly. In-class group discussions and writing will also be assigned to cultivate your summarization skill, which helps to foster better reading comprehension and attain better communicative competence. If you miss any of the quizzes or fail to finish the group activity by the end of the class, there is no way to make it up (no exceptions).  However, your two lowest scores will be dropped—so, save these for those unexpected occasions when you might be sick or miss class for other reasons.\n3. Five People You Meet in Heaven is designed as a self-study reading assignment. You are required to read 6-8 pages every week.  The whole class will be divided into 10 groups with 5 students in each group.  Every week, 2 groups will be well-prepared for oral presentations on the assigned pages (each group for 3-4 pages).  The task for each group-member includes (1) a brief plot summary in Chinese; (2) a brief English summary; (3) a review on selected words and expressions; (4) comments or reflections significant passages or sentences (optional); (5) questions for classmates (optional).\n4. Each student should keep a Reading Portfolio on The Five People You Meet in Heaven.  Your reading portfolio includes at least 4 Summary entries and 10 pages of Handwritten Notes (or: 10 Summary entries) on useful words or expressions encountered while reading.\n","foreignLanguageTextbooks":false}]
