[{"name":"林淑玲","email":"shuling@ntut.edu.tw","latestUpdate":"2010-01-14 13:47:21","objective":"在面臨瞬息萬變的經濟與金融環境之變遷與衝擊之下，國際金融市場的自由化與企業營運的國際化更帶來許多複雜的因素，如匯率與政治風險，跨國稅賦的差異等。另一方面，也提供了許多的利益與潛在機會，如：企業可分散投資以降低風險，利用資本市場的不完全性以降低資金成本，或透過資金調度以節稅等。本課程之目的在於認識全球化與動態化的金融環境，透過國際財務金融理論之瞭解，進而建立多國籍企業財務管理以及國際證券投資的分析決策能力。促使多國籍企業瞭解其身處的國際金融環境與制度之現況，及如何因應並管理外匯、經濟與會計風險，以有效管理長、短期的營運資金，進而制定國際融資與投資決策。\n本課程將涵蓋以下內容：\n1.國際金融環境與多國籍企業：探討多國籍企業的理論模式與財務目標；國際貨幣制度的演進；國際收支平衡帳；國際平價關係與匯率決定；即期與遠期外匯市場；通貨膨脹、利率與匯率之關係。\n2.外匯風險管理：介紹外匯市場的功能、交易方式與匯率報價；匯率預測與平價理論；會計、經濟風險管理；國際套利與利率平價；匯率風險管理與避險策略。\n3.國際營運融資與國際金融市場：探討國際融資決策；制定最適財務結構；國際金融市場（如歐元、其他歐洲通貨市場、國際債券、國際股票市場、金融交換）之認識。\n4.國際投資分析：海外投資計畫之資金成本決定；對外直接投資理論與策略；國際投資組合投資；多國籍企業之資本預算。\n5.國際營運資金管理：長短期融資決策；流動與長期資產負債管理\n","schedule":"週次      日期　　課 程 進 度\n一        2/23　　Chapter 1: The Rise of Multinational Enterprise\n二        3/2　　Chapter 1: The Rise of Multinational Enterprise\n三　　3/9　　Chapter 2: Determinants of Exchange Rage\n四　　3/16　　Chapter 2: Determinants of Exchange Rage\n五　　3/23　　Chapter 7: The Foreign Exchange Market\n六　　3/30　　Chapter 7: The Foreign Exchange Market\n七　　4/6　　Chapter 7: The Foreign Exchange Market\n八　　4/13　　指定作業分組報告\n九　　4/20　　Midterm Examination\n十　　4/27　　Chapter 3: International Monetary System\n十一　　5/4　　Chapter 5: The Balance of Payments and International Economic Linkages\n十二　　5/11　　Chapter 5: The Balance of Payments and International Economic Linkages\n十三　　5/18　　Chapter 4: Parity Conditions in International Finance\n十四　　5/25　　Chapter 4: Parity Conditions in International Finance\n十五　　6/1　　Chapter 12: 國際銀行業務與海外負債融資\n十六　　6/8　　Chapter 14: The Cost of Capital for Foreign Investments\n十七　　6/15　　指定作業分組報告\n十八　　6/22　　Final Examination\n","scorePolicy":"1.出席及課堂參與討論情況：30%。\n2.課堂實作：35%。\n3.指定作業分組報告：35%","materials":"1.教師自編講義 ＆ Alan C. Shapiro, (2010) Multinational Financial Management, Ninth Edition, John Wiley &amp; Sons, Inc.\n2.劉亞秋、薛立言，國際財務管理與金融，民國94年初版，(東華書局)。\n3.何憲章，國際財務管理，民國93年7月，第五版，(新陸書局)。\n4.林琦方，國際企業財務管理，民國94年11月，初版，(普林斯頓國際公司)。\n5.Roy L. Crum, Eugene F. Brigham, Joel F. Houston (2005), Fundamentals of International Finance, First Edition, South-Western, Thomson Corporation.\n6.David K. Eiteman, Artbur I. Stonehill, Michael H. Moffett (2004), Multinational Business Finance, Tenth Edition, Pearson Education, Inc., Publishing as Pearson Addison Wesley.\n7.Jeff Madura (2003), International Financial Management, Seventh Edition, South-Western, Thomson Corporation.\n","foreignLanguageTextbooks":false}]
