[{"name":"楊韻華","email":"yhyang@ntut.edu.tw","latestUpdate":"2010-03-05 12:05:46","objective":"應用語言學與文化應用研究相關專題，以邀請專家專題演講，及論文討論為重點，參與者透過密集討論等方式，可以有效率地交換意見，獲得更深入而廣泛的體驗。　　\nCourse Description:  The course aims to develop graduate students’ scholarly strength in in-depth analysis to prepare for research in their respective disciplines. By centering its focus on critical, analytical and research-oriented development through student/researcher-initiated reading and discussions of scholarly studies, this course will thus require students to participate in lectures arranged by the Graduate Institute as well as other accredited conferences held in Taiwan and overseas.","schedule":"Paper presentation as scheduled.","scorePolicy":"Course Requirements: \n(1) Each student is required to present no less than ONE scholarly paper of studies in class. Papers and research studies to be presented must hold high scholarly value. Approximately thirty to forty minutes will be allotted for each paper presentation, and ten to twenty minutes for Q &amp; A.\n(2) All paper presentation titles will be reviewed and approved by the professors in the Graduate Institute. Students must seek professor’s approval two weeks prior to the scheduled presentation date. Full-length text of the paper presented must be submitted to the course instructor with the signed approval sheet. \n(3) A full-text paper with outline prepared by the current presenter is required to be distributed to the class prior to the presentation. A critique (minimum of 1000 words) on the paper shall be submitted to the instructor at the presentation session.\n(4) Class will meet every other week for 8 times in the fall semester. All sessions will start from 1:10 to 3:00 P.M. on Thursday afternoon. Each class meeting will allow two paper presentations.\n(5) Students who fail to present as scheduled will forfeit the right of presentation and result in the loss of the 30% semester grade.\n(5) During the 2010 Spring Semester, all M.A. students must attend a minimum of six hours of participation in conferences of their respective scholarly fields. Certificate of participation issued by the hosting institute will be required for submission along with student’s reflective paper and/or a critique on one or more presented paper(s).\nGrading Policy:　　Discussion / Presentation Sessions 30% (as scheduled) / Paper Critique 20%\n　　Conference Participation &amp; Paper critique 20% / Class Attendance 30% (10% reduction for each unexcused absence)\n\n\n","materials":"N/A","foreignLanguageTextbooks":false}]
