[{"name":"霍弘毅","email":"twall@ntut.edu.tw","latestUpdate":"2010-02-25 14:25:17","objective":"This will be a rather difficult course since so-called Postmodernism presumes a thorough familiarity with, first, Modernism, and then beyond that the entire Western tradition beginning with the metaphysics of Plato and The Iliad and The Odyssey of Homer.  Many texts we will read will be intellectually taxing.  We’ll proceed slowly.  To break things up, we’ll watch a few films that fall under the category (if it is a category) of the Postmodern.  If there is a ‘Godfather’ for the Postmodern it is probably Friedrich Nietzsche.  If you’ve never read him, it might be worth a couple of hours to look at Also Sprach Zarathustra, Twilight of the Idols, Ecce Homo, or The Gay Science.  He will be referred to in many texts we will read.  In this class we’ll consider Postmodernism of art and architecture, thought and politics.  In addition we will look at the related areas of Structuralism and Post-Structuralism, Lacanian psychoanalysis, Deconsctruction, and gender/sexuality studies.  There will be some round table discussions (10%).\nThere will be a mid term exam (35%): a 4-6 page (double spaced, MLA style) answer to a theoretical question I will hand out 2 or three weeks before mid-term week.  There will be a final exam (55%): also a 4-6 page answer to a theoretical question (double spaced, MLA style).\n","schedule":"Part I\n1- Introduction to Postmodernism\n2- Plato and Metaphysics:　　 Ion\nThe Republic\n3- Film　　　　　　 The Matrix\n4- Roundtable Discussion\nPart II\n1- High Modernism　　           T. S. Eliot The Wasteland\nEzra Pound Cantos\n2- Postmodernism　　 Gilles Deleuze “Plato and the Simulacrum”\nMaurice Blanchot “Two Versions of the Imaginary”\nJean Baudrillard “Simulations”\nFrederic Jameson “Theories of the Postmodern”\nJean-Francois Lyotard Postmodern Fables\n3- Films　　　　　　  Blade Runner\nThe Fly\n4- Roundtable Discussion\nPart III\n1- Structuralism　　   F. de Saussure Course in General Linguistics\nEmil Benveniste Problems in General Linguistics\nRoland Barthes Elements of Semiology\n2- Difference and Deconstruction　　Jacques Derrida “Difference”\n3- Art after Modernism\nWalter Benjamin\n“The Work of Art in the Age of Mechanical Reproduction”\nAndy Warhol The Philosophy of Andy Warhol\n4- Film　　　　   Black Narcissus\n5- Lacan and Psychoanalysis\n6- Sex and Gender after Lacan\nLuce Irigaray   This Sex Which is not One\nSpeculum of the Other Woman\nAn Ethics of Sexual Difference\nCatherine Millot Horsexe\n7- Roundtable Discussion\n","scorePolicy":"1. Discussions (10%)\n2. Mid term exam (35%)\n3. Final exam (55%)","materials":"　","foreignLanguageTextbooks":false}]
