[{"name":"周素鳳","email":"sfchou@ntut.edu.tw","latestUpdate":"2010-02-18 18:03:10","objective":"Course Description:\nThis course will explore the multifaceted relationships between translation literature and local culture, and how translation has affected the cultural landscape in Taiwan, including literary writing, periodicals, newspaper supplements and other published materials. The course is organized by three strands: (1) theoretical explorations, which aims to build up theoretical bases for the relation between literary translation and cultural production; (2) translation and transformation, which investigates how translation has acted as a shaping force in Chinese and Taiwanese literature; (3) case studies.  Drawing upon contemporary theories, we will reflect on the following issues in a broader context of culture:  Does translation literature promote or hamper culture changes in Taiwan?  How does translation become crucial in the formation of Chinese modernity and Taiwanese modernity? How literary works are chosen or rejected for publishing?  How are translated works employed to affect the local literary fields?  How have translated cultural theories influenced the local intellectual development during the last few decades and does translated culture reconfigure the existing tradition by transforming or reaffirming it?  Throughout our discussions, particular attention will be paid to the complexities involved in the concepts and terms such as modernity, identity, representation, subjectivity, post-colonialism, etc.\n","schedule":"2/24\n1.  Course Description\n3/3\n1. Theodor W. Adorno: “Culture Industry Reconsidered,” in Culture and Society, eds. Jeffrey C. Alexander &amp; Steven Seidman.\n2. Susan Bassnett: “The Translation Turn in Cultural Studies,” in Constructing Cultures.\n3/10\n1. Susan Bassnett: “From Comparative Literature to Translation Studies,” in  Comparative Literature: A Critical Introduction.\n2. Andre Lefevere: “Literary Translation and Beyond,” in Translation, Rewriting and the Manipulation of Literary Fame.\n3. Lawrence Venuti: “Globalization,”in The Scandals of Translation.\n3/17\n1. Itama Even-Zohar: “The Position of Translation Literature within the Literary   Polysystem,” in The Translation Studies Reader, ed. Lawrence Venuti.\n2. Andre Lefevere: “Chinese and Western Thinking on Translation,” in Constructing Cultures.\n3. David Wang: “Translating Modernity,” in Translation and Creation, ed. David Pollard.\n3/24\n1. Eva Hung: “Giving Texts a Context: Chinese Translations of Classical English Detective Stories, 1896-1916,” in Translation and Creation.\n2. Yuan Jin: “The Influence of Translated Fiction on Chinese Romantic Fiction,” in  Translation and Creation.\n3. 單德興: 〈翻譯．介入．顛覆：重估林紓的文學翻譯—以《海外軒渠錄》為例〉〉，《翻譯與脈絡》。\n3/31\n1. Sun Yifeng: “Opening the Cultural Mind: Translation and the Modern Chinese Literary Canon.”  Modern Language Quarterly 69:1.\n2. 單德興: 〈理論之旅行/翻譯:以中文再現Edward W. Said—以Orientalism的四種中譯為例〉，《翻譯與脈絡》。\n3. 馬耀民: 〈1970年迄今台灣的翻譯批評與翻譯研究—以《中外文學》與《淡江評論》為例〉，《方法:文學的路》。\n4/7\n1. Ken-fang Lee: “Far away, so close: cultural translation in Ang Lee’s Courching Tiger, Hidden Dragon,”in Inter-Asai Cultural Studes.\n2. Mahasweta Sengupta: “Transltion, Colonialism and Poetics: Rabindranath Tagore in Two Worlds,”in Translation, History and Culture.  Ed. Susan Bassnett &amp; Anre Lefevere.\n4/14\n1.Douglas Robinson: “Postcolonial Studies, Translation Studies,” in Translation and Empire.\n2.bell hooks: “this is the oppressor’s language / yet I need it to talk to you”: Language, a place of struggle,” in Between Languages and Cultures. Eds. Anuradha Dingwaney and Carol Maier.\n3.單德興: 〈冷戰時代的美國文學中譯〉，《翻譯與脈絡》。\n4/21\n1.Kuei-fen Chiu: “Treacherous Translation: Taiwanese Tactics of Intervention in Transnational Cultural Flows,” in Concentric: Literary and Cultural Studies.\n2. 劉亮雅: 〈文化翻譯:後現代，後殖民與解嚴以來的台灣文學〉，《中外文學》34卷 10期。\n4/28\n1.李根芳: 〈翻譯類暢銷書在台灣的文化政治〉，《翻譯與跨文化交流：轉向 與拓展》。\n2. 單德興: 〈翻譯．經典．文學—以Gulliver’s Travels為例〉，《翻譯與脈絡》。\n5/5: meeting with the teacher on term paper topics\n5/12\n1.Sherry Simon: “Taking Gendered Positions in Translation Theory,” in Gender in Translation.\n2. Lori Chamberlain: “Gender and the Metaphorics of Translation,” in Translation Studies Reader.\n3.  Liang-ya Liu: “Queer Theory and Politics in Taiwan: The Cultural Translation and “(Re)Production of Queerness in and beyond Taiwan Lesbian/Gay/Queer Activism,” in NTU Studies in Language and Literature.\n5/19\n1.Toril Moi: “Who’s Afraid of Virginia Woolf: Feminist Reading of Woolf,” in Sexual/Textual Politics.\n2.Ken-fang Lee: “The Multiple Faces of Virginia Woolf in Taiwan: from the 1960s to the 2000s,” in In Other Words: the Journal for Literary Translators, no. 31, 2008, pp. 3-11.\n5/26\nSpecial Topics( for Workshop on Orientalism and Modernism)\n6/2\nTerm Paper Presentation\n6/9 Workshop on Orientalism and Modernism\n6/16 Dragon Festival\n6/23 Term Paper Due\n","scorePolicy":"Grading Scale:\n1.Term paper: 50 %\n2.Summary/critique: 30%-- oral reports on the assigned readings.\n3.Participation: 20%\n","materials":"Further Reading:\n1. Walter Benjamin, “The Task of the Translator,” in The Translation Studies Reader.\n2  J. Hillis Miller, “Border-Crossing: Translating Theory,” in New Starts: Performative Topographies in Literature and Criticism.\n3. 單德興,〈譯者的角色〉，《翻譯與脈絡》，台北: 書林，2009。\n4. Lydia Liu, Translingual Practice: Literature, National Culture, and Translated Modernity—China, 1900-1937,  Calif. Stanford: Stanford UP, 1995.\n5. Lawrence Venuti, The Translator’s Invisibility, Routledge, 1995.\n6. Joseph F. Graham, ed. Difference in Translation, Ithaca &amp; London: Ithaca UP, 1985.\n7. Hu Ying, Tales of Translation—Composing the New Woman in China, 1899-1918, Stanford: Stanford UP, 2000.\n8. 李育霖，《翻譯閾境－主體，倫理，美學》，台北，書林，2009。\n9. Wang Nin, “Translation Journals in Chinese: Toward a Theoretical (Reconstruction of Chinese Critical Discourse,” in New Literary History 36: 4 (2005).\n10. Wei Lou, “Cultural Constraints on Literary Translation,” in Asian Social Science 5:10(Oct. 2009)\n","foreignLanguageTextbooks":false}]
