[{"name":"余盛延","email":"syyu@ntut.edu.tw","latestUpdate":"2010-02-12 17:01:35","objective":"本課程旨在增強學生的「世界文化識力」(cultural literacy) 並體認文學與文化素養在創意應用所扮演的角色，最終的期許是學生能經由此課程觀察到:世界文化的花布斑斕絢麗，儘管形形色色，但不悖離以「文化背景知識」為基礎,以 「溝通能力」(包括: 語言, 圖像, 聲音等等 )為媒介的基本架構。 基礎越深厚， 創造方法與應用模式也越多樣越活潑越有創意。為達到此目標，亦考慮到碩士班學生應具的「世界文化識力」 之廣度與深度，本課程針對文學與文化研究的三大方針分別訂定專門題目來研討。這三大方針是：(1)時代，(2)文類，和(3)作者。希望學生能在本課程中厚植文學與文化之創意應用的基礎，並能持續該素養之培育。\n\n文學與文化應用專題\nSpecial Topics in Cultural Literacy: The Faustian Bargain\nSpring 2010\nProfessor Yu\nWed. 4:10-7:00 p.m.\nOffice Hours: Mon: 10:10-12:00 a.m.; 4:10-6:00 p.m.\nTel: (02) 2771-2171, ext. 3927\nEmail: syyu@ntut.edu.tw\n\nThe Faustian bargain, a concept derived from the idea of pacts with the devil, suggests any deal, to quote Merriam-Webster’s 11th Collegiate Dictionary, “made or done for present gain without regard for future cost or consequences.” The Faust legend beginning with Historia von D. Johann Fausten (1587), the story of a German necromancer who sold his soul to the devil in exchange for knowledge and power, contains the idea of pacts with the devil that has a long tradition in Western narratives and cultural works. In Christopher Marlowe’s Doctor Faustus (1604; 1616), for example, Faustus succumbs to the blandishments of the devil in order to acquire knowledge and power, and the price of the bargain is Faustus’s soul. Since Marlowe’s time, many writers have developed their Faustian variants, including Thomas Mann’s Doctor Faustus (1947) (the story of a German composer, Adrian Leverkühn) and Mikhail Bulgakov’s The Master and Margarita (1967). In addition, Oscar Wilde’s Gothic horror fiction The Picture of Dorian Gray (1890) (a novel about a young man named Dorian Gray, who sells his soul to the devil in order to ensure that his beauty will last while his portrait by an artist will age instead) evidently contains a Faustian theme. In popular culture, the story of the film Bedazzled (2000), for example, is clearly based on the Faust legend.\n\nThe Faustian bargain has become a global cultural concept footnoting contemporary economic, political, scientific, technological and industrial developments and the concomitant ethical and environmental issues. As has been mentioned, “it is not hard to see connections between the Faust story and environmental issues, for Dr. Faust, the man who sacrifices his soul for material well-being and enjoyment, is easily interpreted as a symbol of modern industry, technology, and economy, which use knowledge to dominate nature for our benefit.  Many new technologies, from atomic energy to genetic engineering to the internet, seem to have the characteristics of a Faustian bargain, and we dwellers in the First and Second Worlds are often described as Faustian men and women” (see the website http://www.cs.utk.edu/~mclennan/Classes/UH348/Intro-I.html). To appreciate the significance of the Faust legend and its appropriations in Western culture, we will engage in a close reading of Marlowe’s Doctor Faustus, Wilde’s The Picture of Dorian Gray, and the screenplay of Bedazzled. In addition, I will prepare a packet of articles and supplementary material for this course.\n\nStudents taking this course are required to participate actively in class discussions. They will present a weekly oral report, each for 10 minutes on assigned weekly readings. Above all, they will present a term paper of 12-15 pages or so in class on either May 26 or June 2 and then submit it by June 9.","schedule":"Syllabus\n\n02/24  Introduction\n\n03/03  Christopher Marlowe's Doctor Faustus\n\n03/10  Christopher Marlowe's Doctor Faustus\n\n03/17  Christopher Marlowe's Doctor Faustus\n\n03/24  Christopher Marlowe's Doctor Faustus\n\n03/31　　Christopher Marlowe's Doctor Faustus\n\n04/07　　Oscar Wilde's The Picture of Dorian Gray\n\n04/14　　Oscar Wilde's The Picture of Dorian Gray\n\n04/21　　Oscar Wilde's The Picture of Dorian Gray\n\n04/28  Oscar Wilde's The Picture of Dorian Gray\n\n05/05  Oscar Wilde's The Picture of Dorian Gray\n\n05/12  the screenplay of Bedazzled\n\n05/19  the screenplay of Bedazzled\n\n05/26  Term paper presentation: \nStudent 1:  　　Student 2: 　　　　Student 3\n\n06/02  Term paper presentation: \nStudent 4:  　　Student 5: 　　　　Student 6\n\n06/09  Term paper due.\n\n06/16  The Dragon Boat Festival (Holiday)\n\n06/23  Review and discussion\n","scorePolicy":"Grading policy: attendance: 20%; oral presentation: 30%; term paper: 50%","materials":"Texts:\nMarlowe, Christopher. The Tragical History of Doctor Faustus. (A 1604 Version) Ed. David Bevington and Eric Rasmussen. English Renaissance Drama: A Norton Anthology. Ed. David Bevington, et al. New York: Norton, 2002. 250-284.\n\nWilde, Oscar. The Picture of Dorian Gray\n\nBedazzled, screenplay.\n\nA packet of critical articles\n","foreignLanguageTextbooks":false}]
