[{"name":"陳嘉勳","email":"chenjs@ntut.edu.tw","latestUpdate":"2010-02-28 17:57:49","objective":"本課程以介紹複合動力車輛概念、設計、能量分析及最佳化控制為主，結合內燃機及馬達兩種複合動力之能量管理及配合道路狀況，教導學生熟識複合車輛動力系統。\nThis course presents fundamentals of Hybrid Electric Vehicles: HEV concepts and design, energy analysis, unified modeling approach, optimization and control; The power consumption side of vehicles; Conventional power generation: IC engine overview, concepts of hybridization, general model of energy form and energy flows, on-board energy storage (fuels and batteries); Overview of electrochemical converters: motors, transmissions for HEVs, HEV application, and Principles of energy optimization in HEVs.\nAfter completing this course, students are able to:\n•　　Understand the regulatory climate which is stimulating the present interest in HEVs, as well as the role of HEVs in satisfying existing mandates\n•　　Identify the operational parameters which will eventually guide the HEV designer in specifying hardware\n•　　Use a Windows-based computer program (Matlab/Simulink and Advisor) to calculate vehicle performance\n•　　Recognize the engineering challenges and opportunities posed by HEVs, in order to narrow the vast field of design choices which must be investigated to reach a workable design","schedule":"1. Introduction and vehicle propulsion system\n2. Electric Vehicle, Hybrid Electric Vehicle\n3. Electric Propulsion Systems, DC Motor &amp; Induction Motor Drives\n4. Electric Propulsion Systems, DC Motor &amp; Induction Motor Drives\n5. Design Principle of Series Hybrid Electric Drive Train\n6. Design Principle of Series Hybrid Electric Drive Train\n7. Parallel Hybrid Electric Drive Train\n8. Parallel Hybrid Electric Drive Train\n9. Midterm Exam\n10. Design and Control Methodology of Series-Parallel Hybrid Drive Train\n11. Design and Control Methodology of Series-Parallel Hybrid Drive Train\n12. Design and Control Principles of Plug-In Hybrid Electric Vehicles\n13. Design and Control Principles of Plug-In Hybrid Electric Vehicles\n14. Peaking Power Sources and Energy Storages\n15. Peaking Power Sources and Energy Storages\n16. Fundamentals of Regenerative Braking\n17. Final Exam","scorePolicy":"•　　Midterm exam　　30 %\n•　　Final exam　　40 %\n•　　homework and project　　30 %\n•　　No late homework will be accepted, as solution will be handed out on the day the homework is due.\n","materials":"Reference book: Modern Electronic, Hybrid Electric, and Fuel Cell Vehicles: Fundamentals, Theory, and Design by M. Ehsani, Y. Gao, S. Gay, and A. Emadi,\nPublisher: CRC Press\nInstructor : Jia-Shiun Chen\nOffice Hour: 13:00-17:00 Tuesday\nEmail: chenjs@ntut.edu.tw\nComplex Building 526-11, TEL: (02) 27712171 ext 3626\n","foreignLanguageTextbooks":false}]
