[{"name":"賀一平","email":"ipho@ntut.edu.tw","latestUpdate":"2010-02-22 11:41:52","objective":"The purpose of this course is to develop students into better, more mature, confident, competent, enthusiastic, reflective, independent readers. Young adult literature and children's literature are used as major reading materials together with articles dealing with controversial issues. Activities encouraging students to adopt response strategies and transact with texts actively and aesthetically are provided to motivate students to read whole authentic texts and to improve their reading skills, reading strategies, response strategies, and critical thinking skills. These response-centered activities include journal writing, group discussion, individualized independent study, and guided reading. Authentic evaluation tools including journals and portfolios are used to evaluate student performance.\n","schedule":"Week　　Topic\n1.　　Orientation\n2.　　Winter Vacation Reading Assignment: Young Adult Novel\n3.　　School, High School and College Students, and Part-Time Jobs\n4.　　The Effects of Television\n5.　　The Effects of Television\n6.　　Beauty Contests; Beauty Pageant Fallacies\n7.　　The Case for Torture\n8.　　Young Adult Novel\n9.　　Young Adult Novel (Submission of Journal Entries)\n10.　　Internet Dating/Chat-Room Romance\n11.　　Should Drugs Be Legalized?\n12.　　Should Drugs Be Legalized?\n13.　　Animal Rights/Animal Experimentation\n14.　　Human Cloning/ Designer Babies\n15.　　Pornography: Free Speech\n16.　　Plastic Surgery\n17.　　Young Adult Novel\n18.　　Young Adult Novel (Submission of Portfolio Containing Journal Entries)\n","scorePolicy":"Evaluation\nGroup work and Oral Presentations: 35%\nResponse Journal Entries: 35%\nExams and Reflective journal Entries: 30%\n","materials":"Reading Materials and References:\nTwo Young Adult Novels: Choose two young adult novels from the Recommended Book List to read.\nPavlik, C. (2006). Hot topics (1, 2, 3).  Boston, MA: Thomson/Heinle.\nMacAndrew, R., &amp; Martinez, R. (2002). Taboos and issues.  Boston, MA: Thomson.\nDay, R. R., Shaules, J., &amp; Yamanaka, J. (2009). Impact Issues, 1, 2, 3.  Hong Kong: Pearson Longman.\nMcDonald, S., &amp; Salomone, W. (2008). The writer’s response (4th ed.). Boston, MA: Thomson.\nPula, J. P., Edward, A. T., &amp; Dermott, R. A. (2002). Controversy: Issues for reading and writing.  Upper Saddle River, NJ: Pearson Education.\nNumrich, C. (1994). Raise the issues: An integrated approach to critical thinking.  White Plains, NY: Longman.\nRamage, J. D., &amp; Bean, J. C. (1995). Writing arguments.  Boston, MA: Allyn and Bacon.\n(2004) Current Issues, 1, 2, 3, 4. New York: Macmillan Reference USA.\n","foreignLanguageTextbooks":false}]
