[{"name":"張中訓","email":"","latestUpdate":"2010-03-02 14:19:50","objective":"The course gives an in-depth historical review of Taiwan’s modernizing strategy and process in the second half of the twentieth century, emphasizing the economic, social and political changes in Taiwan over the recent decades. It also focuses on the transformation of the agrarian Taiwanese society into a modern and industrialized one. Within the conceptual framework of development, change, transformation and modernization , major topics will include, but not be limited to land reform, rural construction, local self-government , official economic development plans, the era of white terror and martial law, opposition movement, democracy—Taiwanese style, identity crisis, as well as Taiwan independence vs. reunification with China. The course is intended for students who have no prior knowledge of Taiwanese history.","schedule":"Week 1 2/23 Introductory Remarks on Course Description, Grade      Policy, the Concept of History, A Brief Review of Taiwan's Pre-1945\nColonization, and the Origin of Contemporary Taiwanese.\nWeek 2 3/04 The Relocation of the Republic of China (Nanking Government) to Taiwan, and the Changing United States Policy Toward Taiwan\nWeek 3 3/11 Crises and Reforms, 1949-1953\nWeek 4 3/18 Crises and Reforms, 1949-1953(continued)\nWeek 5 3/25 Consolidation and Development,1953-1963\nWeek 6 4/01 Consolidation and Development,1953-1963(continued)\nWeek 7 4/08 Economic Take-off and Miracle,1964-1973\nWeek 8 4/15 Economic Take-off and Miracle,1964-1973(continued)\nWeek 9 4/22 Mid-term Examination\nWeek10 4/29 The Priod of Economic Readjustment,1974-1979\nWeek11 5/06 Taiwan in 1980's: Challenges and Response, 1980-1983\nWeek12 5/13 Taiwan in 1980's: Political and Educational Reforms,1984-1986\nWeek13 5/20 Taiwan in 1980's: The Great Social, Polical and Cultural\nTransformations, 1987-1989\nWeek14 5/27 Taiwan in 1990's: Marching onto the Road of Democracy and the Development of Taiwanese consciousness\nWeek15 6/03 Taiwan Independence vs. Unification\nWeek16 6/10 Identification Crisis and Economic Integration\nWeek17 6/17 Concluding Remarks\nWeek18 6/24 Final Examination","scorePolicy":"1.Class Performance(including attendance,participation,discussion,and note-taking):40%\n2.Mid-term Examination:30%\n3.Final Examination:30%","materials":"1.Text book :\nManthorpe, Jonathan, Forbidden Nation: A History of  Taiwan, Palgrave Macmillan Press, 2008.\n2.References :\n·Davison, Gary Marvin, A Short History of Taiwan : The Case for Independence, Greenwood Pub Group,2003.\n·Moiz, Azra/ Wu, Janice, Taiwan ,Marshall Cavendish Corp,2006.\n·King, David C., Taiwan, Scholastic Library Pub,\n·Green, Robert, Taiwan, Lucent Books, 2000.\n·Copper, John F., Taiwan: Nation-State or Province? , Perseus Books Perseus Books,2008.","foreignLanguageTextbooks":false}]
