[{"name":"鄧陳興","email":"stcn@ntut.edu.tw","latestUpdate":"2010-03-07 22:38:10","objective":"本課程適用於一般大專之決策分析課程。其目的在說明決策理論之基本觀念，及其在真實世界裡相關決策問題之分析。本課程授課主題包括：不考慮機率之決策問題、與機率有關之決策問題、獲取額外資訊之決策分析、效益分析、遊戲理論。相關之授課內容包括：機率分配、期望值方法、貝氏分析、完全資訊與額外資訊之期望值。\n1.「決策分析:方法與應用」希望能引導同學們對於所有管理活動必須面對的課題，一般企業每天面對的決策問題不盡相同，但其基本構成的元素卻大同小異，包括目標、方案、評估準則以及決策者主觀價值等，讓學生能在「作中學」，以培養學生具備「實用」和「基本」的決策評估與選擇方案過程的知識。\nDecision Analysis is a course to help student to handle the management activities with management skill. In general, although the enterprises have met many different decision problems; however, the basic elements have the same characteristics. It includes objective, solution program, evaluation criteria, and main values of decision-making, etc. Our course will let students ‘learn from doing exercises’ to cultivate the ‘real’ and ‘basic’ decision-making knowledge and skill.\n2.決策分析的方法:包括：多準則決策分析方法、計量決策分析方法、定性決策分析方法與其他；共15章分別敘述。\nThe methodology of decision analysis includes multi-criteria decision analysis and data envlope analysis. The totals are 15 chapters included.\n3.課程設計包括決策實際案例之研討與如何透過各種決策方法，解決周遭的管理問題與自己所面臨的問題，以激勵學生反思，提昇學習成效。\nThe course design will include physical case study and how to use the methodology of decision-making to solve your facing surrounding problems. We hope to urge you reflect yourself from the basic beginning of learning and get the most benefits from the decision-making.\n4. Group Discussion\nThe group topics are given raw materials for your report and are separated with the following 17 categories with three students as a team:\nA) Clean Tech; B) Cloud Computing; C) Communication &amp; Network;  D) Crisis Analysis; E) Cross Strait Market Analysis; F) Digital Content; G) Electronic Vehicle; H) Female Economy; I) IA; J) ICT; K) Innovation Change for New Market; L) ITS; M) Local Area Market; N) New Market Observation; O) Overall Economy; P) PC; and Q) Security.\ni) Group leader is requested to organize a team to discuss, to find and to write a ppt report from the raw materials.\nii) The questionnaires design is required to invest the opinions from the classmates in this class.\nB)Each Team shall select one of the methods of Analytic Hierarchy Process (AHP) or Data Envelopment Analysis (DEA) to investigate the opinions of classmate.\n5.Individual report is requested to select one of the topics of the given Harvard Business Report (HBR), which can NOT be repeatedly to each other. The group topic and selected topic are needed to register to the Class Leader in this class before midterm test.\n6. Three quizzes are given to make sure everybody understand the Operational Research text book and some concepts of Multicriteria Decision Analysis.\n","schedule":"第一週　　03/02　　第1章簡介與決策支援 Chap 1. Introduction (Book1)\n第二週　　03/09　　第2章線性規劃Chap 2. Linear Programming HW1\n第三週　　03/16　　第3章線性規劃:敏感度分析Ch3 Linear Programming Sensitivity Analysis HBR1 (Quiz1)\n第四週　　03/23　　第4章線性規劃應用Ch4 LP and Its Application HW2\n第五週　　03/30　　第5章 線性規劃:單形法(Simplex)Ch5 Model of Simplex HBR2  (Quiz2)\n第六週　　04/06　　第6章 單行法敏感度分析及對偶性 CH6 HW3\n第七週　　04/13　　第13章決策分析 Ch13 Decision Analysis HBR3 (Quiz3)\n第八週　　04/20　　第14章 多目標決策 Ch14 Foundation of MODA HW4\n第九週　　04/27　　期中考試\n第十週　　05/04　　第3章 多屬性決策分析Ch3 Foundation of MODA HBR4 (Book2)\n第十一週　　05/11　　第4章 理想置換模式 Ch4 MOLP HW 5\n第十二週　　05/18　　第5章 績效評估法 Ch5 Outcome Evaluation HBR5\n第十三週　　05/25　　第5章 資料包絡分析法 Ch05 Data Envelopment Analysis (DEA) HW6 (Book3)\n第十四週　　06/01　　第5章 DEA 例子分析 HBR6 (Book3)\n第十五週　　06/08　　第6章層級分析法 Ch06 AHP參數分析 HBR7 (Book2)\n第十六週　　06/15　　第8章多目標決策分析Ch8 G1-G6 (Book2)\n第十七週　　06/22　　第9章多目標線性規劃 Ch9 G7-G12 (Book2)\n第十八週　　06/29　　期末報告 Final Report  Ch10 G12-G18\n","scorePolicy":"期中考試 (Midterm test)：30％　　期末報告 (Final report)：30％\n課堂作業與討論(Homework)：30%；平時成績（課內表現） Quiz &amp; Course expression：10%\n","materials":"教材課本\n1.林張群、陳可杰譯，作業研究(11版)，趙竣，滄海書局(An Introduction to Management Science, 11th Edition) (Book1)\n2.王小璠著，2005，多準則決策分析，初版，台中，滄海(Multicriteria Decision Analysis –From Certainty to Uncertainty) (Book2)\n3.張保隆著，2007，決策分析：方法與運用，初版，台北：華泰 (Book3)\n4.Harvard Business Review (HBR) Magazine\n參考書籍\n1.梁定澎著，2006，決策支援系統與企業智慧，再版，台北：智勝文化\n2.Tenqchen, Shing’s Ph.D. Dissertation, Using Customer-based Models to Gain Competitiveness in the Next Generation Technology: the Case of Telematics Services\n3.Wei, Wan-Li Ph.D. Dissertation, An Application of ANP-based Decision Analysis Models for selecting optimal product design solution, NTTU.\n","foreignLanguageTextbooks":false}]
