[{"name":"蔡榮發","email":"jftsai@ntut.edu.tw","latestUpdate":"2010-02-26 09:08:23","objective":"本課程旨在探討些最近發展之最佳化方法與應用，包含啟發式方法與確定性方法，本課程內容以確定性最佳化方法為主，如線性規劃、非線性規劃、整數規劃、分數規劃、目標規劃等，應用問題包括：原物料切割問題、投資組合問題、管理績效評估、多磁碟系統配置、能力集合分析等。試圖運用各種最佳化技術以最有效率方式求得全域最佳解。此外，相關之文獻及各種應用將深入討論。","schedule":"W1: Introduction to global optimization\nW2: terminology (discrete, continuous, convex, concave, nonconvex, posynomial, polynomial, signomial, quadratic, quai-convex, separable program, fractional program, convex set etc.)\nW3, W4: Multidisk vertical allocation (Data knowledge and engineering, 1993, Chang, 2002, Tsai, 2005, New method) (testing problems)\nW5, W6: Nonlinear programming problems (Approximate polynomial, Li and Chang, 1998; piecewise linearization, Li and Chang, 1998; Fast Assortment, Li and Tsai, 2001; improved goal programming(Li, 1996); piecewise linearization assortment problem, Li, Chang and Tsai, 2002.\nW7, W8: local optima for MINLP, Li,1992; 0-1 fractional, Li, 1994; 0-1 fractional, Chang, 2001; nonconvex separable, Li and Yu, 1999.\nW9: paper presentation\nW10: paper presentation\nW11: paper presentation\nW12, W13: Signomial discrete problems (Tsai, 2002); Fractional programming (Tsai, 2005);SDP with Free variable, Tsai and Lin, 2006.\nW14: Container loading problems (Chen, 1995); Distributed packing, Li, Tsai and Hu, 2003.\nW15: Multiple solutions, Tsai, Lin and Hu, 2008; multiple solutions of nonlinear equation, Tsai and Lin, 2007.\nW16: paper presentation\nW17: paper presentation\nW18: paper presentation\n","scorePolicy":"Presentation: 40% (20% for each)\n上課討論與出席情況: 30%\nHomework: 30%","materials":"References:\n1.Deterministic global optimization: theory, algorithms and applications (Christodoulos A. Floudas, Kluwer Academic Publishers, 2000).\n2.Introduction to global optimization (Horst R., Pardalos P.M. and Thoai N.V., Kluwer Academic Publishers, 2000).\n3.Handbook of test problems in local and global optimization (Christodoulos A. Floudas et al., Kluwer Academic Publishers, 1999).\n4.Selected papers from Journal of Global Optimization, European Journal of Operational Research, Engineering Optimization, and Journal of the Operational Research Society.\n5.Optimization Modeling with Lingo, 2001, LINDO System INC.\nAssignments:\n1. Solving assortment problems with 3 or 4 rectangles with Lingo.\n2. Solving fractional programming problems in DEA. (6 schools)\n3. Solving engineering design problems from papers for finding global solutions .\n","foreignLanguageTextbooks":false}]
