[{"name":"張家銘","email":"arthur.itri@gmail.com","latestUpdate":"2018-06-10 20:13:24","objective":"本課程敦請不同類屬之文化事業、創意產業之經營者，採產學協同教學模式，以實務操作和職能訓練為主要授課內容。旨在協助學生循序漸進，學習產業實務和相關應用技術，強化未來職場競爭力。\n\n本課程的設計，以文化新創事業的發展為目標，品牌的價值最大化為核心，進而設計與執行品牌之行銷方案，分析如何經營新創品牌的價值，與創造出在新創產業中的優勢品牌與品牌資產。結合行銷學的STP模型與SMART Strategy(睿智策略)，對本地與國際市場上的目標顧客，進行系統化的策略性行銷。經由團隊合作，建構起良善通路的競爭優勢。\n\n本課程的教學模式，採用國立臺北科大經典的黑手工程師訓練模式，強調動手式的 OJT (On Job Training)。課堂上會有大量的實務型動手演練實作，下課後會有一定數量的作業與練習，透過此系統性訓練課程，將使學員(學生)具備微(小)型企業(工作室)的基本商業維運知識與能力。\n\nThis course urges the managers of cultural undertakings and creative industries of different categories to adopt cooperative models of production, production and learning. Practical teaching and functional training are the main teaching contents. It aims to help students step by step, learn industrial practices and related application technologies, and strengthen their competitiveness in the future.\n\nThe course is designed to target the development of Innovation Vocation, maximize the value of the brand as the core, and then design and implementation of brand marketing programs, analysis of how to operate a new brand value, and create a cultural industry in the advantages of brand and brand equity. To combine with the STP model of marketing and SMART Strategy, the target customers in the international market, the systematic strategic marketing, linking customers, managing the members in the channel and learning the channel design method. Use teamwork spirit to build the competitive advantage in the commercial channel. The teaching mode of the course: using the Taipei Tech classic Practice-Engineer training model, emphasizing the hands-on OJT (On Job Training) method. There will be a large number of hands-on exercises in the classroom, and a number of homework and exercises after class. After this systematic training course, students (trainee) will have basic enterprise (studio) business operation ability.","schedule":"第一週   文化產業品牌行銷通路-課程介紹\n第二週   品牌與品牌管理導論\n第三週   研發新創品牌之策略\n第四週   設計與執行品牌之行銷方案\n第五週   經營品牌價值與績效衡量\n第六週   創造品牌資產與競爭優勢\n第七週   瞭解行銷管理與掌握行銷洞察力\n第八週   連結顧客與建立優勢品牌\n第九週   期中考\n第十週    創造與傳遞行銷之價值\n第十一週  溝通與經營永續成功的行銷策略\n第十二週  洞悉通路管理之營運模式\n第十三週  掌握通路組織的成員與功能\n第十四週  研發通路結構與網路設計\n第十五週  建構良善通路的競爭優勢\n第十六週  文創產業之個案分析(一)\n第十七週  文創產業之個案分析(二)\n第十八週  期末考","scorePolicy":"1. 出勤與日常報告(60%)。\n2. 期中考試(20%)。\n3. 期末考試(20%)。","materials":"1. 講師編著專業講義。\n2. Strategic Brand Management (Professor Dr. Kevin Lane Keller) 。\n\n備註:\n1. 原則上，以每3人一組，可事先找好組員。\n2.上課需攜帶筆記型電腦。\n    每次的上台報告，視同到客戶公司進行專案簡報，必須穿著正式服裝\n     (服儀標準: 請參考人力銀行 104網站)。\n3. 請勿任意請假。","foreignLanguageTextbooks":true}]
