[{"name":"張家銘","email":"arthur.itri@gmail.com","latestUpdate":"2018-06-10 20:13:55","objective":"本課程的設計，以文化事業的發展為目標，培訓學生動手實作能力為核心，進而建構:\n產品3D建模與文創產業4.0智能製造能力，培養學生未來在職場中的競爭力。\n本課程延續了加法加工的3D成型列印技術與減法加工的CNC 3軸加工技術，運用產業中通用專業軟體，進行:文創產品構思、設計與生產的講解。由單一的物件設計衍生為系列性的組合件產品，再經由同學間的團隊合作，完成產品的製作與生產。\n文創產業的BPM(Business Process Management)、APP(微型應用程式)與供應鏈之作業管理，亦是此課程的另一重心。\n本課程的教學模式，採用國立臺北科技大學經典的黑手工程師訓練模式，強調研發與動手並重的 OJT (On Job Training)。\n課堂上會有大量的實務型動手演練實作，下課後會有一定數量的 Homework與 Exercise，透過此系統性訓練課程，將使學生(學員)具備文創產業4.0實作技術與專業能力。\n\nThe design of this course, the development of cultural vocation as the goal, trains student(trainee) hands-on capacity as the core, and then construct: Product 3D modeling and culture-innovation industry 4.0 intelligent manufacturing capacity, train students to have great work capacity in the future. This course continues the 3D machining technology and subtractive machining of CNC 3-axis machining technology. Use the general software to showcase these topics: thinking of culture-innovation product, design and production. Design by a single object, to derive as a series of assembly products. And, then through the team between the students to complete the manufacturing of products. BPM (Business Process Management), APP (micro Application Software) and supply chain operations management, will be another focus of this course. The teaching mode of the course: using the TaipeiTech classic Practice Engineer Training Model, emphasizing the R&amp;D and hands-on OJT (On Job Training) method. There will be a large number of hands-on exercises in the classroom, and a number of homework and exercises after class. After this systematic training course, students (trainee) will have culture-innovation industry 4.0 operation ability.","schedule":"週次       單元主題\n第一週    文創產業4.0智能製造概論-課程介紹。\n第二週   工業4.0 IOT 智能製造:軟體系統概論。\n第三週   文創產品之設計構思策略: 運用 SketchUp、CAD/CAM軟體工具。\n第四週   進階SketchUp軟體工具:產品設計與3D 建模實作(1)。\n第五週   進階SketchUp軟體工具:產品設計與3D 建模實作(2)。\n第六週   進階SketchUp軟體工具:產品設計與3D 建模實作(3)。\n第七週   進階SketchUp軟體工具:產品設計與3D 建模實作(4)。\n第八週   進階SketchUp軟體工具:產品設計與3D 建模實作(5)。\n第九週   期中考。\n第十週    文創產業4.0智能製造 – BPM(Business Process Management) 與APP概論。\n第十一週  文創產業4.0智能製造 – BPM(Business Process Management) 與APP實作(1)。\n第十二週  文創產業4.0智能製造 – BPM(Business Process Management) 與APP實作(2)。\n第十三週  文創產業4.0智能製造 – BPM(Business Process Management) 與APP實作(3)。\n第十四週  文創產業的供應鏈之作業管理與實務(1)。\n第十五週  文創產業的供應鏈之作業管理與實務(2)。\n第十六週  專題製作(1)。\n第十七週  專題製作(1)。\n第十八週  期末考。","scorePolicy":"1. 出勤與日常報告(60%)。\n2. 期中考試(20%)。\n3. 期末考試(20%)。","materials":"1.　　原廠外文原文操作手冊(Handbook)。\n2.　　講師編寫之專業講義。","foreignLanguageTextbooks":true}]
