[{"name":"華國媛","email":"kyhwa@ntut.edu.tw","latestUpdate":"2018-05-23 21:20:57","objective":"生質能源(bioenergy)指的是儲存在現有(活著或剛失去生命)的動植物體的能量。生質能源的來源，主要是植物將太陽能經由光合作用轉換成葡萄糖，在進一步合生物高分子衍生物(如多醣體(polysaccharides)) 。新一代生質能源技術強調環保技術，整合跨領域之技術，包含應用分子生物技術所發展出之基因轉殖、醱酵控制及生物觸媒技術-利用生物酵素進行催化化學反應達成環保及高效率與節能之目的。本課程將介紹動植物的多醣體種類及如何運用新興生物系統學的技術開發生質能源。\nBioenergy is referred to the energy stored in living or recently living biological organisms, such as animals, plants and microbes. The source of bioenergy can be traced back from plants harvesting the sunlight and converting it to glucose, then to other biopolymers such as polysaccharides. The technologies for developing bioenergy, with an emphasis on environmentally compatible, consist of gene cloning technology from molecular biology and enzymatic control and catalytic chemistry (i.e. green chemistry).  The course is an introduction course on the types of polysaccharides in animals and plants, how scientist use system biology to develop bioengergy.","schedule":"Week/ Date　　Title\n1.　　　　Introduction\n2.　　Why Bioenergy Makes Sense-Global and regional drivers of accelerating CO2 emissions\n3.　　　　Nature’s green revolution\nRenewable energy policy alternatives for the future\nClimate change – the Chinese challenge\n4.　　     Basic principles of energy conversion,\n5　　　　Thermodynamic engine cycles\n6.　　　　Combustion,\n7　　　　Biological conversion into gaseous fuels,\n8　　     Biological conversion into liquid fuels\n9.       Mid-term case report\n10      A Primer on Genetics, Genomics and Plant Breeding\n11.　　　　Bioethanol\n12.　　Selection of Promising Biomass Feedstock Lines Using High-Throughput Spectrometric and Enzymatic Assays\n13　　　　Composition and Biosynthesis of Lignocellulosic Biomas\n14.　　    Genetic Improvement of Corn for Lignocellulosic\n15　　　　Literature review\n16　　　　Literature review\n17　　　　Literature review\n18　　　　Final report","scorePolicy":"Evaluation：Class participation (30%), Midterm report (20%), Final report (20%), Literature review (30%)","materials":"Class booklet with selected article will be given in the class.","foreignLanguageTextbooks":true}]
