[{"name":"白敦文","email":"twp@csie.ntut.edu.tw","latestUpdate":"2018-08-22 14:24:15","objective":"The course of Digital Signal Processing introduces the representation, transformation and manipulation of signals on a computer. DSP is an important and fundamental knowledge for a wide range of application systems, such as consumer electronics, digital communications, digital image applications, medical imaging, and all intelligent application. With the dramatic increase of the processing capability of signal processing microprocessors, it is the expectation that the importance and role of DSP is to accelerate and expand.   Students take this course should be able to understand the most important principles in digital signal processing. Using the MATLAB to practice and understand all theoretical concepts, methods and algorithms.","schedule":"Part I - Introduction to Digital Signal Processing  (Week1)\n　　1.1 Discrete-time sequences and systems (Week1)\n　　1.2 linear time-invariant (LTI) systems (Week 2)\n　　1.3 impulse response and convolution (Week 3)\n　　1.4 the Z-transform and its inverse (Week 4)\n　　1.5 difference equations and system functions (Week 5)\n　　1.6 signal flow graphs (Week 6)\n　　1.7 Fourier transforms and frequency response (Week 6)\n　　1.8 periodic sampling and reconstruction of band limited signals (Week 7)\n        1.9 MIdterm (Week 8)\n　　\n　　Part II - Filter design and Fourier signal analysis  (Week 9)\n　　2.1 Up- and down sampling ( Week 10)\n　　2.2 design of IIR- and FIR-filters  (Week 11)\n　　2.3 digital filter structures (direct, cascade, parallel and lattice)  (Week 12)\n　　2.4 filter transformations  (Week 13)\n　　2.5 all-pass, minimum phase systems (Week 13)\n　　2.6 the discrete and fast Fourier transform (Week 14)\n　　2.7 circular convolution, block convolution (Week 14)\n　　2.8 Fourier analysis, the effect of windowing (Week 15)\n        2.9 Final (Week 16)\n\n8.期末考試(第16週)","scorePolicy":"Quiz and HW(20%)\nProject Report(20%)\nMidterm(30%)\nFinal(30%)","materials":"Lectture Notes","foreignLanguageTextbooks":true}]
