[{"name":"吳景龍","email":"michaelwu@ntub.edu.tw","latestUpdate":"2018-12-25 18:43:52","objective":"本課程帶領非英文系高級班的學生了解深植在英文詞句中的美國主流文化價值。學生除了會學到語言是了解文化的途徑之一外，也會理解文化對語言用詞的影響。課程內容涵蓋電影、電視節目、新聞、音樂劇、生活常用俚語等等。\nThis course enables non-English majors at the advanced level to understand American mainstream cultural values embedded in English language expressions. Students will learn that language is a guide to culture, and on the other hand, culture programs language patterns. Selected texts include films, television shows, news, musical, idiomatic expression, etc.","schedule":"Syllabus 課程表:\nTheme One: News Media\nWeek 1: Introduction.\nWeek 2: Discuss issues and concepts raised in authentic news articles.\nWeek 3: Develop critical thinking about how to evaluate the validity and reliability of given information in news.\nWeek 4: Critique empirical articles worldwide and cultivate a personal take on reading news.\nWeek 5: How Headline is Formed in News Media.\nWeek 6: Reading Rules of Journalistic English 1.\nWeek 7: Reading Rules of Journalistic English 2.\nWeek 8: Reading Rules of Journalistic English 3 and practice .\nWeek 9: Midterm Exam or Report.\n\nTheme Two: Entertainment: films, television shows, and musical\nWeek 10: Musical Phantom of the Opera.\nWeek 11: Musical Phantom of the Opera Dicussion; Musical Miss Saigon.\nWeek 12: Musical Miss Saigon and Miss Saigon Discussion.\nWeek 13: Movie Crach and Discussion.\nWeek 14: TV Show Friends and Discussion.\n\nTheme Three: Idiomatic Expression \nWeek 16: Idiomatic Expression 1.\nWeek 17: Idiomatic Expression 2.\nWeek 18: Final Exam or Report.","scorePolicy":"Percentile of final grades 成績配分:\n1. Group presentation in the class or Midterm Exam:  20 %\n2. Individual tasks (homework, or solo presentation): 20%\n3. Attendance and participation in the classroom discussions: 40 % \n(five absences leading to failure)\n4. English proficiency tests: 20%\n\n備註:本課程十八周之教學內容、進度、方法及成績評量方式等，除了校定不可更改之內容外，均為預期計畫。實際之教學內容、進度、方法及成績評量方式等，會依教師實際授課狀況及同學學習成效而定，教師保留彈性調整之權力。(Adjustments are made according to instructor's actual teaching schedule and students’ classroom performance and learning outcomes.)","materials":"1.  The Metropolitan Daily News: Understanding American Newapapers\nAuthor: Joan Corliss Bartel\n書林出版\nISBN: 986-7790-05-7\n\n2. VOA app\n\n3. CNN app\n\n4. ABC app\n\n5. USA Radio app\n\n6. Learn English Movies\n\n7. Voicetube.com\n\n8. Randall’s ESL Cyber Listening Lab\n\n9. Musical: Phantom of the Opera\n\n10. Musical: Miss Saigon\n\n11. Movie:  Crash\n\n12. 教師自編","foreignLanguageTextbooks":true}]
