[{"name":"黃如瑩","email":"vinia@ntut.edu.tw","latestUpdate":"2018-06-11 23:55:09","objective":"本科目以跨學科多媒體的方式來探討(1)不同媒介(與文類)的作品之間如何存在著發創意的連鎖反應，與創意激盪的引力關係，(2)並探索何以同一時代不同的藝術形式之間展現出類似的創意主題與手法，進而形成時代的文化特色。以荷蘭畫家維米爾(Vermeer)的名畫「戴珍珠耳環的少女」為例，此畫作激發了作家歇維理(Chevalier)無限的想像空間而寫了一部同名小說，試圖去解釋畫作背後之奧秘。接著，受小說的激發，一部同名電影應運而生，把小說情節加以改編，並參考維米爾其它畫作, 試圖重現原畫創作時畫家個人、家庭與時代風采。這一連串連鎖激盪之下，不同媒介與文類的新作品出爐了，各有特色，而且彼此間還有相互連結和彼此評論的關係。有時候，類似的連結(可能在主題或手法上)普遍地出現在同一時代不同的藝術形式之間，這說明了此一連鎖與創意激盪的關係如何大規模地造成文化思想潮流與大眾流行文化。以「解構(後結構)思潮」為例，原本在哲學領域獨樹一格，進入文學批評理論領域後成為顯學，進而影響藝術評論與創作理念。後來更傳播至建築理論與設計，造成「解構建築」之流行與歪斜屋宇之誕生。儼然成為「後現代文化」的註冊商標。這一文化傳播的現象乃跨媒體跨領域之創意發想而聯結成的連鎖反應,蔚成全球文化織錦的風貌.\nPurposes:  The aim of this course is to re-activate and cultivate students' innate ability of visual thinking by exploring the issue of inter-connective-ness across the boundaries of genres, media, and academic disciplines in order to disclose the ways in which creative ideas are conceived, intersecting one another and then travel afar to create new knowledge and insights, which in turns stimulate more creative ideas.","schedule":"Cultural Dissemination and Ideas in the Arts\n~with Prof. Vinia Huang\n.\nSyllabus\nWeek 1 \nIntroduction: To see and to know\nTopic One: Vermeer and  light 維梅爾與光線\nWeek 2 \n(1)　　Girl with a Pearl Earring (novel by Tracy Chevalier with film adaptation) \n戴珍珠耳環的少女 (小說與電影)\n(2)　　Artists inspired by Vermeer: poets, painters (Edward Hopper, Salvador Dali), novelists (Tracy Chevalier, Susan Vreeland, and 門井慶喜之維梅爾的論點)\nWeek 3 \n(1) Image Reading: “The Allegory of Art by Vermeer”\n(2) “The Painter in His Studio: Vermeer” (Essay by John Berger, SE pp. 122-25)\nWeek 4 \n(1)　　Girl with Hyacinth Blue (Novel by Susan Vreeland with film adaptation)\n(2)　　Vermeer’s Hat: The Seventeenth Century and the Dawn of the Global World (Book by Timothy Brook)\nTopic Two: Venus (Images of the Goddess of Love) 女神維納斯\nWeek 5 \n(1) Image Reading: ”The Birth of Venus” (Uffizi), “the Venus de Milo” (Louvre), the Rokeby Venus (the National Gallery), etc.\n(2) The Birth of Venus (Novel by Sarah Dunant)\nWeek 6 \n(1) “The Birth of Perspective” (15th century masters: Sassetta, Uccello, and Francesca)\n(2) “The Clarity of the Renaissance” (Essay by John Berger, SE pp. 41-43)\nWeek 7  \n(1)　　Image Reading: “La Primavera by Botticelli”\n(2)　　 The da Vinci Code (Novel by Dan Brown with film adaptation)\nWeek 8\n(1)　　Image Reading: “Le pelerinage a l”ile de Cythere by Watteau”\n(2)　　The French film “What My Eyes Have Seen” is inspired by Watteau’s paintings.\nWeek 9 \n(1)　　Image Reading: “Le Dejeuner sur L’herbe by Manet”\n(2)　　The modern images of Venus: (a) the motif of the Olympians,(b) parodies of Rokeby Venus,(c) fin-de-siecle scene by Toulouse-Lautrec\nTopic Three: (Self-)Portraits (自)畫像\nWeek 10  Mid-term Exam Week\n(1) Image Reading: “Rembrandt’s self portraits林布蘭的自畫像” \n(2) Artists inspired by Rembrandt: poets(John Berger), novelists (Lynn Cullen’s I Am Rembrandt’s Daughter, John Berger’s “Polish Rider,” 門井慶喜之林布蘭的光)\nWeek 11\n(1) Image Reading: “Vincent van Gogh’s self Portraits”\n(2) Image Reading: “Sun Flowers by Vincent van Gogh”\n(3) “The Production of the World” (Essay by John Berger, SE pp. 459-66)\nWeek 12\n(1)　　Image Reading: “ Mona Lisa by Leonardo da Vinci”\n(2)　　Image Reading: Leonardo’s self portraits \n(3) “The Changing View of Man in the Portrait” (Essay by John Berger, SE, pp. 98-102)\nWeek 13\n(1)　　Frida Kahlo’s life and her self portraits\n(2)　　“Frida Kahlo” (Essay by John Berger)\n(3) Georgia O’keeffe’s landscape and flower paintings in relation to female sexual organs\nTopic Four: Spatial/visual Labyrinth空間與視覺的迷宮\nWeek 14 \n(1) The story of labyrinth in Greek mythology\n(2) Jorge Luis Borges’ short story collection Labyrinths\n(3) The Name of Rose玫瑰之名 (Novel by Umberto Echo with film adaptation)\nWeek 15\n(1) Homer’s epic poem Odyssey and James Joyce’s novel Ulysses\n(2) The labyrinthine garden in Virginia Woolf’s novel Orlando\n(3) The labyrinthine garden in Harry Potter and the Goblet of Fire\nWeek 16:\n(1)　　Image Reading: “Las Meninas (The Maids of Honor侍女) by Diego Velazquez”\n(2) Michel Foucault’s article “ Las Meninas” from the Order of Things\nWeek 17:  Wrapping-up\nWeek 18   Final exam Week: Final paper due","scorePolicy":"Percentile of final grades\n1.Attendance and participation in class discussions:\n3% x 15 = 45%\n2.Oral presentation: 15% X 2 = 30%\n3.Final paper: 25%","materials":"Texts required:\n1.　　Berger, John. Ways of Seeing. London: BBC, 1972.\n2.　　Dyer, Geoff. John Berger: Selected Essays. New York: Vintage, 2003.(Articles selected from this collection)\nReferences:\n1. 世界名畫家全集(44集),何政廣 主編, 臺北:藝術家, 1999.\n2. 百幅世界名畫閱讀\n3. Content Area Reading in Art,\n4. The Literature Student's Survival Kit, by Ian Littlewood","foreignLanguageTextbooks":true}]
