[{"name":"王聰榮","email":"tjwang@ntut.edu.tw","latestUpdate":"2018-09-18 11:28:07","objective":"The theme of the course is \"Sustainable Architecture\". It aims to provide a forum to examine and discuss solution-oriented methods for implementing sustainable development, and to stimulate more ideas and useful insights regarding architecture development within the context of sustainability. In an effort to explore and map the challenges and opportunities of sustainable development, this course aims to address the various aspects of architecture &amp; urban development in accordance with the principles of sustainability. These themes will address issues but not limit to, architectural design, ecological and social sustainability, economic and environmental sustainability, environmentalism.\n本課程主要進行「永續建築環境」之相關研究議題探討與分析。於瞬息萬變之環境與極富思維空間之建築研究中並不能全然按理論或法則定律判斷，亦須依實務經驗輔以基礎理論架構予以綜合評估與分析評估。探討之內容包括但不限下面之主題：『永續建築環境規劃設計』、『永續建築環境教育』和『永續能源環境規劃設計』等相關議題間之相互依存性或相關性，藉由國內外之相關案例進行深入探討與分析，期待建立個人對現今永續建築環境之瞭解與認識。","schedule":"Suggestive projects / assignments / papers\n* Short paper highlighting contemporary local issues and concerns of sustainable development, etc.\n* Literature Review based paper on culture, lifestyles in the context of sustainability and energy consumption.\n* Documentation of examples of sustainable architecture and human settlements focusing on climate change, clean development mechanism, use of technology etc.\n\nTopics to be covered:\na. Definitions and Principles\nb. Environmental Impact of Buildings\nc. Sustainable Design priorities\nd. Cultural and Economic aspects\ne. Life Cycle Design\nf. Selected Examples of Sustainable Architecture – Vernacular, Historical and Contemporary\ng. Overview of passive design strategies for reducing energy consumption\nGroup project: You should choose a particular project of that is widely used and which has some potential alternatives for use and prepare a general sustainability assessment for the project and at least one of its alternatives and prepare a report which should include the following:\na)　　Introduction and rationale for choosing the project for this assignment\nb)　　A material assessment of the project and its alternatives. List the raw materials which go into making the project and where possible a list of where they come from\nc)　　An evaluation of the environmental and social impacts related to this material assessment with a particular focus on potential for some factors which may impact its sustainability of use.\nd)　　A discussion of corporate practices and any other relevant information related to the social and political aspects of the project and its prevalence.\ne)　　Your recommendations for consumers and policy-makers regarding product choice based on this preliminary sustainability assessment.\n\nSchedule\nDate　　         Topic　　                                          Reading and Activity\nSeptember  13　　Introduction and course objectives\n         　　No readings\n\nSeptember  20　　Scale and sustainability\nHistory of SS Measuring Sustainability\nThe complex path to sustainability　　Using nature's genius in architecture\nArchitecture of culture, or culture of architecture?\nThe power of culture in a global society - discover your cultural heritage\nReading: Culture-Sustainability Relation: Towards a Conceptual Framework. Sustainability 2016, 8(2).\nSeptember 27　　Scale and sustainability\nHistory of SS Measuring Sustainability\nThe complex path to sustainability　　Topics selection \nDiscussion of Culture-Sustainability Relation: Towards a Conceptual Framework\nReading: Socio-cultural sustainability of housing: A conceptual exploration. Housing Theory and Society 21(2):65-76 · June 2004.\nOctober 4　　Adaptation and Sustainability　　A wide-angle view of fragile Earth by Yann Arthus-Bertrand\nMagical houses, made of bamboo by Elora Hardy\nThe complex path to sustainability\nArchitecture is in Crisis and sustainable design\nDiscussion of Culture-Sustainability Relation: Towards a Conceptual Framework\nReading: Socio-cultural sustainability of housing: A conceptual exploration.\nOctober 11　　Adaptation and Sustainability 　　Topics selection \nDiscussion of Socio-cultural sustainability of housing: A conceptual exploration.\nReading: What is social sustainability? A clarification of concepts. Geoforum 2011, 42, 342–348.\nOctober 18　　Sustainability Assessments (SA)　　Topics selection \nDiscussion of Socio-cultural sustainability of housing: A conceptual exploration.\nReading: What is social sustainability? A clarification of concepts. Geoforum 2011, 42, 342–348.\nOctober 25\n　　Sustainability Assessments (SA)　　Topics selection \nDiscussion of What is social sustainability? A clarification of concepts.\nReading: Interactive and situated learning in education for sustainability\nNovember 1　　Project presentations　　School Anniversary Celebration\nTopics selection \nDiscussion of What is social sustainability? A clarification of concepts.\nReading: Interactive and situated learning in education","scorePolicy":"Participation &amp; Attendance 20% \nShort-Term Group Projects 20% \nLong-Term Group Project  40% \nDesign Journal 10% \nLessons Learned Paper and Discussion 10%","materials":"　","foreignLanguageTextbooks":true}]
