[{"name":"鄭又平","email":"youpingcheng@gmail.com","latestUpdate":"2018-06-10 21:15:16","objective":"本課程講授媒體、企業與政治三者之間競合的互動關係，教你看透媒體新聞 與節目內容製作背後的意識形態、商業利益與政治操作。本課程的焦點是媒體實 務，而不是深奧的理論框架。我們會廣泛引介各類當代媒體，讓你深入瞭解由傳 統紙媒到當代電子媒體、網路媒體、各種新媒體通路中，大數據與內容的製作該 如何結合運用。 \n \n新聞媒體在企業與政治體系中的特殊角色與效應也是本課程的探討焦點。媒 體在民主政治發展中的角色為何？為什麼人民的感知是:富媒體、窮民主？新聞 自由、個人隱私、社會責任、國家安全之間如何取捨與平衡？屍體、裸體、醜聞、 弊案，這些才是博眼球、拉抬收視率、提升點擊率、衝高瀏覽人次的不二法則嗎？ \n \n史諾登與維基解密究竟意味著什麼？人民的「知的權利」、「新聞自由」在「國 家安全」的大帽子面前，又值幾斤幾兩呢？你我在這個「凡走過必留下痕跡」的 時代裡，究竟還有多少隱私？政府掌控新聞與媒體、通訊、電信、資訊，對我們 公民權利的傷害會有多大？在商業利潤掛帥的商業環境中，「富媒體」會造成「窮 民主」嗎？ \n \n中國大陸已經成為全球媒體巨擘眼中的黃金處女地，各種各樣的新媒體市場 迅速崛起成長，嶄新的商業媒體運作模式更是讓人為之驚艷。媒體的廣告收益屢 創歷史新高，戲劇、新聞與節目製作成本的大手筆投資更是令人咋舌。融媒體的 平台發展，早就跨越兩岸的鴻溝，在兩岸青年次文化之間形成另類的橋樑。海峽 兩岸之間媒體軟實力的相對消長，更是令人訝異。因此，本課程將會針對海峽兩 岸新聞媒體與綜藝節目製作與新媒體的發展趨勢做對比分析。 \n \n在本課程中，我們將透過一系列結合理論與實務導向的專題，以培養學生對 當代傳播媒體現象與體制深入分析探究的能力;更引導學生具體認識在數位新媒 體的時代中，如何利用新媒體來進行廣告、行銷、公關、選舉文宣、危機處理等 實務操作的策略及步驟。 \n \n你會深入了解認識政黨與政治人物如何運用媒體技巧來包裝行銷所謂的政 治理念與政策主張，如何形塑包裝、拆解抹黑個人的政治形象，針對熱點議題與 危機事件該如何處理並設定議程、移轉焦點。這門課程會讓你看穿台灣藍綠各黨 政治人物如何利用媒體操弄民意與民粹，也會讓你學習應對各種媒體公關危機的 技巧。 \n2 \n \n \n我們也會學習認識新聞媒體的採訪、編輯、製作流程，了解狗仔隊與八卦媒 體的操作與炒作手法，讓你熟悉媒體公關的運作方式與邏輯。當然，我們也會學 習到有良心的專業媒體社會責任究竟界線在哪。 \n \n選修本課程會讓你的人生視野打開嶄新的一頁，讓你的思維格局提升到新的 境界，更讓你在商業世界裡消費、面對、解讀、乃至運用媒體得心應手。世界那 麼大，你真的該走出去看看！學習【媒體、企業與政治】課程的精髓就是要真正 理解何謂:「唯有感動人心，才能撼動世界！」 \n \n本課程強調「識讀、參與、思辯、批判、互動」，大量消費、閱聽、比較、 分析各類媒體的內容，上課前必須參與小組討論，課程中必須經常發言參與互動 式討論。如果你只想耍廢鬼混，建議不要選修此課程浪費生命，更糟蹋了老師與 全體同學的投入。 \n \n    歡迎你加入我們的大家庭!","schedule":"課程大綱: \n \n第 1 週 總論：媒體與民主、媒體與政府、媒體與企業 \n \n第 2 週 媒體偏見、客觀性與雙重標準：公民兩難--相信誰？相信什麼？  記者，你為什麼不反叛? \n \n第 3 週  好新聞、壞新聞、假新聞：審視新聞的四種傾向性 \n \n第 4 週  新媒體的崛起與衝擊:點擊率、瀏覽人次、廣告收入與商業模式 \n \n第 5 週 政治公關與議程設定：如何運用媒體進行統治與宣傳 \n \n第 6 週 新聞自由與社會責任：   水果媒體上的屍體與裸體 \n \n第 7 週 新聞自由 vs 國家安全媒體自由的神話還能持續嗎？  \n             史諾登、阿桑奇與維基解密:叛國賊?人民英雄? \n \n第 8 週  企業如何影響新聞運作? 媒體壟斷：你好大，我好怕 \n \n第 9 週 媒體與選舉:形象包裝及政治廣告 \n \n第 10 週 置入性行銷 \n \n第 11 週 媒體中國面面觀 1:兩岸媒體的競合關係 \n \n第 12 週 驚爆黑幕，打破沉默螺旋 \n \n第 13 週 媒體中國面面觀 2: 兩岸新聞大車拼 \n \n第 14 週 媒體中國面面觀 3: 綜藝到網紅 \n \n第 15 週 大數據時代的來臨 \n \n第 16 週 大數據操作與運用  \n               定制資訊 \n\n \n \n第 17 週 數位行銷與新媒體消費革命 \n \n第 18 週 總結","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
