[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2011-09-07 09:40:17","objective":"We will begin our study with an overview of theatre itself.  What is theatre?  What are its origins and functions within Western culture?  We will identify genres within the theatre and study the formal choices characteristic of each genre and within every historical period.  We will study the fundamental characteristics of dramatic form including plot, character, action, and setting, as well as the conventions of dramatic genres, specifically tragedy, comedy, and tragicomedy.  We will then turn our attention to the basic repertoire of the actor, the combinations of voice, movement, characterization and emotional shading which help enact the playwright’s vision.  As an adjunct to this, we will look at the basics of theatre: blocking, costuming, make-up, set design and tips on memorization and the efficient use of rehearsal time.  Our major undertaking will be the production of one full-length of several shorter plays by a well-respected playwright.  Each student will be responsible for bringing about the enactment of drama chosen by the class under my guidance.  The course may be a bit of a challenge, but it is a great opportunity for you to create living art of masterpiece quality and to discover the difference between writing done purely as a mode of elementary communication, or for mere entertainment, and writing that is open-ended, provocative, dynamic, haunting, and relentless in its dis/solving of the puzzle of the Real.","schedule":"September 14　　INTRODUCTION: Theatrical period, style, genre.  Discussion of possible plays.  View film, pt. I.  HOMEWORK:  Memorize Hamlet’s speech, “Speak the speech I pray thee…”\nSeptember 21　　Choose play.  Basics of characterization: voice, movement.  Trying out new ideas.  Begin selecting roles.  View film, pt. 2.  ASSIGNMENT:  Memorize short scene\nSeptember 28　　Practice short scene.  Provisionally select roles.  View film, pt. 3.  ASSIGNMENT:  Prepare for short performance.\nOctober 5　　Performance Revue.  ASSIGNMENT:  Begin memorizing lines, Act One, Scene One (or as appropriate)\nOctober 12　　Introduction to blocking; ass’t director makes crew assignments. ASSIGNMENT:  Continue memorizing lines; work on voice3 charcterization.\nOctober 19　　Blocking; begin assembling materials for sets, costumes, etc. ASSIGNMENT:  Continue memorizing lines, work on movement characterization.\nOctober 26　　Blocking with lines memorized Act One\nNovember 2　　Blocking with lines memorized Act Two\nNovember 9　　 Blocking with lines memorized Act Three\nNovember 16　　Set construction and costuming supervised by ass’t director + individual singers work with musician(s)\nNovember 23　　Scene Rehearsal with sets and costumes supervised by ass’t director + individual singers work with musician(s)\nNovember 30　　Rehearsal  (Mandatory for all students)\nDecember 7　　Rehearsal  (Mandatory of all students)\nDecember 14　　Rehearsal  (Mandatory of all students)\nDecember 21　　Dress Rehearsal/Informal Presentation for English Corner Students  (ABSOLUTELY mandatory of all students)\nDecember 28　　Final Presentation  (ABSOLUTELY mandatory of all students)","scorePolicy":"1/4  memorization and blocking\n1/4  rehearsal\n1/4  taking an active role in work you have selected or that has been selected for you by the Assistant Director (e.g.designing and constructing or selecting set, costumes and/or props)\n1/4  performance","materials":"TEXTS\nClass Hand-out\nFILM\nRhinoceros by Eugene Ionesco","foreignLanguageTextbooks":false}]
