[{"name":"柯萊恩","email":"kcline@ntut.edu.tw","latestUpdate":"2011-09-07 09:38:13","objective":"Circumnavigate your mind!  Assassinate time!  In a single blinding flash five-thousand years of human culture comes down to a limitless now. What are you going to do about it?  Jump ship just when things are getting interesting?  Why not join us on a voyage over the edge of the ocean to the place where chimeras first see the sun’s light?  Or how about flapping your arms and taking flight?  Consider yourself invited on a unique, experiential journey!  No longer will you be standing outside of literature, on the sidewalk of both slim and fat chances (you can take your choice!), weighty suitcase of criticism in hand, looking on forlornly as if through the window of a very expensive department store.  This course offers a unique opportunity to experience literature from the inside, to participate in writing as a professional writer or critic does, directly tapping into language through a mysterious fusion of inner and outer, subjective with objective, the nonsensical, whimsical and dreamlike with the factual, the actual, the real.  For the purposes of this course, we will broaden our definition of creative writing from its major genres, poetry and fiction, to include emergent cross-disciplinary forms such as creative non-fiction, performance art and autobiographically-based critical writing.","schedule":"Part One:  Poetry\n\nSeptember 15　　INTRODUCTION:  Writing as Sacred Event:  Performance Works by Maria Sabina, Black Elk.  ASSIGNMENT: Plan creation of ritual (liminal or liminoid) space.\n\nSeptember 22　　Poetry and ritual.  Workshop.\n\nOctober 29　　Language Shaping Itself into Poetry.  Workshop.\n\nOctober 6　　The Certainty of Ambiguity. Workshop.\n\nOctober 13　　The Uncertainty of Certainty.  Workshop.\n\nOctober 20　　Creative Non-Fiction. Workshop.\n\nPart Two:  Prose Writing　　\n\nOctober 27　　Life/Dream Writing.  \n\nNovember 3　　The Question of Phenomenology\n\nMIDTERM WRITING ASSIGNNMENT DUE!!!\n\nNovember 10　　EXPERIMENTATION I\n\nNovember 17　　EXPERIMENTATION II  \n\nNovember 24　　EXPERIMENTATION III\n\nDecember 1　　PERFORMANCE I\n\nDecember 8　　PERFORMANCE II.\n\nDecember 15　　PERFORMANCE III\n\nDecember 29　　REHEARSAL FOR FINAL PROJECT\n\nJanuary 5　　GROUP PRESENTATION OF FINAL PROJECT\n\nJanuary 12　　FINAL PAPER DUE (No e-mails, please.)","scorePolicy":"20%　　Homework Assignments\n20%　　Midterm\n20%　　Collaborative Performance Work\n40%　　Final","materials":"Course Reader: The class will assemble its own class reader, using the appended list of my own research interests as a guide, though not a limitation.  You must select for each class a representative selection of poetry, drama or prose which you will briefly introduce and share with classmates.  However, you will not be asked to analyze these works but instead to use them as a springboard for creative efforts of your own.  Students will engage in a textual conversation with each of the works in a manner of their own choosing.  Thus, a poem may trigger a work of creative non-fiction, an piece of creative non-fiction may trigger a short-story, a work of fiction may trigger a poem and so on.  Students will be asked to share their labors each and every week with the class in order to receive comments and critique.  These works will be considered as experiments solely and will not be formally graded, although the professor can be expected to provide written feedback for each work handed-in on time.  Their successful completion (on time) does form an important component of your participation score for the class.","foreignLanguageTextbooks":false}]
