[{"name":"蔡瑤昇","email":"ystsai@ntut.edu.tw","latestUpdate":"2011-09-01 15:40:28","objective":"這是行銷管理的進階課程，本課程主要目的在於：\n1.　　瞭解行銷理論的主要議題。\n2.　　瞭解行銷思想的歷史與演進。\n3.　　瞭解科學對行銷學的影響。\n4.　　幫助找尋可能的行銷論文研究主題。\n培養加強科學研究的能力等。","schedule":"第1週  課程介紹及評分方式說明\n第2週  (R0) Rajan, V. P., “From the Editor: Reflection on Research and Publishing,” Journal of Marketing, 60(4), Oct, 1996, 3-6.\n第3週  (R1) Christian Gr?nroos, “On defining marketing: finding a new roadmap for marketing, Marketing Theory,” Dec 01, 2006; 6: 395-417.\n(C1) John R. Rossiter, “What Is Marketing Knowledge?: Stage I: forms of marketing knowledge,” Marketing Theory , Mar 01, 2001; 1: 9-26.\n第4週  (C2) Raymond Hubbard, R. Murray Lindsay, “How the Emphasis on ‘Original’ Empirical Marketing Research Impedes Knowledge Development,” Marketing Theory, Dec 01, 2002; 2: 381-402.\n第5週  (R3) Mark Tadajewski, “Remembering motivation research: toward an alternative genealogy of interpretive consumer research,” Marketing Theory, Dec 01, 2006; 6: 429-466.\n(C3) Barbara Stern, George M. Zinkhan, Anupam Jaju, “Marketing Images: Construct Definition, Measurement Issues, and Theory Development,” Marketing Theory, Jun 01, 2001; 1: 201-224.\n第6週  (R4) Steve Charters, Simone Pettigrew, “Conceptualizing product quality: the case of wine,” Marketing Theory, Dec 01, 2006; 6: 467-483.\n第7週 (C4) Hans Kjellberg, Claes-Fredrik Helgesson, “On the nature of markets and their practices, Marketing Theory,” Jun 01, 2007; 7: 137-162\n(R5) Raquel S?nchez-Fern?ndez, M. ?ngeles Iniesta-Bonillo, “The concept of perceived value: a systematic review of the research,” Marketing Theory , Dec 01, 2007; 7: 427-451.\n第8週  期中考\n第9週 (C5) Roderick J. Brodie, Mark S. Glynn, Joel van Durme, “Towards a Theory of Marketplace Equity: Integrating Branding and Relationship Thinking with Financial Thinking,” Marketing Theory, Mar 01, 2002; 2: 5-28.\n第10週 (R6) Omar Merlo, Bryan A. Lukas and Gregory J. Whitwell, “Heuristics Revisited: Implications for Marketing Research and Practice,” Marketing Theory , 2008; 8: 189-204.\n(C6) Berend Wierenga, “On Academic Marketing Knowledge and marketing Knowledge that Marketing managers Use for Decision-Making,” Marketing Theory, Dec 01, 2002; 2: 355-362.\n第11週 (C7) Luis Araujo, “Markets, market-making and marketing,” Marketing Theory, Sep 01, 2007; 7: 211-226.\n第12週 (C8) Sid Lowe, Adrian N. Carr, Michael Thomas, Lorraine Watkins-Mathys, “The fourth hermeneutic in marketing theory,” Marketing Theory, Jun 01, 2005; 5: 185-203.\n第13週 (C9) Alastair Tombs, Janet R. McColl-Kennedy, “Social-Servicescape Conceptual Model,” Marketing Theory, Dec 01, 2003; 3: 447-475.\n第14週 (C10) Dawn Burton, “Towards a Critical Multicultural Marketing Theory,” Marketing Theory, Jun 01, 2002; 2: 207-236.\n第15週 期末報告及討論\n第16週 期末報告及討論\n第17週 期末報告及討論\n第18週 期末考","scorePolicy":"平時成績：       30％ （出席10％、參與討論20％）\n論文導讀及報告： 40％ （口頭25％、書面15％）\n期末報告：       30％ （口頭20％、書面10％）","materials":"參考書: Shelby D. Hunt, Foundations of Marketing Theory: Toward a General Theory of Marketing, M.E. Sharpe.\n內容還會再修訂 視修課人數及背景再做調整","foreignLanguageTextbooks":false}]
