[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2011-08-30 12:18:31","objective":"The aim of the course is to introduce basic principles of theory of science and the research process, as well as to present methods and models for realization and documentation of projects of theoretical as well as practical nature. The course will give a vision of a subsequent research career in design industry. Design industry is presented as a growing field of research within the design sciences and is positioned in its epistemological and scientific context. The various phases of the research process are presented, from formulation of a problem and a hypothesis, over planning and realization of an investigation to the treatment, presentation and interpretation of results. Introductions are given to information searching in scientific data bases, scientific authorship and writing of popular reports. A research report including an abstract is thereafter written in Chinese/English about a current project. Overall, The contents of this course will provide a comprehensive survey of qualitative and quantitative research methods and their method-specific hypothesis formulation, data acquisition, verification, and analysis. The training on the ability to speak and write effectively on subject matter is also contained in this course.\nCourse Objectives\n?　　To increase the student’s understandings of the role of research in \"future design practice\" and \"knowledge of the discipline for the benefit of society.\"\n?　　To increase the student's abilities to discover, critically read, interpret, and evaluate research.\n?　　To increase the student's abilities to conduct design industry research.\n?　　To increase the student's abilities to communicate research findings.\n?　　To increase the student's understanding of research as an evidence-based design method","schedule":"1. Course Introduction\n2. Interactive Session: Self Introduction (II)\n3. The Gesture Interactive Interface: Xbox Natal\n4. Round Table Meeting Topic I: The future interactive technology and applications (I)\n5. Interactive Session: Self Introduction (III)\n6. The Gesture Interactive Interface: Zcam\n7. Round Table Meeting Topic I: The future interactive technology and applications (II)\n8. Group Presentation of  Round Table Meeting Topic I: The future interactive technology and applications\n9. The Interactive Technology and Education\n10. Round Table Meeting Topic II: The interactive technology for education and commercial applications (I)\n11. The Interactive Technology and Media Design\n12. Round Table Meeting Topic II: The interactive technology for education and commercial applications (II\n13. Group Presentation of  Round Table Meeting Topic II: The interactive technology for education and commercial applications\n14. Discussions and Comments on reading assignment I and II\n15. The Multi-touch Interactive Technology: Android System\n16. Round Table Meeting Topic III: The Multi-touch applications development in Commercial Environment\n17. The Multi-touch Interactive Technology: iPhone and iPad (iOS) System\n18. ound Table Meeting Topic III: The Multi-touch applications development in Game (AppStore Mechanism)\n19. Group Presentation of  Round Table Meeting Topic III: The multi-touch interactive technology for commercial applications and game\n20. The Internet interactive applications development and internet marketing\n21. Demonstration: results of multi-touch practice\n22. Review and Remark\n23.Final Exam","scorePolicy":"Procedures and Class Sessions\nClasses will consist of lectures, moderated round-table discussions, the writing presentation of a research paper and a final exam. Classes will meet in classroom 603 on Friday evenings from 6:30 to 9:20 PM in the Autumn semester of 2010. Studying groups will be established, each consisting of 3-4 members. Each group is asked to build-up and maintains its own studying blog. This course offered out-of-class communications that consist mainly of e-mail communication, and responding to documents posted on the class discussion board as follows: http://www.facebook.com/imi.ntut\nResearch Paper\nThe Research Paper Presentations are considered formal presentations, and as such the dress and deportment of the speaker should be professional in all respects. The class will play the role of the academic review committee. The paper itself must also be of a professional quality such that it may stand on its own, not requiring a formal presentation.  The research paper should be edited by following the APA format (http://www.ccc.commnet.edu/apa/ in English or the document provided in Chinese). The Research Paper is structured approximately in six basic sections as: cover, abstract, contents, references, appendix and footnote. The contents should has subsection as: introduction, literature review, research methodology and design, case study or experiments, results discussion, conclusion and future work.\nCourse Requirements\nStudents are expected to fully participate in each class. Therefore, the assigned readings must be completed before the start of class on the indicated dates. Exercises must be completed and submitted on time. Late work will be penalized ten points per day. Work will be graded A: 90-100, B: 80-89, C:70-79, D:60-69, F:50-59, or Missing:0. At the discretion of the instructor some Exercises may be graded Pass: 100, Fail: 50, or Missing: 0.\nThe grading apportioned as follows:\nParticipation in round-table discussions &amp; attendance - 20%\nMedia and Presentation – 20%\nResearch Paper – 30%\nFinal Examination – 30%","materials":"　","foreignLanguageTextbooks":false},{"name":"李家祥","email":"jasonlee2357@gmail.com","latestUpdate":"2011-09-22 09:20:28","objective":"此課程之重心著重在於新世代的「人機互動技術」（Human-Machine Interaction），是希望能從人的觀點來看，使人可以用更自然人性的方式來操作機器設備；從機器的觀點來看，則是使機器可以具有類似人類的感知與表達能力。技術面則將以擴增實境(Augmented Reality)作為學習與應用的主軸，案例部分將融合博物館、商業行銷活動，甚至是數位學習教材，體驗各產業在融入擴增實境之後，都可以呈現出截然不同的獨特經驗。","schedule":"第9週:  Android Inventor 1\n第10週:　　Android Inventor 2\n第11週:　　Android Inventor 3\n第12週:　　Android Inventor 4\n第13週:　　Processing結合Arduino 1\n第14週:　　Processing結合Arduino 2\n第15週:　　Processing結合Arduino 3\n第16週:　　Processing結合Arduino 4\n第17週:　　互動技術發展的腳本及計畫書報告\n第18週:　　互動技術發展的腳本及計畫書報告","scorePolicy":"1. 平時作業 30%\n2. 出席狀況 10%\n3. 期末作品 60%","materials":"Android Inventor : http://www.appinventorbeta.com/about/ \nProcessing: http://www.processing.org/ \nArduino: http://www.arduino.cc/","foreignLanguageTextbooks":false}]
