[{"name":"王聖銘","email":"ryan5885@gmail.com","latestUpdate":"2011-08-30 12:19:59","objective":"Course Outline\nThis course introduces the concepts of 3D virtual reality using contemporary tools and various data. This course enables the students to gain hands-on experience to create 3D model and to design virtual reality scenario for project and applications development . Practical works are included to provide students the capability of demonstrating conceptual understanding of virtual reality, regardless of the programming language used, developing virtual reality models using appropriate tools and programming language, and applying the knowledge to modeling in a wide range of application disciplines.\nCourse Objectives\n1.　　To present an overview of the past, present, and future of VR, analyze VR concepts.\n2.　　To analyze Virtual Reality Concept.\n3.　　To show the principles of the creation of VR worlds using selected tools.\n4.　　To present an overview of the development process of Virtual Reality project.\n5.　　Topics may include pervasive cognition and interactive virtual reality technologies with geometry, image and hybrid virtual reality systems.","schedule":"Course Syllabus\n1.　　Introduction to the Course. What is Virtual Reality? Sensing in VR and VR Hardware. VR Development Languages. VR past, present, and future. Examples of Virtual Worlds.\n2.　　Development issues - Development cycle and development tools. Organising the code. Scenes and scene graphs. Creating and navigating the virtual world. Gravity and collision. Geometry, standard units, co-ordinate systems and transformations. Examples.\n3.　　Adding user interaction - Events and time, sensors and routes. Examples.\n4.　　Object oriented nature of VR programming - Prototypes, nodes, fields. Structure of a VR Object. Creating Prototypes and Objects. Interface declaration semantics. Definition semantics. Rules for mapping. Scoping rules. External prototype semantics. Static and dynamic instantiation. Examples.\n5.　　Adding processing capabilities to VR models - Scripting. Script languages. Script execution. Initialize and shutdown. Events processed. Scripts with direct outputs. Asynchronous scripts. Accessing fields and events.\n6.　　Adding audio-visual effects 1 - Animation and Light. Interpolators. Common principles. Colour interpolator. Scalar Interpolator. Orientation Interpolator. Position Interpolator. Dynamic scaling. Directional, point, and spot light. Examples.\n7.　　Adding audio-visual effects 2 - Texture and Sound. Textures and texture maps. Application of textures to different geometric objects. Level of Detail. Sound and its spatial aspect. Examples.\n8.　　Creating VR models with emergent behaviour. Examples.\n9.　　Resume and preparation for project submission.","scorePolicy":"Teaching Methods\nProcedures and Class Sessions\nClasses will consist of lectures, moderated round-table discussions, assignment of practical works the writing presentation of a report/research paper and a final project presentation. Classes will meet in classroom B206  (第六教學大樓） on Tuesday afternoon from 14：00 to 17:00 PM in the Autumn semester of 2011. Studying groups will be established, each consisting of 2 members. Each group is asked to build-up and maintains its own studying blog. This course offered out-of-class communications that consist mainly of e-mail communication.\nCourse Requirements\nStudents are expected to fully participate in each class. Therefore, the assigned readings must be completed before the start of class on the indicated dates. Exercises must be completed and submitted on time. Late work will be penalized ten points per day. Work will be graded A: 90-100, B: 80-89, C:70-79, D:60-69, F:50-59, or Missing:0. At the discretion of the instructor some Exercises may be graded Pass: 100, Fail: 50, or Missing: 0.\nThe grading apportioned as follows:\nParticipation in round-table discussions &amp; attendance - 10%\nPractical Work Assignment – 40%\nReport/Research Paper – 20%\nFinal Project Presentation – 30%","materials":"[1]　　R. Stone, \"Serious games: virtual reality’s second coming?,\" Virtual Reality, vol. 13, pp. 1-2, 2009.\n[2]　　M. Zyda, \"From visual simulation to virtual reality to games,\" Computer, vol. 38, pp. 25-32, 2005.\n[3]　　P. Barbosa, \"Remapping the world in 3D,\" Potentials, IEEE, vol. 29, pp. 21-25, 2010.\n[4]　　N. F. Polys, et al., \"Future standards for immersive vr: Report on the ieee virtual reality 2007 workshop,\" Computer Graphics and Applications, IEEE, vol. 28, pp. 94-99, 2008.\n[5]　　S. G. Jones, \"Information, Internet, and community in the information age: notes toward an understanding of community,\" in Cybersociety 2.0: revisiting computer-mediated communication and community, ed: Sage Publications, Inc, 1998.\n[6]　　M. Ma and H. Zheng, \"Virtual Reality and Serious Games in Healthcare,\" Advanced Computational Intelligence Paradigms in Healthcare 6. Virtual Reality in Psychotherapy, Rehabilitation, and Assessment, pp. 169-192, 2011.\n[7]　　A. Sherstyuk, et al., \"Toward Natural Selection in Virtual Reality,\" IEEE Computer Graphics and Applications, pp. 93-96, 2010.","foreignLanguageTextbooks":false}]
