[{"name":"田方治","email":"fctien@ntut.edu.tw","latestUpdate":"2011-09-13 10:52:14","objective":"Objective：The objective of this class is to offer the related knowledge of building up an automated visual inspection system.\nContent:   Quality has been one of the most important issues in currently manufacturing industry such that automated inspection system becomes a crucial tool. Therefore, the objective of this course is to offer the basic knowledge and skill in developing a PC-based automated visual inspection system. The content of this course includes: 3D CAD design, programming design using Borland C++ Builder, PC-based motion and I/O control, inspection design with e-Vision, basic programming design using OpenCV, database design, quality control chart, and related knowledge about inspection tools.\nTextbook：None\nMaterial Website: Materials are available on website: 140.124.75.95\nSubjects：　　This course contains the following subjects:\n1. Introduction to automated visual inspection system\n2. Fundamental of Visual Inspection Concepts – Review and an example\n3. Lighting Knowledge\n4. 3D Graphic Drawing through Solid Work Software (業師)\n5. The fundamentals of Mechanism Design  (業師)\n6. Designing inspection algorithm with e-Vision Library\na. Basic image pre-processing: threshold, color, enhancement, project, profile\nb. Blob analysis\nc. Morphology\nd. Gauging\ne. Matching with template and feature\nf. Others: OCR, Barcode, OCV\n7. Sensor\n8. Control: I/O card 7051, Motion card- Adlink 8132\n9. BCB related: Class, dBase, Multi-thread, Message structure\n10. Other: OpenCV, QC charting  (if time available)\nIn Class Practice\nFor each class, there may be a lab assignment, for which individual student must complete it before leaving the classroom.  This lab assignment must be turned in and your result must be shown to the instructor.  Each assignment will be counted 5% grade.\nPaper Presentation\nA paper related to AVIS must be chosen and turned-in at Week 5. After discussing with instructor, the student will present the entire paper in details at Week 17.\nProject\n1. Term project is executed in group (No of persons in group will depend on attending student no).  Topic is limited in the automated visual inspection area, and a real world case study is preferred.  Project abstract must be submitted (Week 8) in no more than two pages (A4), which includes topic, abstract, research objective, layout of system, feasibility and expected result.\n2. The project is supposed to be outlined as below:\na. Introduction (Why this topic?)\nb. Problem statement and review\nc. Objective and Methodology\nc. Experiment\nd. Conclusion and future recommendations\ne. Reference (if any)\n4. Written Project must be typed and turn in at Week 18.\n5. Hard copy as well as CD-ROM needs to be submitted before deadline.","schedule":"Week 1　　Introduction,\nWeek 2　　Lighting\nWeek 3 　　3D Solid Work Design\nWeek 4　　3D Solid Work Design\nWeek 5 　　3D Solid Work Design (Paper)\nWeek 6 　　Mechanism Design\nWeek 7　　Mechanism Design\nWeek 8　　Mechanism Design Due\nWeek 9　　e-Vision (1)\nWeek 10 　　e-Vision (2)\nWeek 11 　　e-Vision (3)   (Process report)\nWeek 12 　　e-Vision (4)   Book reading\nWeek 13 　　e-Vision (5)   (Process report)\nWeek 14 　　e-Vision (6)\nWeek 15 　　Sensor   (Process report)\nWeek 16　　Others\nWeek 17　　Paper Presentation\nWeek 18　　Project Presentation\nNote: the real schedule may be modified based on the progress of teaching","scorePolicy":"Grading Policy：\nIn class practice　　10*5%　　30%\nGroup Project　　　　30%\nPaper Present　　　　15%\nTest                       20%\nOutside  Reading  　　　　5%\n100% in total","materials":"　","foreignLanguageTextbooks":false}]
