[{"name":"劉家珍","email":"thepoint@thepoint.com.tw","latestUpdate":"2011-09-27 13:48:50","objective":"透過多類型之作業演練、分析及探討，由視覺衍生之知覺性及感情效果於平面設計上之影響，開發一套可供工業設計運用的基本視覺設計原裡，同時開啟注重友善環境通用設計的概念以及實踐。","schedule":"第一週（9/16）\n視覺傳達的概念   銀髮產品產業的起念與啟動   \n\n第二週\n生活中尋找可商品化的想法與議題（創造力 作品一---收集生活周邊的各類產品 交心得 ）\n\n第三週（9/30）\n進入視覺領域，生活中的商品視覺傳達與效果討論，國外資料討論（交作品一）\n文化、氣候、環境、風俗民情等因素對商品的設計影響。比較同一產品，歐美系和日系設計上的不同。視覺傳達的優劣對生活在其中的人們的心理影響及文化品質提升。改變人類生活形態和發展的商品(有形及無形)，如智慧形手機、蘋果各式商品、臉書、社 群網絡)\n\n第四週（10/7）\n2011世界設計展參觀—松山菸廠（作品二：選出設計展中最欣賞及最不欣賞的設計 (可複選)，需拍照及附上說明 ---心得與照片）\n\n第五週（10/14）\n商品的整體設計與包裝，網站、平面、產品的多向設計規劃（作品三：針對銀髮族的任何商品設計 ---設定商品與創作；每組設定一網站，頁面不需要內容；將設計展的照片上傳到其中一頁）\n商品整體包裝及行銷的項目、流程、時程、及重要性。展示免費網站平台的架設，選定網址、上傳照片、管理方式。研討銀髮市場的潛力，將自己視為目標消費者做發想。觀察家中年長者的生活所需，及更大層面的生活圈、社區的形成，進而設想銀髮社區的環境及其所需的商品。\n\n第六週（10/21）\n商品的整體設計與包裝，網站、平面、產品的多向設計規劃（交作品二、每組的網址、作品四---生活中的ABC… or  123…數字攝影，不能直接拍攝車牌、門牌等數字 ）\n各種商品的銷售展示方式，包括有形及無形的店面。視覺傳達上的設計可構成的層次和價格的差異。作業說明：生活中的abc…及123…的簡單畫面影像例子。需將作業上傳到每組設定的網站中，並在照片旁做說明。\n\n第七週（10/28）\n商品的整體設計與包裝，網站、平面、產品的多向設計規劃（交作品三 課堂討論）\n欣賞並視察每組的作品三，及每組的網站。成功商品在整體包裝及行銷上的案例分析，視覺傳達在其中所扮演的角色。\n\n第八週（11/4）\n視覺空間與效果，創意影片賞析（ 作品四繳交與討論 ）\n\n第九週\n銀髮商品（通用設計產品）與空間的接觸及討論（參觀三芝雙連養老社區   暫定）\n\n第十~十一週（11/18~25）\n課程主題/ 色彩的情感\n課程主大綱/ 色彩的象徵及聯想概述、色彩和其他元素之間關係、色彩心理概述\n色彩與時間和觀者年齡的相互關係。音樂及詩詞所構築出的色彩及創作，海報、唱片封片、大師作品分析及欣賞 (Paul Klee: Painting Music; Vladimir Mayakovsky: For the Voice)。\n\n（作品五---每人先選一張影像（圖片）不限類型，用電腦重新上色、濾鏡效果，讓影像表現出創作者所想要表達的感受\n (例如:陳舊、歡愉、記憶、豐富、情感...等等)\n*作品呈現方式:輸出於A4紙上(橫式、直式皆可)，內容有原始圖片和重新上色的作品，兩張並列或並排(先不用文字說明)\n上傳作品至小組網站者有加分，且不需另外輸出\n\n第十一週（11/25)\n（討論與繳交作品五）\n課堂上選一首自己喜歡的音樂、歌曲、或詩詞(中西及古往今來皆可)，試想如何以線條、幾何圖形、中英文字、及色彩呈現感受。\n\n\n第十二~十四週（12/2~16）\n課程主題/包裝設計與生活\n課程主大綱/情感包裝、目標消費者分析、包裝視覺構成要素、包裝設計考量因素、市售個案分析\n每組先選15種(以上)同樣內容物的商品，但三種不同價位(高、中、低)，分析其視覺構成、包裝材質及方式、訴求對象、比較同價位及不同價位的視覺呈現\n*作品六呈現方式: 帶實品討論，上台報告，繳交電子檔，將作品上傳至小組網站，並以網頁展示者加分\n\n第十三週（12/9）\n（請協助宣佈作品七---拍攝街上、公共空間的聖誕樹以及聖誕裝飾，12/23討論）\n* 每人下周帶不需要之報章雜誌、剪刀、口紅膠。一 \"21cmx21cm\"之有色厚紙。\n海內外聖誕裝飾欣賞。紐約梅西百貨的聖誕主題櫥窗布置。歐美社區以聖經故事做為聖誕裝飾的照片欣賞。(或加入) 聖誕節各商品的置入性行銷。\n\n第十四週（12/16）\n（討論與繳交作品六）\n課堂上製作拚貼畫。選定一主題做拚貼畫。如一特定活動(設計展or舞台劇)、社會話題(總統選舉、校園霸凌)、或自我舒發。\n\n\n第十五週（12/23）\n影片賞析、作業活動交流（討論作品七---街頭聖誕藝術）\n\n第十六週\n校外教學---創意設計產業中心（松山菸廠、期末作業 作品八---1/13前繳交）\n\n第十七週（1/6）\n期末討論","scorePolicy":"　","materials":"　","foreignLanguageTextbooks":false}]
